[
    {
        "date": "2024-08-08T20:01:00+00:00",
        "title": "3 Stocks to Watch Following Guidance Upgrades: LMT, NOC, CRH",
        "content": "Earnings season continues to roll along, with the period overall showing positivity and resilience.\n\nFor the roughly 90% of S&P 500 companies that have reported Q2 results, total earnings are up +10.6% from the same period last year on +5.2% higher revenues, with 79.8% beating EPS estimates and 59.2% beating revenue estimates. (As of August 7th.)\n\nIncluding the expectations for those that have yet to report, 2024 Q2 earnings are expected to be up 11% on 5.4% higher revenues. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nConcerning positivity, three companies – Lockheed Martin LMT, Northrop Grumman NOC, and CRH CRH – all posted strong results, lifting their outlooks following the releases. For those interested in post-earnings momentum, let’s take a closer look at each.\n\nLockheed Martin Keeps Paying Investors\n\nLockheed Martin is the largest defense contractor in the world, operating in defense, space, intelligence, homeland security, and information technology. The company’s steady growth continued throughout its latest period, with EPS and revenue growing 6% and 9%, respectively.\n\nThe company has been a long-time favorite among income-focused investors, consistently upping its payout over the years. LMT’s cash-generating abilities have aided its dividend growth, with the company posting nearly $1.3 billion in free cash flow throughout its latest period.\n\nBelow is a chart illustrating the company’s dividends paid annually over the last 15 years. Please note that the final value illustrated is on a trailing twelve-month basis. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nFollowing the favorable quarter, LMT upped its EPS, segment profit, and sales guidance, causing shares to move bullishly.\n\nNorthrop Posts Strong Cash Flows\n\nNorthrop Grumman is a leading global security company offering a broad portfolio of capabilities and technologies. The company posted a double beat, with its earnings and sales growing 19% and 7%, respectively.\n\nCEO Kathy Warden stated, “We are laser focused on performance and continue to expand profitability through the deliberate actions we are taking. With strong support for our programs, growing global orders for our products, and solid execution in our business, we are increasing our revenue and EPS guidance for the year.”\n\nAnalysts have adjusted their expectations accordingly, with the now expected $24.99 per share consensus estimate suggesting a 7% climb year-over-year. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nSimilar to LMT, the company’s cash-generating abilities have supported its dividend nicely, boasting a 9% five-year annualized dividend growth rate. Free cash flow of $1.1 billion grew 80% year-over-year throughout the period.\n\nStory continues\n\nIt’s worth noting that the quarterly release pushed shares above a prior level of resistance. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nCRH Unlocks Higher Profits\n\nCRH manufactures cement, concrete products, aggregates, roofing, insulation, and other building materials. The company just revealed its quarterly results, exceeding our consensus EPS estimate handily and marginally falling short of sales expectations.\n\nCRH upped its FY24 net income and adjusted EBITDA guidance following the release, with shares also seeing a positive move post-earnings. The biggest highlight of the release was the company’s improved profitability, driven by cost management and positive pricing.\n\nThe revisions trend for its current fiscal year was already bullish heading into the release, as we can see below. Given the favorable read and guidance upgrade, it’s more than reasonable to expect this revisions trend to become even more positive. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nBottom Line\n\nThe 2024 Q2 earnings season continues to chug along, though a good chunk of the notable names have already reported. The period has remained positive, again underpinned by a strong showing from the tech sector.\n\nAnd concerning the positivity, all three companies above – Lockheed Martin LMT, Northrop Grumman NOC, and CRH CRH – delivered just that, raising their outlooks following their releases.\n\nFor a deeper dive into the current earnings landscape, I invite you to view our weekly Earnings Trends report – A Closer Look at the Current Earnings Picture\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nCRH PLC (CRH) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-stocks-watch-following-guidance-200100478.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.009,
            "neu": 0.798,
            "pos": 0.193
        }
    }
]