[
    {
        "date": "2024-06-26T14:38:00+00:00",
        "title": "Lockheed's (LMT) GOES-U Satellite Launch to Provide Critical Data",
        "content": "Lockheed Martin Corp. LMT constructed the GOES-U advanced weather satellite, which has been recently launched from NASA's Kennedy Space Center for the National Oceanic and Atmospheric Administration (“NOAA”). Meanwhile, the GOES-U series weather satellite was launched after more than 16 years of designing, building and testing four major weather satellites for the nation.\n\nBenefits of the Launch\n\nFor weather forecasting, tracking severe storms and climate monitoring, GOES-U will provide vital data. Moreover, it will enhance atmospheric phenomenon identification, such as lightning and storms, with its sophisticated equipment. The National Weather Service and meteorologists may utilize this real-time data for early warnings, disaster preparedness and resource management, which can ultimately save lives and reduce economic losses.\r\n\r\nThe GOES-U satellite has two state-of-the-art instruments. First, a ground-breaking operational lightning mapper that tracks lightning strikes in real-time across the United States is called the Geostationary Lightning Mapper. With the use of this technology, meteorologists can quickly identify storms that are intensifying and take appropriate action. Additionally, the Solar Ultraviolet Imager assists in detecting active solar regions and forecasts solar events that may interfere with communication networks, power grids or navigation systems on Earth.\n\nWhat’s Favoring Lockheed?\n\nVarious sectors are currently making use of Geostationary Earth Orbit (“GEO”) satellites for a wide range of applications, such as agriculture, transportation, disaster management and climate research. This increased utilization, along with the traditional roles in defense and space industries, has led to a noticeable rise in demand for advanced GEO satellites. One area experiencing a particularly high demand is the need for accurate and timely weather data as extreme weather events become more common due to climate change.\r\n\r\nThis must have prompted the Mordor Intelligence firm to expect the GEO Satellite market to witness a CAGR of 3.7% over the 2024-2029 period. Such a solid growth opportunity offered by the global GEO Satellite market should bode well for LMT.\r\n\r\nLockheed Martin collaborates with NASA, NOAA and other governmental agencies to offer state-of-the-art satellite systems for Earth observation missions. In addition to the GOES-U satellite, Lockheed Martin offers a broader variety of GEO satellites in its product line. LMT’s GOES-R satellite series provides vital atmospheric, hydrologic, oceanic, climatic, solar and space data, significantly improving the identification and monitoring of environmental events.\r\n\r\nGiven the growth of the GEO satellite market, LMT's recent launch is indicative of the high demand the company enjoys in this industry and suggests that there may be more such launches in the near future.\n\nStory continues\n\nPeer Moves\n\nApart from Lockheed Martin, the growing GEO satellite market also provides growth opportunities to other aerospace players like Boeing BA, Northrop Grumman Corp. NOC and Airbus Group EADSY, which hold a strong presence in this space.\r\n\r\nBoeing has created several notable GEO satellite products throughout the years, serving a wide range of government, broadcasting and communication needs. Its flagship model, the 702 series GEO satellites, can operate in geosynchronous, medium-Earth and low-Earth orbits.\r\n\r\nBoeing has a long-term (three to five years) earnings growth rate of 25.5%. The Zacks Consensus Estimate for BA’s 2024 sales implies an improvement of 0.9% from the prior-year reported figure.\r\n\r\nNorthrop Grumman's experience with satellite systems and payloads has contributed to the development of advanced weather monitoring capabilities. The JPSS-2 satellite, manufactured by the company, offers meteorological data and observations to help anticipate and prepare for extreme weather events, as well as monitor long-term climate changes.\r\n\r\nNorthrop Grumman boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales implies an improvement of 4.6% from the prior-year reported figure.\r\n\r\nAirbus has supplied more than110 GEO satellites to more than 60 countries across the world so far. Its MetOp-SG twin satellites A and B are intended to improve environmental research, climate monitoring and global weather forecasting.\r\n\r\nAirbus’ long-term earnings growth rate is pegged at 17.9%. The Zacks Consensus Estimate for EADSY’s 2024 sales calls for an improvement of 8.2% from the prior-year reported figure.\n\nPrice Movement\n\nIn the past three months, shares of Lockheed Martin have risen 2.5% against the industry’s decline of 9.5%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLockheed Martin currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheeds-lmt-goes-u-satellite-143800787.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0KVV.IL",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.027,
            "neu": 0.835,
            "pos": 0.138
        }
    },
    {
        "date": "2024-06-26T08:20:00+00:00",
        "title": "3 Defense Stocks to Buy With $875 and Hold Forever",
        "content": "Defense and aerospace companies can be underrated long-term investments. A handful of power players dominate the industry, enjoying competitive advantages thanks to their constant innovation, deep pockets, and strong ties to the U.S. government and its allies.\n\nThey also benefit from the fact that America faces numerous (and varied) threats. At the moment, war and lesser conflicts are taking place in Europe and the Middle East. Meanwhile, emerging national economies (like those in BRICS) have created economic pressure on Western countries like the United States, which has long had tense relationships with some Eastern powers.\n\nThe unfortunate reality is that America's strength protects America but it also creates global tension, which means that defense spending will likely be a priority for the U.S. government for the foreseeable future: US Government Defense Spending with Forecast Chart\n\nGeneral Dynamics(NYSE: GD), Lockheed Martin(NYSE: LMT), and RTX(NYSE: RTX) are three of the world's six largest defense and aerospace companies. Their products and services span land, sea, air, and space, and they are poised to grow for decades to come as key partners in America's defense efforts.\n\nThe best part? You can own stock in all three for under $900.\n\nHere is what you need to know about these three buy-and-hold defense stocks.\n\n1. General Dynamics (trading around $300 a share)\n\nDefense companies understandably depend primarily on government spending for revenue, but General Dynamics offers more diversification than most. Its aerospace unit builds private jets and provides aviation services to companies and high-net-worth clients. The company's marine division is the leading designer and builder of nuclear-powered submarines. Lastly, its combat and technologies segments build land vehicles, weapons systems, and software used for IT and mission control.\n\nPolitics can create volatility, primarily when politicians debate America's defense budget. The budget doesn't always go up, stagnating for periods at a time. That can impact companies like General Dynamics. Still, revenue and earnings have historically marched higher if you're patient enough. GD Revenue (TTM) Chart\n\nThat seems poised to continue. Analysts believe General Dynamics will grow earnings by an average of 12% annually over the long term. This sets investors up for double-digit returns once you factor in the company's 1.9% dividend yield. Those looking for investment exposure to a little bit of everything should give General Dynamics a hard look.\n\n2. Lockheed Martin (trading around $472 a share)\n\nInvestors might have seen the F-35 in the news for its potential $2 trillion lifetime program cost. It's probably fair to say that it is Lockheed Martin's most famous product. However, the defense behemoth builds many products across its business units, including jets and helicopters, naval ships, satellites and spacecraft, missile systems, and cybersecurity offerings. The company's space segment represents nearly a fifth of revenue, making the stock an excellent pick for long-term exposure.\n\nStory continues\n\nWhile controversial, the F-35 program has become a cornerstone for America's defense, with a potential runtime through 2088. It arguably sets a high floor for Lockheed Martin's business, which should give investors confidence that it will grow for decades. LMT Revenue (TTM) Chart\n\nDespite the F-35's presence, analysts are more cautious about Lockheed Martin's growth. Analyst estimates call for annualized growth of 4% for the next three to five years. That sets investors up for high-single-digit returns when factoring in the stock's 2.7% yield. Looking further out, it's hard not to like Lockheed Martin's space unit as a potential growth catalyst down the road. Investors can look at Lockheed Martin as a high-floor, lower-ceiling investment.\n\n3. RTX (trading around $102 a share)\n\nA 2020 merger between Raytheon Technologies and United Technologies formed RTX, the world's largest defense company with $71 billion in annual revenue. RTX has a massive footprint in the aviation sector. Its Collins Aerospace unit sells aircraft, components, and systems to military and commercial clients. At the same time, Pratt & Whitney is a separate unit and leading manufacturer of aircraft engines and auxiliary power units. Its Raytheon segment houses its military offerings, which include weapons, systems, and components for air, land, sea, and space.\n\nThe merger brought with it accounting adjustments and spinoffs that impacted GAAP earnings. However, revenue is at all-time highs, and analysts expect profits to boost back with earnings per share of approximately $5.39 this year. Long-term estimates peg earnings growth at 11% annualized over the long term, so the future looks bright for RTX and its shareholders. RTX Revenue (TTM) Chart\n\nLike General Dynamics, RTX offers investors added diversity in commercial business. Pratt & Whitney's leadership in critical aircraft components is a wide-moat competitive advantage that should help the company achieve consistent performance over the years.\n\nShould you invest $1,000 in General Dynamics right now?\n\nBefore you buy stock in General Dynamics, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and General Dynamics wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $723,729!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of June 24, 2024\n\nJustin Pope has no position in any of the stocks mentioned. The Motley Fool recommends Lockheed Martin and RTX. The Motley Fool has a disclosure policy.\n\n3 Defense Stocks to Buy With $875 and Hold Forever was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-defense-stocks-buy-875-082000038.html",
        "symbols": [
            "GD.US",
            "LMT.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.058,
            "neu": 0.796,
            "pos": 0.146
        }
    },
    {
        "date": "2024-06-26T03:03:00+00:00",
        "title": "Lockheed Martin-Built GOES-U Weather Satellite Successfully Launched",
        "content": "NOAA's newest satellite will complete the GOES-R series and provide critical weather and climate data\n\nKENNEDY SPACE CENTER, Fla., June 25, 2024 /PRNewswire/ -- An advanced weather satellite built by Lockheed Martin [NYSE: LMT] for the National Oceanic and Atmospheric Administration (NOAA) launched today from NASA's Kennedy Space Center at 5:26 p.m. ET. Lifted to space aboard a Space X Falcon Heavy rocket, the GOES-U satellite successfully deployed its large solar array to generate electrical power and has established communications with mission operators. The GOES-U weather satellite launched to space on from Florida on a Falcon Heavy rocket.\n\nGOES-U is the final satellite in NOAA's Geostationary Operational Environmental Satellites (GOES) - R series of four satellites. After it reaches geostationary orbit, approximately two weeks after launch, GOES-U will be renamed GOES-19. Once in operations over the East Coast of North America, the satellite be known as GOES East, and will provide advanced weather imagery, atmospheric measurements and real-time mapping of lightning activity, in addition to critical space weather observations.\n\n\"The launch of GOES-U is the culmination of more than 16 years of designing, building and launching four important weather satellites for our nation,\" said Jagdeep Shergill, GOES-U program manager and director of Geo Weather Programs at Lockheed Martin. \"Since the launch of the first GOES-R satellite, our nation has had more accurate weather forecasts and more timely severe storm warnings, and this critical service has positively affected everyone in the U.S.\"\n\nNOAA's GOES-R satellites, and soon GOES-U, provide crucial data for weather forecasting, severe storm tracking and climate monitoring. With their advanced instruments and rapid updates, they improve detection of atmospheric phenomena like hurricanes, wildfires and lighting. This real-time data aids the National Weather Service and meteorologist in early warnings, disaster preparedness and resource management, ultimately saving lives and mitigating economic losses.\n\nThe GOES-U spacecraft features two high-tech instruments built by Lockheed Martin's Advanced Technology Center in Palo Alto, California:\n\nGeostationary Lightning Mapper (GLM), which is a first-of-its-kind operational lightning mapper that tracks lightning across the U.S. in real-time. GLM allows meteorologists to quickly identify intensifying storms and take appropriate action. In 2020, GLM captured a lightning megaflash nearly 500 miles long that broke the world record for longest lightning flash. Solar Ultraviolet Imager (SUVI), focuses on space weather and measures the sun in extreme ultraviolet wavelength range. SUVI is essential to understanding active areas on the sun and predicting solar events that may disrupt power utilities, communication or navigation systems here on Earth.\n\nStory continues\n\nGOES-U is the final satellite of the GOES-R series which will provide critical weather and climate date into the 2030s. Following GOES-U, Lockheed Martin was selected by NASA to develop the nation's next generation weather satellite constellation, Geostationary Extended Observations (GeoXO), for NOAA. GeoXO's new capabilities will deliver more accurate weather forecasting and address emerging environmental issues and challenges. GeoXO, the GOES-R series and the nation's weather satellites are vital infrastructure for national resilience.\n\nNOAA funds, manages and will operate the GOES-R series satellites. NASA oversees the acquisition and development of the GOES-R spacecraft, instruments and launch vehicles. The program is co-located at NASA's Goddard Space Flight Center in Greenbelt, Maryland.\n\nCheck out additional GOES-U imagery here and b-roll video here.\n\nAbout Lockheed Martin Lockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at Lockheedmartin.com. Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/lockheed-martin-built-goes-u-weather-satellite-successfully-launched-302182604.html\n\nSOURCE Lockheed Martin\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-built-goes-u-030300897.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.945,
            "neg": 0.041,
            "neu": 0.877,
            "pos": 0.081
        }
    }
]