[
    {
        "date": "2024-06-22T11:00:37+00:00",
        "title": "Lockheed Martin (NYSE:LMT) shareholders have earned a 8.0% CAGR over the last five years",
        "content": "The main point of investing for the long term is to make money. Furthermore, you'd generally like to see the share price rise faster than the market. But Lockheed Martin Corporation (NYSE:LMT) has fallen short of that second goal, with a share price rise of 29% over five years, which is below the market return. Meanwhile, the last twelve months saw the share price rise 1.8%.\n\nWith that in mind, it's worth seeing if the company's underlying fundamentals have been the driver of long term performance, or if there are some discrepancies.\n\nView our latest analysis for Lockheed Martin\n\nWhile markets are a powerful pricing mechanism, share prices reflect investor sentiment, not just underlying business performance. One flawed but reasonable way to assess how sentiment around a company has changed is to compare the earnings per share (EPS) with the share price.\n\nDuring five years of share price growth, Lockheed Martin achieved compound earnings per share (EPS) growth of 7.5% per year. The EPS growth is more impressive than the yearly share price gain of 5% over the same period. So one could conclude that the broader market has become more cautious towards the stock.\n\nThe image below shows how EPS has tracked over time (if you click on the image you can see greater detail). earnings-per-share-growth\n\nWe consider it positive that insiders have made significant purchases in the last year. Even so, future earnings will be far more important to whether current shareholders make money. Dive deeper into the earnings by checking this interactive graph of Lockheed Martin's earnings, revenue and cash flow.\n\nWhat About Dividends?\n\nIt is important to consider the total shareholder return, as well as the share price return, for any given stock. Whereas the share price return only reflects the change in the share price, the TSR includes the value of dividends (assuming they were reinvested) and the benefit of any discounted capital raising or spin-off. Arguably, the TSR gives a more comprehensive picture of the return generated by a stock. In the case of Lockheed Martin, it has a TSR of 47% for the last 5 years. That exceeds its share price return that we previously mentioned. This is largely a result of its dividend payments!\n\nA Different Perspective\n\nLockheed Martin shareholders gained a total return of 4.7% during the year. But that return falls short of the market. On the bright side, the longer term returns (running at about 8% a year, over half a decade) look better. It may well be that this is a business worth popping on the watching, given the continuing positive reception, over time, from the market. It's always interesting to track share price performance over the longer term. But to understand Lockheed Martin better, we need to consider many other factors. Consider for instance, the ever-present spectre of investment risk.  We've identified 1 warning sign  with Lockheed Martin , and understanding them should be part of your investment process.\n\nStory continues\n\nIf you like to buy stocks alongside management, then you might just love this freelist of companies. (Hint: most of them are flying under the radar).\n\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-nyse-lmt-shareholders-110037187.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.024,
            "neu": 0.802,
            "pos": 0.175
        }
    },
    {
        "date": "2024-06-22T00:14:41+00:00",
        "title": "Lockheed Martin subsidiaries reach $70 million settlement for claims they overcharged Navy for parts",
        "content": "STRATFORD, Conn. (AP) — Two Lockheed Martin subsidiaries have agreed to pay the federal government $70 million for overcharging the Navy for aircraft parts, the U.S. Department of Justice announced Friday.\n\nThe federal agency says Sikorsky Support Services, based in Stratford, Connecticut, and Derco Aerospace, headquartered in Milwaukee, Wisconsin, knowingly entered into an improper subcontract for spare parts and materials for aircrafts used to train Navy pilots.\n\nUnder the contract, Sikorsky purchased the parts from Derco at the cost Derco paid other suppliers, plus a 32% markup.\n\nSikorsky then billed the Navy for the price it paid Derco, in violation of federal regulations barring such arrangements, which prosecutors said drive up government costs.\n\n“Today’s settlement demonstrates that the Justice Department will ensure that government contractors do not skirt the law and engage in self-dealing that may artificially inflate their charges at the expense of the American taxpayers,\" Brian Boynton, head of the DOJ's civil division, said in a statement.\n\nSpokespersons for Lockheed Martin didn’t immediately respond to an email seeking comment Friday.\n\nProsecutors said the settlement resolves a lawsuit filed by a former employee of Derco under whistleblower provision of the federal False Claims Act.\n\nDarrin Jones, of the U.S. Department of Defense's Office of Inspector General, said the settlement should serve as a deterrent for those looking to exploit the agency's procurement process.\n\n“Overinflation of parts and material costs for the repair and maintenance of aircraft affected naval air training and is a disservice to the American taxpayer,” added Greg Gross, of the Naval Criminal Investigative Service's Economic Crimes Field Office.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-subsidiaries-reach-70-001441142.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.296,
            "neg": 0.065,
            "neu": 0.87,
            "pos": 0.065
        }
    }
]