[
    {
        "date": "2024-07-09T11:48:00+00:00",
        "title": "Lockheed (LMT) Wins $200M Deal to Support the U.S. Navy",
        "content": "Lockheed Martin Corp.’s LMT business segment, Rotary and Mission Systems (“RMS”), recently clinched a modification contract for providing engineering design, development and production support to the U.S. Navy. The award has been offered by the Naval Sea Systems Command, Washington, D.C.\n\nValued at $199.6 million, the contract is projected to be completed by September 2025. A major portion of the work related to this deal will be carried out in Manassas, VA.\n\nLockheed’s Maritime Solutions\n\nNations across the globe are fortifying their defense spending on military weapons and arsenals as they look to strengthen their defense capabilities. Against this backdrop, as countries worldwide are enhancing their sea warfare capabilities, an augmented investment in manufacturing navy combat vehicles as well as constantly upgrading them is being noticed in recent times.\n\nTo this end, it is imperative to mention that Lockheed remains one of the primary suppliers of maritime solutions, training and sustainment for the U.S. Navy.\n\nIn particular, its Aegis is a world-renowned naval combat system, which operates as a total weapon system, from detection to kill. The fact that the Aegis weapons system is currently deployed on more than 100 ships across eight ship classes and six navies indicates the solid demand that it enjoys in the global naval combat systems market.\n\nAegis apart, other notable programs designed by LMT’s RMS unit that support the naval missions of the U.S. Navy and international customers are the Littoral Combat Ship (“LCS”) and the Multi-Mission Surface Combatant. This unit also has the Command, Control, Battle Management and Communications (C2BMC) program, which offers undersea combat systems programs to the U.S. Navy.\n\nSuch capabilities of Lockheed to serve the U.S. Navy with precision sea-based weapons must have enabled it to secure solid order inflows like the latest one.\n\nGrowth Prospects\n\nAs navies around the world are trying to strengthen their defense systems to meet national security goals, the growth prospects for the naval combat system market remain solid. In this regard, according to a report by the Mordor Intelligence firm, the global naval combat system market is projected to witness a CAGR of 2.5% during the 2024-2029 period.\n\nThis is likely to benefit Lockheed, considering its maritime capabilities that enable current and future maritime missions. Notably, to ensure the U.S. Navy’s dominance in the sea, LMT provides a broad portfolio of capabilities, including ships, aircraft, manned and unmanned systems, projectiles and sensors.\n\nStory continues\n\nOutside the United States, Lockheed’s maritime solutions also aim at strengthening the sea warfare capabilities of U.S. allies as well as other international customers, thereby enhancing its global reach in the naval combat systems space. Evidently, Lockheed offers its SEA 4000 Air Warfare Destroyer (“AWD”) program to upgrade Australia's maritime defense capability. Under this program, the HOBART Class AWDs have been the most advanced and complex warships ever built in Australia.\n\nLMT apart, other defense contractors that are likely to gain from the solid growth opportunities offered by the global naval combat systems market are mentioned below:\n\nHuntington Ingalls Industries, Inc. HII: Its Ingalls Shipbuilding and Newport News Shipbuilding segments design and construct non-nuclear ships, including amphibious assault ships, expeditionary warfare ships, surface combatants and national security cutters. During 2023, 81% of the company’s revenues were generated from the U.S. Navy.\n\nHII boasts a long-term (three-to-five-years) earnings growth rate of 7.2%. The Zacks Consensus Estimate for 2024 sales implies growth of 2% from the prior-year figure.\n\nNorthrop Grumman Corp. NOC: It delivers components like Airborne LASER Mine Detection System, Surface Electronic Warfare Improvement Program Block III, Fire Scout and bridge and navigation systems for both the Freedom and Independence variants of LCS. During 2023, 15% of NOC’s sales belonged to the Navy.\n\nNOC boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for 2024 sales implies growth of 4.6% from the prior-year figure.\n\nGeneral Dynamics Corp. GD: It is the lead integrator for the Independence-variant LCS. GD is responsible for the design, integration and testing of the navigation, command, control, computing and aviation systems on each ship. In 2023, the Marins Systems business segment generated 23% of the company’s total revenues.\n\nGD boasts a long-term earnings growth rate of 12%. The Zacks Consensus Estimate for 2024 sales implies growth of 10.5% from the prior-year reported figure.\n\nPrice Performance\n\nIn the past year, shares of LMT have rallied 3.1% against the industry’s 10.2% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLockheed currently has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nHuntington Ingalls Industries, Inc. (HII) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-wins-200m-deal-114800630.html",
        "symbols": [
            "0IUC.LSE",
            "0R3E.LSE",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.07,
            "neu": 0.778,
            "pos": 0.152
        }
    },
    {
        "date": "2024-07-09T07:36:59+00:00",
        "title": "Defense Contractors Stocks Q1 In Review: General Dynamics (NYSE:GD) Vs Peers",
        "content": "Defense Contractors Stocks Q1 In Review: General Dynamics (NYSE:GD) Vs Peers\n\nEarnings results often indicate what direction a company will take in the months ahead. With Q1 now behind us, let’s have a look at General Dynamics (NYSE:GD) and its peers.\n\nDefense contractors typically require technical expertise and government clearance. Companies in this sector can also enjoy long-term contracts with government bodies, leading to more predictable revenues. Combined, these factors create high barriers to entry and can lead to limited competition. Lately, geopolitical tensions–whether it be Russia’s invasion of Ukraine or China’s aggression towards Taiwan–highlight the need for defense spending. On the other hand, demand for these products can ebb and flow with defense budgets and even who is president, as different administrations can have vastly different ideas of how to allocate federal funds.\n\nThe 14 defense contractors stocks we track reported a strong Q1; on average, revenues beat analyst consensus estimates by 3.2%. while next quarter's revenue guidance was 0.7% above consensus. Valuation multiples for many growth stocks have not yet reverted to their early 2021 highs, but the market was optimistic at the end of 2023 due to cooling inflation. The start of 2024 has been a different story as mixed signals have led to market volatility, and while some of the defense contractors stocks have fared somewhat better than others, they collectively declined, with share prices falling 1.6% on average since the previous earnings results.\n\nGeneral Dynamics (NYSE:GD)\n\nCreator of the famous M1 Abrahms tank, General Dynamics (NYSE:GS) develops aerospace, marine systems, combat systems, and information technology products.\n\nGeneral Dynamics reported revenues of $10.73 billion, up 8.6% year on year, topping analysts' expectations by 4.2%. It was a mixed quarter for the company. General Dynamics blew past analysts' revenue expectations this quarter. On the other hand, its EPS missed and its backlog fell short Wall Street's estimates. General Dynamics Total Revenue\n\nThe stock is down 4.2% since the results and currently trades at $280.47.\n\nRead our full report on General Dynamics here, it's free.\n\nBest Q1: Northrop Grumman (NYSE:NOC)\n\nResponsible for the development of the first stealth bomber, Northrop Grumman (NYSE:NOC) specializes in providing aerospace, defense, and security solutions for various industry applications.\n\nNorthrop Grumman reported revenues of $10.13 billion, up 8.9% year on year, outperforming analysts' expectations by 3.8%. It was a stunning quarter for the company, with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates.\n\nStory continues Northrop Grumman Total Revenue\n\nThe stock is down 8.1% since the results and currently trades at $436.\n\nIs now the time to buy Northrop Grumman? Access our full analysis of the earnings results here, it's free.\n\nWeakest Q1: Mercury Systems (NASDAQ:MRCY)\n\nListed on the NASDAQ in 1998, Mercury Systems (NASDAQGS:MRCY) specializes in providing processing subsystems and components for defense applications.\n\nMercury Systems reported revenues of $208.3 million, down 21% year on year, falling short of analysts' expectations by 2.9%. It was a weak quarter for the company, with a miss of analysts' earnings and organic revenue estimates.\n\nMercury Systems had the weakest performance against analyst estimates and slowest revenue growth in the group. The stock is up 2.5% since the results and currently trades at $29.82.\n\nRead our full analysis of Mercury Systems's results here.\n\nLockheed Martin (NYSE:LMT)\n\nResponsible for renowned military systems like the F-35 fighter jet, Lockheed Martin Lockheed Martin (NYSE:LMT) specializes in defense, space, intelligence, homeland security, and information technology solutions.\n\nLockheed Martin reported revenues of $17.2 billion, up 13.7% year on year, surpassing analysts' expectations by 7.5%. It was a stunning quarter for the company, with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates.\n\nThe stock is flat since the results and currently trades at $461.76.\n\nRead our full, actionable report on Lockheed Martin here, it's free.\n\nJacobs (NYSE:J)\n\nWith offices in six continents, Jacobs Solutions (NYSE:J) offers engineering, technical, professional, and construction services for clients in various industries.\n\nJacobs reported revenues of $4.27 billion, up 24.4% year on year, falling short of analysts' expectations by 0.7%. It was a weaker quarter for the company, with a miss of analysts' backlog sales estimates.\n\nJacobs pulled off the fastest revenue growth among its peers. The stock is down 7.6% since the results and currently trades at $137.66.\n\nRead our full, actionable report on Jacobs here, it's free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/defense-contractors-stocks-q1-review-073659591.html",
        "symbols": [
            "0IUC.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "GS.US",
            "J.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.043,
            "neu": 0.782,
            "pos": 0.174
        }
    }
]