[
    {
        "date": "2024-06-02T11:01:45+00:00",
        "title": "Insiders At Lockheed Martin Sold US$9.4m In Stock, Alluding To Potential Weakness",
        "content": "Many Lockheed Martin Corporation (NYSE:LMT) insiders ditched their stock over the past year, which may be of interest to the company's shareholders. When evaluating insider transactions, knowing whether insiders are buying versus if they selling is usually more beneficial, as the latter can be open to many interpretations. However, when multiple insiders sell stock over a specific duration, shareholders should take notice as that could possibly be a red flag.\n\nAlthough we don't think shareholders should simply follow insider transactions, logic dictates you should pay some attention to whether insiders are buying or selling shares.\n\nSee our latest analysis for Lockheed Martin\n\nLockheed Martin Insider Transactions Over The Last Year\n\nThe Chief Operating Officer, Frank St. John, made the biggest insider sale in the last 12 months. That single transaction was for US$2.8m worth of shares at a price of US$428 each. So it's clear an insider wanted to take some cash off the table, even below the current price of US$470. We generally consider it a negative if insiders have been selling, especially if they did so below the current price, because it implies that they considered a lower price to be reasonable. Please do note, however, that sellers may have a variety of reasons for selling, so we don't know for sure what they think of the stock price. It is worth noting that this sale was 100% of Frank St. John's holding.\n\nAll up, insiders sold more shares in Lockheed Martin than they bought, over the last year. You can see a visual depiction of insider transactions (by companies and individuals) over the last 12 months, below. By clicking on the graph below, you can see the precise details of each insider transaction! insider-trading-volume\n\nIf you like to buy stocks that insiders are buying, rather than selling, then you might just love this freelist of companies. (Hint: Most of them are flying under the radar).\n\nInsiders At Lockheed Martin Have Sold Stock Recently\n\nThe last three months saw significant insider selling at Lockheed Martin. Specifically, insiders ditched US$6.6m worth of shares in that time, and we didn't record any purchases whatsoever. This may suggest that some insiders think that the shares are not cheap.\n\nInsider Ownership Of Lockheed Martin\n\nAnother way to test the alignment between the leaders of a company and other shareholders is to look at how many shares they own. I reckon it's a good sign if insiders own a significant number of shares in the company. Insiders own 0.06% of Lockheed Martin shares, worth about US$64m. We've certainly seen higher levels of insider ownership elsewhere, but these holdings are enough to suggest alignment between insiders and the other shareholders.\n\nStory continues\n\nSo What Does This Data Suggest About Lockheed Martin Insiders?\n\nInsiders sold stock recently, but they haven't been buying. Despite some insider buying, the longer term picture doesn't make us feel much more positive. But since Lockheed Martin is profitable and growing, we're not too worried by this. While insiders do own shares, they don't own a heap, and they have been selling. So we'd only buy after careful consideration. So these insider transactions can help us build a thesis about the stock, but it's also worthwhile knowing the risks facing this company. At Simply Wall St, we found 2 warning signs for Lockheed Martin that deserve your attention before buying any shares.\n\nOf course, you might find a fantastic investment by looking elsewhere. So take a peek at this freelist of interesting companies.\n\nFor the purposes of this article, insiders are those individuals who report their transactions to the relevant regulatory body. We currently account for open market transactions and private dispositions of direct interests only, but not derivative transactions or indirect interests.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/insiders-lockheed-martin-sold-us-110145681.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.021,
            "neu": 0.873,
            "pos": 0.107
        }
    }
]