[
    {
        "date": "2024-07-11T22:00:18+00:00",
        "title": "Lockheed Martin (LMT) Stock Moves -0.14%: What You Should Know",
        "content": "Lockheed Martin (LMT) closed the latest trading day at $460.38, indicating a -0.14% change from the previous session's end. The stock's change was more than the S&P 500's daily loss of 0.88%. Meanwhile, the Dow gained 0.08%, and the Nasdaq, a tech-heavy index, lost 1.95%.\n\nPrior to today's trading, shares of the aerospace and defense company had gained 0.41% over the past month. This has outpaced the Aerospace sector's loss of 3.69% and lagged the S&P 500's gain of 5.11% in that time.\n\nThe investment community will be closely monitoring the performance of Lockheed Martin in its forthcoming earnings report. The company is scheduled to release its earnings on July 23, 2024. The company is forecasted to report an EPS of $6.44, showcasing a 4.31% downward movement from the corresponding quarter of the prior year. Meanwhile, the latest consensus estimate predicts the revenue to be $17.06 billion, indicating a 2.19% increase compared to the same quarter of the previous year.\n\nFor the entire fiscal year, the Zacks Consensus Estimates are projecting earnings of $26.27 per share and a revenue of $69.76 billion, representing changes of -5.57% and +3.24%, respectively, from the prior year.\n\nFurthermore, it would be beneficial for investors to monitor any recent shifts in analyst projections for Lockheed Martin. These revisions help to show the ever-changing nature of near-term business trends. As a result, upbeat changes in estimates indicate analysts' favorable outlook on the company's business health and profitability.\n\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. To take advantage of this, we've established the Zacks Rank, an exclusive model that considers these estimated changes and delivers an operational rating system.\n\nThe Zacks Rank system, which varies between #1 (Strong Buy) and #5 (Strong Sell), carries an impressive track record of exceeding expectations, confirmed by external audits, with stocks at #1 delivering an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.07% higher within the past month. Lockheed Martin currently has a Zacks Rank of #3 (Hold).\n\nDigging into valuation, Lockheed Martin currently has a Forward P/E ratio of 17.55. For comparison, its industry has an average Forward P/E of 17.55, which means Lockheed Martin is trading at no noticeable deviation to the group.\n\nIt's also important to note that LMT currently trades at a PEG ratio of 4.32. The PEG ratio bears resemblance to the frequently used P/E ratio, but this parameter also includes the company's expected earnings growth trajectory. Aerospace - Defense stocks are, on average, holding a PEG ratio of 1.75 based on yesterday's closing prices.\n\nStory continues\n\nThe Aerospace - Defense industry is part of the Aerospace sector. Currently, this industry holds a Zacks Industry Rank of 101, positioning it in the top 41% of all 250+ industries.\n\nThe Zacks Industry Rank assesses the strength of our separate industry groups by calculating the average Zacks Rank of the individual stocks contained within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nDon't forget to use Zacks.com to keep track of all these stock-moving metrics, and others, in the upcoming trading sessions.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-stock-moves-220018775.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.99,
            "neg": 0.014,
            "neu": 0.893,
            "pos": 0.094
        }
    },
    {
        "date": "2024-07-11T16:10:13+00:00",
        "title": "Will Lockheed (LMT) Beat Estimates Again in Its Next Earnings Report?",
        "content": "Looking for a stock that has been consistently beating earnings estimates and might be well positioned to keep the streak alive in its next quarterly report? Lockheed Martin (LMT), which belongs to the Zacks Aerospace - Defense industry, could be a great candidate to consider.\n\nThis aerospace and defense company has seen a nice streak of beating earnings estimates, especially when looking at the previous two reports. The average surprise for the last two quarters was 8.98%.\n\nFor the last reported quarter, Lockheed came out with earnings of $6.33 per share versus the Zacks Consensus Estimate of $5.80 per share, representing a surprise of 9.14%. For the previous quarter, the company was expected to post earnings of $7.26 per share and it actually produced earnings of $7.90 per share, delivering a surprise of 8.82%.\n\nPrice and EPS Surprise\n\nWith this earnings history in mind, recent estimates have been moving higher for Lockheed. In fact, the Zacks Earnings ESP (Expected Surprise Prediction) for the company is positive, which is a great sign of an earnings beat, especially when you combine this metric with its nice Zacks Rank.\n\nOur research shows that stocks with the combination of a positive Earnings ESP and a Zacks Rank #3 (Hold) or better produce a positive surprise nearly 70% of the time. In other words, if you have 10 stocks with this combination, the number of stocks that beat the consensus estimate could be as high as seven.\n\nThe Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a version of the Zacks Consensus whose definition is related to change. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.\n\nLockheed has an Earnings ESP of +2.59% at the moment, suggesting that analysts have grown bullish on its near-term earnings potential. When you combine this positive Earnings ESP with the stock's Zacks Rank #3 (Hold), it shows that another beat is possibly around the corner. The company's next earnings report is expected to be released on July 23, 2024.\n\nWhen the Earnings ESP comes up negative, investors should note that this will reduce the predictive power of the metric. But, a negative value is not indicative of a stock's earnings miss.\n\nMany companies end up beating the consensus EPS estimate, but that may not be the sole basis for their stocks moving higher. On the other hand, some stocks may hold their ground even if they end up missing the consensus estimate.\n\nStory continues\n\nBecause of this, it's really important to check a company's Earnings ESP ahead of its quarterly release to increase the odds of success. Make sure to utilize our Earnings ESP Filter to uncover the best stocks to buy or sell before they've reported.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-beat-estimates-again-161013453.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.026,
            "neu": 0.838,
            "pos": 0.136
        }
    },
    {
        "date": "2024-07-11T14:02:00+00:00",
        "title": "Mercury (MRCY) Secures $13.2 Million Agreement From U.S. Navy",
        "content": "Mercury Systems MRCY announced that it has signed a $13.2 million agreement with the U.S. Navy to advance sensor processing technologies, which will allow radar and electronic warfare capabilities to be reduced by a significant time.\r\n\r\nIncreasing software and system complexity has been extending timelines to develop and launch military platforms for decades. The Office of Naval Research’s Open Rapid Chipletized Approach program is aiming to decrease the time needed to design edge processing solutions. This will be done by increasing the modularity of components at the chip level.\r\n\r\nUnder this agreement, Mercury will develop a next-generation RF System-in-Package (SiP), which will integrate the latest commercial chips from the largest semiconductor provider within a lighter and smaller footprint.\r\n\r\nThis agreement would help MRCY build on the RFS1140 SiP, which integrates Jariet Electra-MA high-speed data converters, AMD Versal field-programmable gate array (FPGA) and Micron memory for a comprehensive solution to support sensor processing.\n\nYear-to-date Performance Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nMercury’s Other Partnerships to Aid Long-Term Growth Prospects\n\nMercury’s recent agreement with the U.S. Navy came on the heels of some other notable partnerships, which are expected to aid long-term growth prospects for the company. These partnerships include an agreement with BlueHalo, L3Harris and Lockheed Martin.\r\n\r\nMRCY secured a production agreement with BlueHalo to support the U.S. Space Force’s Satellite Communication Augmentation Resource program. The company will provide a FPGA-based common signal acquisition and digital beamforming solution for BlueHalo’s BADGER system.\r\n\r\nMercury also signed a $31 million contract from L3Harris Technologies to provide solid slate data recorders for the U.S. Space Development Agency’s Tranche 2 Tracking Layer satellite constellation. The company’s solid-state data recorders are also the primary storage devices for all three L3Harris constellations.\r\n\r\nEarlier this year, MRCY collaborated with Lockheed Martin to advance the defense and manufacturing technologies in Switzerland. This project is a result of a program between Lockheed Martin and the Swiss government as part of Switzerland’s acquisition of the F-35 Lightning II. Under this agreement, Mercury will enable the transfer of two of armasuisses’ key security-relevant technologies–software-defined radio technologies and cryptology–to the Swiss industry.\r\n\r\nHowever, Mercury faces tough competition from Kratos Defense & Security Solutions KTOS, Lockheed Martin LMT and Elbit Systems ESLT in the defense sector.\r\n\r\nShares of this Zacks Rank #3 (Hold) company have plunged 18.4% year to date against the Zacks Computer and Technology sector’s growth of 29.4%. It also underperformed KTOS and LMT’s rise of 1.7% and 1.6%, respectively, and ESLT’s decline of 12.1%. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nStory continues\n\nConclusion\n\nMercury’s recent agreements and partnerships are a major positive. However, competition in the defense industry remains a concern.\r\n\r\nAdditionally, the company is suffering due to increasing operating expenses and margin pressure.\r\n\r\nIn the third quarter of fiscal 2024, as a percentage of revenues, operating expenses increased 790 basis points to 41.4% from 33.5% in the year-ago quarter.\r\n\r\nThe Zacks Consensus Estimate for MRCY’s fourth-quarter fiscal 2024 loss per share is pegged at 5 cents, which has widened by a cent in the past 60 days. The consensus mark for fiscal 2024 loss is pegged at 97 cents per share, which has widened by 6 cents in the past 60 days.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nElbit Systems Ltd. (ESLT) : Free Stock Analysis Report\n\nKratos Defense & Security Solutions, Inc. (KTOS) : Free Stock Analysis Report\n\nMercury Systems Inc (MRCY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/mercury-mrcy-secures-13-2-140200757.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "MCY.F",
            "MCY.MU",
            "MCY.STU",
            "MRCY.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.02,
            "neu": 0.824,
            "pos": 0.156
        }
    },
    {
        "date": "2024-07-11T11:23:22+00:00",
        "title": "Defense Contractors Stocks Q1 Earnings: Northrop Grumman (NYSE:NOC) Best of the Bunch",
        "content": "Defense Contractors Stocks Q1 Earnings: Northrop Grumman (NYSE:NOC) Best of the Bunch\n\nLooking back on defense contractors stocks' Q1 earnings, we examine this quarter's best and worst performers, including Northrop Grumman (NYSE:NOC) and its peers.\n\nDefense contractors typically require technical expertise and government clearance. Companies in this sector can also enjoy long-term contracts with government bodies, leading to more predictable revenues. Combined, these factors create high barriers to entry and can lead to limited competition. Lately, geopolitical tensions–whether it be Russia’s invasion of Ukraine or China’s aggression towards Taiwan–highlight the need for defense spending. On the other hand, demand for these products can ebb and flow with defense budgets and even who is president, as different administrations can have vastly different ideas of how to allocate federal funds.\n\nThe 13 defense contractors stocks we track reported a strong Q1; on average, revenues beat analyst consensus estimates by 3.5%. while next quarter's revenue guidance was 0.7% above consensus. Valuation multiples for many growth stocks have not yet reverted to their early 2021 highs, but the market was optimistic at the end of 2023 due to cooling inflation. The start of 2024 has been a different story as mixed signals have led to market volatility, and while some of the defense contractors stocks have fared somewhat better than others, they collectively declined, with share prices falling 1.2% on average since the previous earnings results.\n\nBest Q1: Northrop Grumman (NYSE:NOC)\n\nResponsible for the development of the first stealth bomber, Northrop Grumman (NYSE:NOC) specializes in providing aerospace, defense, and security solutions for various industry applications.\n\nNorthrop Grumman reported revenues of $10.13 billion, up 8.9% year on year, exceeding analysts' expectations by 3.8%. Overall, it was a stunning quarter for the company with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates. Northrop Grumman Total Revenue\n\nThe stock is down 9.6% since reporting and currently trades at $429.16.\n\nIs now the time to buy Northrop Grumman? Access our full analysis of the earnings results here, it's free.\n\nRTX (NYSE:RTX)\n\nOriginally focused on refrigeration technology, Raytheon (NSYE:RTX) provides a a variety of products and services to the aerospace and defense industries.\n\nRTX reported revenues of $19.31 billion, up 12.1% year on year, outperforming analysts' expectations by 4.9%. It was a stunning quarter for the company with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates.\n\nStory continues RTX Total Revenue\n\nThe stock is flat since reporting and currently trades at $100.65.\n\nIs now the time to buy RTX? Access our full analysis of the earnings results here, it's free.\n\nWeakest Q1: Mercury Systems (NASDAQ:MRCY)\n\nListed on the NASDAQ in 1998, Mercury Systems (NASDAQGS:MRCY) specializes in providing processing subsystems and components for defense applications.\n\nMercury Systems reported revenues of $208.3 million, down 21% year on year, falling short of analysts' expectations by 2.9%. It was a weak quarter for the company with a miss of analysts' earnings and organic revenue estimates.\n\nMercury Systems had the weakest performance against analyst estimates and slowest revenue growth in the group. Interestingly, the stock is up 1.6% since the results and currently trades at $29.57.\n\nRead our full analysis of Mercury Systems's results here.\n\nICF (NASDAQ:ICFI)\n\nOriginally founded as Inner City Fund, ICF International (NASDAQ:ICFI) delivers consulting and technology services in health, environment, and infrastructure.\n\nICF reported revenues of $494.4 million, up 2.3% year on year, surpassing analysts' expectations by 1.3%. Looking more broadly, it was a strong quarter for the company with an impressive beat of analysts' earnings estimates.\n\nThe stock is down 10% since reporting and currently trades at $129.47.\n\nRead our full, actionable report on ICF here, it's free.\n\nLockheed Martin (NYSE:LMT)\n\nResponsible for renowned military systems like the F-35 fighter jet, Lockheed Martin Lockheed Martin (NYSE:LMT) specializes in defense, space, intelligence, homeland security, and information technology solutions.\n\nLockheed Martin reported revenues of $17.2 billion, up 13.7% year on year, surpassing analysts' expectations by 7.5%. Looking more broadly, it was a stunning quarter for the company with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates.\n\nThe stock is flat since reporting and currently trades at $460.82.\n\nRead our full, actionable report on Lockheed Martin here, it's free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/defense-contractors-stocks-q1-earnings-112322647.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "G6V.BE",
            "G6V.F",
            "G6V.STU",
            "ICFI.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "MCY.F",
            "MCY.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.032,
            "neu": 0.793,
            "pos": 0.175
        }
    }
]