[
    {
        "date": "2024-06-21T16:10:04+00:00",
        "title": "Top Midday Stories: Boeing Close to Buying Back Spirit AeroSystems; Amazon Plans to Launch Premium Alexa; Lockheed Sanctioned by China; American Express Acquires Tock From Squarespace",
        "content": "Top Midday Stories: Boeing Close to Buying Back Spirit AeroSystems; Amazon Plans to Launch Premium Alexa; Lockheed Sanctioned by China",
        "link": "https://finance.yahoo.com/news/top-midday-stories-boeing-close-161004160.html",
        "symbols": [
            "0BOE.LSE",
            "0HT4.LSE",
            "0R1O.IL",
            "0R3E.LSE",
            "1AMZN.MI",
            "AEC1.BE",
            "AEC1.DU",
            "AEC1.F",
            "AEC1.HM",
            "AEC1.MU",
            "AEC1.STU",
            "AEC1.XETRA",
            "AMZ.DU",
            "AMZ.F",
            "AMZ.HM",
            "AMZ.MU",
            "AMZ.STU",
            "AMZ.XETRA",
            "AMZ1.F",
            "AMZN.BA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.494,
            "neg": 0,
            "neu": 0.766,
            "pos": 0.234
        }
    },
    {
        "date": "2024-06-21T14:03:28+00:00",
        "title": "Update: Lockheed Martin Subsidiaries, Executives Sanctioned by China Over Arms Sales to Taiwan",
        "content": "Update: Lockheed Martin Subsidiaries, Executives Sanctioned by China Over Arms Sales to Taiwan",
        "link": "https://finance.yahoo.com/news/lockheed-martin-subsidiaries-executives-sanctioned-140328105.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0,
            "neg": 0,
            "neu": 1,
            "pos": 0
        }
    },
    {
        "date": "2024-06-21T13:39:26+00:00",
        "title": "China sanctions several Lockheed Martin units, three executives over arms deals with Taiwan",
        "content": "BEIJING (AP) — China said Friday it has banned a number of business units of American aviation manufacturer Lockheed Martin Corp. and three of its executives over arms deals the company has signed with Taiwan, the self-ruling island it claims as its own territory.\n\nThe statement from China’s Foreign Ministry said the company’s cooperation with Taiwan had violated the country’s sovereignty, standard terminology in its discussions of any outside dealings that support the island's government.\n\nThe effects of the sanctions appeared largely symbolic since military cooperation between the U.S. and China has been suspended since the People’s Liberation Army’s crackdown on student-led pro-democracy protests in Beijing and other cities in 1989.\n\nNamed under the sanctions were Lockheed Martin Missile System Integration Lab, Lockheed Martin Advanced Technology Laboratories and Lockheed Martin Ventures. Top executives James Donald Taiclet, Frank Andrew St. John and Jesus Malave were listed as banned from traveling to China.\n\nChina has been steadily growing its domestic aircraft industry, producing parts, planes and services for Airbus and producing its own commercial jets. Foreign technology has played a large part in that process, but Chinese companies have increasingly developed the means to replace their overseas suppliers.\n\nTaiwan relies heavily on U.S. suppliers for arms, even as it works to boost its own defense industries and increase mandatory military service for men from four months to one year. That comes against the backdrop of China's rising threat to encircle or invade Taiwan to achieve what it calls a historical mission to annex the island. Taiwan was formerly a Japanese colony and separated from mainland China amid civil war in 1949.\n\nView comments",
        "link": "https://finance.yahoo.com/news/china-sanctions-several-lockheed-martin-133926985.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.718,
            "neg": 0.068,
            "neu": 0.867,
            "pos": 0.065
        }
    },
    {
        "date": "2024-06-21T13:16:00+00:00",
        "title": "General Dynamics (GD) Wins $203M Contract for DDG 51 Combat Ships",
        "content": "General Dynamics Corp.’s GD business unit, Bath Iron Works, recently clinched a contract to provide planning yard services for its DDG 51 guided-missile destroyer ships. The award has been offered by the Naval Sea Systems Command, Washington, D.C.\n\nDetails of the Deal\n\nValued at $202.7 million, the contract is expected to be completed by Jul 31, 2029. Work related to this deal will be carried out in Bath, ME.\n\nThe options included in this contract, on being exercised, should bring the cumulative value of this contract to $1.13 billion.\n\nWhat’s Favoring General Dynamics?\n\nNations across the globe are fortifying their defense spending on military weapons and arsenals as they look to strengthen their defense capabilities. This also includes augmented spending on navy ships for enhanced sea warfare capabilities.\n\nSuch increased spending tends to benefit General Dynamics, with its Bath Iron Works business unit being an expert in manufacturing navy ships and providing modernization and lifecycle support for the U.S. Navy.\n\nNotably, General Dynamics’ DDG-51 Arleigh Burke-class guided-missile destroyers witness significant demand owing to their wide range of advanced warfighting capabilities in multi-threat air, surface and subsurface environments. These also offer protection against a wide range of threats, including ballistic missiles. Their strong demand is evident from the fact that in 2023, the company won a contract from the Navy for the construction of three Flight III DDG-51 destroyers, with a total of 12 ships in backlog (scheduled for delivery through 2032).\n\nSuch strong demand, in tandem with excellence in providing unique capabilities in shipbuilding, must have been boosting GD’s order flows, like the latest one.\n\nGrowth Prospects\n\nAs demand for an efficient security system that can strengthen naval sea warfare capabilities rises, so does the prospect of the naval ship market. This must have encouraged the Mordor Intelligence firm to project that the global naval combat vessels market will witness a CAGR of 6.5% during the 2024-2029 period.\n\nThis growth opportunity should boost General Dynamics’ operating results as it is one of the prime contractors of navy ships. Notably, GD’s Marine Systems segment is the leading designer and builder of surface combatant and auxiliary ships for the U.S. Navy. The segment also provides comprehensive post-delivery services to modernize and extend the service life of Navy ships. It also maintains the most sophisticated marine engineering expertise in the world to support future capabilities.\n\nStory continues\n\nSuch expertise of GD in manufacturing, as well as providing valuable services for naval combat ships, should usher in more order flows for the company, backed by the growing demand in the naval combat vessels market, like the latest one. Such contract wins should boost GD’s revenue generation prospects in the coming years.\n\nPeer Opportunities\n\nGD apart, other defense majors poised to benefit from the expanding naval combat vessels market, on virtue of their strong presence in this space, are discussed below:\n\nBAE Systems BAESY: It designs, builds, commissions, repairs and supports a full range of complex naval ships, from offshore patrol vessels to aircraft carriers. Its Queen Elizabeth Class Aircraft Carriers are the largest warships ever constructed in the United Kingdom.\n\nBAESY boasts a long-term earnings growth rate of 12.2%. The Zacks Consensus Estimate for BAE Systems’ 2024 sales indicates growth of 34.1% from the 2023 level.\n\nLockheed Martin LMT: The company manufactures Littoral Combat Ships (LCS). Its freedom-variant LCS, USS Nantucket (LCS 27), is a resilient, flexible warship designed to encounter the evolving missions of the U.S. Navy.\n\nLockheed’s long-term earnings growth rate is 4.1%. The Zacks Consensus Estimate for LMT’s 2024 sales implies an improvement of 3.2% from the 2023 figure.\n\nHuntington Ingalls Industries HII: Its business segment designs and constructs non-nuclear ships for the U.S. Navy and the U.S. Coast Guard, including amphibious assault ships, expeditionary warfare ships, surface combatants and national security cutters.\n\nHuntington’s long-term earnings growth rate is 7.2%. The Zacks Consensus Estimate for HII’s 2024 sales indicates an increase of 2% from the year-earlier level.\n\nPrice Performance\n\nShares of General Dynamics have risen 42.9% in the past year against the industry’s 10.4% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nGeneral Dynamics currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nBae Systems PLC (BAESY) : Free Stock Analysis Report\n\nHuntington Ingalls Industries, Inc. (HII) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/general-dynamics-gd-wins-203m-131600265.html",
        "symbols": [
            "0IUC.LSE",
            "0R3E.LSE",
            "BA.LSE",
            "BAESF.US",
            "BAESY.US",
            "BSP.BE",
            "BSP.DU",
            "BSP.F",
            "BSP.STU",
            "BSP.XETRA",
            "BSPA.F",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.053,
            "neu": 0.748,
            "pos": 0.198
        }
    },
    {
        "date": "2024-06-21T10:38:16+00:00",
        "title": "China sanctions Lockheed Martin over Taiwan arms sales",
        "content": "BEIJING (Reuters) - China has imposed sanctions against some Lockheed Martin Corp subsidiaries and senior executives over U.S. arms sales to Taiwan, China's foreign ministry said in a statement.\n\nChina will freeze movable, immovable and other kinds of property of Lockheed Martin's senior executives including its chairman James Donald Taiclet, and will bar them from entering the country, the statement on Friday said.\n\nThe companies on the sanction list include Lockheed Martin Missile System Integration Lab, Lockheed Martin Advanced Technology Laboratories and Lockheed Martin Ventures, according to the statement.\n\nChina has repeatedly called on the U.S., an important international backer and arms supplier for democratically-governed Taiwan, which Beijing claims as part of its territory, to stop its arms sales to the island.\n\nBeijing has applied sanctions on U.S. companies including Lockheed Martin on numerous occasions for selling arms to Taiwan.\n\nIn September last year, China said it would impose sanctions against Lockheed and Northrop Grumman under China's Anti-Foreign Sanctions Law.\n\nIt also placed sanctions against Lockheed and Raytheon in 2019, 2020, 2022 and 2023 - with the 2022 action the first under China's new anti-foreign sanctions law.\n\nChina's wide-ranging law to counter foreign sanctions came into force in 2021 in an apparent move to legalise tit-for-tat retaliation against punitive actions taken against it by foreign countries.\n\n(Reporting by Ella Cao, Ethan Wang and Ryan Woo, Editing by William Maclean and Elaine Hardcastle)\n\nView comments",
        "link": "https://finance.yahoo.com/news/china-sanctions-lockheed-martin-over-103816930.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.226,
            "neg": 0.037,
            "neu": 0.929,
            "pos": 0.034
        }
    }
]