[
    {
        "date": "2024-05-22T21:50:05+00:00",
        "title": "Lockheed Martin (LMT) Advances While Market Declines: Some Information for Investors",
        "content": "The most recent trading session ended with Lockheed Martin (LMT) standing at $469.71, reflecting a +0.3% shift from the previouse trading day's closing. The stock outperformed the S&P 500, which registered a daily loss of 0.27%. Meanwhile, the Dow experienced a drop of 0.51%, and the technology-dominated Nasdaq saw a decrease of 0.19%.\n\nShares of the aerospace and defense company have appreciated by 1.79% over the course of the past month, underperforming the Aerospace sector's gain of 5.59% and the S&P 500's gain of 7.34%.\n\nMarket participants will be closely following the financial results of Lockheed Martin in its upcoming release. The company's upcoming EPS is projected at $6.45, signifying a 4.16% drop compared to the same quarter of the previous year. At the same time, our most recent consensus estimate is projecting a revenue of $17.03 billion, reflecting a 2.04% rise from the equivalent quarter last year.\n\nIn terms of the entire fiscal year, the Zacks Consensus Estimates predict earnings of $26.26 per share and a revenue of $69.72 billion, indicating changes of -5.61% and +3.18%, respectively, from the former year.\n\nInvestors should also take note of any recent adjustments to analyst estimates for Lockheed Martin. These recent revisions tend to reflect the evolving nature of short-term business trends. As a result, upbeat changes in estimates indicate analysts' favorable outlook on the company's business health and profitability.\n\nOur research demonstrates that these adjustments in estimates directly associate with imminent stock price performance. To exploit this, we've formed the Zacks Rank, a quantitative model that includes these estimate changes and presents a viable rating system.\n\nThe Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has moved 0.17% higher. As of now, Lockheed Martin holds a Zacks Rank of #3 (Hold).\n\nLooking at valuation, Lockheed Martin is presently trading at a Forward P/E ratio of 17.84. This signifies a discount in comparison to the average Forward P/E of 18.78 for its industry.\n\nInvestors should also note that LMT has a PEG ratio of 4.39 right now. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Aerospace - Defense industry currently had an average PEG ratio of 1.69 as of yesterday's close.\n\nStory continues\n\nThe Aerospace - Defense industry is part of the Aerospace sector. This industry, currently bearing a Zacks Industry Rank of 74, finds itself in the top 30% echelons of all 250+ industries.\n\nThe Zacks Industry Rank is ordered from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nBe sure to use Zacks.com to monitor all these stock-influencing metrics, and more, throughout the forthcoming trading sessions.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-advances-while-215005737.html",
        "symbols": [
            "0R3E.LSE",
            "GSPC.INDX",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.988,
            "neg": 0.02,
            "neu": 0.887,
            "pos": 0.092
        }
    },
    {
        "date": "2024-05-22T20:05:00+00:00",
        "title": "Lockheed Martin Elects Heather Wilson to Board of Directors",
        "content": "BETHESDA, Md., May 22, 2024  /PRNewswire/ -- Lockheed Martin (NYSE: LMT) today announced its board of directors has elected Dr. Heather Wilson to the board, effective today. Dr. Wilson\n\n\"Dr. Wilson's deep knowledge of our industry and extensive leadership experience will be a tremendous asset to our company as we continue to drive innovation and deliver 21st Century Security solutions to our customers,\" said Lockheed Martin Chairman, President and CEO Jim Taiclet. \"Heather has a proven track record in government, academia and the private sector, and I look forward to her strategic insight as a member of the board.\"\n\nWilson served as the 24th Secretary of the U.S. Air Force from 2017 to 2019 and is the president of the University of Texas at El Paso, a 24,000-student research university.\n\nShe is the former president of the South Dakota School of Mines & Technology. From 1998 to 2009, she represented New Mexico in the U.S. House of Representatives and served on the House Armed Services Committee, the House Permanent Select Committee on Intelligence, and the House Energy and Commerce Committee.\n\nWilson graduated from the U.S. Air Force Academy and earned her master's and doctoral degrees as a Rhodes Scholar at Oxford University in England. She is a member of the National Science Board that oversees the National Science Foundation, is inaugural chair of the Alliance of Hispanic Serving Research Universities and serves on the board of directors of Google Public Sector, a subsidiary of Google LLC.\n\nWilson is considered an independent director under applicable rules and regulations and will serve on the Classified Business and Security Committee.\n\nAbout Lockheed Martin\n\nLockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at Lockheedmartin.com.  Lockheed Martin Logo. (PRNewsFoto/Lockheed Martin) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/lockheed-martin-elects-heather-wilson-to-board-of-directors-302153369.html\n\nSOURCE Lockheed Martin Corporation\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-elects-heather-wilson-200500382.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.985,
            "neg": 0,
            "neu": 0.889,
            "pos": 0.111
        }
    },
    {
        "date": "2024-05-22T15:14:00+00:00",
        "title": "Northrop Grumman (NOC) Secures an Army Contract for IBCS",
        "content": "Northrop Grumman Corp. NOC recently secured a modification contract for the Integrated Air and Missile Defense Battle Command System (IBCS). The award has been offered by the Army Contracting Command, Redstone Arsenal, AL.\n\nValued at $49 million, the contract is expected to be completed by Mar 31, 2025. The work related to this deal will be executed at Huntsville, AL. The contract includes foreign military sales to Poland.\n\nWhat’s Favoring Northrop?\n\nMissile defense plays a pivotal role in a nation’s defense strategy. Nations are thus reinforcing their military capabilities to strengthen their defense structure in the growing threat environment. To this end, it is imperative to mention that Northrop Grumman’s IBCS is the centerpiece of the U.S. Army’s modernization strategy for air and missile defense capability.\n\nNotably, the company pioneered the development of integrated battle command solutions and interoperable defense systems. The solid demand for NOC’s IBCS can be gauged from the fact that IBCS seamlessly fused data from a Lower Tier Air and Missile Defense Sensor to acquire, track, engage and intercept a long-range cruise missile surrogate with a PAC-3 Missile Segment Enhancement during a recent test event held at White Sands Missile Range in New Mexico, in April.\n\nNaturally, being a prominent defense contractor, the company frequently wins contracts involving notable missile defense products like IBCS. The latest contract win is an example.\n\nGrowth Prospects\n\nThe global peace index reflects an unstable environment worldwide with the Russia-Ukraine war continuing for more than two years now, in addition to the ongoing hostility prevalent in different parts of the Middle East. This has set the stage for the defense sector to witness rising demand for military products, particularly missiles, as nations worldwide strive to protect their borders from unprecedented attacks.\n\nThis should bode well for the missile industry, as evident from the Mordor Intelligence firm’s report, which estimates the missile and missile defense systems market to witness a CAGR of 5% over the 2024-2029 period.\n\nNOC’s proficiency in missile manufacturing positions it favorably to capitalize on such market growth opportunities. Its product portfolio includes the Guided Multiple Launch Rocket System propulsion and warhead subsystems, the Hypersonic Attack Cruise Missile, the Advanced Anti-Radiation Guided Missile and a few other combat-proven products that support missile defense systems.\n\nPeer Opportunities\n\nApart from NOC, other major missile makers like RTX Corp. RTX, Lockheed Martin LMT and General Dynamics GD are also expected to benefit from the aforementioned prospects of the missile and missile defense market.\r\n\r\nRTX’s business unit, Missiles and Defense, is a prominent U.S. missile maker. Its portfolio includes the AIM-9X Sidewinder missile, the AIM-9X Block II missile and the RAM-guided missile weapon system.\n\nStory continues\n\nRTX boasts a long-term earnings growth rate of 10.3%. The Zacks Consensus Estimate for its 2024 sales indicates an improvement of 6.2% from the 2023 reported figure.\n\nLockheed’s Missiles and Fire Control unit provides combat-proven air and missile defense systems as well as tactical missiles. These include Joint Air-to-Surface Standoff Missile, Long Range Anti-Ship Missile, Multiple Launch Rocket System and a few more missile programs.\n\nLMT boasts a long-term earnings growth rate of 4.2%. The consensus estimate for its 2024 sales indicates an improvement of 3.2% from the 2023 reported figure.\n\nGeneral Dynamics’ Ordnance and Tactical Systems is the system integrator of the 2.75-inch Hydra-70 family of rockets. It also produces composite rocket motor cases and launch tubes for tactical and strategic missiles.\n\nGD has a long-term earnings growth rate of 11%. The Zacks Consensus Estimate for General Dynamics’ 2024 sales indicates an improvement of 10.5% from the 2023 reported figure.\n\nPrice Performance\n\nShares of Northrop Grumman have gained 6.5% over a year against the industry’s 7.7% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nNorthrop Grumman currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/northrop-grumman-noc-secures-army-151400059.html",
        "symbols": [
            "0IUC.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.046,
            "neu": 0.772,
            "pos": 0.182
        }
    },
    {
        "date": "2024-05-22T10:15:00+00:00",
        "title": "7 Long-Term Stocks to Buy Now: May 2024",
        "content": "On a day-to-day basis, the stock market can do almost anything. Short-term returns tend to be highly volatile and quite random in nature. One day meme stocks can skyrocket and the next day, an unexpected piece of economic data can cause the stock market to tank. Many people compare the stock market to a casino, and not without some merit.\n\nIn the bigger picture, however, stocks tend to be more predictable. As the overall economy grows in size and companies generate higher levels of earnings, it tends to lead to rising stock prices and dividend payouts.\n\nFor investors with some patience and willingness to hold companies over the long haul, the stock market has been proven to be a reliable way to generate wealth. These seven long-term stocks to buy, in particular, have excellent track records and operate in businesses and industries that should continue to prosper for many years to come.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nMcCormick (MKC) McCormick & Company spices lined up on a grocery store shelf.\n\nSource: Arne Beruldsen / Shutterstock.com\n\nMcCormick (NYSE:MKC) is the dominant leader within the U.S. spices and seasonings market.\n\nUnlike many packaged food companies, McCormick faces surprisingly little competition. It controls an estimated 40% to 60% market share in its primary categories, coming in at more than double that of its nearest branded competitor. It is also a leading producer of store-brand spices, meaning consumers often choose between a McCormick bottle of spice or a McCormick-manufactured store-brand alternative.\n\nThis quasi-monopoly position has made McCormick a tremendous long-term investment. MKC stock has risen more than 8,000% over the past 40 years.\n\nPast returns are no guarantee of future results, however. To keep its growth streak going, McCormick has expanded its product line-up. It now has a leading position in producing flavors and seasonings for restaurants and institutional kitchens. Furthermore, McCormick is making deals, such as its acquisitions including Frank’s and Cholula in the hot sauce space.\n\nMcCormick is one of the companies least prone to technological disruption. Humans love tasty food, and if anything, younger consumers are more interested in cooking, international cuisines and unique flavors than ever before. McCormick’s dominant market position in a timeless business makes it a wonderful long-term holding.\n\nBrown-Forman (BF-A, BF-B) Person holding cellphone with logo of American spirits company Brown-Forman (BF-B) Corporation on screen in front of webpage. Focus on phone display. Unmodified photo.\n\nSource: T. Schneider / Shutterstock.com\n\nBrown-Forman (NYSE:BF-A, NYSE:BF-B) is one of America’s leading alcoholic spirits companies. Founded in 1870, the company even managed to survive America’s nearly 14-year alcohol prohibition period.\n\nStory continues\n\nBrown-Forman is most well-known for its Jack Daniels whiskey. Under Brown-Forman’s ownership, Jack Daniels has grown from a small regional brand to a global powerhouse. The company is also rolling out far more expensive premium brands such as Woodford Reserve; the future for the spirits industry isn’t primarily in selling more alcohol but rather in selling much higher-quality alcohol.\n\nThe company isn’t just whiskey, either. Brown-Forman’s Casa Herradura tequila acquisition in 2007 looks particularly shrewd. Tequila has gone on to become a fast-growing spirit in the North American market, one where premium and super-premium products are now gaining appeal.\n\nThe final element of the long-term story is ownership. The Brown family continues to control the company via ownership of the A-class shares, which have voting rights. That structure protects Brown-Forman from takeovers and allows this long-term stock to buy to keep delivering outsized returns on a generational timeframe.\n\nVisa (V) several Visa branded credit cards\n\nSource: Kikinunchi / Shutterstock.com\n\nVisa (NYSE:V) has returned to form. The company has been one of the best long-term large-cap stocks in America over time.\n\nBut its rise was temporarily disrupted during the pandemic. V stock slipped as it lost out on its most profitable transactions, the cross-border ones that involve currency exchange.\n\nAdditionally, a surge in FinTech companies and cryptocurrency and blockchain back in 2021 created the idea that there would be much more competition to credit card networks. Fast forward to 2024, however, and almost all these issues have been alleviated.\n\nThe global economy has largely returned to form, with international travel enjoying an especially swift recovery. Meanwhile, the FinTech sector has struggled to maintain its momentum and has barely impacted results for Visa or Mastercard (NYSE:MA). Similarly, while cryptocurrency remains interesting for trading purposes, so far no killer app has emerged within crypto that would meaningfully disrupt Visa.\n\nOver the long term, people will continue shifting more transactions from cash to credit and digital payments; that’s especially true in developing countries. As inflation works its way through the global economy, transaction sizes grow, which naturally lifts Visa’s revenues and earnings. All this makes Visa a highly reliable long-term stock to own.\n\nEcolab (ECL) Ecolab (ECL) logo on its corporate headquarters building.\n\nSource: Ken Wolter / Shutterstock.com\n\nEcolab (NYSE:ECL) is the world’s largest cleaning and sanitation company. It aims to be a one-stop shop for its customers, offering cleaning supplies and chemicals, pest control, water treatment and related services.\n\nThe company realized early on that it could acquire a nearly unlimited number of mom-and-pop cleaning and sanitation shops. It has been rolling up the industry for decades, assembling a global sanitation and water treatment empire. To that point, Ecolab has been one of the best stocks for long-term investment, with shares rising more than 15,000% over the past 40 years.\n\nThe growth story is far from over. Though Ecolab is the industry leader, it only has an estimated 9% of the total $152 billion global market. That means Ecolab can continue running its M&A playbook for many years to come.\n\nEcolab was hit hard during the pandemic as key customers like restaurants, hotels, cruise ships and so on lost business. But with the global economy roaring back to life, Ecolab has enjoyed a rapid recovery amid dramatic margin expansion. Simply put, this long-term stock champion is back to full health and is ready to reward shareholders once again.\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) Space Systems sign in Sunnyvale, California.\n\nSource: Ken Wolter / Shutterstock.com\n\nLockheed Martin (NYSE:LMT) is one of the world’s largest defense contractors.\n\nKnown for its fighter jet program, Lockheed Martin offers a wide array of defensive hardware that helps support almost all types of modern combat. In addition, the company has built an attractive space and satellite business that generates about $12 billion in annual revenues.\n\nLMT stock sold off in 2021 when the U.S. pulled forces out of Afghanistan, and some analysts felt this would lead to a fall in defense spending. Regrettably, however, global tensions swiftly mounted. First, there was Russia’s invasion of Ukraine, and more recently, there has been conflict in the Middle East.\n\nBesides those active conflicts, tensions have also mounted between the U.S. and China over trade disputes and Taiwan’s political status. All this should lead to outsized defense sector spending in coming years. Lockheed Martin’s space business offers another reason for optimism with this long-term stock to buy.\n\nDentsply Sirona (XRAY) A concept image of a doctor holding up an X-Ray.\n\nSource: Shutterstock\n\nDentsply Sirona (NASDAQ:XRAY) is a leading producer of dental equipment and supplies.\n\nThe company built its fortunes from its dental CAD/CAM (computer-aided design/computer-aided manufacturing) systems. These CAD systems allow dentists and orthodontists to design customized tailored solutions for patients at the chairside, rather than having to refer work out to a third-party lab.\n\nIn addition, the rise of digital dentistry more broadly has been a huge tailwind for the industry. It makes it easier and cheaper to perform cosmetic work, thus expanding the addressable market. Dentsply Sirona, with its leading CAD/CAM tools, has held a first-mover advantage.\n\nXRAY stock has underperformed in recent years. The dental market slowed down during the pandemic — it seems that masking and being stuck at home somewhat impacted demand for cosmetic dentistry. There has also been mounting competition in the market, as often happens when a field enjoys rapid growth.\n\nThese factors have pushed XRAY stock down to just 13 times forward earnings, and analysts see earnings returning to double-digit annualized growth going forward. That, combined with the aging population, which will likely consume far more cosmetic dentistry services, should make XRAY stock a great long-term holding.\n\nDollar General (DG)\n\nSource: Shutterstock\n\nDiscount retailer Dollar General (NYSE:DG) has had a rough past couple of years. Dollar General’s stock price collapsed as revenue growth tailed off. Management blamed economic weakness among its core working-class consumer base for the business slowdown. While the economy is still growing, there are real signs of trouble for many Americans, and that has been reflected in results for discount retailers.\n\nThe business has had other issues as well. Investigative reports highlighted potentially unsafe working conditions at some Dollar General stores. The company has also struggled to maintain fully-staffed stores at times amid the labor shortage of the past few years.\n\nHowever, these concerns should work themselves out in time. The economy appears to be decelerating now, which will clear up the labor shortages. And while Dollar General’s core shoppers are facing economic strain right now, a more prolonged economic downturn should cause some more affluent consumers to trade down from pricier stores to Dollar General.\n\nThere is another reason for optimism. A rival, 99 Cents Only, shut down in April, with 371 stores being liquidated. That improves Dollar General’s competitive positioning within the industry and sets it up to take market share and grow sales, especially once the next recession begins.\n\nOn the date of publication, Ian Bezek held a long position in DG, XRAY, LMT, ECL, MKC, BF-B and V stock. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nIan Bezek has written more than 1,000 articles for InvestorPlace.com and Seeking Alpha. He also worked as a Junior Analyst for Kerrisdale Capital, a $300 million New York City-based hedge fund. You can reach him on Twitter at @irbezek.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post 7 Long-Term Stocks to Buy Now: May 2024 appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/7-long-term-stocks-buy-101500922.html",
        "symbols": [
            "0HQ3.LSE",
            "0I8F.LSE",
            "0IC7.LSE",
            "0IFA.LSE",
            "0JZS.LSE",
            "0R3E.LSE",
            "3V6.F",
            "3V64.F",
            "3V64.STU",
            "3V64.XETRA",
            "7DG.BE",
            "7DG.F",
            "7DG.MU",
            "7DG.STU",
            "BF-A.US",
            "BF-B.US",
            "BF5A.F",
            "BF5B.BE",
            "BF5B.DU",
            "BF5B.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.038,
            "neu": 0.857,
            "pos": 0.104
        }
    },
    {
        "date": "2024-05-22T00:00:00+00:00",
        "title": "7 Long-Term Stocks to Buy Now: May 2024",
        "content": "While anything can happen in the markets from day to day, over the long-term, these seven long-term stocks to buy should prosper regardless.\n",
        "link": "https://investorplace.com/2024/05/7-long-term-stocks-to-buy-now-may-2024/",
        "symbols": [
            "BF-A.US",
            "BF-B.US",
            "DG.US",
            "ECL.US",
            "LMT.US",
            "MKC.US",
            "V.US",
            "XRAY.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0,
            "neg": 0,
            "neu": 1,
            "pos": 0
        }
    }
]