[
    {
        "date": "2024-08-06T13:23:00+00:00",
        "title": "What's in Store for Virgin Galactic (SPCE) in Q2 Earnings?",
        "content": "Virgin Galactic Holdings, Inc. SPCE is slated to report second-quarter 2024 results on Aug 7, after the closing bell.\n\nIn the last reported quarter, the company delivered an earnings surprise of 3.85%. Virgin Galactic has a trailing four-quarter negative earnings surprise of 15.91%, on average.\n\nFactors to Note\n\nSolid revenues generated from commercial spaceflight must have boosted Virgin Galactic’s top-line performance in the second quarter. To this end, it is imperative to mention that in June 2024, the company accomplished its second spaceflight of 2024, with its Galactic 07 spaceship successfully completing its commercial flight.\n\nMembership fees generated from SPCE’s Future Astronaut community are also likely to have favorably contributed to its second-quarter revenues.\n\nVirgin Galactic Holdings, Inc. Price, Consensus and EPS Surprise Virgin Galactic Holdings, Inc. Price, Consensus and EPS Surprise\n\nVirgin Galactic Holdings, Inc. price-consensus-eps-surprise-chart | Virgin Galactic Holdings, Inc. Quote\n\nThe Zacks Consensus Estimate for SPCE’s revenues is pegged at $3.5 million, suggesting an improvement of 87.2% from the year-ago quarter’s reported actuals.\n\nOn the cost front, the company is expected to have incurred lower materials and consulting expenses compared with the prior-year quarter’s level, thanks to the completion of modifications of its VSS Unity spaceship and mothership carrier aircraft (VMS Eve) in 2023. This, along with lower expenses related to a reduction in its headcount and strong revenue expectations, is likely to have bolstered SPCE’s overall earnings.\n\nHowever, higher interest expenses, as well as higher labor costs associated with the development of its next-generation spaceflight vehicles, might have adversely impacted SPCE’s quarterly bottom line to some extent.\n\nThe Zacks Consensus Estimate for second-quarter earnings is pegged at a loss of $5.07 per share, suggesting an improvement from the year-ago quarter’s reported loss of $9.20.\n\nWhat the Zacks Model Unveils\n\nOur proven model does not conclusively predict an earnings beat for Virgin Galactic this time around. The combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the chances of an earnings beat, which is not the case here.\n\nThe company has an Earnings ESP of 0.00% and a Zacks Rank #3 at present. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\n\nA Stock to Consider\n\nBelow is a defense stock that has the right combination of elements to post an earnings beat this reporting cycle.\n\nCurtiss-Wright CW is slated to release second-quarter results on Aug 7. CW has an Earnings ESP of +2.42% and a Zacks Rank #3 at present.\n\nStory continues\n\nCurtiss-Wright delivered an average earnings surprise of 9.01% in the trailing four quarters. The consensus estimate for second-quarter earnings is pegged at $2.24 per share, while that for sales is pinned at $736.2 million.\n\nRecent Defense Releases\n\nTeledyne Technologies Inc. TDY reported second-quarter 2024 adjusted earnings of $4.58 per share, which surpassed the Zacks Consensus Estimate of $4.49 by 2%. However, the bottom line declined 1.9% from $4.67 recorded in the year-ago quarter.\n\nTotal sales were $1.37 billion, which missed the Zacks Consensus Estimate of $1.38 billion by 0.2%. The top line also declined 3.6% from $1.42 billion reported in the year-ago quarter.\n\nLockheed Martin Corporation LMT reported second-quarter 2024 adjusted earnings of $7.11 per share, which beat the Zacks Consensus Estimate of $6.45 by 10.2%. The bottom line also improved 5.6% from the year-ago quarter's recorded figure of $6.73.\n\nNet sales were $18.12 billion, which surpassed the Zacks Consensus Estimate of $17.10 billion by 6%. The top line also increased 8.6% from $16.69 billion reported in the year-ago quarter.\n\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTeledyne Technologies Incorporated (TDY) : Free Stock Analysis Report\n\nCurtiss-Wright Corporation (CW) : Free Stock Analysis Report\n\nVirgin Galactic Holdings, Inc. (SPCE) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/whats-store-virgin-galactic-spce-132300843.html",
        "symbols": [
            "0R3E.LSE",
            "CW.US",
            "CWT.F",
            "CWT.STU",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "TDY.US",
            "TYZ.F",
            "TYZ.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.023,
            "neu": 0.852,
            "pos": 0.125
        }
    },
    {
        "date": "2024-08-06T11:00:14+00:00",
        "title": "Lockheed Martin Insiders Sell US$13m Of Stock, Possibly Signalling Caution",
        "content": "Many Lockheed Martin Corporation (NYSE:LMT) insiders ditched their stock over the past year, which may be of interest to the company's shareholders. When analyzing insider transactions, it is usually more valuable to know whether insiders are buying versus knowing if they are selling, as the latter sends an ambiguous message. However, if numerous insiders are selling, shareholders should investigate more.\n\nWhile we would never suggest that investors should base their decisions solely on what the directors of a company have been doing, logic dictates you should pay some attention to whether insiders are buying or selling shares.\n\nView our latest analysis for Lockheed Martin\n\nThe Last 12 Months Of Insider Transactions At Lockheed Martin\n\nOver the last year, we can see that the biggest insider sale was by the Chief Operating Officer, Frank St. John, for US$2.8m worth of shares, at about US$428 per share. So it's clear an insider wanted to take some cash off the table, even below the current price of US$545. We generally consider it a negative if insiders have been selling, especially if they did so below the current price, because it implies that they considered a lower price to be reasonable. While insider selling is not a positive sign, we can't be sure if it does mean insiders think the shares are fully valued, so it's only a weak sign. It is worth noting that this sale was 100% of Frank St. John's holding.\n\nInsiders in Lockheed Martin didn't buy any shares in the last year. You can see the insider transactions (by companies and individuals) over the last year depicted in the chart below. By clicking on the graph below, you can see the precise details of each insider transaction! insider-trading-volume\n\nI will like Lockheed Martin better if I see some big insider buys. While we wait, check out this freelist of undervalued and small cap stocks with considerable, recent, insider buying.\n\nInsiders At Lockheed Martin Have Sold Stock Recently\n\nThe last quarter saw substantial insider selling of Lockheed Martin shares. Specifically, insiders ditched US$3.8m worth of shares in that time, and we didn't record any purchases whatsoever. Overall this makes us a bit cautious, but it's not the be all and end all.\n\nDoes Lockheed Martin Boast High Insider Ownership?\n\nLooking at the total insider shareholdings in a company can help to inform your view of whether they are well aligned with common shareholders. A high insider ownership often makes company leadership more mindful of shareholder interests. Lockheed Martin insiders own about US$73m worth of shares. That equates to 0.06% of the company. While this is a strong but not outstanding level of insider ownership, it's enough to indicate some alignment between management and smaller shareholders.\n\nStory continues\n\nSo What Does This Data Suggest About Lockheed Martin Insiders?\n\nInsiders sold stock recently, but they haven't been buying. Looking to the last twelve months, our data doesn't show any insider buying. On the plus side, Lockheed Martin makes money, and is growing profits. Insiders own shares, but we're still pretty cautious, given the history of sales. We'd practice some caution before buying! So while it's helpful to know what insiders are doing in terms of buying or selling, it's also helpful to know the risks that a particular company is facing. You'd be interested to know, that we found 2 warning signs for Lockheed Martin and we suggest you have a look.\n\nBut note: Lockheed Martin may not be the best stock to buy. So take a peek at this freelist of interesting companies with high ROE and low debt.\n\nFor the purposes of this article, insiders are those individuals who report their transactions to the relevant regulatory body. We currently account for open market transactions and private dispositions of direct interests only, but not derivative transactions or indirect interests.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-insiders-sell-us-110014475.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.992,
            "neg": 0.042,
            "neu": 0.862,
            "pos": 0.096
        }
    },
    {
        "date": "2024-08-06T10:00:00+00:00",
        "title": "7 Stocks That Will Win Big If Trump Wins ‘Bigly’",
        "content": "In just a few months Americans will elect the next president of the United States. As it stands today, Vice President Kamala Harris is polling slightly ahead of Former President Donald Trump with a slim 1% lead. That could change very quickly as past election cycles have shown. Furthermore, there is a 3.5% margin of error in that polling. Suffice it to say, Trump still has an excellent chance of being reelected and if he is, the stock market will change dramatically.\n\nIf Trump is reelected in November expect traditional industries to thrive. There will be a strong bias toward the traditional energy sector and away from greener alternatives. Likewise, the defense sector should thrive as well as Trump and the Republicans are likely to bolster the defense budget. Investors should also expect heightened mergers and acquisitions activity under Republicans.\n\nInvestors interested in understanding how the various S&P 500 sectors have performed under each Administration over the last several decades should refer to this chart.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nExxon Mobil (XOM) XOM Stock Is on the Way Back, but It Will Take Some Time\n\nSource: Jonathan Weiss / Shutterstock.com\n\nRegardless of who wins the presidency, Exxon Mobil (NYSE:XOM) is a strong choice among energy stocks.  I’ll start this explanation by noting that Exxon Mobil is simply a well-run company. Investors could choose any of a number of metrics to suggest that the company has and will continue to have strengths over its competitors. I always like to refer to the company’s ability to drive returns on its invested capital. To me that suggests that ExxonMobil should continue to create profits and reward shareholders.\n\nIt’s also no secret that Republican administrations favor energy stocks and that they tend to receive a lot of attention under Republicans. If Trump is successful in November expect a renewed focus on traditional energy and strong pressure on subsidies for renewable energy.\n\nTrump plans to increase domestic drilling and refill the strategic petroleum reserve if elected. That will directly benefit Exxon Mobil and several other energy firms.\n\nPalantir (PLTR) Palantir Technologies (PLTR) logo seen on billboard, known as Palantir is a public American company that specializes in big data analytics.\n\nSource: Poetra.RH / Shutterstock.com\n\nPalantir (NYSE:PLTR) is likely to be among the best tech stocks to pick up in a Trump administration. In fact, tech stocks should generally fare well under Trump, especially big tech. Republicans are big proponents of smaller government and thus less regulation. That should ease some of the pressure on big tech firms which face heavier scrutiny under Democratic administrations.\n\nPalantir is a unique tech firm that has grown impressively over the last few years. It quickly reached profitability and remains profitable today. It’s also a highly right leaning firm in many regards. Palantir derives a significant portion of its revenues from the government and big defense. Government revenues still account for the largest chunk of Palantir’s sales though the gap is quickly narrowing. Defense budgets should grow under a Trump administration, directly improving Palantir’s prospects in the process.\n\nStory continues\n\nFurthermore, Palantir is a strong investment overall. The company is quickly becoming an enterprise AI competitor worth noting. Commercial revenues are growing very quickly which is testament to the firm’s ability to satisfy private side demand with its AI-driven analytics platforms.\n\nNabors Industries (NBR) NBR stock\n\nSource: Novikov Aleksey / Shutterstock.com\n\nNabors Industries (NYSE:NBR) is a drilling company providing onshore and offshore services to energy companies. it is very well positioned should Trump win.\n\nTrump is on record saying that he will increase domestic oil production and refill the strategic petroleum reserve. He also plans to end President Joe Biden’s delays of federal drilling permits and leases on federal lands to boost oil and natural gas production.\n\nIn short, the entire drilling services sector is widely expected to thrive under Trump. Nabors Industries is falling at the moment but has massive upside potential. The firm anticipates a swift reversal in earnings between 2024 and 2025. That alone should be appealing to investors. Furthermore, should Trump win it is likely that those earnings in 2025 will be even stronger.\n\nThe company noted in its most recent earnings report that large operators in the Permian Basin have begun to adopt its rigs. Meanwhile, international operators including Kuwaiti Oil Company have also awarded Nabors Industries multiyear contracts.\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) C-130J Super Hercules of the United States Air Force performing at Aero India 2017.\n\nSource: Joe Ravi / Shutterstock.com\n\nLockheed Martin (NYSE:LMT) stock should fare well under Trump 2.0 according to recent information. The defense giant serves the  military that is expected to expand if Trump is successful in his second bid at office.\n\nChristopher Miller is the current Favorite to serve as the Secretary of Defense under Trump. Miller has called for an expansion of the Army, Navy, Air Force and Space Force and an increase in spending for nuclear weapons, missile defense and offensive weapons in space. It is expected that Miller’s plans would add hundreds of billions to the defense budget which brings us to Lockheed Martin.\n\nAs one of the largest Beltway defense contractors, Lockheed Martin is well positioned to thrive in such an environment. Expect those increases to be funneled into the largest defense firms which are listed here by market capitalization. Lockheed Martin is amongst the biggest and it should therefore be expected to receive a large influx of funding.\n\nCaterpillar (CAT) A Caterpillar backhoe at the top of a hill\n\nSource: aapsky / Shutterstock.com\n\nIndustrial stocks including Caterpillar (NYSE:CAT) performed well under the first Trump administration. During his first four years industrial stocks appreciated by 38%.\n\nTrump’s policies on infrastructure are somewhat paradoxical. Republicans and Democrats agree that the nation’s crumbling infrastructure must be addressed. However, Trump generally seeks to reduce taxes that provide the funding base for the majority of infrastructure improvements. Trump’s fund to stimulate infrastructure build out ultimately failed during his first administration per his admission. It’s safe to assume that should Trump be reelected he will be looking to improve on his infrastructure record.\n\nThe long and short of it is that Americans understand our infrastructure needs to be addressed. A new administration would renew hope that an infrastructure boom will materialize. that favors Caterpillar and other large industrial firms that would sell more equipment in such a situation. Investors should also note that Caterpillar continues to steadily increase its earnings which provides reason to invest in the stock in general.\n\nJPMorgan Chase (JPM) Chase Bank logo and storefront\n\nSource: Daryl L / Shutterstock.com\n\nJPMorgan Chase (NYSE:JPM) and other well-funded financial firms are well positioned to thrive under Trump. One of the primary reasons to believe so is that Trump will seek to knock down regulations that temper growth prospects for such firms and their respective stocks.\n\nJPMorgan Chase and other financial firms will benefit from a relaxation of M&A regulations. UBS Group (NYSE:UBS) notes that “the prospect of less stringent capital and liquidity rules and easing financial regulation” under Trump will serve as a potent catalyst for financial firms that have been hampered under Biden.\n\nCouple that with the potential for as many as three rate cuts at the tail end of 2024 and financial firms, especially large ones, will be set to thrive as Trump enters office in early 2025.\n\nJPMorgan Chase is the largest American bank and it’s very clear that the company could further consolidate its leading position under Trump.\n\nKroger (KR) Kroger (KR) Supermarket. The Kroger Co. is One of the World's Largest Grocery Retailers.\n\nSource: Eric Glenn / Shutterstock.com\n\nKroger (NYSE:KR) is another company to watch as it relates to the easing of business regulations. The stock has been negatively affected by The Federal Trade Commission which sued Kroger to stop its planned acquisition of Albertsons (NYSE:ACI) in February.\n\nUnions representing grocery workers are leading the charge against Kroger. They claim that the merger would harm workers, suppliers, shoppers and communities. If the acquisition is allowed to happen Kroger will effectively control 20% of the U.S. grocery market and employ one out of every six grocery laborers.\n\nRegardless, Trump is pro big business and anti-regulation. That drastically increases the odds that the merger would be allowed to take place. Frankly speaking, I question some of the logic offered by the unions and that of the Federal Trade commission. Walmart (NYSE:WMT) controlled 25% of the U.S. grocery market in 2022, higher than that which would occur under the proposed Kroger-Albertsons merger. Either do something to reduce Walmart’s monopoly or allow the proposed merger to go forward.\n\nOn the date of publication, Alex Sirois did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.comPublishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nAlex Sirois is a freelance contributor to InvestorPlace whose personal stock investing style is focused on long-term, buy-and-hold, wealth-building stock picks. Having worked in several industries from e-commerce to translation to education and utilizing his MBA from George Washington University, he brings a diverse set of skills through which he filters his writing.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post 7 Stocks That Will Win Big If Trump Wins ‘Bigly’ appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/7-stocks-win-big-trump-100000845.html",
        "symbols": [
            "0JS2.LSE",
            "0R3E.LSE",
            "ACI.US",
            "CAT.US",
            "JPM.US",
            "KOG.DU",
            "KOG.F",
            "KOG.MU",
            "KOG.STU",
            "KR.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.028,
            "neu": 0.799,
            "pos": 0.173
        }
    },
    {
        "date": "2024-08-06T00:00:00+00:00",
        "title": "7 Stocks That Will Win Big If Trump Wins &#039;Bigly&#039;",
        "content": "These stocks are positioned to rise should Trump be reelected this November for a second term in the Presidency",
        "link": "https://investorplace.com/2024/08/7-stocks-that-will-win-big-if-trump-wins-bigly/",
        "symbols": [
            "CAT.US",
            "JPM.US",
            "KR.US",
            "LMT.US",
            "PLTR.US",
            "XOM.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0,
            "neg": 0,
            "neu": 1,
            "pos": 0
        }
    }
]