[
    {
        "date": "2024-09-27T15:27:00+00:00",
        "title": "Lockheed's Unit Secures a Contract for Czech Republic's F-35 Integration",
        "content": "Lockheed Martin Corporation’s LMT Aeronautics business segment recently clinched a $422.2 million contract to provide key services for the integration of Czech Republic into the F-35 Joint Strike Fighter program. This contract entails Lockheed to offer program management, logistics, sustainment and systems engineering services support.\r\n \r\nThe work related to this deal will be carried out in various undisclosed locations outside and inside the continental United States. The deal is projected to be completed by September 2027. The contract has been offered by the Naval Air Systems Command, Patuxent River, MD.\n\nWhat’s Favoring LMT?\n\nWith countries worldwide enhancing their defense capabilities, spending on advanced military arms and ammunition has been rapidly increasing. This also includes fighter jets, which are crucial for air warfare missions. This trend has been benefiting Lockheed, a renowned manufacturer of combat aircraft, in the form of a steady flow of orders from the Pentagon and U.S. allies.\r\n\r\nNotably, Lockheed’s F-35 airplane is the most lethal fighter jet, which delivers fifth generation sustainment for mission readiness. Equipped with advanced sensors and communications suites, it boasts the ability to securely connect and share information across every domain, including air, land, sea, space and cyber.\r\n \r\nSuch remarkable features are likely to have been boosting the demand for this jet. The demand can be further gauged from the fact that Lockheed had delivered 992 F-35 airplanes as of June 30, 2024, since its inception. The latest contract win bears yet another testament to the solid demand that the F-35 jets enjoy in the combat jet market.\n\nGrowth Prospects for LMT\n\nRising military conflicts, terrorism and border disputes, along with rapid technological advancements in combat jets, have led nations to increase their defense spending on combat-proven jets, which constitute an integral part of their defense structure.\r\n \r\nThis is likely to have prompted Mordor Intelligence to forecast a compound annual growth rate of 3.7% for the global fighter aircraft market during the 2024-2029 time period.\r\n\r\nSuch solid market prospects offer growth opportunities for Lockheed Martin. Notably, its portfolio includes well-established combat jets like the F-16 Fighting Falcon, F-22 Raptor and F-21, in addition to the F-35 Lightning II.\n\nOpportunities for LMT’s Peers\n\nOther aerospace companies that are likely to benefit from the expanding global fighter aircraft market are discussed below.\r\n\r\nNorthrop Grumman Corporation NOC: It is a leading provider of manned and unmanned air systems. It builds some of the world’s most advanced aircraft like the E-2C Hawkeye 2000, A-10 Thunderbolt II, F-5 Tiger Fighter Jet and many more.\r\n\r\nNorthrop has a long-term (three to five years) earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales indicates year-over-year growth of 5.4%.\r\n\r\nEmbraer ERJ: The company offers a comprehensive portfolio of the most advanced aircraft in the combat market, which includes the A-29 Super Tucano light attack and advanced trainer and the C-390 Millennium military multi-mission aircraft.\r\n\r\nThe Zacks Consensus Estimate for ERJ’s 2024 sales indicates year-over-year growth of 19.1%. The consensus estimate for 2024 earnings per share indicates year-over-year growth of 262.8%.\r\n\r\nThe Boeing Company BA: Its Defense, Space & Security segment engages in the research, development, production and modification of manned and unmanned military aircraft. BA’s product portfolio includes a range of combat-proven aircraft like the F/A-18 Super Hornet, P-8, C-17 Globemaster III, EA-18G and a few more.\r\n \r\nBoeing has a long-term earnings growth rate of 21.3%. The Zacks Consensus Estimate for BA’s 2025 sales indicates year-over-year growth of 20%.\n\nStory continues\n\nLMT Stock’s Price Movement\n\nShares of LMT have gained 24.3% in the past three months compared with the industry’s 6.9% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLMT’s Zacks Rank\n\nLMT currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nEmbraer-Empresa Brasileira de Aeronautica (ERJ) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheeds-unit-secures-contract-czech-152700651.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.044,
            "neu": 0.766,
            "pos": 0.19
        }
    },
    {
        "date": "2024-09-27T12:58:00+00:00",
        "title": "RTX Ships Its AN/TPY-2 Radar to the Kingdom of Saudi Arabia",
        "content": "RTX Corporation’s RTX business segment, Raytheon, recently shipped the first AN/TPY-2 radar to the Kingdom of Saudi Arabia.  This is RTX’s first AN/TPY-2 radar equipped with a complete Gallium Nitride, or GaN technology, which delivers increased sensitivity, allowing for wider range and surveillance capability.\r\n\r\nThis technology also plays an important role in allowing the AN/TPY-2 radar to assist the hypersonic mission.\n\nRTX’s Expertise in Making Top-Grade Radars\n\nWith the rapid rise of geopolitical tensions in recent years, governments throughout the world have dramatically increased their military arsenals. As radars constitute a crucial component of this arsenal, rising defense spending has resulted in a rise in demand for combat-proven radars.\r\n\r\nThis must have been ushering in a solid order flow for radar manufacturing companies like RTX, whose extensive expertise in radar technology applies to a vast range of advanced radar systems for various applications, including air defense, missile defense, maritime surveillance and a few more. The latest contract win is a bright example of that.\r\n\r\nIn particular, RTX's AN/TPY-2 is a missile defense radar capable of detecting, tracking and distinguishing ballistic missiles. It operates in the X band of the electromagnetic spectrum, allowing it to see objects more clearly. The radar comes in two models — one for detecting rising ballistic missiles and another for guiding interceptors to a descending warhead.\n\nRTX Stock’s Growth Opportunities\n\nThe need for military radars has skyrocketed in recent years due to several factors, such as rising defense spending in developing countries, increased geopolitical tensions and inter-country conflicts that have heightened threats from missiles and aircraft. This must have prompted the Markets and Markets firm to project a CAGR of 5.4% for the military radar market in the 2024-2029 period. Such growth projections bode well for prominent radar manufacturers like RTX.\r\n\r\nRTX’s product portfolio consists of varied radars like SPY 6, APG-63(V)3, APG-79 and APG-82(V)1 and GhostEye MR and a few more that enjoy solid demand in the global military radar market.\n\nProspects for RTX’s Peers\n\nSome other defense contractors, which are also major radar producers, are projected to gain from the expanding global military radar industry. Those companies have been discussed below.\r\n\r\nLockheed Martin LMT: The company’s radars are the choice of more than 45 nations across six continents. Its product portfolio consists of varied radars like missile defense radars, ballistic missile radars as well as surveillance radars like TPY-4, the AN/APY-9 Radar, the AN/TPQ-53 Radar System, SPY-7, TPS-77 and Sentinel A4.\r\n\r\nLMT has a long-term (three to five years) earnings growth rate of 4.7%. The Zacks Consensus Estimate for the company’s 2024 sales indicates year-over-year growth of 5.3%.\r\n\r\nNorthrop Grumman NOC: The company has been at the forefront of Active Electronically Scanned Array (AESA) innovations for more than 60 years now and is a pioneer in AESA radars. Its diverse product portfolio also includes a handful of other radars like AN/ZPY-5 VADER, AN/TPS-80 G/ATOR, AN/TPS-78 and HAMMR.\r\n\r\nNorthrop has a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for the company’s 2024 sales indicates year-over-year growth of 5.4%.\r\n\r\nL3Harris Technologies LHX: The company is a renowned manufacturer of combat-proven radars. Its product portfolio includes SPS-48 land-based surveillance radar, AN/APY-11 Multimode radar, Tactical Air Surveillance radar, AN/SPS-48G Long range 3D surveillance radar and many more. \r\n\r\nL3Harris has a long-term earnings growth rate of 8.9%. The Zacks Consensus Estimate for LHX’s 2024 sales implies an improvement of 9.6% from the prior-year figure.\n\nStory continues\n\nRTX Stock’s Price Movement\n\nIn the past six months, shares of RTX have risen 23.4% against the industry’s decline of 0.9%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nRTX’s Zacks Rank\n\nRTX currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nL3Harris Technologies Inc (LHX) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-ships-tpy-2-radar-125800235.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.XETRA",
            "LHX.US",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.018,
            "neu": 0.827,
            "pos": 0.155
        }
    },
    {
        "date": "2024-09-27T12:58:00+00:00",
        "title": "General Dynamics Wins a $191M Deal for Iron Fist Protection System",
        "content": "General Dynamics Corp. GD recently won a contract worth nearly $191.2 million from the Defense Logistics Agency Aviation to provide its Iron Fist Protection System B-kits. The delivery order is expected to be finished by July 31, 2027.\n\nWhat Lies Ahead for GD Stock?\n\nActive Protection Systems (“APS”) are intended to protect the vehicle on which they are mounted against anti-tank weapons. In recent times, demand for APS has increased significantly, backed by rising military spending by nations worldwide amid widespread geopolitical tensions as well as the growing need for higher survivable and technologically advanced weapon systems against emerging combat threats.\r\n\r\nThe Mordor Intelligence firm projects the Active Protection Systems market to witness a CAGR of 6.1% during the 2024-2029 period. Such market growth expectations are likely to benefit General Dynamics, which has been a renowned provider of APS for armed forces globally.\r\n\r\nNotably, its Iron Fist Light is an active protection system that employs separate optical sensors, tracking radar, launchers and countermeasure weapons to neutralize threats at a safe distance from the protected combat vehicles. The system offers 360-degree protection for close-range circumstances in both open terrain and urban areas. Iron Fist Light's small size and light weight, versatility, excellent performance, ability to reduce residual penetration and ease of connection make it the ideal active protection option for any fighting vehicle.\r\n\r\nThese features must have been ushering in notable contracts, like the latest one, for GD. Considering the aforementioned market growth opportunities, such contracts are expected to continue to come in the near future, thereby bolstering the company's revenue generation prospects.\n\nOpportunities for GD’s Peers\n\nConsidering the solid growth opportunities of the APS market, other defense primes like Lockheed Martin LMT, RTX Corporation RTX and BAE Systems BAESY, with a strong presence in this space, should also benefit.\r\n\r\nLockheed Martin’s Modular Active Protection System (“MAPS”) is the backbone of the U.S. Army. The MAPS base kit provides automated, next-generation survivability to ground combat vehicles and operators. Its base kit combines sensors and countermeasures in an open, shared architecture to detect, track, classify, and defeat current and upcoming threats like rocket-propelled grenades and anti-tank guided missiles.\r\n\r\nLMT boasts a long-term (three to five years) earnings growth rate of 4.7%. The Zacks Consensus Estimate for 2024 sales indicates an improvement of 5.3% from the previous year's reported figure.\r\n\r\nRTX’s Quick Kill Active Protection System comprises a multi-mission fire-control radar that detects and tracks incoming threats, as well as hard-kill countermeasures that act as a hit avoidance system, allowing for multi-tracking and multi-engagement of enemy fire for vehicle and squad protection.\r\n\r\nRTX boasts a long-term earnings growth rate of 10.4%. The Zacks Consensus Estimate for its 2024 sales indicates an improvement of 7% from the previous year's reported figure.\r\n\r\nBAE Systems’ laser-based TERRA RAVEN countermeasure system destroys incoming threat signals to protect ground vehicles from missile attacks. It is part of a layered defense and response approach that can be readily implemented into current and next-generation combat vehicles.\r\n\r\nBAESY has a long-term earnings growth rate of 12.4%. The Zacks Consensus Estimate for BAESY’s 2024 sales implies growth of 37.4% from the prior-year figure.\n\nStory continues\n\nGD Stock’s Price Movement\n\nIn the past six months, shares of General Dynamics have risen 6.4% against the industry’s 0.9% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nGD’s Zacks Rank\n\nGeneral Dynamics currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nBae Systems PLC (BAESY) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/general-dynamics-wins-191m-deal-125800260.html",
        "symbols": [
            "0IUC.LSE",
            "0R3E.LSE",
            "BA.LSE",
            "BAESF.US",
            "BAESY.US",
            "BSP.BE",
            "BSP.DU",
            "BSP.F",
            "BSP.STU",
            "BSP.XETRA",
            "BSPA.F",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.084,
            "neu": 0.721,
            "pos": 0.195
        }
    },
    {
        "date": "2024-09-27T08:52:35+00:00",
        "title": "Defense Contractors Stocks Q2 In Review: BWX (NYSE:BWXT) Vs Peers",
        "content": "Defense Contractors Stocks Q2 In Review: BWX (NYSE:BWXT) Vs Peers\n\nLet’s dig into the relative performance of BWX (NYSE:BWXT) and its peers as we unravel the now-completed Q2 defense contractors earnings season.\n\nDefense contractors typically require technical expertise and government clearance. Companies in this sector can also enjoy long-term contracts with government bodies, leading to more predictable revenues. Combined, these factors create high barriers to entry and can lead to limited competition. Lately, geopolitical tensions–whether it be Russia’s invasion of Ukraine or China’s aggression towards Taiwan–highlight the need for defense spending. On the other hand, demand for these products can ebb and flow with defense budgets and even who is president, as different administrations can have vastly different ideas of how to allocate federal funds.\n\nThe 15 defense contractors stocks we track reported a very strong Q2. As a group, revenues beat analysts’ consensus estimates by 4.7% while next quarter’s revenue guidance was 6.7% below.\n\nBig picture, the Federal Reserve has a dual mandate of inflation and employment. The former had been running hot throughout 2021 and 2022 but cooled towards the central bank's 2% target as of late. This prompted the Fed to cut its policy rate by 50bps (half a percent) in September 2024. Given recent employment data that suggests the US economy could be wobbling, the markets will be assessing whether this rate and future cuts (the Fed signaled more to come in 2024 and 2025) are the right moves at the right time or whether they're too little, too late for a macro that has already cooled.\n\nThankfully, defense contractors stocks have been resilient with share prices up 9.8% on average since the latest earnings results.\n\nBWX (NYSE:BWXT)\n\nContributing components and materials to the famous Manhattan Project in the 1940s, BWX (NYSE:BWXT) is a manufacturer and service provider of nuclear components and fuel for government and commercial industries.\n\nBWX reported revenues of $681.5 million, up 11.3% year on year. This print exceeded analysts’ expectations by 6.6%. Overall, it was a very strong quarter for the company with an impressive beat of analysts’ Commercial Operations revenue andoperating margin estimates. BWX Total Revenue\n\nInterestingly, the stock is up 15.9% since reporting and currently trades at $107.19.\n\nIs now the time to buy BWX? Access our full analysis of the earnings results here, it’s free.\n\nBest Q2: Mercury Systems (NASDAQ:MRCY)\n\nFounded in 1981, Mercury Systems (NASDAQ:MRCY) specializes in providing processing subsystems and components for primarily defense applications.\n\nStory continues\n\nMercury Systems reported revenues of $248.6 million, down 1.8% year on year, outperforming analysts’ expectations by 7.8%. The business had an incredible quarter with an impressive beat of analysts’ organic revenue and earnings estimates. Mercury Systems Total Revenue\n\nThe market seems happy with the results as the stock is up 7.8% since reporting. It currently trades at $36.64.\n\nIs now the time to buy Mercury Systems? Access our full analysis of the earnings results here, it’s free.\n\nWeakest Q2: General Dynamics (NYSE:GD)\n\nCreator of the famous M1 Abrahms tank, General Dynamics (NYSE:GD) develops aerospace, marine systems, combat systems, and information technology products.\n\nGeneral Dynamics reported revenues of $11.98 billion, up 18% year on year, exceeding analysts’ expectations by 4.1%. Still, it was a slower quarter as it posted a miss of analysts’ backlog sales estimates.\n\nInterestingly, the stock is up 2.4% since the results and currently trades at $301.46.\n\nRead our full analysis of General Dynamics’s results here.\n\nLockheed Martin (NYSE:LMT)\n\nHeadquartered in Maryland, Famous for the F-35 aircraft, Lockheed Martin (NYSE:LMT) specializes in defense, space, homeland security, and information technology products.\n\nLockheed Martin reported revenues of $18.12 billion, up 8.6% year on year. This print surpassed analysts’ expectations by 6.5%. It was an exceptional quarter as it also produced an impressive beat of analysts’ organic revenue estimates and full-year revenue guidance exceeding analysts’ expectations.\n\nThe stock is up 21.6% since reporting and currently trades at $576.90.\n\nRead our full, actionable report on Lockheed Martin here, it’s free.\n\nICF (NASDAQ:ICFI)\n\nOriginally founded as Inner City Fund, ICF International (NASDAQ:ICFI) delivers consulting and technology services in health, environment, and infrastructure.\n\nICF reported revenues of $512 million, up 2.4% year on year. This number surpassed analysts’ expectations by 1.3%. Overall, it was a very strong quarter as it also produced an impressive beat of analysts’ operating margin estimates and a solid beat of analysts’ earnings estimates.\n\nThe stock is up 12.7% since reporting and currently trades at $164.\n\nRead our full, actionable report on ICF here, it’s free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/defense-contractors-stocks-q2-review-085235507.html",
        "symbols": [
            "0IUC.LSE",
            "4BW.BE",
            "4BW.F",
            "4BW.STU",
            "BWXT.US",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "ICFI.US",
            "LMT.US",
            "MCY.F",
            "MCY.MU",
            "MCY.STU",
            "MRCY.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.022,
            "neu": 0.831,
            "pos": 0.147
        }
    }
]