[
    {
        "date": "2024-07-13T14:00:16+00:00",
        "title": "Is Lockheed Martin Corporation (NYSE:LMT) Trading At A 28% Discount?",
        "content": "Key Insights\n\nUsing the 2 Stage Free Cash Flow to Equity, Lockheed Martin fair value estimate is US$646 Lockheed Martin is estimated to be 28% undervalued based on current share price of US$464 Our fair value estimate is 31% higher than Lockheed Martin's analyst price target of US$492\n\nIn this article we are going to estimate the intrinsic value of Lockheed Martin Corporation (NYSE:LMT) by taking the forecast future cash flows of the company and discounting them back to today's value. Our analysis will employ the Discounted Cash Flow (DCF) model. Before you think you won't be able to understand it, just read on! It's actually much less complex than you'd imagine.\n\nWe generally believe that a company's value is the present value of all of the cash it will generate in the future. However, a DCF is just one valuation metric among many, and it is not without flaws. Anyone interested in learning a bit more about intrinsic value should have a read of the Simply Wall St analysis model.\n\nCheck out our latest analysis for Lockheed Martin\n\nCrunching The Numbers\n\nWe use what is known as a 2-stage model, which simply means we have two different periods of growth rates for the company's cash flows. Generally the first stage is higher growth, and the second stage is a lower growth phase. In the first stage we need to estimate the cash flows to the business over the next ten years. Where possible we use analyst estimates, but when these aren't available we extrapolate the previous free cash flow (FCF) from the last estimate or reported value. We assume companies with shrinking free cash flow will slow their rate of shrinkage, and that companies with growing free cash flow will see their growth rate slow, over this period. We do this to reflect that growth tends to slow more in the early years than it does in later years.\n\nA DCF is all about the idea that a dollar in the future is less valuable than a dollar today, and so the sum of these future cash flows is then discounted to today's value:\n\n10-year free cash flow (FCF) forecast\n\n2025 2026 2027 2028 2029 2030 2031 2032 2033 2034 Levered FCF ($, Millions)  US$6.16b US$6.46b US$7.02b US$7.03b US$7.08b US$7.17b US$7.29b US$7.42b US$7.57b US$7.73b Growth Rate Estimate Source Analyst x9 Analyst x5 Analyst x2 Analyst x1 Est @ 0.81% Est @ 1.28% Est @ 1.61% Est @ 1.84% Est @ 2.00% Est @ 2.12% Present Value ($, Millions) Discounted @ 6.4%  US$5.8k US$5.7k US$5.8k US$5.5k US$5.2k US$4.9k US$4.7k US$4.5k US$4.3k US$4.1k\n\n(\"Est\" = FCF growth rate estimated by Simply Wall St)\r\nPresent Value of 10-year Cash Flow (PVCF) = US$51b\n\nStory continues\n\nWe now need to calculate the Terminal Value, which accounts for all the future cash flows after this ten year period. The Gordon Growth formula is used to calculate Terminal Value at a future annual growth rate equal to the 5-year average of the 10-year government bond yield of 2.4%. We discount the terminal cash flows to today's value at a cost of equity of 6.4%.\n\nTerminal Value (TV)= FCF2034 × (1 + g) ÷ (r – g) = US$7.7b× (1 + 2.4%) ÷ (6.4%– 2.4%) = US$195b\n\nPresent Value of Terminal Value (PVTV)= TV / (1 + r)10= US$195b÷ ( 1 + 6.4%)10= US$104b\n\nThe total value is the sum of cash flows for the next ten years plus the discounted terminal value, which results in the Total Equity Value, which in this case is US$155b. To get the intrinsic value per share, we divide this by the total number of shares outstanding. Compared to the current share price of US$464, the company appears a touch undervalued at a 28% discount to where the stock price trades currently. Valuations are imprecise instruments though, rather like a telescope - move a few degrees and end up in a different galaxy. Do keep this in mind. dcf\n\nImportant Assumptions\n\nWe would point out that the most important inputs to a discounted cash flow are the discount rate and of course the actual cash flows. You don't have to agree with these inputs, I recommend redoing the calculations yourself and playing with them. The DCF also does not consider the possible cyclicality of an industry, or a company's future capital requirements, so it does not give a full picture of a company's potential performance. Given that we are looking at Lockheed Martin as potential shareholders, the cost of equity is used as the discount rate, rather than the cost of capital (or weighted average cost of capital, WACC) which accounts for debt. In this calculation we've used 6.4%, which is based on a levered beta of 0.883. Beta is a measure of a stock's volatility, compared to the market as a whole. We get our beta from the industry average beta of globally comparable companies, with an imposed limit between 0.8 and 2.0, which is a reasonable range for a stable business.\n\nSWOT Analysis for Lockheed Martin\n\nStrength\n\nEarnings growth over the past year exceeded the industry.\n\nDebt is well covered by earnings and cashflows.\n\nDividends are covered by earnings and cash flows.\n\nWeakness\n\nDividend is low compared to the top 25% of dividend payers in the Aerospace & Defense market.\n\nOpportunity\n\nAnnual earnings are forecast to grow for the next 3 years.\n\nGood value based on P/E ratio and estimated fair value.\n\nThreat\n\nAnnual earnings are forecast to grow slower than the American market.\n\nLooking Ahead:\n\nAlthough the valuation of a company is important, it is only one of many factors that you need to assess for a company. DCF models are not the be-all and end-all of investment valuation. Preferably you'd apply different cases and assumptions and see how they would impact the company's valuation. For instance, if the terminal value growth rate is adjusted slightly, it can dramatically alter the overall result. What is the reason for the share price sitting below the intrinsic value? For Lockheed Martin, there are three essential elements you should consider:\n\nRisks: Be aware that  Lockheed Martin is showing  1 warning sign in our investment analysis, you should know about... Future Earnings: How does LMT's growth rate compare to its peers and the wider market? Dig deeper into the analyst consensus number for the upcoming years by interacting with our free analyst growth expectation chart. Other High Quality Alternatives: Do you like a good all-rounder? Explore our interactive list of high quality stocks to get an idea of what else is out there you may be missing!\n\nPS. Simply Wall St updates its DCF calculation for every American stock every day, so if you want to find the intrinsic value of any other stock just search here.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-corporation-nyse-lmt-140016406.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.026,
            "neu": 0.81,
            "pos": 0.164
        }
    }
]