[
    {
        "date": "2024-10-07T20:31:52+00:00",
        "title": "Market Chatter: Lockheed Martin, Pentagon Agree on Milestones to Unlock Withheld Payments for F-35 Upgrades",
        "content": "Market Chatter: Lockheed Martin, Pentagon Agree on Milestones to Unlock Withheld Payments for F-35 Upgrades",
        "link": "https://finance.yahoo.com/news/market-chatter-lockheed-martin-pentagon-203152491.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.361,
            "neg": 0,
            "neu": 0.848,
            "pos": 0.152
        }
    },
    {
        "date": "2024-10-07T16:39:12+00:00",
        "title": "Lockheed Martin Remains 'Prime' Defense Stock Amid Escalating Global Tensions, RBC Says",
        "content": "Lockheed Martin Remains 'Prime' Defense Stock Amid Escalating Global Tensions, RBC Says",
        "link": "https://finance.yahoo.com/news/lockheed-martin-remains-apos-prime-163912207.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.296,
            "neg": 0.19,
            "neu": 0.704,
            "pos": 0.106
        }
    },
    {
        "date": "2024-10-07T15:05:00+00:00",
        "title": "RTX Secures a $255M Contract to Support Standard Missile Program",
        "content": "RTX Corp. RTX recently secured a modification contract involving its Standard Missile. The award has been provided by the Naval Sea Systems Command, Washington, D.C.\n\nDetails of the Deal\n\nValued at $254.5 million, the contract is expected to be completed by September 2029. Per the terms of the deal, RTX will provide depot, intermediate level repair and maintenance for Standard Missile. It will also procure provisioned items and ordered spares, and test equipment for the Standard Missile.\n\nA major portion of work related to this deal will be carried out in Camden, AR.\n\nWhat’s Favoring RTX Stock?\n\nNations across the globe are increasingly enhancing their military strength through increased defense spending amid the growing global threat landscape. With missiles constituting a critical portion of a nation’s defense structure, countries aimed at strengthening their borders are investing significantly in missile and missile defense systems. With RTX being a prominent missile manufacturer with a robust global presence, it continues to enjoy a solid order flow for production and associated spare parts supply of its combat proven missiles.\n\nIn particular, RTX's Standard Missile (SM) series features two key variants — the SM-2 and SM-6. The SM-2 is widely recognized as the world’s leading surface-to-air defense system, protecting the U.S. Navy from anti-ship missiles and aircraft. Meanwhile, the SM-6 offers broader capabilities, performing anti-air, anti-surface and ballistic missile defense functions.\n\nTo date, RTX has supplied more than 12,000 SM-2 missiles to the United States and its allies, along with over 500 SM-6 missiles to the U.S. Navy. These figures highlight the strong market demand for these advanced systems. RTX’s latest contract win further reinforces this demand and is expected to contribute significantly to the company’s revenue growth in the coming quarters, thus solidifying its status as a critical player in the global defense sector.\n\nGrowth Prospects for RTX Stock\n\nThe global peace index reflects an unstable environment worldwide. The Russia-Ukraine war has been ongoing for more than two years now, in addition to the ongoing hostility in different parts of the Middle East. This has set the stage for the defense sector to witness rising demand for military products, particularly missiles, as nations worldwide strive to protect their borders from unprecedented attacks.\n\nTherefore, the growth prospect for the missile and missile defense systems market remains solid. To this end, the Mordor Intelligence firm projects the market to witness a CAGR of 5% over the 2024-2029 period.\r\nSuch a solid market growth projection stands to benefit RTX, which enjoys an extensive missile portfolio, including AIM-9X Sidewinder missile, TOW missiles and many more such weapons, apart from the Standard Missile. The company also provides advanced sensors and interceptors to identify, track and defeat threats as part of a layered missile defense.\n\nStory continues\n\nOpportunities for Peers\n\nOther defense contractors that are likely to benefit from the growth opportunities offered by the missile and missile defense market are as follows:\n\nNorthrop Grumman NOC: Northrop is a prominent developer of missile systems and counter systems, including strategic deterrents, as well as subsystems and components. Its product portfolio includes the Integrated Air and Missile Defense Battle Command System, the Guided Multiple Launch Rocket System propulsion and warhead subsystems, the Hypersonic Attack Cruise Missile, the Advanced Anti-Radiation Guided Missile and a few other combat-proven products that support missile defense systems.\n\nNOC boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for Northrop’s 2024 sales indicates an improvement of 5.4% from the 2023 reported figure.\n\nLockheed Martin LMT: Lockheed’s Missiles and Fire Control business unit develops, manufactures and supports advanced combat missiles and rockets for military customers, including the U.S. Army, Navy, Air Force, Marine Corps, NASA and dozens of foreign allies. Some of its prominent products are the PAC-3 missile and the Terminal High Altitude Area Defense missile.\n\nLMT boasts a long-term earnings growth rate of 4.7%. The Zacks Consensus Estimate for Lockheed’s 2024 sales indicates an improvement of 5.3% from the 2023 reported figure.\n\nThe Boeing Company BA: Air and missile defense systems built by this jet giant have been protecting the United States and its international partners against threats ranging from intercontinental ballistic missiles to hostile aircraft for nearly 25 years. Boeing’s product portfolio includes the supersonic Bomarc missile, the Thor missile, the AGM-86B/C Air-Launched Cruise Missile and the GAM-77 Hound Dog Missile.\n\nBA boasts a long-term earnings growth rate of 21.3%. The Zacks Consensus Estimate for BA’s third-quarter 2024 sales indicates growth of 10% from the year-ago quarter’s reported figure.\n\nPrice Movement\n\nIn the past year, shares of RTX have risen 71.1% compared with the industry’s growth of 12.1%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nRTX currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-secures-255m-contract-support-150500113.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.052,
            "neu": 0.772,
            "pos": 0.177
        }
    },
    {
        "date": "2024-10-07T14:55:00+00:00",
        "title": "CAE Signs a $1.7B Deal With SkyAlyne to Aid Canada's FAcT Program",
        "content": "CAE Inc. CAE recently declared that it has inked a 25-year subcontract with SkyAlyne, a joint venture between CAE and KF Aerospace, to provide cutting-edge, modern pilot training to the Royal Canadian Air Force (“RCAF”). The subcontract is estimated to be worth nearly $1.7 billion.\n\nA Brief Note on CAE’s New Deal\n\nPer the terms of the deal, CAE will initially construct and supply a variety of simulators and training devices to be installed at Moose Jaw, Saskatchewan, and Southport, Manitoba, for the different aircraft fleets being bought for the RCAF under the FAcT program. These training gadgets are likely to be available during the next five years.\r\n\r\nThroughout the contract, CAE will provide intensive aircrew training, which will include ground school, simulation and real flight. By doing this, CAE will continue its long-standing operation of the NATO Flying Training in Canada program at 15 Wing Moose Jaw.\n\nCAE’s Growth Prospects\n\nMilitary flight simulators are positioned for considerable expansion, driven by increasing geopolitical tensions worldwide, increased expenditures on combat jets and the demand for cost-effective training options. Per a report by the Mordor Intelligence firm, the global market for Military Aircraft Simulation & Training is projected to witness a CAGR of 2% between 2024 and 2031. Such growth opportunities offered by the aforementioned market should bode well for CAE in the coming years.\r\n\r\nFor almost 40 years, CAE's Aircare FACTS Training has been a pioneer in human factor-based emergency procedure training for pilots, flight engineers, flight attendants and other cabin crew, as well as executive frequent flyers. The company's Aircare FACTS training provides a variety of research-based curricula tailored to the demands of corporate, public aviation and military aircraft. The FACTS training is acknowledged as the industry standard for emergency training worldwide.\r\n\r\nCAE also provides the most innovative full-flight simulators (FFS), including the latest CAE 7000XR Series Level D FFS, which improves training efficiency, offers advanced capabilities and increases operational efficiency.\r\n\r\nSuch capabilities of CAE must have enabled the company to win steady orders that support Military Aircraft Simulation & Training, like the latest one.\n\nOpportunities for Other Aerospace Companies\n\nAerospace companies that are likely to reap the benefits of the growing Military Aircraft Simulation & Training market are as follows:  \r\n\r\nLockheed Martin LMT: The company’s F-35 Full Mission Simulators are high-fidelity systems that replicate the F-35’s advanced avionics, stealth capabilities and combat systems. It also provides Mission Rehearsal Training solutions and offers high-end training with reduced hardware requirements to train pilots with 5th Generation Tactics, Techniques and Procedures.\r\n\r\nLockheed’s long-term (three to five years) earnings growth rate is 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales implies an improvement of 5.3% from the prior-year figure.\r\n\r\nBAE Systems BAESY: Its Hawk advanced jet trainer, equipped with advanced airborne simulation technology and new generation cockpit environment, provides a smoother and more cost-effective transition to the front line. This allows for student pilot and Weapons System Officer output at the most appropriate skill levels in readiness for front-line operations.\r\n\r\nBAE Systems has a long-term earnings growth rate of 12.4%. The Zacks Consensus Estimate for BAESY’s 2024 sales suggests growth of 37.4% from the prior-year reported figure.\r\n\r\nRTX Corporation RTX: Its Joint Secure Air Combat Training System provides the first certified, four-level Multiple Independent Levels of Security test and training equipment in both airborne and ground equipment, allowing for tethered and autonomous operations.\r\n\r\nRTX has a long-term earnings growth rate of 10.4%. The Zacks Consensus Estimate for RTX’s 2024 sales implies growth of 7% from the prior-year reported figure.\n\nStory continues\n\nCAE Stock Price Movement\n\nIn the past month, shares of CAE have risen 3.2% compared with the industry’s growth of 5.4%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nCAE’s Zacks Rank\n\nCAE currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nBae Systems PLC (BAESY) : Free Stock Analysis Report\n\nCAE Inc (CAE) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/cae-signs-1-7b-deal-145500279.html",
        "symbols": [
            "0R3E.LSE",
            "BA.LSE",
            "BAESF.US",
            "BAESY.US",
            "BSP.BE",
            "BSP.DU",
            "BSP.F",
            "BSP.STU",
            "BSP.XETRA",
            "BSPA.F",
            "CAE.TO",
            "CAE.US",
            "CE9.BE",
            "CE9.F",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.033,
            "neu": 0.833,
            "pos": 0.134
        }
    },
    {
        "date": "2024-10-07T14:19:00+00:00",
        "title": "Here's Why You Should Add Lockheed Martin Stock to Your Portfolio Now",
        "content": "Lockheed Martin Corporation LMT with its strong backlog, rising earnings and sales estimates, robust ROE and high solvency, offers a great investment opportunity in the Zacks Aerospace sector.\r\n\r\nThe company currently carries a Zacks Rank #2 (Buy). Let’s look at the factors that are driving the stock.\n\nLMT’s Growth Projections & Surprise History\n\nThe Zacks Consensus Estimate for LMT’s 2025 earnings per share (EPS) is pinned at $28.87, which indicates year-over-year growth of 8.9%.\r\n\r\nThe consensus estimate for 2024 sales is pinned at $71.14 billion, which indicates year-over-year growth of 5.3%.\r\n\r\nThe company’s long-term (three to five years) earnings growth rate is 4.7%.\r\n\r\nLMT has a positive earnings surprise history. Its trailing four-quarter earnings surprise is 7.46%, on average.\n\nLMT’s Dividend Yield and Share Repurchases\n\nLockheed Martin has been rewarding its shareholders with dividend payments at regular intervals. Its current dividend yield is 2.08%, better than the industry’s yield of 1.54%.\r\n\r\nDuring the first six months of 2024, LMT repurchased 4.2 million shares worth $1.9 billion. As of June 30, 2024, the total remaining authorization for common share repurchases under the company’s share repurchase program was $8.2 billion.\n\nLMT’s Return on Equity\n\nLMT’s current return on equity (ROE) is 95.03%, which is more than the industry average of 11.55%. ROE, a profitable measure, reflects how effectively a company is utilizing its shareholders’ funds in its operations to generate income.\n\nLMT’s Solvency\n\nThe time-to-interest earned ratio at the end of the second quarter was 8.83. The ratio, being greater than one, reflects the company’s ability to meet future interest obligations without difficulties.\n\nLMT’s Liquidity\n\nLMT’s current ratio is 1.24, better than the industry average of 1.10. The current ratio, being greater than one, indicates the company has enough short-term assets to meet its short-term obligations.\n\nLMT’s Rising Backlog\n\nLockheed Martin’s total backlog was a solid $158.34 billion as of June 30, 2024. Such a consistent level of contract flows and subsequent backlog growth bolster its long-term revenue prospects. The company expects to recognize approximately 36% of its backlog over the next 12 months and approximately 60% over the next 24 months.\n\nLMT Stock Price Performance\n\nShares of LMT have gained 31.8% in the past three months compared with the industry’s 9.9% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nOther Stocks to Consider\n\nSome other top-ranked stocks in the industry are Air Industries Group AIRI, Leidos Holdings, Inc. LDOS and RTX Corporation RTX. AIRI sports a Zacks Rank #1 (Strong Buy), while LDOS and RTX currently carry a Zacks Rank of 2. You can see the complete list of Zacks Rank of 1 stocks here.\r\n\r\nAIRI delivered an average earnings surprise of 8.88% in the last four quarters. The Zacks Consensus Estimate for AIRI’s 2024 sales indicates year-over-year growth of 7.1%.\r\n\r\nLDOS delivered an average earnings surprise of 23.49% in the last four quarters. The consensus estimate for LDOS’s 2024 sales indicates year-over-year growth of 5.4%.\r\n\r\nRTX delivered an average earnings surprise of 6.62% in the last four quarters. The Zacks Consensus Estimate for RTX’s 2024 sales indicates year-over-year growth of 7%.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nLeidos Holdings, Inc. (LDOS) : Free Stock Analysis Report\n\nAir Industries Group (AIRI) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/heres-why-add-lockheed-martin-141900758.html",
        "symbols": [
            "0R3E.LSE",
            "LDOS.US",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "S6IA.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0,
            "neu": 0.813,
            "pos": 0.187
        }
    },
    {
        "date": "2024-10-07T13:30:10+00:00",
        "title": "Is Lockheed (LMT) a Buy as Wall Street Analysts Look Optimistic?",
        "content": "The recommendations of Wall Street analysts are often relied on by investors when deciding whether to buy, sell, or hold a stock. Media reports about these brokerage-firm-employed (or sell-side) analysts changing their ratings often affect a stock's price. Do they really matter, though?\n\nBefore we discuss the reliability of brokerage recommendations and how to use them to your advantage, let's see what these Wall Street heavyweights think about Lockheed Martin (LMT).\n\nLockheed currently has an average brokerage recommendation (ABR) of 2.00, on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell, etc.) made by 21 brokerage firms. An ABR of 2.00 indicates Buy.\n\nOf the 21 recommendations that derive the current ABR, 11 are Strong Buy and one is Buy. Strong Buy and Buy respectively account for 52.4% and 4.8% of all recommendations.\n\nBrokerage Recommendation Trends for LMT Broker Rating Breakdown Chart for LMT\n\nCheck price target & stock forecast for Lockheed here>>>\r\n\r\nThe ABR suggests buying Lockheed, but making an investment decision solely on the basis of this information might not be a good idea. According to several studies, brokerage recommendations have little to no success guiding investors to choose stocks with the most potential for price appreciation.\n\nDo you wonder why? As a result of the vested interest of brokerage firms in a stock they cover, their analysts tend to rate it with a strong positive bias. According to our research, brokerage firms assign five \"Strong Buy\" recommendations for every \"Strong Sell\" recommendation.\n\nIn other words, their interests aren't always aligned with retail investors, rarely indicating where the price of a stock could actually be heading. Therefore, the best use of this information could be validating your own research or an indicator that has proven to be highly successful in predicting a stock's price movement.\n\nZacks Rank, our proprietary stock rating tool with an impressive externally audited track record, categorizes stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), and is an effective indicator of a stock's price performance in the near future. Therefore, using the ABR to validate the Zacks Rank could be an efficient way of making a profitable investment decision.\n\nABR Should Not Be Confused With Zacks Rank\n\nIn spite of the fact that Zacks Rank and ABR both appear on a scale from 1 to 5, they are two completely different measures.\n\nBroker recommendations are the sole basis for calculating the ABR, which is typically displayed in decimals (such as 1.28). The Zacks Rank, on the other hand, is a quantitative model designed to harness the power of earnings estimate revisions. It is displayed in whole numbers -- 1 to 5.\n\nStory continues\n\nIt has been and continues to be the case that analysts employed by brokerage firms are overly optimistic with their recommendations. Because of their employers' vested interests, these analysts issue more favorable ratings than their research would support, misguiding investors far more often than helping them.\n\nOn the other hand, earnings estimate revisions are at the core of the Zacks Rank. And empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nFurthermore, the different grades of the Zacks Rank are applied proportionately across all stocks for which brokerage analysts provide earnings estimates for the current year. In other words, at all times, this tool maintains a balance among the five ranks it assigns.\n\nAnother key difference between the ABR and Zacks Rank is freshness. The ABR is not necessarily up-to-date when you look at it. But, since brokerage analysts keep revising their earnings estimates to account for a company's changing business trends, and their actions get reflected in the Zacks Rank quickly enough, it is always timely in indicating future price movements.\n\nIs LMT a Good Investment?\n\nLooking at the earnings estimate revisions for Lockheed, the Zacks Consensus Estimate for the current year has increased 0.1% over the past month to $26.51.\n\nAnalysts' growing optimism over the company's earnings prospects, as indicated by strong agreement among them in revising EPS estimates higher, could be a legitimate reason for the stock to soar in the near term.\n\nThe size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #2 (Buy) for Lockheed. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\n\nTherefore, the Buy-equivalent ABR for Lockheed may serve as a useful guide for investors.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-buy-wall-street-133010537.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.012,
            "neu": 0.816,
            "pos": 0.172
        }
    },
    {
        "date": "2024-10-07T10:55:00+00:00",
        "title": "Boeing Secures Navy Contract to Upgrade the EA-18G Growler Jet",
        "content": "The Boeing Company BA has been awarded a $95.8 million contract to provide testing and installation support for the Block II Phase One upgrade for the EA-18G Growler jet, called the Next Generation Electronic Attack Unit, for the U.S. Navy. It includes both developmental and operational testing as well as the production of aircraft systems like avionics and airframe materials.\n\nDetails of the Deal\n\nAs part of the agreement, Boeing will also produce and deliver 25 NGEAU A-Kits, 25 Gunbay Pallet A-Kits, 15 NGEAU B-Kits, and nine spare B-Kits. The work will be carried out at Boeing’s facility in St. Louis, MO, Minneapolis, MN; Bethpage, NY; and Linthicum, MD.\r\n \r\nThe award has been provided by the Naval Air Systems Command, Patuxent River, MD. The deal is expected to be completed by April 2028.\n\nWhat’s Favoring BA?\n\nWith countries worldwide enhancing their defense capabilities, spending on advanced military arms and ammunition has been rapidly increasing. This also includes fighter jets, which are crucial for air warfare missions. This trend has been benefiting Boeing, a renowned manufacturer of combat aircraft, in the form of a steady flow of orders from the Pentagon and U.S. allies.\r\n\r\nBoeing’s EA-18G Growler is one of the most advanced electronic attack aircraft, delivering next-generation capabilities for mission readiness.  Equipped with cutting-edge jamming systems and advanced sensors, it excels at disrupting enemy radar and communications. The Growler is also capable of securely connecting and sharing information across various domains, including air, land, sea, space and cyber, making it a critical asset in modern warfare.\r\n\r\nSuch notable features of the EA-18G Growler are likely to have been boosting its demand, which is further evident from the latest contract win.\n\nGrowth Prospects for BA\n\nRising military conflicts, terrorism and border disputes, along with rapid technological advancements in combat jets, have led nations to increase their defense spending on combat-proven jets, which constitute an integral part of their defense structure.\r\n \r\nThis is likely to have prompted Mordor Intelligence to forecast a compound annual growth rate of 3.7% for the global fighter aircraft market during the 2024-2029 time period.\r\n\r\nSuch solid market prospects offer growth opportunities for Boeing. Notably, its portfolio includes well-established combat jets like the F/A- Super Hornet, F-15EX and T-7A Red Hawk, in addition to the EA-18G Growler.\n\nOpportunities for BA’s Peers\n\nOther aerospace companies that are likely to benefit from the expanding global fighter aircraft market are discussed below.\r\n\r\nNorthrop Grumman Corporation NOC: It is a leading provider of manned and unmanned air systems. It builds some of the world’s most advanced aircraft like the E-2C Hawkeye 2000, A-10 Thunderbolt II, F-5 Tiger Fighter Jet and many more.\r\n\r\nNorthrop has a long-term (three to five years) earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales indicates year-over-year growth of 5.4%.\r\n\r\nEmbraer ERJ: The company offers a comprehensive portfolio of the most advanced aircraft in the combat market, which includes the A-29 Super Tucano light attack and advanced trainer and the C-390 Millennium military multi-mission aircraft.\r\n\r\nThe Zacks Consensus Estimate for ERJ’s 2024 sales indicates year-over-year growth of 19.1%. The consensus estimate for 2024 earnings per share indicates year-over-year growth of 262.8%.\r\n\r\nLockheed Martin Corporation LMT is the manufacturer of some of the most advanced military jets in the world. Its key jet programs include the F-35 Lightning II, F-22 Raptor, F-16 Fighting Falcon and C-130 Hercules.\r\n\r\nLockheed Martin has a long-term earnings growth rate of 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales indicates year-over-year growth of 5.3%.\n\nStory continues\n\nBA Stock’s Price Movement\n\nShares of BA have lost 16.6% in the past three months against the industry’s 9.8% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nBA’s Zacks Rank\n\nBA currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nEmbraer-Empresa Brasileira de Aeronautica (ERJ) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/boeing-secures-navy-contract-upgrade-105500595.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.058,
            "neu": 0.76,
            "pos": 0.182
        }
    }
]