[
    {
        "date": "2024-09-09T21:50:09+00:00",
        "title": "Lockheed Martin (LMT) Outpaces Stock Market Gains: What You Should Know",
        "content": "In the latest trading session, Lockheed Martin (LMT) closed at $576.57, marking a +1.75% move from the previous day. The stock's change was more than the S&P 500's daily gain of 1.16%. Elsewhere, the Dow gained 1.2%, while the tech-heavy Nasdaq added 1.16%.\n\nPrior to today's trading, shares of the aerospace and defense company had gained 2.73% over the past month. This has lagged the Aerospace sector's gain of 4.06% and the S&P 500's gain of 3.48% in that time.\n\nThe upcoming earnings release of Lockheed Martin will be of great interest to investors. The company is expected to report EPS of $6.40, down 5.47% from the prior-year quarter. In the meantime, our current consensus estimate forecasts the revenue to be $17.45 billion, indicating a 3.37% growth compared to the corresponding quarter of the prior year.\n\nRegarding the entire year, the Zacks Consensus Estimates forecast earnings of $26.49 per share and revenue of $71.14 billion, indicating changes of -4.78% and +5.28%, respectively, compared to the previous year.\n\nInvestors should also note any recent changes to analyst estimates for Lockheed Martin. These recent revisions tend to reflect the evolving nature of short-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.\n\nEmpirical research indicates that these revisions in estimates have a direct correlation with impending stock price performance. To exploit this, we've formed the Zacks Rank, a quantitative model that includes these estimate changes and presents a viable rating system.\n\nThe Zacks Rank system, ranging from #1 (Strong Buy) to #5 (Strong Sell), possesses a remarkable history of outdoing, externally audited, with #1 stocks returning an average annual gain of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 0.24% lower. Lockheed Martin currently has a Zacks Rank of #3 (Hold).\n\nLooking at its valuation, Lockheed Martin is holding a Forward P/E ratio of 21.39. This denotes a premium relative to the industry's average Forward P/E of 20.49.\n\nAlso, we should mention that LMT has a PEG ratio of 4.58. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. The Aerospace - Defense industry currently had an average PEG ratio of 1.82 as of yesterday's close.\n\nThe Aerospace - Defense industry is part of the Aerospace sector. With its current Zacks Industry Rank of 45, this industry ranks in the top 18% of all industries, numbering over 250.\n\nStory continues\n\nThe strength of our individual industry groups is measured by the Zacks Industry Rank, which is calculated based on the average Zacks Rank of the individual stocks within these groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nBe sure to use Zacks.com to monitor all these stock-influencing metrics, and more, throughout the forthcoming trading sessions.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-outpaces-stock-215009550.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.008,
            "neu": 0.877,
            "pos": 0.115
        }
    },
    {
        "date": "2024-09-09T14:07:00+00:00",
        "title": "RTX Secures $405 Million Contract for F135 Propulsion System",
        "content": "RTX Corporation’s RTX business division, Pratt and Whitney Military Engines, recently secured a modification contract valued at $405.3 million. The latest modification will enable RTX to procure spares to produce and deliver the F135 propulsion system for the F-35 fighter jet.\r\n \r\nThe contract will serve the U.S. Air Force, Marine Corps, Navy, non-Department of Defense participants, F-35 Cooperative Program Partners and foreign military sales customers.  The majority of work related to this award will be carried out in East Hartford, CT.\n\nFighter Jet Demand Favoring RTX\n\nWith rising global tensions, more nations are investing in technologically advanced combat jets that can perform well in difficult situations to boost their aerial security. This, in turn, has been bolstering the demand for advanced fighter jet engines like the F135.\r\n \r\nWith the F-35 fighter jet constituting a major portion of the U.S. combat jet market, RTX has been constantly upgrading its F135 jet engines. As a recent development in this space, the company’s Pratt and Whitney business segment built the F135 Engine Core Upgrade, which is the only engine that offers all global F-35 operators the additional power and thermal management capacity needed to enable next-generation weapons systems and sensors.\r\n \r\nWith nations across the globe striving to strengthen their aerial border, growth prospects for the fighter jet market remain bright. To this end, Mordor Intelligence predicts that the global fighter aircraft market will witness a CAGR of 3.7% during the 2024-2029 period.\r\n \r\nThis market growth opportunity should boost the demand for combat jet engines. With more than 7,000 Pratt and Whitney military engines currently in service with 34 armed forces worldwide, RTX is well positioned to secure more contracts involving its jet engines, like the latest one, in the future.\n\nProspects of RTX’s Peers\n\nOther defense companies that are likely to enjoy the perks of the expanding fighter jet market have been discussed below.\r\n\r\nNorthrop Grumman NOC is a leading provider of proven manned and unmanned air systems. It builds some of the world’s most advanced aircraft, like the B-2 Spirit Stealth Bomber, A-10 Thunderbolt II and B-21 Raider.\r\n \r\nNorthrop Gruman has a long-term (three to five years) earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales indicates year-over-year growth of 5.4%.\r\n\r\nLockheed Martin Corporation LMT is the manufacturer of some of the most advanced military jets in the world. Its key jet programs include the F-35 Lightning II, F-22 Raptor, F-16 Fighting Falcon and C-130 Hercules.\r\n\r\nLockheed Martin has a long-term earnings growth rate of 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales indicates year-over-year growth of 5.3%.\r\n \r\nThe Boeing Company BA is a significant player in the fighter jet market with its F/A-18 Super Hornet and F-15 Eagle programs. These jets are essential in the U.S. Navy and Air Force fleets and are exported to allied nations.\r\n\r\nBoeing has a long-term earnings growth rate of 21.3%. The Zacks Consensus Estimate for BA’s third-quarter 2024 sales indicates year-over-year growth of 10.8%.\n\nStory continues\n\nRTX Stock’s Price Movement\n\nShares of RTX have gained 11.2% in the past three months compared with the industry’s 2.4% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nRTX’s Zacks Rank\n\nRTX currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-secures-405-million-contract-140700001.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.034,
            "neu": 0.783,
            "pos": 0.183
        }
    },
    {
        "date": "2024-09-09T12:30:00+00:00",
        "title": "2 Top Defense Tech Stocks to Buy in September",
        "content": "Investors looking to add some firepower to their portfolios should pay attention to the aerospace and defense industry. Beyond the several geopolitical conflicts adding a tailwind of demand, a bigger industry development may be the ongoing shift toward more high-tech solutions. Companies capitalizing on this \"defense tech\" theme are well-positioned to deliver positive returns.\n\nHere are two outperforming stocks that could be great buys this month. Image source: Getty Images.\n\n1. Lockheed Martin\n\nLockheed Martin(NYSE: LMT) is recognized as one of the world's largest defense manufacturers with a portfolio of high-profile fighter jet aircraft, helicopters, and missile systems. The company has expanded into space with satellite communications, alongside a growing number of cybersecurity solutions.\n\nThe stock has been a big winner this year, rallying more than 25% to a record high amid a string of better-than-expected earnings. In the second quarter, Lockheed delivered a solid 9% increase in revenue while segment operating profit climbed by 10% from the prior-year quarter.\n\nLockheed is citing robust performance across all segments. Notably, products like Guided Multiple Launch Rocket Systems (GMLRS), Javelin anti-tank missiles, lasers, and radars are being used extensively in active Eastern European battlefields with a growing order backlog.\n\nA key development has been the restart in deliveries of the F-35 fighter jet program to the U.S. government following nearly a year of being suspended pending a required technology upgrade. Lockheed is producing upward of 156 F-35 aircraft per year and expects to deliver between 75 and 100 by year-end.\n\nThe latest trends have been strong enough for management to hike 2024 guidance, reaffirming the success of the company's 21st Century Security initiative. The strategy to integrate more advanced technologies across the product portfolio appears to be paying off.\n\nThe effort is opening up new growth channels and is expected to generate higher profitability. Innovations include artificial intelligence (AI) playing an increasing role in areas like missiles and fire control, and the rotary and mission systems unit. Overall, there's a lot to like about Lockheed Martin. High-quality fundamentals, earnings growth, and a 2.5% dividend yield make me bullish on the stock.\n\n2. General Dynamics\n\nGeneral Dynamics(NYSE: GD) is another defense industry leader but stands out with a broad product portfolio. The company has a significant reach in military programs including land vehicles, weapons, and the C-130 Hercules transport aircraft. It is also involved in marine systems with Navy ships and submarines. The Gulfstream Aerospace subsidiary has been very lucrative with business jets in high demand.\n\nThis diversification has proven to be a winning combination. General Dynamics stock is up 33% over the year, reflecting accelerating growth and sharply higher profitability in recent quarters. Trends in the second quarter were particularly impressive, with revenue up 18% year over year driving a 21% increase in earnings per share (EPS).\n\nIn the aerospace segment, the launch of the G700 aircraft with ramped-up deliveries is a large part of the growth story, but the strength is across the board. The combat systems segment posted revenue growth of 18% with earnings jumping by 25% from the prior year quarter as management noted the highest level of orders since 2014.\n\nThe company has booked multiple large-scale contract awards in all segments, suggesting a robust operating environment with management revising full-year guidance higher.\n\nMaybe the most interesting aspect of the company is its technology segment, which includes cybersecurity solutions such as National Security Agency (NSA) certified encrypted communications systems. In this case, General Dynamics has quickly emerged as a leader in this field, leveraging its specialized defense software expertise into data analytics for commercial applications. In my opinion, the many moving parts in General Dynamic's long-term outlook make the stock a good long-term bet.\n\nThe big picture for investors\n\nGeneral Dynamics and Lockheed Martin are both capitalizing on this theme of defense tech with an industry transformation underway. Coincidentally, the two stocks are both trading at a forward price-to-earnings ratio (P/E) of 20. I believe that this level of valuation premium is justified based on the operating and financial momentum. The ability of both companies to execute on a significant market opportunity should continue to reward shareholders.\n\nShould you invest $1,000 in General Dynamics right now?\n\nBefore you buy stock in General Dynamics, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and General Dynamics wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $630,099!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of September 3, 2024\n\nDan Victor has no position in any of the stocks mentioned. The Motley Fool recommends Lockheed Martin. The Motley Fool has a disclosure policy.\n\n2 Top Defense Tech Stocks to Buy in September was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/2-top-defense-tech-stocks-123000540.html",
        "symbols": [
            "GD.US",
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.041,
            "neu": 0.79,
            "pos": 0.169
        }
    },
    {
        "date": "2024-09-09T11:42:00+00:00",
        "title": "Lockheed Secures a Contract to Support CH-53K Helicopter Program",
        "content": "Lockheed Martin Corp.’s LMT business unit, Sikorsky Aircraft, recently secured a contract to support its CH-53K helicopter program.\n\nThe award has been provided by the Naval Supply Systems Command Weapon Systems Support, Philadelphia, PA.\n\nDetails of the Deal\n\nValued at $20.1 million, the contract is projected to be completed by September 2027. Per the terms of the deal, Lockheed will procure spare parts like 20 valve selectors, 31 lower swivels, 25 aircraft mechanical actuators, 12 mechanical actuators and a few more for the CH-53K helicopters.\n\nWork related to this contract will be carried out in Stratford, CT.\n\nWhat’s Favoring LMT Stock?\n\nAs countries worldwide enhance their defense capabilities, spending on advanced military arms and ammunition is rapidly increasing. This includes growing investments in military helicopters, which are crucial for air warfare missions. Lockheed, as a prominent manufacturer of combat helicopters, thus wins a steady flow of orders from the Pentagon and other U.S. allies. The latest contract win is a bright example of that.\n\nNotably, LMT’s CH-53K King Stallion builds on Sikorsky’s legacy, following the success of earlier models such as the CH-53A, CH-53D/G and CH-53E. Designed for modern combat and shipboard operations, the CH-53K is intelligent, reliable, low-maintenance and highly survivable in harsh environments. With more than 1,200 test flight hours, the helicopter achieved milestones in 2018, including operating at high altitudes, extreme temperatures and low visibility.\n\nThese capabilities have likely driven this rotorcraft’s demand in recent times and should lead to more contract awards for Lockheed in the days ahead. Such order flows are expected to boost the company’s revenues, solidifying its position as a leader in military aviation.\n\nGrowth Prospects for LMT Stock\n\nRising military conflicts, terrorism and border disputes, along with rapid technological advancements of military helicopters, have led nations to increase defense spending, particularly on combat-proven helicopters to enhance aerial security. This might have prompted the Mordor Intelligence firm to forecast a compound annual growth rate (CAGR) of more than 2.9% for the military helicopter market from 2024 to 2030.\n\nSuch solid market prospects offer growth opportunities for Lockheed. Notably, the company’s portfolio includes well-established helicopters like the Black Hawk, MH-60R Seahawk, CH-148 Cyclone and the CH-53K King Stallion.\n\nOpportunities for LMT’s Peers\n\nOther defense companies that are expected to enjoy the perks of the expanding military helicopter market have been discussed below.\n\nStory continues\n\nThe Boeing Company BA: Its military rotorcraft serves the U.S. Army, Navy, Marines and Air Force and allied defense forces in more than 20 countries across the globe. Boeing’s Defense, Space & Security segment produces rotorcraft and rotary-wing programs, such as H-47 Chinook, AH-64 Apache, AH-6 Little Bird and V-22 Osprey.\n\nThe company has a long-term (three to five years) earnings growth rate of 21.3%.  The Zacks Consensus Estimate for BA’s third-quarter 2024 sales indicates an improvement of 10.8% from the prior-year quarter’s reported figure.\n\nAirbus Group EADSY: It is one of the world's largest suppliers of advanced military helicopters. EADSY’s product portfolio includes the H135 combat helicopter, the H145M helicopter, AS565 MBe, H160M, H175M, H215M, H225M and a few more.\n\nThe company’s long-term earnings growth rate is 13.9%. The Zacks Consensus Estimate for EADSY’s 2024 sales indicates an improvement of 6.9% from the 2023 reported figure.\n\nTextron TXT: Its business unit, Textron Aviation Defense, designs, builds and supports versatile and globally known military helicopters, preferred for training and attack missions. Some of Textron’s renowned products are the Beechcraft T-6C trainer and the AT-6 Wolverine.\n\nTXT boasts a long-term earnings growth rate of 10.1%. The consensus estimate for TXT’s 2024 sales indicates an improvement of 5.6% from the 2023 reported figure.\n\nPrice Movement\n\nIn the past year, shares of Lockheed have risen 34.7% compared with the industry’s growth of 3.5%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLockheed currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-secures-contract-support-ch-114200295.html",
        "symbols": [
            "0BOE.LSE",
            "0KVV.IL",
            "0LF0.LSE",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.039,
            "neu": 0.792,
            "pos": 0.17
        }
    }
]