[
    {
        "date": "2024-05-05T07:59:00+00:00",
        "title": "Want Decades of Passive Income? 3 Stocks to Buy Now and Hold Forever.",
        "content": "Technology gets a lot of attention on Wall Street, but the world still runs on industries that physically make and move the goods we use daily. Some industrial companies have been doing this for decades and are poised to continue for decades.\n\nTheir dependable and steadily growing nature has amassed terrific dividend track records. Their solid fundamentals and competitive advantages allow them to share profits with shareholders and continue running excellent businesses.\n\nHere are three industrial stocks you can confidently buy and receive dividends from for decades.\n\n1. Caterpillar\n\nMachinery company Caterpillar(NYSE: CAT) might be next to the word industrial in the dictionary. It's an industrial in every sense of the word. Caterpillar makes a variety of large, earth-moving machinery for construction, mining, energy, and transportation. Think bulldozers, dump trucks, and more. The company sells its famous yellow machinery and generates additional revenue from service and maintenance contracts.\n\nCaterpillar's end markets are susceptible to the economy. Companies don't spend much money during recessions; they usually go into survival mode. Caterpillar's business will see ups and downs as a result. You can see how Caterpillar's dividend payout ratio surges higher during down years: CAT Cash Dividend Payout Ratio Chart\n\nCaterpillar has repeatedly proven it can navigate these rough waters. The company has paid and raised its dividend for 31 consecutive years, which means it survived not only COVID-19 but also the financial crisis in 2008-2009. Today, the payout ratio is at its lowest point in a decade, which has Caterpillar prepared for the next downturn. You can buy and hold Caterpillar with confidence.\n\n2. Enbridge\n\nEnergy is the foundation of the world's economy, and Enbridge(NYSE: ENB) plays a significant role in North America. The energy company operates a network of pipelines and storage for oil and gas that spans North America from its headquarters in northern Canada to the Gulf of Mexico. Enbridge also has additional businesses in renewable energy generation and a gas utility segment.\n\nPipelines are Enbridge's primary business. These lines transfer oil, gas, and other materials throughout North America. While many energy companies are sensitive to commodity prices, Enbridge acts more like a toll booth; it depends on the volume flowing through its pipes. This makes Enbridge a more consistent business. The company has paid and raised its dividend for 28 consecutive years.\n\nEnbridge usually invests heavily in upgrading and maintaining its pipelines and utility businesses, so its free cash flow can be inconsistent, even if revenue streams are steady. Investors should look to the company's distributable cash flow (DCF) per share, which management uses to communicate how well the business is doing. Enbridge's DCF per share will be around $5.60 this year, and the company will pay around $3.66 per share. That's a payout ratio of 65%, making this stock's 7.4% yield a dividend you can count on.\n\nStory continues\n\n3. Lockheed Martin\n\nThe United States is a world power that routinely deals with geopolitics. There's a reason why America spends more on its military than any other nation. Lockheed Martin(NYSE: LMT) has been a major benefactor, poised to continue well into the future. Lockheed Martin designs and builds various weapons for America and its allies, ranging from fighter jets to helicopters, from missiles to satellites.\n\nToday, Lockheed Martin is most famous for its F-35 program, worth an estimated $1.7 trillion over its lifetime. It's usually bad to depend on one customer, but Lockheed Martin is an exception. It's nice when the customer you do most of your business with can literally print money to pay its bills. Politicians can occasionally scrutinize the National Defense budget, but America has spent increasingly more on its military over time.\n\nThis steady relationship has resulted in consistent dividend growth for shareholders. Lockheed Martin has paid and raised its dividend for 22 consecutive years. The dividend payout ratio is very manageable at just 49% of cash flow, and investors can lock in a 2.7% yield at the current share price. Investors can enjoy Lockheed Martin's dividends for as long as America needs its military.\n\nShould you invest $1,000 in Caterpillar right now?\n\nBefore you buy stock in Caterpillar, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Caterpillar wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $544,015!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of April 30, 2024\n\nJustin Pope has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Enbridge. The Motley Fool recommends Lockheed Martin. The Motley Fool has a disclosure policy.\n\nWant Decades of Passive Income? 3 Stocks to Buy Now and Hold Forever. was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/want-decades-passive-income-3-075900768.html",
        "symbols": [
            "CAT.US",
            "ENB.US",
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.051,
            "neu": 0.818,
            "pos": 0.132
        }
    }
]