[
    {
        "date": "2024-05-07T15:31:00+00:00",
        "title": "TransDigm (TDG) Beats on Q2 Earnings, Ups '24 Sales View",
        "content": "TransDigm Group Incorporated TDG reported second-quarter fiscal 2024 adjusted earnings of $7.99 per share, which beat the Zacks Consensus Estimate of $7.37 by 8.4%. The bottom line also improved 33.6% from the prior-year quarter’s reported figure of $5.98.\n\nBarring one-time items, the company recorded GAAP earnings of $6.97 per share compared with $5.32 in the year-ago quarter.\n\nSales\n\nNet sales amounted to $1.92 billion, up 20.5% from $1.59 billion registered in the prior-year period. The reported figure also beat the Zacks Consensus Estimate of $1.89 billion by 1.8%.\n\nTransdigm Group Incorporated Price, Consensus and EPS Surprise Transdigm Group Incorporated Price, Consensus and EPS Surprise\n\nTransdigm Group Incorporated price-consensus-eps-surprise-chart | Transdigm Group Incorporated Quote\n\nOperating Results\n\nThe gross profit for the quarter came in at $1.15 billion, up 24% from the year-ago quarter’s level of $929 million.\n\nNet income increased 32.9% year over year to $404 million. The growth was primarily driven by an increase in net sales and the application of the company’s value-driven operating strategy.\n\nFinancial Position\n\nCash and cash equivalents as of Mar 30, 2024, amounted to $4.29 billion, up from $3.47 billion as of Sep 30, 2023.\n\nLong-term debt totaled $21.33 billion compared with $19.33 billion as of Sep 30, 2023.\n\nCash from operating activities amounted to $865 million compared with $507 million at the end of the second quarter of fiscal 2023.\n\nGuidance\n\nTransDigm raised its guidance for fiscal 2024. The company now expects sales in the range of $7.68-$7.80 billion, up from the earlier guidance of $7.48-$7.68 billion. The Zacks Consensus Estimate for the same is pegged at $7.70 billion, lower than the midpoint of the company’s guided range.\n\nTDG currently expects fiscal 2024 adjusted earnings in the band of $31.75-$33.09 per share, up from the prior guidance of $31.00-$32.94. The Zacks Consensus Estimate for earnings is pegged at $31.45 per share, lower than the company’s guided range.\n\nZacks Rank\n\nTransDigm currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nRecent Defense Releases\n\nGeneral Dynamics Corporation GD reported first-quarter 2024 earnings per share (EPS) of $2.88, which missed the Zacks Consensus Estimate of $2.89 by 0.4%. However, the figure increased 9.1% from $2.64 per share recorded in the year-ago quarter.\n\nGD’s revenues of $10,731 million beat the Zacks Consensus Estimate of $10,201 million by 5.2%. The top line also improved 8.6% from the prior-year reported figure.\n\nRTX Corporation’s RTX first-quarter 2024 adjusted EPS of $1.34 beat the Zacks Consensus Estimate of $1.23 by 8.9%. The bottom line also improved 9.8% from the year-ago quarter’s level of $1.22.\n\nStory continues\n\nRTX’s net sales were $19,305 million, which surpassed the Zacks Consensus Estimate of $18,412.6 million by 4.8%. The top line also improved 12% from $17,214 million recorded in the first quarter of 2023.\n\nLockheed Martin Corporation LMT reported first-quarter 2024 adjusted earnings of $6.33 per share, which beat the Zacks Consensus Estimate of $5.80 by 9.1%. The bottom line, however, declined 1.6% from the year-ago quarter's recorded figure of $6.43.\n\nLMT’s net sales were $17.20 billion, which beat the Zacks Consensus Estimate of $16.19 billion by 6.2%. The top line also increased 13.7% from $15.13 billion reported a year ago.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nTransdigm Group Incorporated (TDG) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/transdigm-tdg-beats-q2-earnings-153100465.html",
        "symbols": [
            "0IUC.LSE",
            "0R3E.LSE",
            "0REK.LSE",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "T7D.BE",
            "T7D.F",
            "T7D.STU",
            "TDG.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.019,
            "neu": 0.866,
            "pos": 0.116
        }
    },
    {
        "date": "2024-05-07T14:11:05+00:00",
        "title": "What Boeing's delayed rocket launch means for the company, according to Intuitive Machines CEO",
        "content": "Boeing (BA) delayed the launch of its Starliner space capsule Monday after identifying a faulty oxygen relief valve just hours before liftoff.\n\nEarly Tuesday, NASA said the launch, which was expected to carry two astronauts to the International Space Station (ISS), would be rescheduled to “no earlier than Friday, May 10.”\n\n“The delay allows teams to complete data analysis on a pressure regulation valve on the liquid oxygen tank of the Atlas V rocket's Centaur upper stage and determine whether it is necessary to replace the valve,” NASA said in a statement.\n\nThe launch of the CST-100 Starliner on board the United Launch Alliance (ULA) rocket, a Boeing-Lockheed Martin (LMT) joint venture, was supposed to mark Boeing’s first crewed flight and a big step forward for a firm plagued by design flaws and a botched flight attempt.\n\nBut mission teams scrubbed the launch two hours before liftoff. NASA astronauts Barry “Butch” Wilmore and Sunita Williams were set to spend a week on the International Space Station while the Starliner remained docked.\n\n“It has been a real challenge for them to get their spacecraft ready to go and safe for our astronauts,” said Intuitive Machines (LUNR) founder and CEO Steve Altemus, speaking at the Milken Institute’s Global Conference. “While they've worked through some very difficult technical challenges, what's the future of that program? I'm not quite sure how it will persist over time and what kind of investment it'll take.” NASA's Boeing Crew Flight Test astronauts Suni Williams and Butch Wilmore exit the Kennedy Space Center in Florida during a mission dress rehearsal on Friday, April 26, 2024. (Frank Micheaux/NASA via AP) (ASSOCIATED PRESS)\n\nAerospace has 'fundamentally changed'\n\nThe delay marked the latest setback for a company already grappling with quality control and safety issues in its aviation business, including a slew of problems linked to its 737 Max models.\n\nBoeing began developing Starliner in 2014 after winning a $6.8 billion NASA contract along with Elon Musk’s SpaceX to ferry astronauts to the International Space Station. Since then, SpaceX’s Crew Dragon capsule has flown nine crewed flights for NASA and four flights with private astronauts, while Boeing has failed to keep up.\n\nBoeing's first attempt to reach the ISS was unsuccessful after its onboard clock was set incorrectly, causing the computer to fire the capsule’s engines prematurely. The program has incurred more than $1.5 billion in cost overruns.\n\nAltemus, whose company has partnered with Boeing and Northrop Grumman (NOC) to develop a lunar terrain vehicle for NASA, said Boeing's challenges highlight a fundamental shift within the new space economy.\n\n“It speaks to a broader issue in the industry about what's the role of the traditional prime contractor or the strategic aerospace company,” he said. “I think the environment of NASA and the way they're doing nontraditional procurements to buy goods and services for the Artemis program has fundamentally changed the landscape and disrupted strategic aerospace.”\n\nStory continues Photographers capture the Boeing Starliner capsule atop an Atlas V rocket as it is rolled out to the launch pad on May 4, 2024, in Cape Canaveral, Fla. (AP Photo/Terry Renna) (ASSOCIATED PRESS)\n\nThe space economy is in the midst of a rapid evolution, driven by SpaceX. Borrowing from a playbook established by founder Elon Musk, firms are moving quicker, building bigger, and slashing costs in the process, bringing a tech startup-like mentality to space exploration.\n\nMuch of that growth has been limited to rockets and satellites, but NASA has added fuel by leaning on private companies to take on the risk of further space exploration to the moon and beyond.\n\nAltemus said that the push to move faster and be more flexible has put smaller companies like Intuitive in the driver’s seat. NASA has already awarded the company more than $100 million to develop an end-to-end lunar delivery service in addition to developing the lunar terrain vehicle.\n\nIn February, Intuitive became the first commercial company to reach the surface of the moon, although its lunar vehicle Odysseus tipped on its side upon landing, altering the mission.\n\n\"The government is asking us as commercial companies to share the risk,\" Altemus said. \"Sometimes with the larger strategic aerospace companies, their boards and their shareholders are not comfortable with that risk posture, where a smaller, more nimble, agile company can maybe work around those financial risks and be successful.\"\n\n\"I think the companies that can figure this out, the ones who can manage with these non-traditional procurements, will be the tier one aerospace companies of the future,\" he added.\n\nCatch more of Yahoo Finance's coverage at the 2024 Milken Institute Global Conference.\n\nAkiko Fujita is an anchor and reporter for Yahoo Finance. Follow her on Twitter @AkikoFujita.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance\n\nView comments",
        "link": "https://finance.yahoo.com/news/what-boeings-delayed-rocket-launch-means-for-the-company-according-to-intuitive-machines-ceo-141105654.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.688,
            "neg": 0.038,
            "neu": 0.916,
            "pos": 0.045
        }
    },
    {
        "date": "2024-05-07T13:00:00+00:00",
        "title": "Elsight Enhances the Indago 4 Uncrewed Aerial System with Robust and Beyond Visual Line-of-Sight (BVLOS) Communications",
        "content": "After integration with Elsight Halo, the Indago 4 completed its first BVLOS (beyond visual line-of-sight) flight with enhanced capabilities for wider situational awareness\n\nOR YEHUDA, Israel, May 7, 2024 /PRNewswire/ -- During a strategic collaboration exercise, Elsight's (ASX: ELS) Halo connectivity platform was rapidly integrated with Lockheed Martin (NYSE: LMT) Indago 4 Uncrewed Aerial System (UAS) to complete BVLOS (beyond visual line-of-sight) flights with enhanced capabilities and expanded operational reach.\n\nAt the heart of this integration lies Elsight's Halo, a highly reliable communication system. By seamlessly aggregating diverse IP links—public cellular, private cellular, satellite, and SDR radio—the Halo ensures uninterrupted connectivity even in the most challenging environments. Whether it's disaster response, surveillance, or remote inspections, the Indago 4 now operates with unparalleled reliability for continuous connectivity and transmission of video and data to the command-and-control center.\n\nIncorporating Elsight's solution enhances the Indago 4's wireless dispersion capabilities for maintaining robust communication links across varying terrains, obstacles, and distances with ensured uninterrupted data flow such as real-time video feeds or critical telemetry data.\n\n\"We designed the Halo to provide real-time situational awareness in difficult defense and public safety scenarios,\" said Roee Kashi, Co-founder and CTO of Elsight. \"Ultimately, field commanders need to make strategic decisions at any moment and should have the widest 'lens' possible with all the critical information. Now with our integration, the Indago 4 becomes the 'eyes' of any commander and the control center.\"\n\nAbout Elsight\n\nElsight (ASX: ELS) Elsight delivers Connection Confidence with proprietary bonding connectivity that incorporates both software and hardware elements to deliver reliable, secure, high bandwidth communications—even in the most challenging areas for stationary, portable, or actively mobile situational requirements. Elsight provides robust, secured connectivity to unmanned aerial and ground systems manufacturers, operators, and integrators globally. www.elsight.com\n\nContact:\r\nSusan Becker\r\nMarketing Director \r\nsusan.b@elsight.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/elsight-enhances-the-indago-4-uncrewed-aerial-system-with-robust-and-beyond-visual-line-of-sight-bvlos-communications-302138136.html\n\nSOURCE Elsight Ltd\n\nView comments",
        "link": "https://finance.yahoo.com/news/elsight-enhances-indago-4-uncrewed-130000311.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.94,
            "neg": 0.042,
            "neu": 0.855,
            "pos": 0.102
        }
    },
    {
        "date": "2024-05-07T11:45:00+00:00",
        "title": "3 Defense Stocks to Sell in May Before They Crash &amp; Burn",
        "content": "Although geopolitical tensions are high and defense spending is generally on the rise globally, not all defense stocks companies will benefit. Some defense contractors may face challenges. Those include supply chain disruptions, labor shortages or reputational risks that could impact performance and prices.\n\nMoreover, the defense industry is heavily dependent on government contracts and budget allocations. And those can be highly unpredictable and subject to political shifts. Companies that rely heavily on a few key contracts or have a narrow product portfolio may be more vulnerable to changes in government priorities or spending cuts.\n\nMore specifically, some defense stocks have a mix of weakening fundamentals and overvalued natures. Let’s explore some of those that investors should sell this month.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nRTX Corporation (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nRTX Corporation (NYSE:RTX) is known for its aerospace and defense products. Quite recently, it faced a significant setback with a defect discovered in 1,200 of its jet engines. This issue requires grounding and inspection of the engines, which could impact the company’s financial performance and reputation.\n\nImportantly, RTX did very well in its Q1 results. Also, the Raytheon defense division showed strong profit margin growth. However, the Collins Aerospace and Pratt & Whitney divisions experienced margin declines. This could be a concern, as these two divisions account for a significant portion of RTX’s revenue.\n\nSome analysts’ commentary leans into RTX being currently overvalued. It trades at high multiples compared to both its historical averages as well as the median for its peer universe. So although a solid stock, a pullback may be needed, and it could be primed for a retracement.\n\nThe Boeing Company (BA) image of a Boeing (BA) 737 max aircraft. stocks to buy and sell related to Boeing\n\nSource: Marco Menezes / Shutterstock.com\n\nThe Boeing Company (NYSE:BA) has also experienced challenges. The company’s stock performance has been underwhelming compared to market expectations. Furthermore, BA has faced production issues and other operational difficulties.\n\nBad news has been abound for the stock, which is perhaps one of the most impactful media disasters of the last decade for a company. Also, last month, the Chief Executive Officer (CEO) indicated that there could be more bad news forthcoming.\n\nDuring the earnings call, CEO Calhoun mentioned that 737 production will be “slow and lumpy” in Q2 as the company works through challenges over the next 60 days. Chief Financial Officer (CFO) Brian West also indicated that Boeing is slowing near-term production of the 787 Dreamliner. The company is planning to return to five per month later in the year. So, these production issues could impact the company’s performance.\n\nStory continues\n\nAlso, Northcoast Research cut its rating for BA stock to sell from neutral. It cites channel checks that point to a lower build rate for the 787 Dreamliner than Boeing’s claim of five per month. This discrepancy could indicate an underlying problem not yet shared with investors.\n\nLockheed Martin (LMT) Close top view of a Lockheed Martin (LMT) F-35C Lightning II with afterburner on\n\nSource: ranchorunner / Shutterstock.com\n\nWhile traditionally a strong performer, Lockheed Martin (NYSE:LMT) has recently been subject to concerns over its valuation and the sustainability of its growth.\n\nLMT stock has underperformed the S&P 500 in 2021 and 2023, despite outperforming in 2022. This inconsistent performance, especially during a period when many other stocks have provided better returns with less risk, may make LMT less attractive to some investors.\r\n\r\nAdditionally, despite strong revenue growth, Lockheed Martin’s consolidated operating margin declined by 170 basis points year-over-year (YOY) to 11.8% in Q1. Lower operating margins led to a decrease in earnings per share compared to the prior-year quarter.\n\nLike RTX, I think that LMT is a great stock but its valuation is too rich due to its own success. Its high valuation makes it more vulnerable to market and systemic risks than others. Therefore, it should be worth waiting on the sidelines before considering adding LMT to one’s portfolio. And similar to RTX, it also trades at high valuation multiples to its historical performance. This prompts caution.\n\nOn the date of publication, Matthew Farley did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nMatthew started writing coverage of the financial markets during the crypto boom of 2017 and was also a team member of several fintech startups. He then started writing about Australian and U.S. equities for various publications. His work has appeared in MarketBeat, FXStreet, Cryptoslate, Seeking Alpha, and the New Scientist magazine, among others.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 3 Defense Stocks to Sell in May Before They Crash & Burn  appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-defense-stocks-sell-may-114500256.html",
        "symbols": [
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "BA.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.916,
            "neg": 0.05,
            "neu": 0.878,
            "pos": 0.071
        }
    },
    {
        "date": "2024-05-07T11:36:00+00:00",
        "title": "Boeing’s Starliner Launch Delayed After Problem With Rocket Valve",
        "content": "A Boeing spacecraft was due to take its inaugural crewed flight Monday, carrying NASA astronauts to the International Space Station.\n\nContinue reading\n\nView comments",
        "link": "https://finance.yahoo.com/m/52fd91fd-ca86-3202-9fc2-5da212c9f608/boeing%E2%80%99s-starliner-launch.html",
        "symbols": [
            "0BOE.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0,
            "neg": 0,
            "neu": 1,
            "pos": 0
        }
    },
    {
        "date": "2024-05-07T03:45:00+00:00",
        "title": "Starliner Launch Delayed After Issue Identified With Rocket Valve",
        "content": "Boeing spacecraft was due to take its inaugural crewed flight Monday, carrying NASA astronauts to the International Space Station.\n\nContinue reading\n\nView comments",
        "link": "https://finance.yahoo.com/m/52fd91fd-ca86-3202-9fc2-5da212c9f608/starliner-launch-delayed.html",
        "symbols": [
            "0BOE.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0,
            "neg": 0,
            "neu": 1,
            "pos": 0
        }
    },
    {
        "date": "2024-05-07T00:00:00+00:00",
        "title": "3 Defense Stocks to Sell in May Before They Crash &amp; Burn ",
        "content": "With overvaluations and risks persisting, discover three defense stocks that investors should drop this month before potential crashes. ",
        "link": "https://investorplace.com/2024/05/3-defense-stocks-to-sell-in-may-before-they-crash-burn/",
        "symbols": [
            "BA.US",
            "LMT.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.402,
            "neg": 0.203,
            "neu": 0.725,
            "pos": 0.072
        }
    }
]