[
    {
        "date": "2024-05-06T20:51:05+00:00",
        "title": "3 Top Stock Picks Positioned to Capitalize on Skyrocketing Defense Spending",
        "content": "Global military spending for 2023 touched record highs of $2.44 trillion. On a year-on-year basis, defense spending increased by 6.8%. That does not come as a surprise, as there are multiple points of geopolitical friction globally. It’s also likely that defense spending will continue to increase at a healthy pace through the decade. From an investment perspective, it’s a good opportunity to consider exposure to some of the best defense stock picks.\n\nIf we look at some top defense companies, the order backlog has been swelling. Further, companies are investing in next-generation defense technology. A swelling backlog implies clear revenue and cash flow visibility. Investment in R&D will ensure that growth remains healthy as new technology replaces the existing in the coming years.\n\nTherefore, the overall outlook for the defense sector is positive. Even with macroeconomic headwinds, I don’t see a slowdown in defense spending. As a matter of fact, global defense spending increased even during the pandemic years.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nWith this overview, let’s discuss three defense stock picks poised to surge higher on the back of potential growth acceleration.\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) Space Systems sign in Sunnyvale, California.\n\nSource: Ken Wolter / Shutterstock.com\n\nLockheed Martin (NYSE:LMT) is my top pick from the defense sector. After remaining sideways for the last 12 months, LMT stock trades at an attractive forward price-earnings ratio of 17.9. Further, the stock offers a dividend yield of 2.73%. With business progress remaining positive, I am bullish on a strong breakout for LMT stock.\n\nAs of Q1 2024, Lockheed reported a strong order backlog of $159 billion. That provides clear revenue and cash flow visibility. For the current year, Lockheed has guided for free cash flow of $6.2 billion. FCF will likely continue to swell in the coming years on the back of healthy order intake.\n\nAn important point to note is that Lockheed is investing in next-generation defense technology. That includes hypersonics and next-generation interceptors, among others. Investment in research and development will ensure that Lockheed is ahead of the curve. Further, with expanding sales to allies, the addressable market is significant.\n\nLeonardo DRS (DRS)\n\nAmong the emerging defense stocks,Leonardo DRS (NASDAQ:DRS) is worth considering for multibagger returns. DRS stock has trended higher by 35% in the last 12 months. However, the growth stock remains attractive at a forward price-earnings ratio of 26.8. With a swelling order backlog, I expect growth to accelerate in the coming years.\n\nStory continues\n\nAs an overview, Leonardo DRS is a provider of defense technologies. For the last financial year, the company clocked revenue and EBITDA of $3 billion and $378 million respectively. It’s worth noting that as of Q1 2024, Leonardo reported an order backlog of $7.8 billion. On a year-on-year basis, the backlog swelled by 84%. If the order intake remains robust, there is a strong case for a healthy upside in EBITDA and cash flows.\n\nI must add here that Leonardo has been consistently investing in R&D. Last month, the company won the 2024 Herschel Award for the “development of a groundbreaking cooled infrared sensor that unlocks the ability for advanced military and scientific capabilities.”\n\nRTX (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nRTX (NYSE:RTX) has witnessed a healthy rally of 20% for year-to-date. However, the stock remains attractively valued at a forward price-earnings ratio of 19.3. Therefore, I expect further upside for this 2.49% dividend yield defense stock.\n\nFor Q1 2024, RTX reported healthy sales growth of 12% on a year-on-year basis to $19.3 billion. For the same period, the company reported a healthy order backlog of $202 billion. That included a $125 billion backlog from the commercial segment and $77 billion from defense. A robust backlog provides clear revenue visibility.\n\nAn important point to note is that the order intake for Q1 2024 was $25 billion. If that pace of intake sustains, organic sales growth will likely remain robust. I must add that RTX has guided for free cash flow of $5.7 billion for the year. That provides ample flexibility to invest in operational modernization and technological innovation.\n\nOn the date of publication, Faisal Humayun did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nFaisal Humayun is a senior research analyst with 12 years of industry experience in the field of credit research, equity research and financial modeling. Faisal has authored over 1,500 stock specific articles with focus on the technology, energy and commodities sector.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post 3 Top Stock Picks Positioned to Capitalize on Skyrocketing Defense Spending appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-top-stock-picks-positioned-205105598.html",
        "symbols": [
            "0R3E.LSE",
            "2VZ.F",
            "5UR.F",
            "5UR.XETRA",
            "DRS.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.001,
            "neu": 0.8,
            "pos": 0.199
        }
    },
    {
        "date": "2024-05-06T16:50:29+00:00",
        "title": "INSIGHT-Sea drone warfare has arrived. The U.S. is floundering.",
        "content": "*\n\nHouthi, Ukraine sea drone attacks reshape ocean warfare\n\n*\n\nU.S. Navy's sea drone program in D.C. funding quagmire\n\n*\n\nPentagon wants sea drones to counter China's naval power\n\n(Adds Switchblade in paragraph 22)\n\nBy Joe Brock and Mike Stone\n\nMay 6 (Reuters) - The U.S. Navy's efforts to build a fleet of unmanned vessels are faltering because the Pentagon remains wedded to big shipbuilding projects, according to some officials and company executives, exposing a weakness as sea drones reshape naval warfare.\n\nThe lethal effectiveness of sea drones has been demonstrated in the Black Sea where Ukraine has deployed remote-controlled speed boats packed with explosives to sink Russian frigates and minesweepers since late 2022.\n\nYemeni-backed Houthi rebels have employed similar vessels against commercial shipping in the Red Sea in recent months, albeit without success.\n\nThese tactics have caught the attention of the Pentagon, which is incorporating lessons from Ukraine and the Red Sea into its plans to counter China's rising naval power in the Pacific, Pentagon Spokesman Eric Pahon told Reuters.\n\nIn a signal of the Pentagon's intent, Deputy Secretary of Defense Kathleen Hicks announced an initiative in August - named Replicator - to deploy hundreds of small, relatively cheap air and sea drones within the next 18-24 months to match China's growing military threat.\n\nThis public show of commitment masks years of hesitation by the U.S. Navy to build a fleet of unmanned vessels despite repeated warnings this was the future of maritime warfare, according to interviews with a dozen people with direct knowledge of the U.S. sea drone plans, including Navy officers, Pentagon officials, and sea drone company executives.\n\nTwo Navy sources and three executives at sea drone manufacturers said the biggest impediment to progress has been a Department of Defense (DoD) budget process that prioritizes big ships and submarines built by legacy defense contractors.\n\n\"At some point, you hit the D.C. problem,\" said Philipp Stratmann, CEO at Ocean Power Technologies (OPT), a New Jersey-based firm that supplies the U.S. Navy with the WAM-V, an autonomous surface drone.\n\n\"You hit the fact that there is a military industrial complex that has the best lobbyists and knows exactly how the money flows and contracting works in the DOD.\"\n\nA Navy spokesperson said it \"acquires capabilities based on fleet demand signals\", referring to the messages headquarters receive from commanders at sea.\n\nThe Navy has a budget of $172 million this year for small and medium-sized underwater sea drones, falling to $101.8 million in 2025, the spokesperson said. That's a tiny fraction of the $63 billion Navy procurement budget proposed by President Joe Biden's administration for 2025.\n\nStory continues\n\nMilitary sea drones can range from missile-armed speed boats to minehunting miniature submarines and solar-powered sailboats equipped with high-definition spy cameras, underwater sensors and loudspeakers used to holler warnings at enemy ships.\n\nBut when the Navy has deployed sea drones on reconnaissance missions in recent years, it hasn't always had the fleet expertise to use them, the two Navy sources said, asking not to be named due to the sensitivity of the matter.\n\nThere aren't enough Navy sailors trained to pilot drones or to analyze vast swathes of data sent back from the craft's cameras and sensors, the sources said.\n\nThe spokesperson said the Navy was in the process of improving its data collection and analysis from sensors.\n\nPentagon spokesman Pahon said the DoD has been \"laser-focused on accelerating innovation over the last three years\", including the use of sea drones.\n\nAcknowledging budget challenges, Pahon said the Pentagon was using innovative ways to cross \"the valley of death\", a term used to describe the torturous approval process new inventions travel through to be purchased in large quantities.\n\nREPLICATOR\n\nOne example Pahon cited was the Replicator program: the short-term, $500 million-a-year project is designed to cut through bureaucracy and fast track the deployment of thousands of cheap aerial and sea drones.\n\nThese drones will be used to match China's rapidly-growing air and naval power in the Asia-Pacific region, the Pentagon's Hicks said at the project's launch in August. She said Replicator is being funded mainly by reallocating funds from the existing Pentagon budget.\n\nAs part of the initiative, the Pentagon in January issued a solicitation for private companies to deliver small sea drones to the Navy, demanding production capacity of 120 vessels per year, with deployment beginning in April 2025.\n\nOn Monday, the Pentagon\n\nsaid the Switchblade\n\n-600, an aerial loitering munition made by AeroVironment Inc , was the first weapon publicly confirmed to be included in the Replicator initiative. The program's first tranche also includes undisclosed maritime surface products, other aerial drones and counter-drone systems (c-UAS), the Pentagon said.\n\nDuane Fotheringham, president of unmanned systems at Huntington Ingalls Industries (HII), the largest U.S. military shipbuilder, acknowledged the Pentagon and Navy had shown their \"intent\" to accelerate the deployment of sea drones but he said the industry wanted to see long-term funding in the defense budget.\n\n\"We hear the demand signal … but we all have to work together very closely to understand what that demand is and when it will be available,\" Fotheringham told Reuters.\n\nAt a cost ranging between $1 million and $3 million apiece, according to Navy and defense contractor sources, drones offer a relatively cheap and fast way to expand the Navy's fleet, especially as several large traditional shipbuilding projects - like a new class of frigate warships - are running years behind schedule.\n\nThe U.S. is testing using robot ships in active combat scenarios. But their more immediate use is for missions that are too costly and numerous for manned naval fleets.\n\nThis includes maritime surveillance, minehunting, and protecting critical undersea infrastructure, like gas pipelines and fiber-optic cables, four drone companies told Reuters.\n\nSwarms of small sea drones could also act as a shield for valuable crewed assets like aircraft carriers and submarines, and tangle up troop-carrying ships in the event China tries to invade Taiwan, said Bryan Clark, an advisor to the Navy on autonomous craft and a senior fellow at the Hudson Institute - a think tank headquartered in Washington.\n\nClark estimates the Navy has around 100 small drones for use on the ocean surface and another 100 underwater drones, while China has a similar-sized autonomous force that is growing fast. The Navy spokesperson declined to comment on how many drones it has in operation.\n\n\"Ukraine has shown how effective they can be and how they can be employed in current operations,\" Clark said. \"The U.S. Navy needs to embrace that lesson and field combat (sea drones) right away.\"\n\nThe Navy's 5th fleet, which operates out of Bahrain, has been testing unmanned vessels for three years, led by its Task Force 59 unit.\n\nThe project has deployed surveillance drones built by private firms, including startups, as well as those backed by defense heavyweights like Lockheed Martin and HII.\n\n\"The situation in the Red Sea gives the work of Task Force 59 added urgency and we look forward to fielding solutions to help counter Houthi malign behaviour,\" Colin Corridan, commander of the task force, told Reuters.\n\nMISSILE TEST\n\nIn October, the Navy carried out its first live missile test from an unmanned speedboat in the Arabian Peninsula.\n\nThe T38 Devil Ray, built by Florida-based sea drone firm MARTAC, successfully launched a miniature missile system to destroy a target boat, with a human operator ashore giving the order, according to a Navy announcement and video.\n\nMARTAC's Chief Marketing Officer, Stephen Ferretti, referred questions about the operation to the Navy.\n\nThe use of unmanned vessels was expanded to the Navy's 4th Fleet in central America last year where they have been used to crack down on human smuggling off the northern coast of Haiti.\n\nOne of the companies operating there is Saildrone, a California-based firm that makes wind-, solar- and diesel-powered autonomous vessels that collect images and data with cameras and sensors.\n\nSaildrone has circumnavigated Washington's funding politics. Because the company operates and maintains its own vessels, and charges a service fee for the data they collect, the Navy can pay to use the drones out of its operating expenses rather than procurement budget.\n\nSaildrone launched the Surveyor, its largest vessel, which has been tailored for the military, at an event in March attended by Chief of Naval Operations Lisa Franchetti.\n\nThe drone firm, which also supplies coast guards and ocean survey departments, has a fleet of 130 vessels and is building several more every month, said Richard Jenkins, the company's founder.\n\n\"Right now, we are struggling to keep up with demand,\" Jenkins told Reuters in an interview. He declined to comment on how much Saildrone charges the Navy.\n\nOcean Aero builds the autonomous Triton vessel, which can move on the surface or underwater to collect data and hunt for mines using sensors. The company, which is backed by Lockheed Martin, opened a 63,000 feet manufacturing facility in Gulfport, Mississippi last October that is capable of churning out 150 Tritons a year.\n\nLockheed Martin did not respond to a request for comment.\n\nHII was awarded a contract last October to build nine small underwater drones for the U.S. Navy's Lionfish program, with the potential for this to rise to 200 vehicles over the next five years. The contract could total $347 million, although that is far from guaranteed.\n\nThe Lionfish program - which is focused on the Indo-Pacific where the U.S. is vying for control with China - is based on HII's Remus 300, a minehunting drone that can be launched like a torpedo from a crewed ship or submarine.\n\nThese programs are proof that the Pentagon is trying to move faster to deploy sea drones, spokesman Pahon told Reuters.\n\n\"We know we need to keep pushing to stay ahead,\" he said. (Reporting by Joe Brock in Singapore and Mike Stone in Washington; Editing by Daniel Flynn)\n\nView comments",
        "link": "https://finance.yahoo.com/news/insight-sea-drone-warfare-arrived-165029690.html",
        "symbols": [
            "0J76.LSE",
            "0R3E.LSE",
            "HI4.F",
            "HI4.STU",
            "HII.US",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.977,
            "neg": 0.042,
            "neu": 0.899,
            "pos": 0.059
        }
    },
    {
        "date": "2024-05-06T11:56:00+00:00",
        "title": "Curtiss-Wright (CW) Beats Q1 Earnings, Hikes '24 Sales View",
        "content": "Curtiss-Wright Corporation CW shares rose 4.4% to reach $268.17 on May 3 following the release of its first-quarter 2024 results. \r\n\r\nThe company reported first-quarter earnings per share (EPS) of $1.99, which surpassed the Zacks Consensus Estimate of $1.75 by 13.7%. The bottom line also improved 34.5% from the year-ago quarter’s level of $1.48.\n\nCurtiss-Wright Corporation Price, Consensus and EPS Surprise\n\nCurtiss-Wright Corporation price-consensus-eps-surprise-chart | Curtiss-Wright Corporation Quote\n\nOperational Performance\n\nIn the quarter under review, the company’s net sales of $713.2 million went up 13% year over year. Also, the top line surpassed the Zacks Consensus Estimate of $665 million by 7.2%.\r\n\r\nThe company reported adjusted operating income of $100 million in the first quarter, up 23% year over year. The operating margin expanded 110 basis points (bps) to 14%.\r\n\r\nCurtiss-Wright’s total backlog at the end of the first quarter was $3.1 billion, which increased by 7% from the 2023-end backlog figure. This improvement can be attributed to higher demand from both aerospace and defense, as well as commercial markets.\r\n\r\nNew orders of $901 million rose 26% year over year, driven by the strong demand for the company’s defense electronics and naval defense products.\n\nSegmental Performance\n\nAerospace & Industrial: Sales in this segment improved 8% year over year to $219.3 million. The upside was driven by higher commercial aerospace market sales, backed by increased OEM sales of actuation and sensor products and surface treatment services on narrowbody and widebody platforms. Also, higher revenues from the aerospace defense market driven by increased actuation development on various fighter jet programs benefited the segment’s sales growth.\r\n\r\nThe operating income improved 3% to $27.5 million. However, the operating margin contracted 60 bps to 12.5%.\r\n\r\nDefense Electronics: Sales in this segment increased 31% year over year to $211.7 million. This rise was driven by increased sales of CW’s embedded computing equipment on various fighter jets, unmanned aerial vehicles and helicopter programs. Also, robust demand and higher sales of tactical battlefield communications equipment, along with increased OEM sales of avionics and electronics on various platforms, have contributed to this segment’s sales growth.\r\n\r\nThe operating income increased 106% to $48.1 million. The operating margin expanded 830 bps to 22.7%.\r\n\r\nNaval & Power: Sales in this segment increased 6% year over year to $282.1 million, driven by higher sales contributions from the arresting systems equipment and higher revenues from the Columbia-class submarine. Moreover, increased commercial nuclear aftermarket sales supporting the maintenance of operating reactors in the United States and Canada are likely to have aided this segment’s sales growth.\r\n\r\nThe segment's operating income decreased 7% to $35.2 million. The operating margin contracted 180 bps to 12.5%.\n\nStory continues\n\nFinancial Update\n\nCW’s cash and cash equivalents as of Mar 31, 2024 were $338 million compared with $406.9 million as of Dec 31, 2023.\r\n\r\nThe long-term debt was $0.96 billion as of Mar 31, 2024 compared with $1.05 billion as of Dec 31, 2023.\r\n\r\nThe operating cash outflow totaled $45.6 million as of Mar 31, 2024 compared with $91.6 million cash used a year ago.\r\n\r\nThe adjusted free cash outflow at the end of Mar 31, 2024 was $57.7 million compared with the adjusted free cash outflow of $92.3 million in the previous year.\n\n2024 Guidance\n\nCurtiss-Wright has partially increased its guidance for 2024. The company now expects to generate GAAP earnings in the band of $10.10-$10.40 per share, up from its prior guided range of $10.00-$10.30 per share.\r\n\r\nCW also increased its sales outlook, which is now expected in the range of $2.99-$3.04 billion compared to the earlier guidance in the band of $2.96-$3.01 billion. The Zacks Consensus Estimate for CW’s 2024 sales is pegged at $2.99 billion, which is almost in line with the lower end of the company’s guided range.\r\n\r\nThe company continues to expect to generate free cash flow in the range of $415-$435 million during 2024.\n\nZacks Rank\n\nCurtiss-Wright currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nRecent Defense Releases\n\nL3Harris Technologies, Inc. LHX reported first-quarter 2024 adjusted earnings (from continuing operations) of $3.06 per share, which beat the Zacks Consensus Estimate of $2.89 by 5.9%. The bottom line also increased 7% from the year-ago quarter’s reported figure of $2.86.\r\n\r\nL3Harris’ first-quarter revenues totaled $5.21 billion, which beat the Zacks Consensus Estimate of $5.11 billion by 2%. The top line figure also rose 16.6% from the year-ago quarter’s level of $4.47 billion.\r\n\r\nLockheed Martin Corporation LMT reported first-quarter 2024 adjusted earnings of $6.33 per share, which beat the Zacks Consensus Estimate of $5.80 by 9.1%. However, the bottom line declined 1.6% from the year-ago quarter's recorded figure of $6.43.\r\n\r\nIts net sales were $17.20 billion, which surpassed the Zacks Consensus Estimate of $16.19 billion by 6.2%. The top line also increased 13.7% from $15.13 billion reported in the year-ago quarter.\r\n\r\nHexcel Corporation HXL reported first-quarter 2024 adjusted earnings of 44 cents per share, which came in line with the Zacks Consensus Estimate.\r\n\r\nIn the first quarter, the company’s net sales totaled $472.3 million, which missed the Zacks Consensus Estimate of $475 million by 0.6%. However, the top line witnessed an improvement of 3.2% from the year-ago quarter’s reported figure of $457.7 million.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nHexcel Corporation (HXL) : Free Stock Analysis Report\n\nCurtiss-Wright Corporation (CW) : Free Stock Analysis Report\n\nL3Harris Technologies Inc (LHX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/curtiss-wright-cw-beats-q1-115600308.html",
        "symbols": [
            "0R3E.LSE",
            "CW.US",
            "CWT.F",
            "CWT.STU",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.XETRA",
            "HXL.F",
            "HXL.STU",
            "HXL.US",
            "LHX.US",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.014,
            "neu": 0.863,
            "pos": 0.123
        }
    },
    {
        "date": "2024-05-06T00:00:00+00:00",
        "title": "3 Top Stock Picks Positioned to Capitalize on Skyrocketing Defense Spending",
        "content": "These are the best defense stock picks, as they represent companies with a growing order backlog likely to translate into cash flow upside.\n",
        "link": "https://investorplace.com/2024/05/3-top-stock-picks-positioned-to-capitalize-on-skyrocketing-defense-spending/",
        "symbols": [
            "DRS.US",
            "LMT.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.751,
            "neg": 0,
            "neu": 0.72,
            "pos": 0.28
        }
    }
]