[
    {
        "date": "2024-10-01T20:55:53+00:00",
        "title": "Defense Stocks Jump After Iran Attacks Israel",
        "content": "Major defense stocks advanced Tuesday after Iran launched missiles at Israel, raising the odds of a wider conflict. Lockheed Martin was among the S&P 500's best performers, while RTX shares hit an all-time high.\n\nContinue reading\n\nView comments",
        "link": "https://finance.yahoo.com/m/8dc4a078-48ce-37c3-9706-fbb7a053d495/defense-stocks-jump-after.html",
        "symbols": [
            "0R2N.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.796,
            "neg": 0.051,
            "neu": 0.694,
            "pos": 0.255
        }
    },
    {
        "date": "2024-10-01T18:16:00+00:00",
        "title": "Lockheed Martin and Other Defense Stocks Gain After Iran Fires Missiles at Israel",
        "content": "Defense stocks, including Lockheed Martin and Northrop Grumman were on the rise after Iran fired missiles at Israel in the latest escalation in the Middle East. Most recently, Iran launched a ballistic missile strike against Israel, in retaliation for the death of Hezbollah leader Hassan Nasrallah, who was killed in an Israeli airstrike on Friday.\n\nContinue reading\n\nView comments",
        "link": "https://finance.yahoo.com/m/65aa88c0-0bfb-3563-882b-1d4d38b1d714/lockheed-martin-and-other.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.904,
            "neg": 0.196,
            "neu": 0.756,
            "pos": 0.048
        }
    },
    {
        "date": "2024-10-01T14:03:00+00:00",
        "title": "Northrop Wins a Contract for Active Electronically Scanned Array Radars",
        "content": "Northrop Grumman Corp.’s NOC business unit, Northrop Grumman Systems, recently secured a modification contract to supply active electronically scanned array (AESA) radars for the U.S. Air Force’s F-16 aircraft fleet. The award has been offered by the Air Force Life Cycle Management Center, Wright-Patterson Air Force Base, OH.\n\nDetails of the Deal\n\nValued at $30 million, this contract is projected to be completed by May 30, 2031. Work related to this deal will be executed in Linthicum Heights, MD.\n\nThe latest modification brought the total face value of the agreement to $1.67 billion.\n\nNOC Stock’s Place in the Radar Market\n\nNorthrop is a prominent player in the radar market. Its Mission Systems business segment offers multiple radars and associated products like the Scalable Agile Beam Radar, F-35 fire control radar and Distributed Aperture System, Ground/Air Task Oriented Radar (G/ATOR,) APR-39 DV(2) and EV(2) Radar Warning Receiver programs and a few more.\n\nAs far as its expertise in AESA radar is concerned, Northrop has been at the forefront of AESA innovations for more than 60 years. Its well-earned expertise in AESA fire control radars helps provide air-to-air, air-to-ground, land and sea superiority for the world’s armed forces. Impressively, the company’s airborne fire control radars are used in the U.S. Air Force’s 5th generation fighter platforms, the F-22 Raptor and the F-35 Lightning II, apart from F-16 jets.\n\nThis surely reflects the solid demand that Northrop’s AESA enjoys in the U.S. military aerospace industry. The latest contract win is yet another example of that.\n\nGrowth Opportunities for NOC Stock\n\nWith widespread geopolitical tensions engulfing the global peace map in recent years, resulting in cross-border conflicts as well as civil unrest within a nation, multiple nations have been investing significantly to effectively strengthen their military arsenal. As radars constitute a crucial component of this arsenal, rising defense spending has also been boosting investments in radar manufacturing and associated components. The growth prospects for the radar market thus remain bright.\n\nThis must have prompted the Markets and Markets firm to project a CAGR of 5.2% for the global military radar market in the 2024-2029 period. Such growth projections bode well for prominent radar manufacturers like NOC.\n\nIn addition to being a prime provider of AESA radars, Northrop develops radar systems that support complex missions at sea and counter increasingly sophisticated anti-ship threats. Its AN/SPQ-9B is a multimode X-band pulse Doppler radar that detects all known and projected sea-skimming missiles. The company also offers land-based radars like AN/TPS-80 G/ATOR, HAMMR and the AN/TPS-80 Long Range Radar, which provide a complete, operational picture and unambiguous view of the battlespace to help warfighters make better decisions.\n\nStory continues\n\nNOC Stock’s Peer Prospects\n\nOther prominent radar manufacturers that are expected to benefit from the aforementioned growth opportunities offered by the global military radar market are discussed below:\n\nRTX Corp. RTX: Its product portfolio consists of varied radars like integrated air and missile defense radars, ballistic missile radars, surveillance radars and air dominance radars. RTX’s radars like AN-SPY 6, AN-TPY-2, APG-79 and APG-82 are some of its combat-proven products that enjoy solid demand in the global military radar market.\n\nRTX boasts a long-term earnings growth rate of 10.4%. The Zacks Consensus Estimate for RTX’s 2024 sales implies an improvement of 7% from the 2023 reported figure.\n\nLockheed Martin LMT: Its radars are chosen by more than 45 countries across six continents. AN/APY-9 Radar, the AN/TPQ-53 Radar System, SPY-7, TPS-77 and Sentinel A4 are some of the company’s combat-proven products that enjoy solid demand in the global military radar market.\n\nLMT boasts a long-term earnings growth rate of 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales implies an improvement of 5.3% from the 2023 reported figure.\n\nL3Harris Technologies LHX: It is a renowned manufacturer of radars. The company manufactures combat-proven radars like SPS-48 land-based surveillance radar, AN/APY-11 Multimode radar, Tactical Air Surveillance radar, AN/SPS-48G Long range 3D surveillance radar and many more.\n\nL3 Harris boasts a long-term earnings growth rate of 8.9%. The Zacks Consensus Estimate for LHX’s 2024 sales implies an improvement of 9.6% from the 2023 reported figure.\n\nNOC Stock’s Price Movement\n\nShares of Northrop have rallied 19.4% in the past year compared with the industry’s growth of 14.3%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nNorthrop currently has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nL3Harris Technologies Inc (LHX) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/northrop-wins-contract-active-electronically-140300978.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.XETRA",
            "LHX.US",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.024,
            "neu": 0.79,
            "pos": 0.186
        }
    },
    {
        "date": "2024-10-01T13:51:00+00:00",
        "title": "Lockheed Martin Secures a $3.2 Billion Contract for JASSM &amp; LRASM",
        "content": "Lockheed Martin Corporation LMT recently secured a contract valued at $3.23 billion for the procurement of Joint Air-to-Surface Standoff Missiles (\"JASSM\") and Long-Range Anti-Ship Missiles (\"LRASM\"). The work related to this deal will be carried out in Orlando, FL, and is projected to be completed by July 31, 2032.\r\n\r\nThe award has been provided by the U.S. Air Force Life Cycle Management Center, Eglin Air Force Base, FL. The contract will serve the governments of Japan, the Netherlands, Finland and Poland.\n\nWhat’s Favoring LMT?\n\nWith countries worldwide enhancing their defense capabilities, spending on advanced military arms and ammunition has been rapidly increasing. This also includes growing investments in missiles and missile defense systems, which are crucial for warfare missions. Lockheed Martin, as a prominent manufacturer of missiles and missile defense systems, thus continues to witness a steady flow of orders from the Pentagon and U.S. allies. The latest contract win is an example of that.\r\n \r\nNotably, Lockheed Martin’s first cruise missile, JASSM, provides continued significant long-range, precision engagement capabilities for air-to-ground missions. The combat-proven and mission-effective weapon system is designed to destroy high-value, well-defended, fixed and relocatable targets from significant standoff range, keeping aircrews well out of danger from hostile air defense systems without compromising lethality or reach.\r\n\r\nOn the other hand, LRASM is a precision-guided intelligent anti-ship missile designed to prevent a variety of surface threats at very long ranges. It can navigate semi-autonomously to a target and deliver a precise payload from a safe standoff range.\r\n\r\nSuch notable features of the aforementioned missiles of Lockheed Martin are likely to have been boosting their demand, which is further evident from the latest contract win.\n\nLMT’s Growth Prospects\n\nRising military conflicts, terrorism and border disputes have led nations to increase their focus on national security, particularly on missile defense systems, backed by the rapid development of advanced missile technologies over the last decade.\r\n \r\nThis is likely to have prompted Mordor Intelligence to forecast a compound annual growth rate of 5% for the missiles and missile defense systems market during the 2024-2029 time period.\r\n\r\nThis should benefit Lockheed Martin, with its Missile and Fire Control unit being a recognized developer of high-performance missiles. The unit pursues business in more than 50 countries worldwide. Some of its major programs are the Patriot Advanced Capability-3 and Terminal High Altitude Area Defense air and missile defense programs as well. Its prominent missiles include Precision Strike Missile, Joint Air-to-Ground Missiles and Hellfire II Missiles.\n\nStory continues\n\nProspects of LMT’s Peers\n\nOther defense companies that are likely to enjoy the perks of the expanding missiles and missile system market have been discussed below.\r\n\r\nNorthrop Grumman Corporation NOC: Northrop Grumman provides high-speed, long-range strike weapons like the AARGM-ER, which is a supersonic, air-launched tactical missile system. It also develops and builds advanced missile defense technology, ranging from command systems to directed energy weapons, advanced munitions and powerful sensors.\r\n\r\nThe company’s long-term (three to five years) earnings growth rate is 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales indicates year-over-year growth of 5.4%.\r\n\r\nRTX Corporation RTX: It is known for its missile defense systems like the Patriot and SM-6, which are in high demand globally. RTX also provides advanced sensors and interceptors to identify, track and defeat threats as part of a layered missile defense.\r\n \r\nThe company’s long-term earnings growth rate is 10.4%. The Zacks Consensus Estimate for RTX’s 2024 sales indicates year-over-year growth of 7%.\r\n\r\nThe Boeing Company BA: It manufactures various missile defense systems, including the Ground-based Midcourse Defense, Aegis Ballistic Missile Defense and Avenger. Boeing-built and supported air and missile defense systems have been protecting its customers for nearly 25 years against threats ranging from intercontinental ballistic missiles to hostile aircraft.\r\n\r\nThe company has a long-term earnings growth rate of 21.3%. The Zacks Consensus Estimate for BA’s 2025 sales indicates year-over-year growth of 20%.\n\nLMT Stock’s Price Movement\n\nShares of LMT have gained 26.2% in the past three months compared with the industry’s 10.9% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLMT’s Zacks Rank\n\nLMT currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-secures-3-2-135100270.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.059,
            "neu": 0.752,
            "pos": 0.189
        }
    },
    {
        "date": "2024-10-01T13:39:00+00:00",
        "title": "RTX Secures a $1.3B Deal to Improve F135 Engine Capabilities",
        "content": "RTX Corporation’s RTX business segment, Pratt & Whitney, recently secured a contract worth up to $1.3 billion to continue working on the F135 Engine Core Upgrade (“ECU”), which will increase the engine's longevity. These upgraded F135 engines, once integrated into the F-35 jets, are expected to boost this fighter aircraft’s performance.\n\nRTX’s F135 Engine Core Upgrade Benefits\n\nThe ECU is an upgrade developed by Pratt & Whitney for its F135 engines to provide an affordable, low-risk and agile pathway for enhancing propulsion capability for all three variants of F-35 jets. The ECU is the only engine that offers all global F-35 operators the additional power and thermal management capacity needed to enable next-generation weapons systems and sensors.\r\n\r\nThe ECU upgrade will meet the necessary requirements for the Block 4 upgrade of F-35 jets, which is aimed at enabling the F-35 aircraft to carry more weapons and improve its electronic warfare capabilities. \r\n\r\nThe fact that the F135 ECU is expected to generate tens of billions of lifecycle cost savings makes it the most cost-effective solution for the block 4 upgrade of F-35 jets. The recent contract win is a testament to that.\n\nWhat’s Favoring RTX?\n\nAmid the rising geopolitical unrest worldwide, countries are rapidly increasing their military spending to improve their capacity for battle. With aerial security being an important section of a nation’s defense map, there remains solid demand for combat-proven jets like the F-35.\r\n\r\nBuilt by America's largest defense contractor, Lockheed Martin LMT, the F-35 enjoys a profitable position in the combat aircraft market, with this aircraft being the most lethal fighter jet worldwide. One of its most recent developments is the Czech Republic's intention to buy 24 F-35s, becoming the 18th nation to join the F-35 global team in the first quarter of 2024. This suggests that demand for Lockheed's F-35 fighter is skyrocketing.\r\n\r\nThe increased demand for the F-35 allows RTX, the manufacturer of the jet's engine, F135, to get a steady stream of orders from the Pentagon, U.S. allies and other international customers. Pratt & Whitney has delivered almost 1,200 F135 engines to date.\r\n\r\nThe production of LMT’s F-35 jets is expected to continue for several years, given the U.S. government's current inventory target of 2,456 aircraft for the Air Force, Marine Corps and Navy. This should boost the demand for F135 engines and can be expected to boost its order growth in the near future. Such order growth should boost the top line of RTX’s Pratt & Whitney unit, which registered 19% year-over-year sales growth in the second quarter of 2024.\n\nStory continues\n\nProspects for RTX’s Peers\n\nThe aforementioned F-35 inventory target should also benefit other defense majors like Northrop Grumman NOC and BAE Systems BAESY, which are involved in the production of this aircraft.\r\n\r\nNorthrop Grumman produces the F-35 aircraft's center fuselage, the AN/APG-81 Active Electronically Scanned Array radar and communications subsystems and provides sustainment support for the Electro-Optical Distributed Aperture System. Moreover, NOC’s Integrated Communications, Navigation, and Identification, incorporated in F-35 jets, is one of the most advanced integrated avionics systems ever engineered to enhance pilot effectiveness.\r\n\r\nNorthrop has a long-term (three to five years) earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales suggests growth of 5.4% from the prior-year reported figure.\r\n\r\nBAE Systems is another key partner in the manufacturing of F-35 jets. The rear fuselage of every F-35 in the global fleet has been built by BAE Systems. It also manufactures vertical and horizontal tails for F-35 jets. The company provides an electronic warfare package for the F-35 that includes a fully integrated radar warning (targeting support and self-protection) to detect and eliminate surface and airborne threats.\r\n\r\nBAE Systems boasts a long-term earnings growth rate of 12.4%. The Zacks Consensus Estimate for BAESY’s 2024 sales implies an improvement of 37.4% from the 2023 reported figure.\n\nRTX Stock Price Movement\n\nIn the past six months, shares of RTX have risen 22.9% compared with the industry’s 6.7% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nRTX’s Zacks Rank\n\nRTX currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nBae Systems PLC (BAESY) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-secures-1-3b-deal-133900836.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "BA.LSE",
            "BAESF.US",
            "BAESY.US",
            "BSP.BE",
            "BSP.DU",
            "BSP.F",
            "BSP.STU",
            "BSP.XETRA",
            "BSPA.F",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.039,
            "neu": 0.813,
            "pos": 0.148
        }
    },
    {
        "date": "2024-10-01T13:00:00+00:00",
        "title": "Lockheed Martin Announces Third Quarter 2024 Earnings Results Webcast",
        "content": "BETHESDA, Md., Oct. 1, 2024 /PRNewswire/ -- Lockheed Martin (NYSE: LMT) will webcast live its third quarter 2024 earnings results conference call (listen-only mode) on Tuesday, October 23, 2024 at 11 a.m. ET.  James Taiclet, chairman, president and chief executive officer; Jay Malave, chief financial officer; and Maria Ricciardone, vice president, Treasurer and Investor Relations, will discuss third quarter 2024 results, provide updates on key topics and answer questions. Third quarter 2024 results will be published prior to the market opening on October 22. Lockheed Martin Logo. (PRNewsFoto/Lockheed Martin)\n\nThe live webcast will be available at www.lockheedmartin.com/investor and the accompanying presentation slides and relevant financial charts will also be available on the same website prior to market open.\n\nAn on-demand replay of the webcast will be available through Tuesday, November 5, 2024 at www.lockheedmartin.com/investor, and a podcast will be available here.\n\nFor additional information, visit the company's website: www.lockheedmartin.com.\n\nAbout Lockheed Martin Lockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at LockheedMartin.com. Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/lockheed-martin-announces-third-quarter-2024-earnings-results-webcast-302258212.html\n\nSOURCE Lockheed Martin\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-announces-third-quarter-130000382.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.934,
            "neg": 0,
            "neu": 0.911,
            "pos": 0.089
        }
    },
    {
        "date": "2024-10-01T11:44:00+00:00",
        "title": "Zacks Investment Ideas feature highlights: Taiwan Semiconductor Manufacturing, UnitedHealth and Lockheed Martin",
        "content": "For Immediate Release\n\nChicago, IL – October 1, 2024 – Today, Zacks Investment Ideas feature highlights Taiwan Semiconductor Manufacturing TSM, UnitedHealth UNH and Lockheed Martin LMT.\n\nA Closer Look at \"Wide Moat\" Stocks\n\nZacks Thematic Screens lets you dive into 30 dynamic investment themes shaping the future. Whether you're interested in cutting-edge technology, renewable energy, or healthcare innovations, our themes help you invest in ideas that matter to you.\n\nThematic investing has emerged as a powerful way for investors to sync their portfolios with emerging trends. A mix of long-term and short-term themes is increasingly dictating which companies lead as economies expand and markets shift.\n\nWhile stocks in each theme aren't direct recommendations, they offer a solid starting point. Leverage the Zacks Rank and other metrics to identify the best stocks for your strategy. Each featured stock comes with a Zacks report, giving you the tools to analyze performance and potential.\n\nFor those interested in viewing the Thematic lists, please click here >>> Thematic Screens – Zacks Investment Research.\n\nLet's take a closer look at the 'Wide Moat' theme and analyze a few stocks within.\n\nWide Moat Explained\n\nImagine investing in companies that not only lead their industries today but are also strategically fortified to dominate well into the future.\n\nThis is the essence of the \"wide moat\" investment theme, where businesses possess durable competitive advantages - dubbed moats - that shield them from competitors. Inspired by Warren Buffett's investment philosophy, this theme features companies with unique strengths such as brand recognition, patent protection, proprietary technology, and network effects.\n\nThese moats ensure long-term profitability and market leadership, making such companies resilient in volatile markets. Please click here for a direct link to the Wide Moat thematic list >>> Zacks Thematic Screens – Wide Moat.\n\nScreen Results\n\nLet's take a look at a few stocks that the screen provided.\n\n1.) Taiwan Semiconductor Manufacturing\n\nTaiwan Semiconductor, a current Zacks Rank #2 (Buy), has seen the revisions trend for its current fiscal year turn notably bullish. The company is the world's largest dedicated integrated circuit foundry.\n\nThe company has long been a favorite among income-focused investors who are also seeking chip exposure, carrying a 5.5% five-year annualized dividend growth rate. Shares have overall benefited nicely on the back of the semiconductor trade fueled by AI this year, up more than 60%.\n\nStory continues\n\n2.) UnitedHealth\n\nUnitedHealth, a current Zacks Rank #2 (Buy), provides a wide range of healthcare products and services, including health maintenance organizations, point-of-service plans, preferred provider organizations, and managed fee-for-service programs.\n\nShares have been red-hot over the last three months, gaining nearly 20% and driven by better-than-expected quarterly results. Concerning its latest release, the company exceeded both consensus earnings and sales expectations, with EPS growing 10% alongside a 6% sales increase.\n\nThe company's top line growth has been historically strong, as shown below. Please note that the final value is on a trailing twelve-month basis.\n\n3.) Lockheed Martin\n\nLockheed Martin, a current Zacks Rank #2 (Buy), is the largest defense contractor in the world. The company has long been a favorite among income-focused investors, underpinned by its 7.4% five-year annualized dividend growth rate.\n\nShares have been consistently strong over the last decade, gaining 330% compared to the S&P 500's 270% gain. On an annualized basis over the last decade, shares have averaged an impressive 15%.\n\nBottom Line\n\nZacks Thematic Screens lets you dive into 30 dynamic investment themes shaping the future. Whether you're interested in cutting-edge technology, renewable energy, or healthcare innovations, our themes help you invest in ideas that matter to you.\n\nFor those interested in viewing the Thematic lists, please click here >>> Thematic Screens – Zacks Investment Research.\n\nPlease click here for a direct link to the Wide Moat thematic list >>> Zacks Thematic Screens – Wide Moat\n\nWhy Haven't You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\n\nToday you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performancefor information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nUnitedHealth Group Incorporated (UNH) : Free Stock Analysis Report\n\nTaiwan Semiconductor Manufacturing Company Ltd. (TSM) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-114400824.html",
        "symbols": [
            "0R3E.LSE",
            "2330.TW",
            "GSPC.INDX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "TSFA.F",
            "TSFA.STU",
            "TSM.US",
            "TSMN.MX",
            "TSMWF.US",
            "UNH.F",
            "UNH.MU",
            "UNH.MX",
            "UNH.NEO",
            "UNH.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.011,
            "neu": 0.795,
            "pos": 0.193
        }
    },
    {
        "date": "2024-10-01T09:37:43+00:00",
        "title": "RTX Wins $1.3B Contract For F135 Engine Upgrade: Details",
        "content": "RTX Wins $1.3B Contract For F135 Engine Upgrade: Details\n\nOn Monday, RTX Corporation‘s (NYSE:RTX) business, Pratt & Whitney, won a contract worth up to $1.3 billion to advance the F135 Engine Core Upgrade (ECU).\n\nThe contract is expected to boost engine durability and enhance power and cooling for Block 4 and future F-35 capabilities.\n\nJill Albertelli, president of Pratt & Whitney’s Military Engines business, said, “It allows us to continue work in the risk reduction phase with a fully staffed team focused on design maturation, aircraft integration, and mobilizing the supply base to prepare for production.”\n\nJeff Shockey, senior vice president of RTX Global Government Relations, stated, “Their steadfast commitment to the F135 ensures it will deliver critical capabilities for decades to come.”\n\nTo date, Pratt & Whitney has delivered over 1,200 F135 engines, accumulating more than 900,000 flight hours.\n\nThe F135 ECU will be integrated into new F-35s during production or retrofitted at global F135 depot sustainment facilities, making it accessible to all F-35 operators.\n\nApart from this, RTX’s Raytheon delivered its first sensor payload to Lockheed Martin Corporation (NYSE:LMT), ensuring the U.S. Space Force’s Next-Generation Overhead Persistent Infrared (Next-Gen OPIR) Geosynchronous Earth Orbit (GEO) Block 0 missile warning satellite remains on schedule for its initial launch in 2025.\n\nInvestors can gain exposure to the stock via iShares U.S. Aerospace & Defense ETF (BATS:ITA) and First Trust Exchange-Traded Fund First Trust Indxx Aerospace & Defense ETF (NYSE:MISL).\n\nPrice Action: RTX shares are up 0.12% at $121.16 premarket at the last check Tuesday.\n\nRead Next:\n\nRussia To Expand Army For Third Time Since War With Ukraine Began: Defense Stocks RTX, Northrop Grumman Gain\n\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools. Click now to access unique insights that can set you ahead in today's competitive market.\n\nGet the latest stock analysis from Benzinga?\n\nRTX (RTX): Free Stock Analysis Report\n\nThis article RTX Wins $1.3B Contract For F135 Engine Upgrade: Details originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-wins-1-3b-contract-093743978.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "LMT.US",
            "MISL.US",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.985,
            "neg": 0.044,
            "neu": 0.817,
            "pos": 0.139
        }
    }
]