[
    {
        "date": "2024-06-24T22:00:19+00:00",
        "title": "Lockheed Martin (LMT) Increases Despite Market Slip: Here's What You Need to Know",
        "content": "The latest trading session saw Lockheed Martin (LMT) ending at $471.51, denoting a +0.84% adjustment from its last day's close. The stock outpaced the S&P 500's daily loss of 0.31%. Meanwhile, the Dow experienced a rise of 0.67%, and the technology-dominated Nasdaq saw a decrease of 1.09%.\n\nHeading into today, shares of the aerospace and defense company had gained 0.05% over the past month, outpacing the Aerospace sector's loss of 1.25% and lagging the S&P 500's gain of 2.73% in that time.\n\nInvestors will be eagerly watching for the performance of Lockheed Martin in its upcoming earnings disclosure. The company is forecasted to report an EPS of $6.45, showcasing a 4.16% downward movement from the corresponding quarter of the prior year. Our most recent consensus estimate is calling for quarterly revenue of $17.03 billion, up 2.04% from the year-ago period.\n\nFor the full year, the Zacks Consensus Estimates are projecting earnings of $26.26 per share and revenue of $69.72 billion, which would represent changes of -5.61% and +3.18%, respectively, from the prior year.\n\nFurthermore, it would be beneficial for investors to monitor any recent shifts in analyst projections for Lockheed Martin. These recent revisions tend to reflect the evolving nature of short-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.\n\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.\n\nThe Zacks Rank system, running from #1 (Strong Buy) to #5 (Strong Sell), holds an admirable track record of superior performance, independently audited, with #1 stocks contributing an average annual return of +25% since 1988. The Zacks Consensus EPS estimate remained stagnant within the past month. As of now, Lockheed Martin holds a Zacks Rank of #3 (Hold).\n\nDigging into valuation, Lockheed Martin currently has a Forward P/E ratio of 17.81. This represents a discount compared to its industry's average Forward P/E of 17.93.\n\nMeanwhile, LMT's PEG ratio is currently 4.39. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. As the market closed yesterday, the Aerospace - Defense industry was having an average PEG ratio of 1.78.\n\nThe Aerospace - Defense industry is part of the Aerospace sector. Currently, this industry holds a Zacks Industry Rank of 77, positioning it in the top 31% of all 250+ industries.\n\nStory continues\n\nThe Zacks Industry Rank assesses the strength of our separate industry groups by calculating the average Zacks Rank of the individual stocks contained within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nYou can find more information on all of these metrics, and much more, on Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-increases-despite-220019962.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.991,
            "neg": 0.009,
            "neu": 0.896,
            "pos": 0.095
        }
    },
    {
        "date": "2024-06-24T13:12:00+00:00",
        "title": "How a Texas Factory Is Emerging as a Key Ammo Supplier for the U.S., Ukraine",
        "content": "A General Dynamics facility slated to make artillery shells is part of the Pentagon’s $6 billion push to produce more munitions domestically.\n\nContinue reading\n\nView comments",
        "link": "https://finance.yahoo.com/m/de93cb84-a003-3086-8f45-0aacf35abf80/how-a-texas-factory-is.html",
        "symbols": [
            "012450.KO",
            "0IUC.LSE",
            "0R3E.LSE",
            "GD.MX",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.STU",
            "HRS.XETRA",
            "LHX.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.273,
            "neg": 0,
            "neu": 0.92,
            "pos": 0.08
        }
    },
    {
        "date": "2024-06-24T11:26:00+00:00",
        "title": "RTX Secures a Contract to Build AN/APY-10 Radar Systems",
        "content": "RTX Corp. RTX recently secured a contract involving its AN/APY-10 Radar Systems. The award has been offered by the Naval Air Systems Command, Patuxent River, MD.\n\nDetails of the Deal\n\nValued at $35 million, the contract is expected to be completed by September 2028. Per the terms of the deal, RTX will manufacture and supply 18 AN/APY-10 Radar Systems for the P-8A Poseidon aircraft.\n\nOf these 18 radars, 14 will be delivered to the government of Canada, three to Germany’s government and one to the U.S. Navy. Work related to this deal will be executed in McKinney, TX.\n\nRTX & Radars\n\nWith the rapid escalation of geopolitical tensions globally in recent times, nations across the globe have been significantly boosting their defense arsenal. Since radars constitute a vital part of this arsenal, escalation in defense spending has been boosting investments in radars as well.\n\nTo this end, it is imperative to mention that while radars have been in use since World War II for locating threats and targets, they are being used today for multiple purposes like ground surveillance, missile control, fire control, moving target indication, weapons location and vehicle search.\n\nThis must have been ushering in solid order flow for radar manufacturing companies like RTX in the form of contract wins like the latest one. Notably, RTX’s AN/APY-10 is a multi-mission maritime and overland surveillance radar developed for the Boeing P-8 Poseidon maritime patrol and surveillance aircraft. It is capable of performing long-range surface search and target tracking, periscope detection as well as ship imaging.\n\nRTX’s Growth Prospects\n\nThe demand for military radar systems has expanded manifold in recent times, driven by factors like the rise in defense spending of emerging economies, increase in regional tensions and inter-country conflicts that have boosted threats from missiles and aircraft.\n\nThis has set the stage for ample growth opportunities for the military radar market and must have prompted the Morder Intelligence firm to project a CAGR of 5.2% during 2024-2029 for the aforementioned market. Such growth projections bode well for prominent radar manufacturers like RTX.\n\nImpressively, RTX’s product portfolio consists of varied radars like integrated air and missile defense radars, ballistic missile radars, surveillance radars as well as air dominance radars. Radars like AN-TPY-2, APG-79, AN/SPY-6 and APG-82 are some of the company’s combat-proven products that enjoy solid demand in the global military radar market, apart from AN/APY-10.\n\nOpportunities for Peers\n\nRTX apart, other defense contractors that are major radar manufacturers and thus expected to benefit from the growth opportunities offered by the global military radar market are discussed below:\r\n\r\nLockheed Martin LMT: Its radars are the choice of more than 45 nations on six continents. The company’s product portfolio includes various radar systems like AN/APY-9 radar, airborne ground surveillance radar systems, AN/TPQ-53 radar systems, SPY-7, the long-range discrimination radar, FPS-117 and a few more.\r\n\r\nLockheed boasts a long-term earnings growth rate of 4.10%. The Zacks Consensus Estimate for 2024 earnings implies an improvement of 3.2% from the 2023 reported figure.\r\n\r\nL3Harris Technologies LHX: The company manufactures combat-proven radars like SPS-48, land-based surveillance radar, AN/APY-11 Multimode radar, Tactical Air Surveillance radar, AN/SPS-48G Long range 3D surveillance radar and many more.  Notably, its Vigilant family of software-defined, radar electronic support measures solutions is essential for survival and dominance in the electromagnetic threat environment of the modern battlefield.\n\nStory continues\n\nL3Harris boasts a long-term earnings growth rate of 9.2%. The Zacks Consensus Estimate for 2024 earnings implies an improvement of 9.4% from the 2023 reported figure.\n\nNorthrop Grumman NOC: As a pioneer in Active Electronically Scanned Array (AESA) radars, NOC has been at the forefront of AESA innovations for more than 60 years. Its diverse product portfolio includes a handful of other radars like the F-35 fire control radar and the Distributed Aperture System, the LONGBOW Fire Control Radar, the Scalable Agile Beam Radar, the APR-39 DV (2) digital radar warning receiver and a few more.\n\nNorthrop boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for 2024 sales implies an improvement of 4.6% from the 2023 reported figure.\n\nPrice Performance\n\nThe company’s shares have risen 12.4% in the past year against the industry’s decline of 8.4%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nRTX currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nL3Harris Technologies Inc (LHX) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-secures-contract-build-apy-112600778.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.XETRA",
            "LHX.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.043,
            "neu": 0.78,
            "pos": 0.176
        }
    },
    {
        "date": "2024-06-24T01:00:00+00:00",
        "title": "How a Texas Factory Will Become a Key Ammo Supplier for the U.S., Ukraine",
        "content": "A General Dynamics facility slated to make artillery shells is part of the Pentagon’s $6 billion push to produce more munitions domestically.\n\nContinue reading\n\nView comments",
        "link": "https://finance.yahoo.com/m/de93cb84-a003-3086-8f45-0aacf35abf80/how-a-texas-factory-will.html",
        "symbols": [
            "012450.KO",
            "0IUC.LSE",
            "0R3E.LSE",
            "GD.MX",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.STU",
            "LHX.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.273,
            "neg": 0,
            "neu": 0.92,
            "pos": 0.08
        }
    }
]