[
    {
        "date": "2024-08-22T20:01:21+00:00",
        "title": "U.S. Foreign Military Aid by Country: Top 20 Countries",
        "content": "This article looks at countries that receive the most US foreign military aid. You can skip our detailed analysis of how Washington has aided its allies amid security challenges in recent years, and head over directly to the U.S. Foreign Military Aid by Country: Top 5 Countries.\n\nGlobal military spending reached a record high of $2.44 trillion in 2023, having grown 6.8% compared to the year before. According to the Stockholm International Peace Research Institute (SIPRI), this is the biggest percentage spike in defense expenditure since 2009 and the ninth consecutive fiscal year during which military spending has increased.\n\nREAD ALSO: 15 Countries That Provided the Highest Military Aid to Ukraine and 25 Countries That Receive the Most Foreign Aid From the US.\n\nThe United States spent $916 billion on defense last year, representing 37.5% of the global military expenditure. The figure also amounted to 68% of NATO’s total defense bill during the year. A considerable portion of the overall spending from Washington went to providing military assistance to Ukraine in its war against Russia, and in aiding Israel as it advances against Hamas in the Gaza Strip. In April this year, President Biden signed into law a $95 billion war aid assistance package for Ukraine, Israel, Taiwan, and other countries in global hot spots. According to Reuters, much of this is expected to go into the procurement of pricey, advanced military equipment from aerospace and defense giants such as Lockheed Martin Corporation (NYSE:LMT), RTX Corporation (NYSE:RTX), The Boeing Company (NYSE:BA), Northrop Grumman Corporation (NYSE:NOC), and more.\n\nThe surge in global military spending amid the volatile situation in Europe and the Middle East has created a boom in the defense industry. Lockheed Martin Corporation (NYSE:LMT)’s share price has spiked 55% since Russia invaded Ukraine, from $361 in February 2022 to its current level of $558 per share, due to strong demand for its weapons, such as HIMARS, GMLRS, and the F-35. The company generated over $67 billion in revenues in 2023, of which an estimated 96% was defense-related. With no immediate end to the conflicts in sight, the stock is set to further strengthen. According to Insider Monkey, 47 hedge funds were bullish about Lockheed Martin Corporation (NYSE:LMT) during the first quarter of 2024.\n\nNorthrop Grumman Corporation (NYSE:NOC)’s shares have also soared 33% since the start of the Russia-Ukraine war. Last month, the company finalized a co-production agreement with a Ukrainian firm Ukroboronservice to manufacture medium-caliber ammunition in the country. Under the contract, Northrop Grumman Corporation (NYSE:NOC) will provide equipment and training to Ukroboronservice to establish an assembly line in the country to produce and test these weapons.\n\nOn the other hand, The Boeing Company (NYSE:BA) is currently working on a 2022 contract worth $927 million to deliver Israel's four KC-46A Pegasus aircraft in the next few years. The company also accelerated work on an order for 1,000 small-diameter bombs for Israel, under a contract signed in 2021, after Hamas launched an attack on Israel in October last year.\n\nRTX Corporation (NYSE:RTX) is flying high as well amid strong financial results. The company posted a revenue of $69 billion in 2023 and has made a robust start to the first half of the ongoing fiscal year. During the first quarter, it generated $19.3 billion in sales and an EPS of $1.34, which was 10% higher YoY. The company fared even better in the second quarter, registering a revenue of $19.8 billion and an EPS of $1.41.\n\nAnticipating a sustained demand for its weapons and other offerings, RTX Corporation (NYSE:RTX) has revised its full-year outlook with total revenue now forecast between $78.5 to $79.5 billion, up from the prior range of $78 to $79 billion. The company has also revised its EPS expectations to between $5.35 - $5.45, compared to $5.25 - $5.40 in the earlier quarter. It is one of the best defense stocks to buy right now. You can read about other top-performing stocks in the industry by heading over to the 10 Best Aerospace and Defense Stocks to Buy Now.\n\nWhile we acknowledge the potential of RTX Corporation (NYSE:RTX) as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than RTX Corporation (NYSE:RTX) but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock. U.S. Foreign Military Aid by Country: Top 20 Countries\n\nChameleonsEye / Shutterstock.com\n\nMethodology\n\nCountries that receive the most foreign military aid from the US are ranked in ascending order of the disbursements made by Washington under the peace and security category over the last five years, between 2019 and 2023. Data has been sourced from ForeignAssistance.gov, the US government website that makes foreign aid data available to the public.\n\nAt Insider Monkey we are obsessed with the stocks that hedge funds pile into. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points. (see more details here).\n\nLet’s now head over to the list of countries that receive the most foreign military aid from the United States.\n\nU.S. Foreign Military Aid by Country: Top 20 Countries\n\n20. Mexico\n\nForeign Military Aid from the US (2019-2023): $295 million\n\nMexico is a major recipient of American military aid to combat challenges such as organized crime and violence, drug trafficking, and poor law and order. Since 2008, Washington has disbursed over $3 billion worth of military assistance to its neighbor.\n\n19. Czech Republic\n\nForeign Military Aid from the US (2019-2023): $324 million\n\nThe United States has disbursed $324 million in military assistance to the Czech Republic over the last five years. Washington, in 2022, endorsed a $106 million package for Prague to modernize its armed forces and build a cyber response team within the military to counter Russian threats in the continent.\n\n18. Estonia\n\nForeign Military Aid from the US (2019-2023): $334 million\n\nEstonia is a Baltic country that borders Russia in the east. It is one of the largest recipients of American foreign military aid, with $334 million being disbursed by Washington over the last five years.\n\n17. Lithuania\n\nForeign Military Aid from the US (2019-2023): $339 million\n\nUS military assistance to Lithuania is aimed at enhancing the country’s capabilities in border security, hybrid warfare, and maritime and aerial territorial defense. As part of these efforts, Washington in March this year approved a $228 million military aid package for Lithuania, Estonia, and Latvia.\n\n16. Ecuador\n\nForeign Military Aid from the US (2019-2023): $350 million\n\nEcuador and the United States cooperate on addressing the challenges emanating from narcotrafficking and illegal armed groups that straddle the country’s border with Colombia. An estimated $350 million has been disbursed by the US as military aid to Ecuador since 2019.\n\n15. Poland\n\nForeign Military Aid from the US (2019-2023): $375 million\n\nPoland is an important US ally on NATO’s eastern flank. The country’s military is undergoing a major modernization program, which has been helped by American approval of the sale of key weapons, direct loan financing, and also military aid packages.\n\n14. Romania\n\nForeign Military Aid from the US (2019-2023): $397 million\n\nThe United States has provided $397 million in military assistance to Romania over the last five years, to enhance maritime security in the Black Sea and to counter the growing Russian influence in the region.\n\n13. Bulgaria\n\nForeign Military Aid from the US (2019-2023): $431 million\n\nBulgaria is one of the largest recipients of foreign military aid from the United States. The two countries signed a security partnership, the US-Bulgarian Defense Cooperation Agreement, under which Washington provides the country military assistance, and in exchange, the US gets access to military facilities in Bulgaria. During the last five years between 2019 and 2023, the European country received $431 million in military aid from the United States.\n\n12. Tunisia\n\nForeign Military Aid from the US (2019-2023): $471 million\n\nThe United States enjoys critical military relations with Tunisia and has disbursed $471 million since 2019 to the country. However, over the last couple of years, American aid to Tunisia has considerably dropped due to the country’s increasingly authoritarian drift under the current government.\n\n11. Pakistan\n\nForeign Military Aid from the US (2019-2023): $536 million\n\nHistorically, Pakistan has been one of the largest recipients of American aid – economic, military, and humanitarian. However, over the past decade, ties between the two countries have turned lukewarm, with the US even freezing military aid to the country in some instances over accusations of Islamabad harboring certain militant groups.\n\n10. Colombia\n\nForeign Military Aid from the US (2019-2023): $731 million\n\nColombia and the US closely cooperate in disrupting transnational criminal organizations, including narco terrorist groups. The US has disbursed $731 million in military assistance to the country since 2019 to strengthen peace, security, and law and order.\n\n9. Philippines\n\nForeign Military Aid from the US (2019-2023): $809 million\n\nThe Philippines has received over $800 million in military aid from the United States since 2019. Washington this year announced to provide Manila with another $500 million amid ongoing tensions with China in the region.\n\n8. Somalia\n\nForeign Military Aid from the US (2019-2023): $998 million\n\nThe United States is one of Somalia’s largest international donors. The American government has provided over $3 billion in the last decade to Mogadishu and other peacekeeping missions in the country. In January 2023, the US announced $9 million for Somalia to fight Al-Shabaab militants.\n\n7. Lebanon\n\nForeign Military Aid from the US (2019-2023): $1 billion\n\nThe United States is a key donor of Lebanon’s military. In January last year, the US government rerouted $72 million in aid for the Lebanese military and police to boost the wages of their personnel. The US has disbursed $1 billion in foreign military assistance to the Middle Eastern country over the last five years.\n\n6. Iraq\n\nForeign Military Aid from the US (2019-2023): $2.2 billion\n\nIraq is one of the largest receivers of American military assistance, with Washington having provided the country with over $2 billion in aid since 2019. The two countries enjoy a strategic security partnership, aimed at countering the ISIS threat in the region.\n\n5. Jordan\n\nForeign Military Aid from the US (2019-2023): $2.3 billion\n\nThe United States and Jordan cooperate on counterterrorism, border and maritime security, and cybersecurity. Washington disbursed $2.3 billion to the country between 2019 and 2023. The White House announced last year that it would provide Jordan with $1.45 billion in further aid between 2023 and 2029, with some funds being routed toward security needs as well.\n\n4. Ukraine\n\nForeign Military Aid from the US (2019-2023): $2.6 billion\n\nThe United States has approved a whopping $175 billion in financial, military, and humanitarian aid for Ukraine since Russia invaded the country in February 2022. According to aid-related data available to the public, $2.6 billion worth of funds have been disbursed to Kyiv to meet its military needs. This month, the US government announced $125 million in further fresh military assistance for the country.\n\n3. Afghanistan\n\nForeign Military Aid from the US (2019-2023): $6.1 billion\n\nSince the collapse of Ashraf Ghani’s regime to the Taliban in 2021, the US government has halted providing military assistance to Afghanistan. Despite that, it ranks among the top recipients of US military aid during the last five years due to a whopping $6.1 billion being disbursed between 2019 and 2021. In fact, between 2001 and 2021, Washington provided almost $73 billion in military aid to Kabul to fight the Taliban and other militant groups such as Al Qaeda and ISIS.\n\n2. Egypt\n\nForeign Military Aid from the US (2019-2023): $6.3 billion\n\nEgypt is one of the largest recipients of American assistance, with more than $50 billion provided by Washington to the country in military aid since 1978. This support has enhanced Egypt’s capabilities to defend its land and maritime borders from external threats, and to also be equipped well enough to face the emerging threats from terrorist groups, especially from those in the Sinai Peninsula.\n\n1. Israel\n\nForeign Military Aid from the US (2019-2023): $16.5 billion\n\nSince Israel’s founding in 1948, it has been the largest recipient of all foreign aid from the United States. According to a report in Al Jazeera, it has received over $300 billion in assistance, of which 74% has been military-related. During the last five years, Washington has disbursed over $16 billion in foreign military aid to Israel. Since the Netanyahu government’s order of invasion against Hamas in the Gaza Strip, the US government has approved the sale of weapons to Israel on a large scale and also provided heavy financial and military assistance.\n\nREAD NEXT: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n\nDisclosure: None. U.S. Foreign Military Aid by Country: Top 20 Countries was originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/u-foreign-military-aid-country-200121287.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.049,
            "neu": 0.854,
            "pos": 0.097
        }
    },
    {
        "date": "2024-08-22T17:16:00+00:00",
        "title": "Lockheed (LMT) Secures a Deal to Aid H-60 Black Hawk helicopters",
        "content": "Lockheed Martin Corp.’s LMT business unit, Sikorsky, recently clinched a contract to conduct configurations for various H-60 Black Hawk helicopters. Work related to this deal is expected to be completed by Aug 21, 2029.\n\nValued at $97.3 million, the contract has been awarded by the Army Contracting Command, Redstone Arsenal, AL.\n\nWhat Offers Lockheed an Edge?\n\nLockheed's H-60 fleet of Black Hawk multirole helicopters is a vital asset for the U.S. military and the armed forces of 34 other nations. Equipped with digital avionics, powerful GE engines, durable airframe structures and composite wide-chord rotor blades, the modern BLACK HAWK platform offers enhanced survivability and situational awareness. It also boasts the ability to fly higher and carry more than its predecessors.\n\nThe helicopter's advanced weapon system enables pilots to identify and engage both stationary and moving targets using forward-firing guns, rockets and laser-guided air-to-ground missiles.\n\nThese impressive features likely contribute to the strong order flow that Lockheed continues to receive, as seen in the latest contract.\n\nWith more than 4,000 BLACK HAWK aircraft of various types in service globally, the demand for Lockheed's H-60 helicopters remains robust in the combat helicopter market. This strong demand is expected to lead to more contract wins for Lockheed, like the latest one, potentially boosting revenue growth for its Sikorsky business unit in the near future.\n\nLMT’s Growth Prospects\n\nRecent advancements and the integration of new tactical, logistical, and essential features have significantly increased the prominence and demand for U.S. military helicopters. As a leading combat helicopter manufacturer, Lockheed is well-positioned to benefit from this trend, consistently securing helicopter delivery and service contracts from the Pentagon and U.S. allies. The recent contract award is a prime example of this success.\n\nLooking forward, escalating geopolitical tensions and cross-border conflicts worldwide are driving nations to boost defense spending on new aircraft and helicopters to strengthen their aerial capabilities. According to a report by the Mordor Intelligence firm, the military helicopters market is projected to witness a compound annual growth rate (CAGR) of 2.9% between 2024 and 2030.\n\nThis should significantly boost Lockheed’s performance, as the company enjoys a dominant position in the military helicopter market with its portfolio containing combat-proven programs like Black Hawk, MH-60R Seahawk, HH-60W Combat Rescue, CH-148 Cyclone, S-97 Raider and CH-53K King Stallion heavy-lift helicopters.\n\nStory continues\n\nOpportunities for Peers\n\nOther defense companies that should enjoy the perks of the expanding military helicopter market have been discussed below.\n\nBoeing BA: The company’s helicopters are renowned for their leading-edge, ready and relevant solutions that deliver proven capabilities. Boeing’s product portfolio includes combat helicopters and rotorcraft like CH-47 Chinook, AH-64 Apache, AH-6 Little Bird and V-22 Osprey.\n\nBoeing has a long-term (three to five years) earnings growth rate of 21.3%. The Zacks Consensus Estimate for BA’s third-quarter 2024 sales indicates an improvement of 2.5% from the prior-year quarter’s reported figure.\n\nAirbus Group EADSY: It is one of the world's largest suppliers of advanced military helicopters. Its product portfolio includes the H135 combat helicopter, the H145M helicopter, AS565 MBe Panther, H160M, H175M, H215M, H225M and a few more.\n\nAirbus’ long-term earnings growth rate is 13.9%. The consensus estimate for EADSY’s 2024 sales indicates an improvement of 7.2% from the 2023 reported figure.\n\nTextron TXT: Its Bell unit is one of the leading suppliers of helicopters to the U.S. government. In association with Boeing, this unit is the only supplier of military tiltrotor aircraft. Some of TXT’s key programs are AH-1Z helicopter, V-22 tiltrotor, V-247 and V280 aircraft.\n\nTextron boasts a long-term earnings growth rate of 10.1%. The Zacks Consensus Estimate for TXT’s 2024 sales indicates an improvement of 5.6% from the 2023 reported figure.\n\nPrice Movement\n\nIn the past year, shares of Lockheed have surged 21.8% against the industry’s decline of 2.3%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLockheed currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-secures-deal-aid-171600648.html",
        "symbols": [
            "0BOE.LSE",
            "0KVV.IL",
            "0LF0.LSE",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.029,
            "neu": 0.802,
            "pos": 0.168
        }
    },
    {
        "date": "2024-08-22T15:30:40+00:00",
        "title": "Why Is Lockheed (LMT) Up 7.5% Since Last Earnings Report?",
        "content": "A month has gone by since the last earnings report for Lockheed Martin (LMT). Shares have added about 7.5% in that time frame, outperforming the S&P 500.\n\nWill the recent positive trend continue leading up to its next earnings release, or is Lockheed due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recent earnings report in order to get a better handle on the important drivers.\n\nLockheed Beats on Q2 Earnings, Ups '24 Sales View\n\nLockheed Martin Corporation reported second-quarter 2024 adjusted earnings of $7.11 per share, which beat the Zacks Consensus Estimate of $6.45 by 10.2%. The bottom line also improved 5.6% from the year-ago quarter's recorded figure of $6.73.\n\nThe company reported GAAP earnings of $6.85 per share compared with $6.63 in the prior-year period.\n\nThe year-over-year bottom-line improvement can be attributed to solid sales growth and operating profit improvement from the second quarter of 2023.\n\nOperational Highlights\n\nNet sales were $18.12 billion, which surpassed the Zacks Consensus Estimate of $17.10 billion by 6%. The top line also increased 8.6% from $16.69 billion reported in the year-ago quarter.\n\nThe year-over-year top-line improvement can be attributed to sales growth from each of the four company segments.\n\nBacklog\n\nLMT’s backlog as of Jun 30, 2024, was $158.34 billion compared with $159.37 billion at the end of first-quarter 2024.\n\nOur model projected a backlog worth $179.34 billion for the second quarter.\n\nThe Aeronautics segment accounted for $53.03 billion of the total backlog amount, while Rotary and Mission Systems contributed $37.36 billion. The Missiles and Fire Control segment contributed $34.83 billion, while the Space unit accounted for $33.11 billion.\n\nSegmental Performance\n\nAeronautics: Sales improved 5.8% year over year to $7.28 billion. This was driven by sales growth from a higher volume on sustainment, development and production contracts for F-35 program, and ramped-up production of the F-16 program.\n\nThe segment’s operating profit improved 4.6% year over year to $751 million. The operating margin, however, contracted 10 basis points (bps) to 10.3%.\n\nMissiles and Fire Control: Quarterly sales improved a solid 12.6% year over year to $3.10 billion. This was on account of higher sales from tactical and strike missile programs, driven by a production ramp-up of Guided Multiple Launch Rocket Systems (“GMLRS”) and Long Range Anti-Ship Missile (“LRASM”) programs.\n\nThe segment’s operating profit increased 21.3% year over year to $450 million. The operating margin of 14.5% expanded 100 bps from the year-ago quarter’s level.\n\nStory continues\n\nSpace: Sales rose 0.9% year over year to $3.20 billion due to higher sales from strategic and missile defense programs, driven by higher volume of the hypersonics and Fleet Ballistic Missile (“FBM”) programs.\n\nThe segment’s operating profit rose 10.9% to $346 million. The operating margin expanded 90 bps to 10.8%.\n\nRotary and Mission Systems: Quarterly revenues improved 16.7% to $4.55 billion on a year-over-year basis. This was primarily driven by higher net sales from integrated warfare systems and sensors programs. Higher net sales from Sikorsky helicopter programs also aided this segment’s top line.\n\nThe segment’s operating profit rose 9% to $495 million in the reported quarter. The operating margin, however, deteriorated 70 bps to 10.9% in the said time frame.\n\nFinancial Condition\n\nLockheed’s cash and cash equivalents totaled $2.52 billion at the end of second-quarter 2024 compared with $1.44 billion at the end of 2023.\n\nCash from operating activities amounted to $3.51 billion as of Jun 31, 2024, compared with $2.66 billion in the year-ago period.\n\nLong-term debt as of Jun 30, 2024, totaled $19.12 billion, up from $17.29 billion as of Dec 31, 2023.\n\n2024 Guidance\n\nLockheed has partially raised its financial guidance for 2024. The company now expects to generate revenues in the range of $70.50-$71.50 billion, up from the prior guidance of $68.50-$70.00 billion. The Zacks Consensus Estimate for revenues is pegged at $69.80 billion, which lies below the company’s updated guided range.\n\nLMT currently expects 2024 earnings per share (EPS) to be in the range of $26.10-$26.60, up from the earlier guidance of $25.65-$26.35. The Zacks Consensus Estimate for the company’s full-year EPS is pinned at $26.20, lower than the mid-point of the company’s updated guidance.\n\nLockheed still expects to generate free cash flow in the range of $6.00-$6.30 billion and incur capital expenditures of $1.75 billion during 2024.\n\nHow Have Estimates Been Moving Since Then?\n\nIt turns out, estimates review flatlined during the past month.\n\nVGM Scores\n\nCurrently, Lockheed has a subpar Growth Score of D, however its Momentum Score is doing a bit better with a C. Following the exact same course, the stock was allocated a grade of C on the value side, putting it in the middle 20% for this investment strategy.\n\nOverall, the stock has an aggregate VGM Score of C. If you aren't focused on one strategy, this score is the one you should be interested in.\n\nOutlook\n\nLockheed has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/why-lockheed-lmt-7-5-153040429.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.019,
            "neu": 0.875,
            "pos": 0.106
        }
    }
]