[
    {
        "date": "2024-08-30T17:46:00+00:00",
        "title": "Top Stock Reports for NVIDIA, AT&amp;T &amp; Lockheed Martin",
        "content": "Friday, August 30, 2024\r\n\r\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including NVIDIA Corporation (NVDA), AT&T Inc. (T) and Lockheed Martin Corporation (LMT), as well as two micro-cap stocks Steel Partners Holdings L.P. (SPLP) and Natural Resource Partners L.P. (NRP). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\r\n\r\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\r\n\r\nYou can see all of today’s research reports here >>>\r\n\r\nNVIDIA shares have lost some ground following the beat-and-raise quarterly release on Wednesday, August 28th, with market participants seemingly shrugging the company's raised guidance. But this lack of stock market follow through for the shares could very well be a reflection of the stock's impressive gains over the past year rather than a comment on underlying busines trends.\n\nThe company is benefiting from the strong growth of artificial intelligence (AI), high-performance and accelerated computing. The data center end-market business is benefiting from the growing demand for generative AI and large language models using graphic processing units (GPUs) based on NVIDIA Hopper and Ampere architectures. \r\n\r\nA surge in hyperscale demand and higher sell-ins to partners across the Gaming and ProViz end markets following the normalization of channel inventory are acting as tailwinds. Collaborations with Mercedes-Benz and Audi are likely to advance its presence in the autonomous vehicles and other automotive electronics space. \r\n\r\nHowever, its near-term prospects are likely to be hurt by softening IT spending amid macroeconomic headwinds. The United States and China’s tit-for-tat trade war is also a major concern.\r\n\r\n(You can read the full research report on NVIDIA here >>>)\r\n\r\nShares of AT&T have outperformed the Zacks Wireless National industry over the year-to-date period (+23.4% vs. +21.7%). The company is expected to benefit from an integrated fiber expansion strategy that improves broadband connectivity, while steady 5G deployments are likely to boost end-user experience. The deployment of O-RAN architecture is likely to offer more flexibility, lower costs and monetize the network to reduce huge debt burden. \r\n\r\nWith a customer-centric business model, AT&T is witnessing healthy momentum in its postpaid wireless business with a lower churn rate and increased adoption of higher-tier unlimited plans. However, lower demand for legacy voice and data services is affecting revenues in the Business Wireline vertical. \r\n\r\nDeclining Mobility equipment sales are a concern. Fierce competition in a saturated wireless market will likely strain margins. A muted guidance for 2024 is worrisome while high debt burden remains a perennial problem.\r\n\r\n(You can read the full research report on AT&T here >>>)\r\n\r\nLockheed Martin shares have outperformed the Zacks Aerospace - Defense industry over the past year (+29.1% vs. +1.9%). The company’s broad product offerings allow it to secure major defense contracts, which in turn boosts its backlog count. Lockheed remains the largest U.S. defense contractor with a steady order flow from its leveraged presence in the Army, Air Force, Navy and IT programs. \r\n\r\nThe solid U.S. defense budgetary provisions should boost its business. Its products also witness a strong international demand from the countries like Germany, Taiwan, Japan and Australia. Meanwhile, the company also holds a strong solvency position. \r\n\r\nHowever, Lockheed is facing performance issues concerning some of its products that may affect its results. Shortage of skilled labor may adversely impact the company’s operating results. The sanctions imposed by China on Lockheed might also affect its business.\r\n\r\n(You can read the full research report on Lockheed Martin here >>>)\r\n\r\nShares of Steel Partners’ have declined -2.5% over the year-to-date period against the Zacks Diversified Operations industry’s decline of -7%. This microcap company with market capitalization of $795.34 million reported strong financial results in second-quarter 2024, with revenues growing 6.4% year over year to $533.2 million and a 113.2% surge in net income to $124.9 million.\r\n\r\nRevenues for the six months ended Jun 30, 2024 also increased by 6.7% to $1 billion. This growth reflects the company's effective diversification across its industrial and financial services segments. SPLP's operational efficiency is highlighted by a 15.7% adjusted EBITDA margin, up from 14.7% in second-quarter 2023. \r\n\r\nSteel Partners’ balance sheet is robust, with $256.4 million in cash and a $112-million debt reduction in the first half of 2024, enhancing financial stability. Investments in the Supply Chain segment, which saw 192% in revenues for the six months ended Jun 30, 2024, position SPLP for long-term growth, particularly as global supply chains evolve.\r\n\r\n(You can read the full research report on Steel Partners here >>>)\r\n\r\nNatural Resource Partners’ shares have declined -0.4% over the year-to-date period against the Zacks Coal industry’s decline of -2.4%. This microcap company with market capitalization of $1.13 billion faces significant risks from its heavy reliance on coal royalties, with metallurgical coal accounting for 75% of second-quarter 2024 coal royalty revenues. \r\n\r\nWeakened steel demand, particularly in China and Europe, is pressuring coal prices, potentially reducing NRP's cash flow. The secular decline in U.S. thermal coal demand, driven by environmental regulations and competition from natural gas, further threatens long-term revenues. \r\n\r\nAdditionally, a surge in Chinese soda ash production is depressing global prices, impacting NRP's profitability. Inflationary pressures, labor shortages, and high financing costs also pose challenges, while stringent environmental regulations and reliance on lessees increase operational risks. Overall, NRP's exposure to volatile coal markets and regulatory risks positions it in a challenging environment.\r\n\r\n(You can read the full research report on Natural Resource Partners here >>>)\r\n\r\nOther noteworthy reports we are featuring today include The Boeing Company (BA), The Sherwin-Williams Company (SHW) and MetLife, Inc. (MET).\r\n\r\n\r\nDirector of Research\r\n\r\nSheraz Mian\r\n\r\nNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\n\nToday's Must Read\n\nNVIDIA (NVDA) Rides on Strong Adoption of GPUs, Partnerships\n\nAT&T (T) Rides on Wireless Traction, Fiber Densification\n\nSolid Orders Growth Aids Lockheed (LMT), Amid Labor Shortage\n\nFeatured Reports\n\nAcquisitions and Cost Actions to Aid Sherwin-Williams (SHW) \r\nPer the Zacks analyst, the company's strategic acquisitions and cost-control initiatives will aid its performance amid headwinds from weak demand in Europe and China.\n\nStrategic Efforts Aid MetLife (MET), Pressure on EMEA Unit Ail\r\nPer the Zacks analyst, several acquisitions and partnerships will continue to bolster the capabilities and global presence of MetLife. Pressure on the EMEA segment is a concern.\n\nGrainger (GWW) Gains from Solid Volume Amid Cost Woes\r\nPer the Zacks analyst, Grainger is poised well to gain from the volume growth in its end markets. However, elevated costs and supply shortages will remain headwinds.\n\nBiogen's (BIIB) New Drugs Skyclarys & Others Can Revive Growth\r\nThe Zacks analyst believes Biogen's new products like Leqembi for Alzheimer's disease, Skyclarys for Friedreich's ataxia and Zurzuvae for depression can help revive growth in the long term\n\nTractor Supply's (TSCO) Strategic Efforts Appear Encouraging\r\nPer Zacks analyst, Tractor Supply is benefiting from its Life Out Here plan and Neighbor's Club program. Its 'ONETractor' strategy, aimed at connecting store and online shopping also is encouraging.\n\nDiverse Workforce Aids Interpublic (IPG), Seasonality Ails\r\nPer the Zacks analyst, creative and digital talent from diverse backgrounds increase Interpublic's organic growth. Seasonality has a major impact on its business in the first quarter.\n\nRising Loan Balance Aids BOK Financial (BOKF) Amid High Costs\r\nPer the Zacks analyst, BOK Financial's top line continues to benefit from rising loan and deposit balances. Yet, ongoing investments in technology are set to keep the bottom line under pressure.\n\nNew Upgrades\n\nRising Air Traffic Aids Boeing (BA), Labor Shortage Woes\r\nPer the Zacks analyst, improving air passenger traffic as well as increasing fiscal defense budget are expected to boost Boeing's growth. Yet shortage of skilled labor remains a concern.\n\nSolid Pipeline, Oncotype DX Growth Aid Exact Sciences (EXAS)\r\nThe Zacks analyst is impressed with Exact Sciences' key pipeline progress, including the next-generation Cologuard and Oncodetect MRD tests. International expansion of Oncotype DX looks promising.\n\nAXIS Capital (AXS) Set to Grow on Improved Portfolio Mix\r\nPer the Zacks analyst, AXIS Capital continues to build on Specialty Insurance, Reinsurance plus Accident and Health. Improved portfolio mix and effective capital deployment should pave way for growth.\n\nNew Downgrades\n\nProPetro (PUMP) Margins Pressured by Lower Activity\r\nThe Zacks analyst believes that declining rig counts and heightened competition has suppressed ProPetro Holding's margins and profitability by lowering utilization rates.\n\nUPS' Prospects Hurt by High Costs & Low Shipping Volumes\r\nHigh labor expenses at UPS bother the Zacks analyst. The shipping volume-related crisis represents another headwind.\n\nDull U.S. Retail Pharmacy Arm, High Cost Irk Walgreens (WBA)\r\nThe Zacks analyst is worried about Walgreen Boots' soft U.S. Retail Pharmacy arm steaming from an unfavorable consumer environment. Mounting costs and expenses are putting pressure on profitability.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nAT&T Inc. (T) : Free Stock Analysis Report\n\nThe Sherwin-Williams Company (SHW) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nMetLife, Inc. (MET) : Free Stock Analysis Report\n\nNatural Resource Partners LP (NRP) : Free Stock Analysis Report\n\nSteel Partners Holdings LP (SPLP): Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/top-stock-reports-nvidia-t-174600643.html",
        "symbols": [
            "0BOE.LSE",
            "0R3E.LSE",
            "1NVDA.MI",
            "ATTB34.SA",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.076,
            "neu": 0.777,
            "pos": 0.147
        }
    },
    {
        "date": "2024-08-30T16:27:00+00:00",
        "title": "Lockheed, Raytheon Secure $1.3 Billion Javelin Missile Contract",
        "content": "Lockheed Martin Corporation LMT and Raytheon, part of RTX Corporation RTX, have been awarded a $1.3 billion follow-on contract by the U.S. Army for Javelin missiles. These missiles have played a significant role in Ukraine's defense. This latest agreement, which builds on a larger contract from last year, could total up to $7.2 billion for an indefinite quantity of missiles between 2023 and 2026.\r\n\r\nThe companies have been increasing Javelin production to meet rising demand and aim to achieve an annual manufacturing capacity of around 4,000 missiles by 2026. The new contract includes the production of more than 4,000 Javelins, mainly to replenish Javelin missile stock that has been sent to support Ukraine.\n\nIncreasing Usage of LMT and RTX’s Javelin Missiles\n\nThe joint venture (JV) between Lockheed Martin and Raytheon is a powerful alliance in the defense industry. These two defense companies have collaborated on various defense projects, with the Javelin missile system being one of their most successful projects. This JV brings together LMT’s extensive experience in missile production and Raytheon’s advanced technology in defense systems, thereby enabling it to meet the U.S. Army's requirements.\r\n\r\nThe Javelin missile is a versatile, shoulder-fired weapon system known for its precision and effectiveness on the battlefield. It automatically guides itself to the target after launch, allowing the gunner to take cover and avoid counterfire. Soldiers or marines using the missile can reposition immediately after firing, or reload to engage another threat. It has been widely used by U.S. forces and allied nations and is currently utilized in Ukraine. The missile’s ability to engage multiple targets, including tanks and fortified positions, has made it an essential tool for modern warfare.\n\nLMT’s Growth Prospects\n\nLockheed Martin secures major defense contracts with a steady order flow from its leveraged presence in the Army, Air Force, Navy and IT programs. Its total backlog was a solid $158.34 billion as of June 30, 2024. The company continues to win defense contracts and support the defense departments of the United States and other allied nations.\r\n\r\nThe global defense sector is seeing strong growth driven by rising geopolitical tensions and the need for advanced military capabilities. The demand for U.S. weaponry, including shoulder-mounted Javelin systems is on the rise, which will further boost LMT’s performance.\n\nProspects of LMT’s Defense Peers\n\nOther defense companies that are likely to enjoy the perks of the expanding defense market have been discussed below.\r\n\r\nNorthrop Grumman Corporation NOC develops and builds some of the world’s most advanced missile defense technology, from command systems to directed energy weapons, advanced munitions and powerful sensors.\r\n\r\nNorthrop Gruman has a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales indicates year-over-year growth of 5.4%.\r\n\r\nGeneral Dynamics Corporation GD is a manufacturer and integrator of land solutions including wheeled and tracked combat vehicles, weapon systems and munitions.\r\n\r\nGeneral Dynamics has a long-term earnings growth rate of 12.6%. The consensus estimate for GD’s 2024 sales indicates year-over-year growth of 13.5%.\n\nStory continues\n\nLMT’s Stock Price Movement\n\nShares of LMT have gained 21.4% in the past three months, compared with the industry’s 5.6% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLMT’s Zacks Rank\n\nLMT currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-raytheon-secure-1-3-162700684.html",
        "symbols": [
            "0IUC.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "GD.MX",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.043,
            "neu": 0.764,
            "pos": 0.193
        }
    },
    {
        "date": "2024-08-30T14:19:24+00:00",
        "title": "Lockheed, Raytheon Venture Lands $1.3 Billion Missile Contract",
        "content": "The Javelin Joint Venture (JJV) is a partnership between Raytheon and Lockheed Martin responsible for making some 50,000 Javelin missiles and more than 12,000 reusable Command Launch Units.\n\nYesterday, the U.S. Army awarded JJV a $1.3 billion contract for Javelin missiles and associated equipment and services. The deal is the largest single-year Javelin production contract to date, and the first follow-on award that is a part of an indefinite-delivery, indefinite-quantity (IDIQ) production contract initially awarded in May 2023.\n\nMost Read on IEN:\n\n2 Former Union Presidents Among 7 Indicted in Boilermaker Scheme Boeing Workers Angry as NASA Switches to SpaceX Lax FAA Oversight Blamed for Deadly Military Helicopter Crash $3M Hypercar Prototype Crashes During Test\n\nThe contract will procure Javelin weapon systems and production support for the U.S. Army. Last year, the JJV started ramping up production to increase Javelin All Up Round (AUR) production to 3,960 per year by late 2026.\n\nWith more than 25 international customers worldwide, the contract supports Javelin’s increased global demand, including new international customer Kosovo. The contract also includes more than 4,000 Javelins to replenish rounds sent to Ukraine.\n\nClick here to subscribe to our daily newsletter featuring breaking manufacturing industry news.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-raytheon-venture-lands-1-141924120.html",
        "symbols": [
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.791,
            "neg": 0.059,
            "neu": 0.844,
            "pos": 0.096
        }
    },
    {
        "date": "2024-08-30T13:46:25+00:00",
        "title": "Lockheed Martin Resumes Delivery Of F-35 Jets, But US Government To Withhold Some Payment Putting Profit Margins Under Pressure",
        "content": "Lockheed Martin Resumes Delivery Of F-35 Jets, But US Government To Withhold Some Payment Putting Profit Margins Under Pressure\n\nLockheed Martin Corporation (NYSE:LMT) has resumed deliveries of the F-35 jets to the U.S. military after a months-long pause, but the U.S. government is withholding the final $5 million payment per jet until a long-delayed technology upgrade, known as Technology Refresh 3 (TR-3), is fully implemented.\n\nThe delay in the TR-3 upgrade has prompted the U.S. government to withhold a portion of the payment for each jet.\n\nThe TR-3 upgrade includes essential software and hardware improvements, such as enhanced displays, increased computer memory, and improved processing power, all critical to the jet’s combat capabilities.\n\nAlthough the deliveries have resumed, the withheld funds will significantly impact Lockheed Martin’s profit margins, the Reuters report notes.\n\nThe company, which derives 27% of its sales from the F-35 program, is under pressure to resolve the issue.\n\nThe report adds that Lockheed Martin indicates that it may take several more months to complete the necessary upgrades.\n\nDespite the current challenges, Lockheed Martin plans to deliver approximately 100 F-35 jets to the U.S. military this year, with a target of over 150 deliveries in 2025.\n\nThe most common F-35A variant costs an average of $82.5 million per unit for deliveries scheduled in 2023, 2024, and 2025.\n\nThe F-35B, designed for short takeoff and landing, and the F-35C, optimized for aircraft carriers, are priced at $109 million and $102.1 million, respectively.\n\nOn a recent earnings call, Lockheed Martin CEO Jim Taiclet emphasized the importance of the F-35 program, noting that the first TR-3-configured aircraft had been delivered and that the company expects to meet its 2024 delivery goals of 75 to 110 jets.\n\nHowever, the company has acknowledged that it could take 12 to 18 months to deliver the backlog of F-35s that were parked due to the delivery pause.\n\nThe F-35 program, known for its stealth capabilities, has faced multiple delays and production issues over the years, but it remains a top priority for Lockheed Martin and the U.S. military.\n\nPrice Action: LMT stock was trading higher by 0.20% to $568.01 at the last check on Friday.\n\nDisclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n\nRead Next:\n\nShell Considers Job Cuts In Oil And Gas Workforce: Report.\n\nPhoto courtesy: Lockheed Martin\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nStory continues\n\nLOCKHEED MARTIN (LMT): Free Stock Analysis Report\n\nThis article Lockheed Martin Resumes Delivery Of F-35 Jets, But US Government To Withhold Some Payment Putting Profit Margins Under Pressure originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-resumes-delivery-f-134625756.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.983,
            "neg": 0.05,
            "neu": 0.852,
            "pos": 0.098
        }
    },
    {
        "date": "2024-08-30T11:37:29+00:00",
        "title": "Here's What We Like About Lockheed Martin's (NYSE:LMT) Upcoming Dividend",
        "content": "Readers hoping to buy Lockheed Martin Corporation (NYSE:LMT) for its dividend will need to make their move shortly, as the stock is about to trade ex-dividend. The ex-dividend date is usually set to be one business day before the record date which is the cut-off date on which you must be present on the company's books as a shareholder in order to receive the dividend. The ex-dividend date is important because any transaction on a stock needs to have been settled before the record date in order to be eligible for a dividend. In other words, investors can purchase Lockheed Martin's shares before the 3rd of September in order to be eligible for the dividend, which will be paid on the 27th of September.\n\nThe company's next dividend payment will be US$3.15 per share, and in the last 12 months, the company paid a total of US$12.60 per share. Looking at the last 12 months of distributions, Lockheed Martin has a trailing yield of approximately 2.2% on its current stock price of US$566.85. Dividends are a major contributor to investment returns for long term holders, but only if the dividend continues to be paid. So we need to check whether the dividend payments are covered, and if earnings are growing.\n\nView our latest analysis for Lockheed Martin\n\nDividends are typically paid out of company income, so if a company pays out more than it earned, its dividend is usually at a higher risk of being cut. That's why it's good to see Lockheed Martin paying out a modest 45% of its earnings. Yet cash flow is typically more important than profit for assessing dividend sustainability, so we should always check if the company generated enough cash to afford its dividend. Thankfully its dividend payments took up just 44% of the free cash flow it generated, which is a comfortable payout ratio.\n\nIt's encouraging to see that the dividend is covered by both profit and cash flow. This generally suggests the dividend is sustainable, as long as earnings don't drop precipitously.\n\nClick here to see the company's payout ratio, plus analyst estimates of its future dividends. historic-dividend\n\nHave Earnings And Dividends Been Growing?\n\nStocks in companies that generate sustainable earnings growth often make the best dividend prospects, as it is easier to lift the dividend when earnings are rising. If business enters a downturn and the dividend is cut, the company could see its value fall precipitously. With that in mind, we're encouraged by the steady growth at Lockheed Martin, with earnings per share up 9.8% on average over the last five years. The company is retaining more than half of its earnings within the business, and it has been growing earnings at a decent rate. We think this is generally an attractive combination, as dividends can grow through a combination of earnings growth and or a higher payout ratio over time.\n\nThe main way most investors will assess a company's dividend prospects is by checking the historical rate of dividend growth. Lockheed Martin has delivered 9.0% dividend growth per year on average over the past 10 years. It's encouraging to see the company lifting dividends while earnings are growing, suggesting at least some corporate interest in rewarding shareholders.\n\nTo Sum It Up\n\nIs Lockheed Martin an attractive dividend stock, or better left on the shelf? Earnings per share growth has been growing somewhat, and Lockheed Martin is paying out less than half its earnings and cash flow as dividends. This is interesting for a few reasons, as it suggests management may be reinvesting heavily in the business, but it also provides room to increase the dividend in time. It might be nice to see earnings growing faster, but Lockheed Martin is being conservative with its dividend payouts and could still perform reasonably over the long run. There's a lot to like about Lockheed Martin, and we would prioritise taking a closer look at it.\n\nIn light of that, while Lockheed Martin has an appealing dividend, it's worth knowing the risks involved with this stock. For example - Lockheed Martin has 2 warning signs we think you should be aware of.\n\nA common investing mistake is buying the first interesting stock you see. Here you can find a full list of high-yield dividend stocks.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/heres-lockheed-martins-nyse-lmt-113729954.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.022,
            "neu": 0.816,
            "pos": 0.162
        }
    }
]