[
    {
        "date": "2024-08-19T12:11:00+00:00",
        "title": "Lockheed Martin (LMT) Set to Purchase Terran Orbital for $450M",
        "content": "Lockheed Martin Corp. LMT recently signed a contract to acquire a manufacturer of satellite products, Terran Orbital. The acquiree offers satellite-based solutions that serve the aerospace and defense industry.\r\n\r\nThe acquisition has an estimated enterprise value of $450 million. For each outstanding share of common stock, Lockheed Martin will pay 25 cents in cash to purchase Terran Orbital and pay off its current debt. The buyout is expected to be completed in the fourth quarter of 2024.\n\nBenefits of the Acquisition\n\nTerran Orbital’s acquisition is expected to further strengthen Lockheed Martin’s footprint in the aerospace and defense industry, particularly in space systems, wherein LMT already enjoys a strong presence. Terran Orbital’s end-to-end satellite solutions, combining satellite design, production, launch planning, mission operations and on-orbit support to meet the needs of the most demanding military, civil and commercial customers, are aligned with LMT’s value generation approach.\r\n\r\nThe aforementioned factors will provide Lockheed Martin with an opportunity to expand its customer base, enhance its product offerings and increase its market share in the satellite-based solutions business area.\n\nOverall, the acquisition is likely to be instrumental to LMT’s growth in the satellite product space and broaden its product portfolio, which should bolster its revenue-generation prospects.\n\nWhat’s Driving Acquisitions Among Aerospace Defense Players?\n\nThe military industry has seen a notable rise in mergers and acquisitions recently due to several factors like the growing emphasis on cost-reduction initiatives, diversifying their portfolio to tackle competition and achieving economies of scale, along with operational efficiency to attain long-term goals. These transactions are becoming more significant, allowing businesses to grow as they see fit by expanding their operations, gaining access to new skills, developing technologies and ultimately producing higher-quality goods and services as well as capturing larger market shares.\r\n\r\nLockheed Martin’s latest decision to acquire Terran Orbital also seems to have been motivated by the aforementioned factors.\n\nPeer Moves\n\nApart from Lockheed Martin, defense companies that have recently indulged in valuable acquisition deals are as follows:\r\n\r\nIn March 2024, Teledyne Technologies TDY agreed to acquire Valeport Holdings 2019 Limited and its affiliates, a designer and manufacturer of underwater sensors for environmental, energy, construction and defense applications. This buyout should boost TDY’s Marine technology offerings.\r\n\r\nThe company has a long-term (three to five years) earnings growth rate of 7.3%. It delivered an average earnings surprise of 3.47% in the last four quarters.\r\n\r\nIn May 2024, TransDigm Group, Inc. TDG agreed to acquire Raptor Scientific for $655 million, a manufacturer of complex test and measurement solutions primarily serving the aerospace and defense end markets. Through this acquisition, TDG should be able to provide a wider range of products and gain a larger market share in the highly engineered aviation components industry.\r\n\r\nTransDigm Group has a long-term earnings growth rate of 20.7%. The Zacks Consensus Estimate for its fiscal 2024 sales calls for an improvement of 19.4% from the prior-year figure.\r\n\r\nIn April 2024, Curtiss-Wright Corporation CW completed the acquisition of WSC, Inc. for $34 million. The buyout is expected to expand Curtiss-Wright’s portfolio of advanced commercial nuclear technologies utilized in the modernization of existing power plants and the design of new power plants, such as Advanced Small Modular Reactors.\r\n\r\nThe Zacks Consensus Estimate for CW’s 2024 sales implies an improvement of 6.9% from the prior-year figure. The company boasts a four-quarter earnings surprise of 11.52%, on average.\n\nStory continues\n\nPrice Movement\n\nIn the past three months, shares of Lockheed Martin have risen 19.9% compared with the industry’s growth of 3.1%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLMT currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTransdigm Group Incorporated (TDG) : Free Stock Analysis Report\n\nTeledyne Technologies Incorporated (TDY) : Free Stock Analysis Report\n\nCurtiss-Wright Corporation (CW) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-set-purchase-121100741.html",
        "symbols": [
            "0R3E.LSE",
            "0REK.LSE",
            "CW.US",
            "CWT.F",
            "CWT.STU",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "T7D.BE",
            "T7D.F",
            "T7D.STU",
            "TDG.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.012,
            "neu": 0.802,
            "pos": 0.185
        }
    }
]