[
    {
        "date": "2024-08-01T21:27:00+00:00",
        "title": "Aerospace &amp; Defense ETFs to Track Amid Q2 Earnings",
        "content": "The uptrend in theAerospace & Defense industry is mapped by the performance of the S&P Aerospace & Defense Select Industry Index, which has added 20.56% over the past year, surpassing the S&P 500's 20.34% gain in the same period. With escalating geopolitical tensions, the global aerospace and defense sector is poised to witness significant growth in the coming years.\n\nAccording to Statista, global military spending amounted to $2.44 trillion in 2023, with the Unites States accounting for about 40% of the global spending. U.S. military spending is projected to increase annually, highlighting growth opportunities in the sector.\n\nBelow, we highlight Q1 earnings results of a few renowned U.S. Aerospace – Defense Industry players.\n\nNorthrop Grumman\n\nNorthrop Grumman NOC reported second-quarter 2024 earnings of $6.36 per share, which beat the Zacks Consensus Estimate of $5.95 by 6.9%. The bottom line increased 19.1% from $5.34 recorded in the year-ago quarter, driven by an increase in operating income and sales.\n\nNOC’s total sales of $10.22 billion beat the Zacks Consensus Estimate of $10.07 billion by 1.4%. The top line increased 6.7% from $9.58 billion reported in the year-ago quarter, driven by robust segmental sales growth. The company’s operating income during the quarter totaled $1.09 billion, up 13% from $967 million in the prior-year quarter.\n\nThe company partially raised its 2024 guidance, projecting revenues in the range of $41-$41.40 billion and adjusted earnings in the band of $24.90-$25.30 per share. Shares of NOC have gained about 10% over the past two weeks (as of Aug 1).\n\nRTX Corporation\n\nRTX Corporation RTX reported second-quarter 2024 adjusted EPS of $1.41, which beat the Zacks Consensus Estimate of $1.29 by 9.3%. The bottom line also improved 9.3% from the year-ago quarter’s level of $1.29.\n\nRTX’s first-quarter net sales totaled $19.72 billion, which surpassed the Zacks Consensus Estimate of $19.31 billion by 2.2%. The top line also improved 7.7% from $18.31 billion recorded in the second quarter of 2023, driven by higher segmental sales growth. RTX posted an adjusted operating profit of $2.56 billion, up 14.1% from the year-ago quarter’s reported figure.\n\nRTX updated its guidance for 2024, with projected adjusted EPS in the band of $5.35-$5.45 and sales of $78.75-$79.50 billion. Shares of RTX have gained about 13% over the past two weeks (as of Aug 1).\n\nGeneral Dynamics\n\nGeneral Dynamics GD reported second-quarter 2024 EPS of $3.26, which missed the Zacks Consensus Estimate of $3.30 by 1.2%. However, the figure increased 20.7% from $2.70 per share recorded in the year-ago quarter, driven by sales growth as well as an improvement in operating earnings.\n\nStory continues\n\nGD’s revenues of $11.98 billion in the reported quarter beat the Zacks Consensus Estimate of $11.52 billion by 3.9%. The top line showed an impressive improvement of 18% from the prior-year reported figure, driven by increased segmental revenues. GD’s operating earnings totaled $1.16 billion, up 20.2% from the year-ago quarter’s $962 million.\n\nThe long-term debt (as of Jun 30, 2024) was $7.26 billion, down from the 2023-end level of $8.75 billion. General Dynamics recorded a total backlog of $91.30 billion, down from the first-quarter level of $93.73 billion. The funded backlog at the end of the reported quarter was $74.41 billion.\n\nShares of GD have gained about 1.8% over the past two weeks (as of Aug 1).\n\nLockheed Martin\n\nLockheed Martin LMT reported second-quarter 2024 adjusted earnings of $7.11 per share, which beat the Zacks Consensus Estimate of $6.45 by 10.2%. The bottom line improved 5.6% from the year-ago quarter's recorded figure of $6.73.\n\nNet sales were $18.12 billion, which surpassed the Zacks Consensus Estimate of $17.10 billion by 6%. The top line also increased 8.6% from $16.69 billion reported in the year-ago quarter, driven by segmental revenue sales growth.\n\nLockheed has partially raised its financial guidance for 2024, expecting revenues in the range of $70.50-$71.50 billion. The company also continues to project EPS in the range of $26.10-$26.60. Shares of LMT have gained about 14% over the past two weeks (as of Aug 1).\n\nETFs in Focus\n\nFor investors looking to take a bet on Q2 results as well as a continued surge in military spending, the following Aerospace – Defense ETFs provide a great opportunity.\n\niShares U.S. Aerospace & Defense ETF ITA has gained 14.23% over the past year and 8.8% over the past month.\n\nInvesco Aerospace & Defense ETF PPA has gained 22.23% over the past year and 7.2% over the past month.\n\nSPDR S&P Aerospace & Defense ETF XAR has gained 15.85% over the past year and 8.4% over the past month.\n\nGlobal X Defense Tech ETF SHLD has gained 0.12% over the past three months and 7.60% over the past month.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nGlobal X Defense Tech ETF (SHLD): ETF Research Reports\n\niShares U.S. Aerospace & Defense ETF (ITA): ETF Research Reports\n\nInvesco Aerospace & Defense ETF (PPA): ETF Research Reports\n\nSPDR S&P Aerospace & Defense ETF (XAR): ETF Research Reports\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/aerospace-defense-etfs-track-amid-212700503.html",
        "symbols": [
            "0IUC.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "GD.MX",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.008,
            "neu": 0.817,
            "pos": 0.176
        }
    },
    {
        "date": "2024-08-01T13:40:12+00:00",
        "title": "Are Aerospace Stocks Lagging  Leidos (LDOS) This Year?",
        "content": "Investors interested in Aerospace stocks should always be looking to find the best-performing companies in the group. Leidos (LDOS) is a stock that can certainly grab the attention of many investors, but do its recent returns compare favorably to the sector as a whole? A quick glance at the company's year-to-date performance in comparison to the rest of the Aerospace sector should help us answer this question.\n\nLeidos is one of 46 companies in the Aerospace group. The Aerospace group currently sits at #8 within the Zacks Sector Rank. The Zacks Sector Rank includes 16 different groups and is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors.\n\nThe Zacks Rank is a proven system that emphasizes earnings estimates and estimate revisions, highlighting a variety of stocks that are displaying the right characteristics to beat the market over the next one to three months. Leidos is currently sporting a Zacks Rank of #2 (Buy).\n\nOver the past 90 days, the Zacks Consensus Estimate for LDOS' full-year earnings has moved 1.2% higher. This shows that analyst sentiment has improved and the company's earnings outlook is stronger.\n\nBased on the most recent data, LDOS has returned 33.4% so far this year. At the same time, Aerospace stocks have gained an average of 3.3%. This means that Leidos is performing better than its sector in terms of year-to-date returns.\n\nAnother stock in the Aerospace sector, Lockheed Martin (LMT), has outperformed the sector so far this year. The stock's year-to-date return is 19.6%.\n\nIn Lockheed Martin's case, the consensus EPS estimate for the current year increased 2.3% over the past three months. The stock currently has a Zacks Rank #2 (Buy).\n\nLooking more specifically, Leidos belongs to the Aerospace - Defense industry, which includes 22 individual stocks and currently sits at #65 in the Zacks Industry Rank. On average, stocks in this group have lost 1.7% this year, meaning that LDOS is performing better in terms of year-to-date returns. Lockheed Martin is also part of the same industry.\n\nInvestors interested in the Aerospace sector may want to keep a close eye on Leidos and Lockheed Martin as they attempt to continue their solid performance.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLeidos Holdings, Inc. (LDOS) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/aerospace-stocks-lagging-leidos-ldos-134012345.html",
        "symbols": [
            "0R3E.LSE",
            "L1DO34.SA",
            "LDOS.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "S6IA.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.018,
            "neu": 0.848,
            "pos": 0.134
        }
    },
    {
        "date": "2024-08-01T10:24:00+00:00",
        "title": "The Zacks Analyst Blog Highlights Toyota Motor, Lockheed Martin, Chubb and Pro-Dex",
        "content": "For Immediate Release\n\nChicago, IL – August 1, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Toyota Motor Corp. TM, Lockheed Martin Corp. LMT, Chubb Ltd. CB and Pro-Dex, Inc. PDEX.\n\nHere are highlights from Wednesday’s Analyst Blog:\n\nTop Stock Reports for Toyota, Lockheed Martin and Chubb\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Toyota Motor Corp., Lockheed Martin Corp. and Chubb Ltd., as well as a micro-cap stock Pro-Dex, Inc. The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\r\n\r\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\r\n\r\nYou can see all of today’s research reports here >>>\r\n\r\nToyota Motor’s shares have outperformed the Zacks Automotive - Foreign industry over the past year (+12.4% vs. -11.1%). The company’s robust lineup of trucks and sport utility vehicles is set to fuel sales. To capitalize on the global shift to environment-friendly vehicles, the auto giant is deepening its focus on manufacturing electric and hydrogen fuel-cell vehicles, which will bolster the company’s product competitiveness.\r\n\r\nToyota Motor aims to expand global sales of BEVs to 1.5 million units in 2026 and 3.5 million units a year by 2030. Toyota’s commitment to maximize shareholders value via dividends and buyback is also praiseworthy.\r\n\r\nHowever, labor cost inflation is expected to continue to weigh on margins. Rising debt levels, along with high R&D expenses and capex, are set to play spoilsport. Also, Toyota expects sales in Japan to decrease, given the lower shipments of Daihatsu. Thus, the stock warrants a cautious stance now.\r\n\r\n(You can read the full research report on Toyota here >>>)\r\n\r\nShares of Lockheed Martin have outperformed the Zacks Aerospace - Defense industry over the past year (+19.1% vs. -4.4%). The company ended second-quarter 2024 on a solid note, with both its earnings and revenues surpassing their respective Zacks Consensus Estimate. Its broad product offerings allow it to secure major defense contracts, which, in turn, boosts its backlog count.\r\n\r\nLockheed remains the largest U.S. defense contractor with a steady order flow from its leveraged presence in the Army, Air Force, Navy and IT programs. The solid U.S. defense budgetary provisions should boost its business. Its products also witness a strong international demand.\r\n\r\nHowever, Lockheed is facing performance issues concerning some of its products that may affect its results. Shortage of skilled labor may adversely impact Lockheed’s operating results. The sanctions imposed by China on Lockheed might also affect its business.\r\n\r\n(You can read the full research report on Lockheed Martin here >>>)\r\n\r\nChubb’s shares have outperformed the Zacks Insurance - Property and Casualty industry over the past year (+36.2% vs. +25.2%). The company’s suite of compelling products as well as services, focus on capitalizing on the potential of middle-market businesses and investments in various strategic initiatives pave the way for long-term growth.\r\n\r\nSeveral distribution agreements have expanded its network, boosting its market presence. An impressive inorganic growth story helps to achieve a higher long-term return on equity. Chubb expects adjusted net investment income to be in the range of $1.57 billion to $1.63 billion per quarter in 2024.\r\n\r\nChubb boasts a strong capital position with sufficient cash generation capabilities that ensure steady payouts to investors. Second quarter EPS beat estimates. However, exposure to catastrophe loss induces underwriting volatility. Escalating expenses weigh on margin expansion.\r\n\r\n(You can read the full research report on Chubb here >>>)\r\n\r\nShares of Pro-Dex have outperformed the Zacks Medical - Dental Supplies industry over the past year (+12.9% vs. -1.7%). This microcap company with market capitalization of $69.48 million has demonstrated strong financial performance, with net sales increasing 10% year over year to $38.8 million for the nine months ended Mar 31, 2024, reflecting robust demand.\r\n\r\nThe acquisition of a new 25,000 sq. ft. manufacturing facility in Tustin, CA, boosts production capacity and supports future growth. Strategic alliances, such as a supply agreement with Monogram Orthopaedics, enhance market reach and revenue potential. Pro-Dex's strong balance sheet, with $3.2 million in cash and $5.2 million in operating cash flow, ensures financial stability.\r\n\r\nStrong customer relationships, with repeat business from major customers accounting for 85% of net sales, provide a stable revenue stream. However, customer concentration risk, limited market diversification, high operating expenses and competitive pressures are notable headwinds.\r\n\r\n(You can read the full research report on Pro-Dex here >>>)\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nToyota Motor Corporation (TM) : Free Stock Analysis Report\n\nChubb Limited (CB) : Free Stock Analysis Report\n\nPro-Dex, Inc. (PDEX): Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-toyota-102400829.html",
        "symbols": [
            "0R3E.LSE",
            "7203.TSE",
            "C1BL34.SA",
            "CB.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "TM.US",
            "TMCO34.SA",
            "TMN.MX",
            "TOM.F",
            "TOMA.F",
            "TOMA.STU",
            "TOYOF.US",
            "TYT.LSE"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.036,
            "neu": 0.836,
            "pos": 0.128
        }
    },
    {
        "date": "2024-08-01T09:53:00+00:00",
        "title": "Zacks.com featured highlights Best Buy, AES, Lockheed Martin, PulteGroup and Banco de Chile",
        "content": "For Immediate Release\n\nChicago, IL – August 1, 2024 – Stocks in this week’s article are Best Buy Co., Inc. BBY, The AES Corp. AES, Lockheed Martin Corp. LMT, PulteGroup, Inc. PHM and Banco de Chile BCH.\n\n5 High ROE Stocks to Bet On as Markets Seek Rate Cut Clarity\n\nThe broader U.S. equity markets witnessed a modest uptrend over the past few trading days, buoyed by optimism related to rate cuts driven by easing inflationary pressures and solid economic metrics that portrayed the resilience of the economy. In addition, a relatively healthy earnings performance from hitherto reported companies ignited hopes of a possible rate cut as early as September.\n\nThe markets now await the Federal Reserve’s update on the monetary policy as it wraps up its policy meeting later today. Although the Fed is widely expected to keep the benchmark funds rate steady in the 5.25% to 5.5% range, investors are seeking cues for probable cuts in the near future. With a better-than-expected 2.8% annualized GDP growth in the second quarter and a robust labor market scenario, the conditions appear primed to heed the broader sentiments.\n\nAs investors employ a wait-and-see approach in a classic example of “backing and filling” in the market, they can benefit from “cash cow” stocks that garner higher returns. However, identifying cash-rich stocks alone does not make for a solid investment proposition unless it is backed by attractive efficiency ratios like return on equity (ROE). A high ROE ensures that the company is reinvesting cash at a high rate of return. Best Buy Co., Inc., The AES Corp., Lockheed Martin Corp., PulteGroup, Inc. and Banco de Chile are some of the stocks with high ROE to profit from.\n\nWhy ROE?\n\nROE = Net Income/Shareholders’ Equity\n\nROE helps investors distinguish profit-generating companies from profit burners and is useful in determining the financial health of a company. In other words, this financial metric enables investors to identify companies that diligently deploy cash for higher returns.\n\nMoreover, ROE is often used to compare the profitability of a company with other firms in the industry — the higher, the better. It measures how well a company is multiplying its profits without investing new equity capital and portrays management’s efficiency in rewarding shareholders with attractive risk-adjusted returns.\n\nHere are five of the 14 stocks that qualified the screening:\n\nBest Buy: Headquartered in Richfield, MN, Best Buy is a multinational specialty retailer of consumer electronics, home office products, entertainment software, communication, food preparation, wellness, health, security, appliances and related services. The company retails technology products in the United States and Canada.\n\nStory continues\n\nIt has a long-term earnings growth expectation of 5.1% and delivered a trailing four-quarter earnings surprise of 11%, on average. It has a VGM Score of B. Best Buy carries a Zacks Rank #2. You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nAES: Arlington, VA-based AES is a global power company. Its businesses are spread across four continents in 14 countries. The company has four Strategic Business Units located in the United States and other regions across the globe. AES remains one of the forerunners in the utility industry's transition to clean energy by investing in sustainable growth and innovative solutions while delivering superior results.\n\nIt delivered a trailing four-quarter earnings surprise of 13.8%, on average. AES carries a Zacks Rank #2. It has a VGM Score of A.\n\nLockheed Martin: Based in Bethesda, MD, Lockheed Martin is the largest defense contractor in the world. Its main areas of focus are defense, space, intelligence, homeland security and information technology, including cyber security. Lockheed Martin currently operates through four businesses — Aeronautics, Missiles and Fire Control, Rotary and Missions Systems and Space Systems.\n\nThe company has a long-term earnings growth expectation of 4.2% and delivered a trailing four-quarter earnings surprise of 7.5%, on average. Lockheed Martin carries a Zacks Rank #2.\n\nPulteGroup: Based in Atlanta, GA, PulteGroup engages in homebuilding and financial services businesses, primarily in the United States. The company conducts operations through two primary business segments – Homebuilding and Financial Services. The company engages in maintaining a 50/50 balance between build-to-order and spec sales, enabling it to meet immediate demand with spec homes while also accommodating buyers who prefer to customize their homes with build-to-order options.\n\nThe company has a long-term earnings growth expectation of 19% and delivered a trailing four-quarter earnings surprise of 10%, on average. It has a VGM Score of B. PulteGroup carries a Zacks Rank #2.\n\nBanco de Chile: Headquartered in Santiago, Chile, Banco de Chile provides various banking services to customers in the Latin American country. These include deposit accounts, loans, payment-related cards and insurance solutions. The company also offers services such as cash management, treasury, financial advisory, trade finance, leasing, factoring, payment, payroll, collection, mutual fund management, securities brokerage, currency trading, investment management, collection, securitization and capital markets services.\n\nIt delivered a trailing four-quarter earnings surprise of 7.1%, on average. Banco de Chile carries a Zacks Rank #2.\n\nYou can get the rest of the stocks on this list by signing up now for your 2-week free trial to the Research Wizard and start using this screen in your own trading. Further, you can also create your own strategies and test them first before taking the investment plunge.\n\nThe Research Wizard is a great place to begin. It's easy to use. Everything is in plain language. And it's very intuitive. Start your Research Wizard trial today. And the next time you read an economic report, open up the Research Wizard, plug your finds in, and see what gems come out.\n\nClick here to sign up for a free trial to the Research Wizard today.\n\nFor the rest of this Screen of the Week article please visit Zacks.com at: https://www.zacks.com/stock/news/2312735/5-high-roe-stocks-to-bet-on-as-markets-seek-rate-cut-clarity\n\nZacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.\n\nContact: Jim Giaquinto\n\nCompany: Zacks.com\n\nPhone: 312-265-9268\n\nEmail: pr@zacks.com\n\nVisit: https://www.zacks.com/\n\nZacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer.\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nBest Buy Co., Inc. (BBY) : Free Stock Analysis Report\n\nPulteGroup, Inc. (PHM) : Free Stock Analysis Report\n\nThe AES Corporation (AES) : Free Stock Analysis Report\n\nBanco De Chile (BCH) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/zacks-com-featured-highlights-best-095300669.html",
        "symbols": [
            "0H6G.LSE",
            "0KS6.LSE",
            "0R18.LSE",
            "0R3E.LSE",
            "AES.BE",
            "AES.DU",
            "AES.F",
            "AES.MU",
            "AES.STU",
            "AES.US",
            "BBY.MX",
            "BBY.US",
            "BBYY34.SA",
            "BCH.US",
            "BUY.BE",
            "BUY.DU",
            "BUY.F",
            "BUY.STU",
            "CHILE.SN",
            "G4RA.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.018,
            "neu": 0.825,
            "pos": 0.156
        }
    },
    {
        "date": "2024-08-01T00:05:00+00:00",
        "title": "Top Stock Reports for Toyota, Lockheed Martin &amp; Chubb",
        "content": "Wednesday, July 31, 2024\r\n\r\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Toyota Motor Corp. (TM), Lockheed Martin Corp. (LMT) and Chubb Ltd. (CB), as well as a micro-cap stock Pro-Dex, Inc. (PDEX). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\r\n\r\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\r\n\r\nYou can see all of today’s research reports here >>>\r\n\r\nToyota Motor’s shares have outperformed the Zacks Automotive - Foreign industry over the past year (+12.4% vs. -11.1%). The company’s robust lineup of trucks and sport utility vehicles is set to fuel sales. To capitalize on the global shift to environment-friendly vehicles, the auto giant is deepening its focus on manufacturing electric and hydrogen fuel-cell vehicles, which will bolster the company’s product competitiveness.\r\n\r\nToyota Motor aims to expand global sales of BEVs to 1.5 million units in 2026 and 3.5 million units a year by 2030. Toyota’s commitment to maximize shareholders value via dividends and buyback is also praiseworthy.\r\n\r\nHowever, labor cost inflation is expected to continue to weigh on margins. Rising debt levels, along with high R&D expenses and capex, are set to play spoilsport. Also, Toyota expects sales in Japan to decrease, given the lower shipments of Daihatsu. Thus, the stock warrants a cautious stance now.\r\n\r\n(You can read the full research report on Toyota here >>>)\r\n\r\nShares of Lockheed Martin have outperformed the Zacks Aerospace - Defense industry over the past year (+19.1% vs. -4.4%). The company ended second-quarter 2024 on a solid note, with both its earnings and revenues surpassing their respective Zacks Consensus Estimate. Its broad product offerings allow it to secure major defense contracts, which, in turn, boosts its backlog count.\r\n\r\nLockheed remains the largest U.S. defense contractor with a steady order flow from its leveraged presence in the Army, Air Force, Navy and IT programs. The solid U.S. defense budgetary provisions should boost its business. Its products also witness a strong international demand.\r\n\r\nHowever, Lockheed is facing performance issues concerning some of its products that may affect its results. Shortage of skilled labor may adversely impact Lockheed’s operating results. The sanctions imposed by China on Lockheed might also affect its business.\r\n\r\n(You can read the full research report on Lockheed Martin here >>>)\r\n\r\nChubb’s shares have outperformed the Zacks Insurance - Property and Casualty industry over the past year (+36.2% vs. +25.2%). The company’s suite of compelling products as well as services, focus on capitalizing on the potential of middle-market businesses and investments in various strategic initiatives pave the way for long-term growth.\r\n\r\nSeveral distribution agreements have expanded its network, boosting its market presence. An impressive inorganic growth story helps to achieve a higher long-term return on equity. Chubb expects adjusted net investment income to be in the range of $1.57 billion to $1.63 billion per quarter in 2024.\r\n\r\nChubb boasts a strong capital position with sufficient cash generation capabilities that ensure steady payouts to investors. Second quarter EPS beat estimates. However, exposure to catastrophe loss induces underwriting volatility. Escalating expenses weigh on margin expansion.\r\n\r\n(You can read the full research report on Chubb here >>>)\r\n\r\nShares of Pro-Dex have outperformed the Zacks Medical - Dental Supplies industry over the past year (+12.9% vs. -1.7%). This microcap company with market capitalization of $69.48 million has demonstrated strong financial performance, with net sales increasing 10% year over year to $38.8 million for the nine months ended Mar 31, 2024, reflecting robust demand.\r\n\r\nThe acquisition of a new 25,000 sq. ft. manufacturing facility in Tustin, CA, boosts production capacity and supports future growth. Strategic alliances, such as a supply agreement with Monogram Orthopaedics, enhance market reach and revenue potential. Pro-Dex's strong balance sheet, with $3.2 million in cash and $5.2 million in operating cash flow, ensures financial stability.\r\n\r\nStrong customer relationships, with repeat business from major customers accounting for 85% of net sales, provide a stable revenue stream. However, customer concentration risk, limited market diversification, high operating expenses and competitive pressures are notable headwinds.\r\n\r\n(You can read the full research report on Pro-Dex here >>>)\r\n\r\nOther noteworthy reports we are featuring today include Honeywell International (HON), American Electric Power (AEP) and The Hartford Financial Services Group (HIG).\r\n\r\nMark Vickery\r\nSenior Editor\r\n\r\nNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\n\nStory continues\n\nToday's Must Read\n\nRobust Line-Up Aids Toyota (TM) Amid Rising Labor Costs\n\nSolid Orders Growth Aids Lockheed (LMT), Labor Shortage Woes\n\nBetter Pricing, New Business Growth Drive Chubb Limited (CB)\n\nFeatured Reports\n\nCapex Aids American Electric (AEP) Amid High Interest Costs\r\nPer the Zacks analyst, solid capital expenditure in transmission and distribution should benefit American Electric. Yet, increasing interest expenses might hurt its bottom-line performance\n\nStrategic Efforts Aid Hartford Financial (HIG), High Costs Ail\r\nPer the Zacks analyst, Hartford Financial's strategic initiatives, like vending of non-core businesses to focus on its U.S. operations, bode well. Rising expenses are a concern.\n\nRising Revenues Aid Northern Trust (NTRS), High Costs Ail\r\nPer Zacks analyst, Northern Trust's top-line growth is supported by a steady increase in loan balances, as well as rising NII and fee income. However, an elevated cost base remains a concern.\n\nGrowth in Software, Global Services Businesses Aid F5 (FFIV)\r\nPer the Zacks analyst, F5 benefits from strong growth in software, driven by the solid uptick in public cloud and security offerings. Increased pricing is driving Global Services revenues.\n\nMattel (MAT) Banks On Product Innovations, Macro Woes Ail\r\nPer the Zacks analyst, Mattel's focus on new product innovations and Optimizing for Profitable Growth program bode well. However, soft North America sales and uncertain macro environment are concerns.\n\nSolid Automotive Business Aids Sensata (ST) Amid Forex Woes\r\nPer the Zacks analyst, Sensata's results gained from solid traction in the automotive vertical, outgrowing the market by 700bps in the second quarter. Volatile foreign currency movements pose headwind\n\nMyRisk Prospects Boost Myriad Genetics (MYGN) Amid Cost Woes\r\nPer the Zacks analyst, Myriad Genetics' omni-channel strategy should drive the growth of MyRisk with RiskScore Hereditary Cancer test across all of its businesses. Yet, macro woes escalate costs.\n\nNew Upgrades\n\nStrong Aerospace Segment Drives Honeywell's (HON) Revenues\r\nPer the Zacks analyst, solid performance of Honeywell's Aerospace segment, driven by strong commercial aftermarket and solid commercial aviation demand will continue to lend momentum to Honeywell.\n\nTechnipFMC (FTI) to Gain from Expanding Backlog\r\nThe Zacks analyst believes that TechnipFMC's record backlog of $13.9 billion ensures strong revenue visibility and supports margin improvements.\n\nImproved Occupancy & ADR Aid Caesars (CZR), High costs Ail\r\nPer the Zacks analyst, Caesars is likely to benefit from improved occupancy and average daily rate in its Las Vegas segment. However, high costs, weather and construction related woes hurt.\n\nNew Downgrades\n\nJ. B. Hunt (JBHT) Continues to Grapple With Segmental Weakness\r\nThe Zacks Analyst is worried about the fact that lower revenues across the majority of the segments, higher equipment-related costs, and higher insurance and claims expenses hurt J. B. Hunt's results.\n\nViasat (VSAT) Plagued by Soft Demand, Fierce Competition\r\nPer the Zacks analyst, declining demand for fixed broadband services and intensifying competition from other major players such as SpaceX will likely impede Viasat's top line.\n\nPaylocity Holding (PCTY) Hurt By Rising Stiff Competition\r\nPer the Zacks Analyst, Paylocity Holding is suffering from rising stiff competition in the HCM software market from players like Oracle, Paychex, etc. Higher interest rates also remain a concern.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nThe Hartford Financial Services Group, Inc. (HIG) : Free Stock Analysis Report\n\nToyota Motor Corporation (TM) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nAmerican Electric Power Company, Inc. (AEP) : Free Stock Analysis Report\n\nChubb Limited (CB) : Free Stock Analysis Report\n\nPro-Dex, Inc. (PDEX): Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/top-stock-reports-toyota-lockheed-000500886.html",
        "symbols": [
            "0J3H.LSE",
            "0R3E.LSE",
            "7203.TSE",
            "C1BL34.SA",
            "CB.US",
            "HFF.BE",
            "HFF.DU",
            "HFF.F",
            "HFF.MU",
            "HFF.STU",
            "HIG-PG.US",
            "HIG.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.056,
            "neu": 0.781,
            "pos": 0.164
        }
    }
]