[
    {
        "date": "2024-08-02T11:45:00+00:00",
        "title": "7 Subdued Blue-Chip Stocks That Will Reward Patient Investors",
        "content": "An undeniable fact about equities is that it always remains in a long-term uptrend. In the last ten years, the S&P 500 Index has delivered total returns at a CAGR of 12.75%. Even if we extend the time horizon, the markets have rewarded investors. The key is good stock selection and the patience to hold. This column discusses seven blue-chip stocks that have underperformed in the recent past but have the potential to surge higher in the long term.\n\nThis is a good time to look at subdued blue-chip stocks with the index trading near all-time highs. If there is a correction, undervalued blue-chip stocks are unlikely to be significantly impacted. On the other hand, positive business developments will ensure that the upside potential is significant in the coming years.\n\nLet’s therefore discuss the fundamental reasons to be bullish on these blue-chip ideas. If difficult to talk about targets, but I can say with some conviction that a portfolio of these stocks can beat index returns in the next five years.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nChevron Corporation (CVX) chevron stock\n\nSource: LesPalenik / Shutterstock.com\n\nChevron Corporation (NYSE:CVX) stock has been sideways in the last 12 months. The key reason is macroeconomic headwinds impacting energy prices. I see this sideways move as a good buying opportunity with the blue-chip stock having strong fundamentals and steady growth visibility.\n\nFrom a fundamental perspective, Chevron has an investment-grade balance sheet. As of the first quarter of 2024, the energy company reported a net debt ratio of 8.8%. Further, for 2023, Chevron reported operating cash flow of $35.6 billion. If oil trends are higher on expansionary monetary policies, annual OCF is likely to be more than $40 billion.\n\nThis positions Chevron to make aggressive capital investments. It’s worth noting that in the last ten years, the average reserve replacement has been over 100%. Once the acquisition of Hess Corporation (NYSE:HES) is closed, production growth and cash flow upside are also on the cards. At the same time, there is likely to be sustained value creation through dividends and share repurchases.\n\nLockheed Martin (LMT) Close top view of a Lockheed Martin (LMT) F-35C Lightning II with afterburner on\n\nSource: ranchorunner / Shutterstock.com\n\nAfter remaining subdued for an extended period, Lockheed Martin’s (NYSE:LMT) stock has trended higher by almost 15% in the last month. At a forward P/E of 19.9x, the defense major remains attractive and offers a dividend yield of 2.39%.\n\nThe first point to note is that with rising geopolitical tensions globally, industry tailwinds are likely to remain positive. It’s also worth noting that the company ended the second quarter (Q2) of 2024 with an order backlog of $158 billion. As the backlog swells, revenue growth acceleration is on the cards.\n\nStory continues\n\nFor Q2 2024, Lockheed reported year-on-year sales growth of 9% to $18.1 billion. The company also increased its sales and EPS guidance for the year. Further, free cash flow for 2024 is likely at $6.2 billion. This provides ample flexibility to invest in dividends and share repurchases.\n\nAnother growth trigger for Lockheed is investment in next-generation defense technology. This includes areas of hypersonic, and next-generation space capabilities, among others. With high financial flexibility, investment in innovation is likely to be robust.\n\nPfizer (PFE) Here's How Pfizer Stock (and Pharma) Stand to Benefit From Mylan Deal. Best Biotech Stocks to Buy\n\nSource: Manuel Esteban / Shutterstock.com\n\nPfizer (NYSE:PFE) stock was on a sharp downtrend and touched 52-week lows of $25.2 in April. However, PFE stock has made a strong comeback from oversold levels and currently trades at $31. At a forward P/E of 12.9x, the biotech stock remains attractive and offers a dividend yield of 5.47%. I therefore expect the positive momentum to sustain.\n\nPfizer recently reported strong Q2 2024 results. Revenue increased by 3% on a year-on-year basis to $13.3 billion. The company also revised its annual revenue guidance upwards to $61 billion (mid-range).\n\nAn important point to note is that Pfizer has an attractive product pipeline of 113 candidates as of July. This includes 33 and 27 candidates in the third and second phases respectively. In the next few years, the pipeline will provide growth visibility.\n\nI must add that in December 2023, Pfizer completed the acquisition of Seagen. This positions Pfizer among the leading oncology companies and will contribute to growth acceleration.\n\nRio Tinto (RIO) the rio tinto (RIO) logo on a building during daylight\n\nSource: Rob Bayer / Shutterstock.com\n\nRio Tinto (NYSE:RIO) is possibly among the best industrial commodity stocks to buy. At a forward P/E of 8.9x, RIO stock looks undervalued and offers a healthy dividend yield of 6.72%. With expansionary monetary policies on the cards, I expect a rally for industrial commodities and Rio is positioned to benefit.\n\nIt’s worth noting that Rio has continued to report healthy numbers. For the first half of 2024, the commodity company reported EBITDA and operating cash flow of $12.1 billion and $7.1 billion respectively. Further, with a strong balance sheet, Rio is positioned to make aggressive investments. Between 2024 and 2026, the company plans to make annual investments of $7 billion.\n\nAn important point to note is that the iron ore segment continues to drive cash flows. However, Rio is diversifying into energy transition metals like aluminum, copper and lithium, among others. The diversification is likely to yield results in the next five years.\n\nNewmont Corporation (NEM) Newmont logo on a mobile phone screen\n\nSource: Piotr Swat/Shutterstock\n\nReturns from Newmont Corporation (NYSE:NEM) stock have been unimpressive in the last five years. However, with gold trending higher, I am bullish on a strong breakout for NEM stock. It’s worth noting that a forward P/E of 16.2x looks attractive for this 2.12% dividend yield stock.\n\nCurrently, gold is trading just above $2,400 an ounce. However, Citi believes that the precious metal can trade at $3,000 an ounce in the next 6 to 18 months. If this holds, I expect healthy returns from NEM stock during this period.\n\nFrom an asset perspective, Newmont has ten tier-one gold assets that are likely to support production growth through 2040. At the same time, the company has 14 million tons and 26 million tons of copper reserves and resources respectively. These assets provide clear growth visibility and with potentially higher realized price, cash flows will swell.\n\nFor Q2 2024, Newmont reported operating cash flow of $1.4 billion. If gold indeed trades above $3,000 an ounce, annual OCF is likely to be in the range of $7 to $10 billion. This will translate into healthy dividend growth.\n\nThe Home Depot (HD) a Home Depot store is seen from the outside\n\nSource: Cassiohabib / Shutterstock.com\n\nConsumption spending remains the growth driver for the U.S. economy. This has been impacted to some extent by tight monetary policies. However, with growth concerns, rate cuts are likely and I am bullish on the consumption sector.\n\nThe Home Depot (NYSE:HD) stock has remained subdued in line with challenging macroeconomic conditions. I see current levels as a good buying opportunity for this 2.49% dividend yield stock.\n\nA key growth trigger for Home Depot is the acquisition of SRS Distribution. The latter is one of the fastest-growing building products distributors in the United States. With the completion of the acquisition, the company’s total addressable market has increased by $50 billion to $1 trillion. This will have a positive impact on growth in the coming quarters.\n\nFor 2024, Home Depot has guided for a 1% decline in comparable store sales. This factor is however discounted in the stock and growth acceleration is likely towards the end of the year. This will translate into an upside for HD as its standing improves among blue-chip stocks.\n\nVale (VALE) the Vale logo displayed on a mobile phone with the company's webpage in the background\n\nSource: rafapress / Shutterstock.com\n\nVale (NYSE:VALE) stock has witnessed a deep correction year-to-date. I see this as a golden buying opportunity with the commodity stock trading at a forward P/E of 5x. In my view, VALE stock can double from current levels in the next 24 to 36 months.\n\nRecently, Vale reported results for Q2 2024 and there were several positives. First, iron ore production and sales have been on an uptrend. At the same time, copper production has been stable. While nickel production has declined, it’s on the back of maintenance.\n\nFurther, pro-forma EBITDA for Q2 2024 was $4 billion. Higher iron ore shipments boosted the company’s EBITDA. If commodities trend higher in the coming quarters, the annual EBITDA potential is likely to be $20 billion.\n\nVale is therefore positioned to deliver healthy operating and free cash flows. This will ensure a strong balance sheet and flexibility for dividends, making it one of the best blue chip stocks to buy.\n\nOn the date of publication, Faisal Humayun did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or\r\nindirectly) any positions in the securities mentioned in this article.\n\nFaisal Humayun is a senior research analyst with 12 years of industry experience in the field of credit research, equity research and financial modeling. Faisal has authored over 1,500 stock specific articles with focus on the technology, energy and commodities sector.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post 7 Subdued Blue-Chip Stocks That Will Reward Patient Investors appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/7-subdued-blue-chip-stocks-114500378.html",
        "symbols": [
            "0R3E.LSE",
            "CRA1.F",
            "CVLB.F",
            "CVLB.STU",
            "CVLC.F",
            "CVX.US",
            "HD.MX",
            "HD.NEO",
            "HD.US",
            "HDI.BE",
            "HDI.DU",
            "HDI.F",
            "HDI.HM",
            "HDI.MU",
            "HDI.XETRA",
            "HDI0.F",
            "HES.US",
            "HOME34.SA",
            "LMT.MX"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.015,
            "neu": 0.795,
            "pos": 0.19
        }
    },
    {
        "date": "2024-08-02T00:00:00+00:00",
        "title": "7 Subdued Blue-Chip Stocks That Will Reward Patient Investors",
        "content": "These are the blue-chip stocks to buy as they represent companies with strong fundamentals and growth acceleration possibility.",
        "link": "https://investorplace.com/2024/08/7-subdued-blue-chip-stocks-that-will-reward-patient-investors/",
        "symbols": [
            "CVX.US",
            "HD.US",
            "LMT.US",
            "NEM.US",
            "PFE.US",
            "RIO.US",
            "VALE.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.71,
            "neg": 0,
            "neu": 0.731,
            "pos": 0.269
        }
    }
]