[
    {
        "date": "2024-06-18T21:24:00+00:00",
        "title": "Lockheed Martin Selected to Develop Next Generation Weather Satellite Constellation",
        "content": "NOAA's Geostationary Extended Observations weather satellites to bring new critical measurements and advanced weather forecasting capability\n\nDENVER, June 18, 2024 /PRNewswire/ -- NASA has selected Lockheed Martin [NYSE: LMT] to develop and build the nation's next generation weather satellite constellation, Geostationary Extended Observations (GeoXO), for the National Oceanic and Atmospheric Administration (NOAA). Concept art of NOAA's GeoXO weather satellite consellation being developed by Lockheed Martin.\n\nThe baseline contract is for three spacecraft with options for four additional spacecraft. The total estimated value of the contract including options is $2.27 billion.\n\nThe GeoXO mission will continue and expand upon critical observations of weather provided by the Lockheed Martin-built GOES-R Series geostationary satellites to include new observations of our oceans and air pollution. GeoXO's new capabilities will deliver more accurate weather forecasting and address emerging environmental issues and challenges that threaten our economy and safety. GeoXO and the nation's weather satellites are vital infrastructure for national resilience.\n\n\"Our team is excited and ready to move forward to design and field this critical national capability,\" said Kyle Griffin, vice president and general manager of Commercial Civil Space at Lockheed Martin. \"Our GeoXO design draws heavily from what we've learned with GOES-R spacecraft over the last 15 years, while incorporating new, digital technologies not only onboard the vehicles but in the design and development of this powerful, weather-monitoring platform of the future.\"\n\nA Deeper Look into Our Severe Weather, Shifting Climate GeoXO represents an expansion of our nation's geostationary weather satellite enterprise, its capabilities and continued U.S. technological leadership. The geostationary constellation will help NOAA provide better, more accurate information on severe weather patterns, marine ecosystems, air quality and our changing climate.\n\nWith new instruments onboard, the observatories will have a major impact including: the first geostationary observations of our coastal ecosystems that supports resilient coastal communities, near real-time hyperspectral sounding to map the state of the atmosphere, enhanced lightning observations for severe convection monitoring, and continental U.S.-wide observations of harmful pollutants in the air we breathe.\n\nA Weather Constellation for the Future The first GeoXO launch is planned for the early 2030s and will maintain and advance NOAA's critical geostationary observations through the late 2050s.\n\nStory continues\n\nThe GeoXO spacecraft is based on Lockheed Martin's modernized LM2100™ satellite bus, which provides more performance and flexibility for addressing NOAA's mission needs over the coming decades. The platform features SmartSat™ technology that enables new software pushes and capabilities as environmental data needs change over time.\n\nHalf a Century, 120+ Weather Spacecraft on Orbit For over 50 years, Lockheed Martin has built and launched more than 120 weather and environmental spacecraft for our government's civil and military agencies.\n\nThe revolutionary GOES-R mission provided the first lightning observations from geostationary orbit, the ability to detect remote wildland fire ignitions, and unprecedented tracking of severe weather that have proven indispensable to the nation and sets a new bar for future expectations from the public, forecasters, and researchers who depend on the geostationary weather mission.\n\nThe launch of the fourth and final spacecraft in the series, GOES-U, is scheduled for June 25, 2024 from NASA's Kennedy Space Center, Florida.\n\nAbout Lockheed Martin Lockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at Lockheedmartin.com.\n\n#   #   # Lockheed Martin Logo. (PRNewsfoto/Lockheed Martin) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/lockheed-martin-selected-to-develop-next-generation-weather-satellite-constellation-302176133.html\n\nSOURCE Lockheed Martin\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-selected-develop-next-212400409.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.975,
            "neg": 0.037,
            "neu": 0.877,
            "pos": 0.086
        }
    },
    {
        "date": "2024-06-18T17:22:00+00:00",
        "title": "Boeing (BA) Wins $128M Contract to Aid CH-47 Chinook Helicopter",
        "content": "The Boeing Company BA recently secured a modification contract for its CH-47 Chinook helicopter. The award has been offered by the Army contracting Command, Redstone Arsenal, AL.\n\nValued at $127.5 million, the contract is expected to be completed by Sep 30, 2028. Per the terms of the deal, Boeing will procure sustainment parts for CH-47 aircraft.\n\nWhat’s Favoring Boeing?\n\nAs nations across the globe continue to strengthen their defense structures, spending on military arms and ammunition that boast technologically advanced features continues to increase manifold. This also includes increased investments in military helicopters that play a critical role in air warfare missions.\n\nTo this end, it is imperative to mention that Boeing’s CH-47 Chinook is an advanced, multi-mission, tandem-rotor helicopter, proven in cargo and troop transport, search and rescue, casualty evacuation, special operations, humanitarian and disaster relief, and more. It can be equipped with extended-range fuel tanks and fitted for air-to-air refueling capability. This implies that the Chinook can fly farther than ever before.\n\nSuch remarkable features of this aircraft must have been boosting its demand, which, in turn, has prompted Boeing to provide a broad spectrum of services, from performance-based logistics contracting and integrated fleet support to vertical lift maintenance, modifications and repairs. The latest contract win bears a bright example of that.\n\nConsidering the fact that CH-47 is the heavy-lift helicopter of choice for the U.S. Army and 20 international operators, with more than 950 Chinooks deployed worldwide, we may expect Boeing to win more similar contracts involving sustainment parts supply in the near future.\n\nGrowth Prospects\n\nRising military conflicts, terrorism, border disputes, territory invasions and violations have forced nations to increase their defense spending toward procuring combat-proven helicopters to enhance their aerial security in recent times. To this end, the Mordor Intelligence firm expects the military helicopters market to witness a CAGR of more than 2.9% during the 2024-2030 period.\n\nSuch expanding market prospects should boost Boeing’s growth, thanks to its established position in manufacturing combat helicopters like AH-64 Apache, MH-139 and AH-6 light attack helicopter, apart from Ch-47 Chinook.\n\nOther defense primes that are expected to reap the benefits of the military helicopter market have been discussed below.\n\nAirbus EADSY is one of the world's largest suppliers of advanced military helicopters. Some of its military helicopters are H125M, H135, H145M, AS565MBe, H160M, H175M, H215M, H225M, etc.\n\nStory continues\n\nAirbus boasts a long-term earnings growth rate of 17.9%. The Zacks Consensus Estimate for EADSY’s 2024 sales indicates an improvement of 8.2% from the 2023 reported figure.\n\nLockheed Martin’s LMT Sikorsky business unit provides military and rotary-wing aircraft to all five branches of the U.S. armed forces, along with military services and commercial operators in 40 nations. Some of LMT’s renowned products are Armed Black Hawk, CH-53K, MH-60R, Defiant X, Raider X, S-97 Raider, FireHawk, etc.\n\nLockheed boasts a long-term earnings growth rate of 4.1%. The consensus estimate for LMT’s 2024 sales indicates an improvement of 3.2% from the 2023 reported figure.\n\nTextron’s TXT Bell business supplies advanced military helicopters and provides parts and support services to the U.S. government and military customers outside the United States. TXT Bell’s primary U.S. government programs are for the production and support of the V-22 tiltrotor aircraft and H-1 helicopters.\n\nTextron boasts a long-term earnings growth rate of 10.1%. The consensus mark for TXT’s 2024 sales indicates an improvement of 5.6% from the 2023 reported number.\n\nPrice Movement\n\nShares of Boeing have lost 1.5% in the past three months compared with the industry’s 6.2% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nBoeing currently has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/boeing-ba-wins-128m-contract-172200980.html",
        "symbols": [
            "0BOE.LSE",
            "0KVV.IL",
            "0LF0.LSE",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.049,
            "neu": 0.776,
            "pos": 0.175
        }
    },
    {
        "date": "2024-06-18T17:21:00+00:00",
        "title": "Lockheed (LMT) Secures an Army Contract to Aid PAC-3 Program",
        "content": "Lockheed Martin Corp.’s LMT business segment, Missiles and Fire Control (MFC), recently clinched a contract for Phased Array Tracking to Intercept of Target Advanced Capability-3 (PAC-3) software. The award has been offered by the Army Contracting Command, Redstone Arsenal, AL.\n\nValued at $65.5 million, the contract is expected to be completed by Jun 30, 2026. Work related to this deal will be carried out in Grand Prairie, TX, as well as Bahrain, Germany, Japan, Kuwait, the Netherlands, Poland, Qatar, Romania, Saudi Arabia, South Korea, Sweden, Switzerland and the United Arab Emirates.\n\nWhat’s Favoring Lockheed?\n\nIncreasing geopolitical and socioeconomic turmoil worldwide has prompted nations, both developed and developing, to expand their respective military arsenal, with missiles constituting a significant portion of that inventory.\r\n\r\nThis, in turn, has been ushering in solid contract flows for major missile makers like Lockheed. The latest contract win is a testament to that.\r\n\r\nNotably Lockheed’s MFC unit develops, manufactures and supports advanced combat missiles and rockets for military customers, including the U.S. Army, Navy, Air Force, Marine Corps, NASA and dozens of foreign allies. In particular, its PAC-3 is an advanced defensive missile, which with its unmatched Hit-to-Kill capabilities, defends against advanced threats including tactical ballistic missiles, cruise missiles, hypersonic missiles and aircraft.\n\nTo this end, it is imperative to mention that in 2023, 15 nations chose PAC-3 Cost Reduction Initiative and PAC-3 Missile Segment Enhancement (MSE) to provide missile defense capabilities. This surely reflects the solid demand that PAC-3 enjoys in the global missile market.\n\nLMT’s Growth Prospects\n\nThe global peace index reflects an unstable environment worldwide, with the Russia-Ukraine war continuing for more than two years now, in addition to the ongoing hostility in different parts of the Middle East. This has set the stage for the defense sector to witness rising demand for military products, particularly missiles, as nations worldwide strive to protect their borders from unprecedented attacks.\n\nTherefore, the growth prospect for the missile and missile defense systems market remains solid. To this end, the Mordor Intelligence firm projects the market to witness a CAGR of 5% over the 2024-2029 period.\n\nSuch a solid growth prospect, offered by the aforementioned market, positions Lockheed to benefit substantially in the coming days. Notably, to further enhance the market reach of PAC-3 missiles, in May 2024, Lockheed launched a PAC-3 MSE interceptor from an MK-70 containerized launch platform to engage a cruise missile target in flight.  This test marked the first time PAC-3 MSE was launched in this configuration, utilizing the Virtualized Aegis Weapon System to intercept a live target. Such modernization efforts in tandem with growing demand for missiles can be expected to fetch more contract wins for PAC-3 missile, thereby bolstering the top-line performance of LMT’s MFC unit.\n\nStory continues\n\nOpportunities for Peers\n\nThe solid growth prospect offered by the missile and missile defense systems market should also bode well for other defense contractors, as mentioned below, which are prominent missile makers, apart from LMT.\n\nRTX Corp RTX: It offers a variety of combat-proven missile defense systems, including the Patriot missile, Standard Missiles, Advanced Medium-Range Air-to-Air Missile, Evolved Seasparrow Missile, Tomahawk cruise missile and a few more. To keep up with its growing demand for a wide variety of missiles, RTX broke ground on a $115 million worth, 26,000-square-foot expansion of its Redstone Raytheon Missile Integration Facility in April 2024.\n\nRTX boasts a long-term earnings growth rate of 10.6%. The Zacks Consensus Estimate for its 2024 sales implies an improvement of 6.2% from the 2023 reported figure.\n\nNorthrop Grumman NOC: It is a prominent developer of missile systems and counter systems, including strategic deterrents, as well as subsystems and components. Its product portfolio includes the Integrated Air and Missile Defense Battle Command System, the Hypersonic Attack Cruise Missile, the Advanced Anti-Radiation Guided Missile and a few other combat-proven products that support missile defense systems.\r\n\r\nNOC boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for its 2024 sales implies an improvement of 4.6% from the 2023 reported figure.\n\nThe Boeing Company BA: Boeing-built and supported air and missile defense systems have been protecting the United States, its allies and international partners against threats ranging from intercontinental ballistic missiles to hostile aircraft, for almost 25 years. Its product portfolio includes the Aegis Ballistic Missile Defense, the Avenger Air Defense System, the Ground-Based Midcourse Defense and a few other missiles.\n\nBA boasts a long-term earnings growth rate of 25.5%. The Zacks Consensus Estimate for its 2024 sales suggests an improvement of 2% from the 2023 reported figure.\n\nPrice Movement\n\nShares of Lockheed have risen 2.8% in the past year against the industry's decline of 12.9%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nThe company currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-secures-army-contract-172100708.html",
        "symbols": [
            "0BOE.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.047,
            "neu": 0.766,
            "pos": 0.188
        }
    },
    {
        "date": "2024-06-18T14:00:00+00:00",
        "title": "3 Space Stocks to Buy Now: June 2024",
        "content": "The space sector saw a tough 2022 due to low investor interest in high-risk sectors and high interest rates affecting borrowing costs. 2023 has already seen a recovery, and 2024 has been hot for the sector, with $6.5 billion in investments in Q1 2024, up 33% from Q4 2023. Now is the time to pay attention to this industry again. The space economy, valued at $443.20 billion last year, is projected to grow to $916.85 billion by 2033, indicating robust financial health. Government and private investments are driving innovation, with $4 billion funneled into space companies in 2023 alone, a tenfold increase from a decade ago.\n\nThe three companies below enjoy being in a fast growing market, have recently secured strong contracts, and have healthy financials to back them up. Moreover, they are either affected by temporary headwinds or have unrealized growth potential which makes it a good time to snap it up right now.\n\nRocket Lab (RKLB) Person holding smartphone with logo of aerospace company Rocket Lab USA Inc. (RKLB) on screen in front of website. Focus on phone display. Unmodified photo.\n\nSource: T. Schneider / Shutterstock.com\n\nRocket Lab (NASDAQ:RKLB)was founded by former SpaceX engineers who focused the company on launching small satellites with significant cost advantages. RKLB is down over 17% YTD (year-to-date) due to a failed launch in September 2023 and postponed rocket launches\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nHowever, Rocket Lab is still a leader in the market. It has launched more rockets than other providers second only toSpaceX. Many of its competitors have already gone bankrupt, and it’s understood that space is a risky industry where failed launches are common.\n\nRocket Lab’s financials are still solid. Revenue was $92.77 million in Q1 2024, up 69% YOY. Losses were $44.26 million which is less than last year’s $45.62 million. Cash was $365.93 million, significantly up from $162.52 million in Q3. Rocket Lab also has a current ratio of 3.1x, which is the ratio of its assets to its debt due in one year. This means that Rocket Lab is in a strong financial position to continue operating and weather any failed launches in the future.\n\nOverall, though Rocket Lab has seen some bad publicity due to a failed launch and postponed launches, its superior technology and market position combined with its solid financials makes it a future leader in space.\n\nLockheed Martin (LMT) Close top view of a Lockheed Martin (LMT) F-35C Lightning II with afterburner on\n\nSource: ranchorunner / Shutterstock.com\n\nLockheed Martin (NYSE:LMT) is the aerospace and defense industry leader. Its stock has changed little since the year began and traded under $435 for the early part of 2024. The stock has been stalled due to fighter jet delays and fewer orders signed for 2025 by President Biden. However, a key opportunity for the stock lies in its space sector.\n\nStory continues\n\nDue to its long-standing relationship with the U.S. government and numerous governmental contracts, Lockheed Martin has an 18.5% market share in the space vehicle and missile manufacturing industry. In fact, it is the biggest receiver of defense contracts from the US government overall.\n\nLockheed Martin reported outperforming figures ending the fiscal year 2023. Revenue stood at $67.57 billion, demonstrating 2.41% YoY growth. Additionally, net income rose to $6.92 billion, showing 20.73% YoY growth. Best of all, Lockheed reported a Leveraged (free cash flow) Margin of 7.39%, beating the sector by 15.4%.\n\nLockheed Martin’s legacy product has been the Orion Spacecraft which started in 2006. It recently used the Orion to complete the Artemis I missions in 2023, and NASA has said that the Orion is performing better than expected. Furthermore, Lockheed Martin has been able to reduce costs significantly with each iteration. Overall, Lockheed Martin has been a successful player in space and has strong ties to the US government. Its future in space and stagnating stock price could mean it’s a good opportunity to buy.\n\nLeidos Holdings (LDOS) Leidos (LDOS) logo on the side of an office building\n\nSource: Jer123 / Shutterstock.com\n\nLeidos Holdings (NYSE:LDOS)is a defense and aviation research company headquartered in Virginia. The company’s stock is up 33.06% year to date due to major new contracts.\n\nLDOS has shown steady gross profits over the past few quarters. Undeniable progress has been made since Quarter 1, 2023, when the gross profit was $495 million, to Q1 2024, at $638 million. Other factors, such as earnings-per-share, have also seen positive growth, with earnings-per-share growth from Q1 2023 to 2024 at 77%.\n\nRecently, the company was offered a contract worth $738 million to support the US Air Force, including IT and telecommunications support. This is a massive win for Leidos as it supports the company financially while allowing it to form partnerships with the DoD, strengthening its position since 2003.\n\nTo conclude, Leidos’s financials are robust, and its contract with the US Air Force makes it a strong space stock.\n\nOn the date of publication, Michael Que did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nThe researchers contributing to this article did not hold (either directly or indirectly) any positions in the securities mentioned in this article.\n\nMichael Que is a financial writer with extensive experience in the technology industry, with his work featured on Seeking Alpha, Benzinga and MSN Money. He is the owner of Que Capital, a research firm that combines fundamental analysis with ESG factors to pick the best sustainable long-term investments.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 3 Space Stocks to Buy Now: June 2024 appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-space-stocks-buy-now-140000978.html",
        "symbols": [
            "0R3E.LSE",
            "L1DO34.SA",
            "LDOS.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RKLB.US",
            "S6IA.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.047,
            "neu": 0.819,
            "pos": 0.134
        }
    },
    {
        "date": "2024-06-18T13:15:00+00:00",
        "title": "Lockheed Martin Delivers 2,700th C-130 Hercules Tactical Airlifter",
        "content": "MARIETTA, Ga., June 18, 2024 /PRNewswire/ -- Lockheed Martin (NYSE: LMT) recently delivered the 2,700th Hercules multi-mission tactical airlifter, increasing the size, reach and strength of the worldwide C-130 fleet. Lockheed Martin Photograph by David L. Key\n\nThis landmark aircraft is a KC-130J Super Hercules tanker operated by the U.S. Marine Corps Aerial Refueler Transport Squadron 252 at Marine Corps Air Station at Cherry Point, North Carolina.\n\nDefined by its proven performance and unmatched versatility, operators in 70 nations around the world fly C-130 airlifters to support any mission — anywhere, any time. The current C-130 production model is the C-130J Super Hercules, which includes the KC-130J tactical tanker. To date, the C-130J is certified to support 18 different mission requirements.\n\n\"The Lockheed Martin team is honored to deliver this milestone Super Hercules to the U.S. Marine Corps, where it will be part of the largest KC-130J fleet in the world and provide true force amplification across the globe,\" said Rod McLean, vice president and general manager of Lockheed Martin's Air Mobility & Maritime Missions line of business. \"Not only does this Hercules represent the 2,700th C-130 delivered, but it also reflects the inherent mission and performance adaptability that fuels the C-130's ongoing relevance.\"\n\nThe KC-130J is the global standard for tactical tankers, refueling a majority of rotary wing aircraft in operation today and multiple fixed-wing aircraft including the Lockheed Martin F-35B/C Lighting II fighter aircraft. With its truly tactical design, the KC-130J has the ability to fly at the slow speeds and low altitudes that are ideal when refueling helicopters.\n\nAlways evolving, continually innovating and ready for what's next, the Super Hercules leads the charge by setting standards and shaping the future of tactical airlift missions — including humanitarian operations around the world. The global C-130J fleet spans 26 operators in 22 nations with 20+ air worthiness certifications. With nearly 3 million flight hours logged across the global fleet of 540+ C-130Js, invaluable insights gained from missions in every scenario equip the C-130J for what's next.\n\nFor additional information visit: www.lockheedmartin.com/C130\n\nAbout Lockheed Martin Lockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at Lockheedmartin.com.\n\nStory continues (PRNewsfoto/Lockheed Martin Aeronautics) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/lockheed-martin-delivers-2-700th-c-130-hercules-tactical-airlifter-302174868.html\n\nSOURCE Lockheed Martin Aeronautics\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-delivers-2-700th-131500056.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.009,
            "neu": 0.84,
            "pos": 0.152
        }
    },
    {
        "date": "2024-06-18T00:00:00+00:00",
        "title": "3 Space Stocks to Buy Now: June 2024",
        "content": "With the industry looking strong, space stocks are a great investment. If you buy these three companies your portfolio is sure to grow.",
        "link": "https://investorplace.com/2024/06/3-space-stocks-to-buy-now-june-2024/",
        "symbols": [
            "LDOS.US",
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.866,
            "neg": 0,
            "neu": 0.662,
            "pos": 0.338
        }
    }
]