[
    {
        "date": "2024-08-25T16:06:00+00:00",
        "title": "Why Lockheed Martin and General Dynamics Just Declared War on Rocket Engines",
        "content": "What do Iranian drones have in common with Russian hypersonic missiles and China's DF-21D \"aircraft carrier killer\" rocket? All three pose a clear and present danger to U.S. forces and their allies, and all three require air defense missiles to protect against this threat.\n\nThat's a problem for the U.S. and allied militaries, though, and for defense companies like Lockheed Martin(NYSE: LMT) and RTX Corporation, makers of the famous PATRIOT air defense missile (as well as many other missiles, such as the just as famous HIMARS rocket in use today in Ukraine).\n\nDefense products, you see, involve long supply chains -- similar to what one sees in the automotive industry -- where one company may produce a final product (like a PATRIOT) but depends on subcontractors to produce the components that go into that final product. You probably recall how shortages of low-tech automotive semiconductor chips resulted in widespread shortages of cars during the pandemic, for example. Well, today, slow shortages of rocket engines pose a bottleneck to the production of rockets by America's defense companies, too.\n\nFrom problem to solution\n\nThe Wall Street Journal reports that Northrop Grumman and L3Harris are the two defense giants that dominate the production of missile engines. Both have caught flak from Lockheed and RTX for their failure to produce enough to meet demand. To remedy this situation, Lockheed Martin has proposed that it get into the rocket engine-making business itself.\n\nIt's a big job, though, and Lockheed can't do it alone. Last week, the company confirmed it would form a joint venture with defense rival General Dynamics (NYSE: GD), aiming to develop a new generation of military missile motors to supplement the constrained supply produced by Northrop and L3Harris.\n\nIn this partnership, Lockheed will apparently act largely as a silent partner (and exclusive customer), although assisting with the design and testing of the engines. General Dynamics will do the actual manufacturing at its Camden, Arkansas, munitions factory and then ship them next door to Lockheed Martin's Guided Multiple Launch Rocket System (GMLRS) rocket assembly plant. GMLRS is one of the primary weapons launched by HIMARS rocket launchers. Having General Dynamics fulfill all of Lockheed's motor needs for this one type of missile should diminish demand for motors for other missiles, thus helping to unkink the supply chain both for Lockheed -- and for everyone else.\n\nWhat it means for Northrop and L3Harris\n\nIn the long term, the joint venture could expand its production to provide motors of other missile types produced by Lockheed and by other buyers, as well -- creating a permanent rival to Northrop and L3Harris in the missile engine market.\n\nStory continues\n\nL3Harris's Aerojet Rocketdyne subsidiary supplies only 5.4% of the company's total annual revenue, according to data from S&P Global Market Intelligence, limiting its exposure to this new threat. The effect on Northrop Grumman is harder to parse. Rocket motors are part of the company's space systems division (which is quite large, accounting for 35% of Northrop's annual revenue).\n\nIt's hard to tell, however, how much of this revenue comes from rocket motors in particular.\n\nWhat it means for Lockheed Martin and General Dynamics\n\nWhat does seem clear is that the new joint venture has the potential to benefit Lockheed Martin and General Dynamics quite a lot. Northrop Grumman earns a respectable 8.7% operating profit margin on its \"space\" business, while L3Harris's Aerojet unit generates even better profit margins of 11.6%.\n\nThose aren't bad numbers at all, assuming a Lockheed-GD joint venture can duplicate them. Moreover, if expanding the production of rocket engines helps Lockheed to sell more complete missiles to its customers, the operating margins at Lockheed's missiles and fire control division average 12.9%! Growing sales in that unit would clearly be a big boost to its business.\n\nAs for General Dynamics, the fourth part of this four-way dynamic could benefit most of all. GD's combat systems division would do the heavy lifting in building all these new rocket engines (I should also point out that Lockheed wants to grow GMLRS production by 40% this year). GD already earns 13.9% operating profit margins on its combat systems sales -- making it easily the company's most profitable business.\n\nSimply put, if this deal comes together, General Dynamics stock will be the biggest beneficiary of all.\n\nShould you invest $1,000 in General Dynamics right now?\n\nBefore you buy stock in General Dynamics, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and General Dynamics wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $792,725!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of August 22, 2024\n\nRich Smith has no position in any of the stocks mentioned. The Motley Fool recommends Lockheed Martin and RTX. The Motley Fool has a disclosure policy.\n\nWhy Lockheed Martin and General Dynamics Just Declared War on Rocket Engines was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/why-lockheed-martin-general-dynamics-160600287.html",
        "symbols": [
            "GD.US",
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.066,
            "neu": 0.786,
            "pos": 0.148
        }
    },
    {
        "date": "2024-08-25T11:07:00+00:00",
        "title": "How Lockheed Martin Bought a Space Company for 75% Off",
        "content": "Patience, as the saying goes, is a virtue. It also turns out to be quite useful if you're reluctant to overpay for a stock -- as defense and aerospace giant Lockheed Martin (NYSE: LMT) just discovered.\n\nIt's been five months now since Lockheed Martin first expressed interest in buying tiny Terran Orbital (NYSE: LLAP), a one-time SPAC company that grew into a key subcontractor of satellites for Lockheed's operations.\n\nBack in March, Lockheed offered to acquire Terran and take the company private for a buyout price of $1 a share. Terran balked at the offer, though, even going so far as to swallow a poison pill to discourage Lockheed from advancing its proposal. By May, Lockheed had apparently taken the hint and withdrawn its offer.\n\nAnd things were not looking good for Terran.\n\nTerran trips and drops the ball\n\nIn May, Terran reported that declining sales and rising costs forced it to record a net loss of more than $53 million. By August, the situation had begun to improve -- but not enough. Sales continued to decline, while interest costs on debt mounted. Terran's second-quarter 2024 earnings weren't quite as bad as in Q1, but still worse than in Q2 2023, and the company reported yet another loss: $35.4 million.\n\nWorse, concerns about the reliability of the company's contract with Rivada Space Networks -- which Terran had expected to be worth $2.4 billion in future revenue -- were mounting. Revenue from Rivada amounted to less than $5 million in the whole first half of 2024. By the end of June, Terran made the decision to delete the entire contract value from its backlog, leaving it expecting just $313 million in future revenue -- almost all of which would come from Lockheed.\n\nIt was at this point that Lockheed pounced.\n\nTerran abandons hope\n\nWith less than $15 million left in the bank, Terran management was forced to admit, \"Substantial doubt about the Company's ability to continue as a going concern exists.\" That was bad news for Terran Orbital shareholders, who lost 80% of their stock market value between April and August -- but it also posed a problem for Lockheed Martin.\n\nLockheed, remember, was depending on Terran to build \"over 100 space vehicles\" for it, most of which were needed to fulfill a multibillion-dollar missile defense contract for the Pentagon. If Terran went bust, it could jeopardize that contract, and Lockheed couldn't allow that to happen. So Lockheed made Terran another offer.\n\nInstead of $1 a share, it would pay Terran Orbital $0.25 for each share of the company it did not already own. (According to data from S&P Global Market Intelligence, Lockheed already held a 6.6% minority stake in the company). The offer represented a 75% discount from Lockheed's offered price in March -- but with bankruptcy looming, Terran was in no position to negotiate.\n\nStory continues\n\nTerran accepted.\n\nLockheed Martin scores a bargain\n\nOn Thursday, Aug. 15, Lockheed Martin announced a definitive agreement to acquire Terran Orbital. Lockheed will pay $0.25 per share -- $47.8 million -- for the shares it doesn't own, and pay off Terran's debts, resulting in a total acquisition value of \"approximately $450 million.\"\n\nWith $2.5 billion in cash and annual free cash flow of $7 billion, Lockheed can easily afford to pay this. But is it a good deal for Lockheed?\n\nActually, I'd argue it's an excellent deal. First and foremost, because it secures Lockheed's supply chain and access to the satellites it needs to fulfill its Pentagon contracts, which according to the number-crunchers at Payload Space are worth $2.6 billion to Lockheed Martin. But Lockheed's also getting a steal of a deal on the price it's paying for Terran Orbital.\n\nAdmittedly, it's not as big a steal as you might expect. With Terran's price per share dropping 75%, the actual shares may be a lot cheaper. But Lockheed's not getting a discount on the other price components of the acquisition -- paying off debts and canceling warrants to buy stock, for example. Still, in recent years, the prices large space companies have been paying to acquire their smaller, unprofitable space start-up peers have averaged about 4 times annual sales. Indeed, at the time Lockheed made its first offer to acquire Terran Orbital, this was the approximate value of the offer -- 3.9 times sales.\n\nSix months later, Lockheed's deal looks even sweeter. Terran's $133 million in trailing-12-month sales, divided into the $450 million acquisition enterprise value, works out to a valuation of 3.3 times sales -- still a comfortable 17.5% below what I'd consider fair value for a space stock.\n\nLong story short, Lockheed shareholders can rest easy that their company made the right call and got a price that's more than nice.\n\nShould you invest $1,000 in Lockheed Martin right now?\n\nBefore you buy stock in Lockheed Martin, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Lockheed Martin wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $792,725!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of August 22, 2024\n\nRich Smith has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends S&P Global. The Motley Fool recommends Lockheed Martin. The Motley Fool has a disclosure policy.\n\nHow Lockheed Martin Bought a Space Company for 75% Off was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-bought-space-company-110700418.html",
        "symbols": [
            "LLAP.US",
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.081,
            "neu": 0.784,
            "pos": 0.135
        }
    }
]