[
    {
        "date": "2024-06-30T13:00:11+00:00",
        "title": "Is Lockheed Martin (NYSE:LMT) Using Too Much Debt?",
        "content": "Some say volatility, rather than debt, is the best way to think about risk as an investor, but Warren Buffett famously said that 'Volatility is far from synonymous with risk.' So it seems the smart money knows that debt - which is usually involved in bankruptcies - is a very important factor, when you assess how risky a company is. We can see that Lockheed Martin Corporation (NYSE:LMT) does use debt in its business. But the more important question is: how much risk is that debt creating?\n\nWhen Is Debt Dangerous?\n\nDebt and other liabilities become risky for a business when it cannot easily fulfill those obligations, either with free cash flow or by raising capital at an attractive price. Part and parcel of capitalism is the process of 'creative destruction' where failed businesses are mercilessly liquidated by their bankers. However, a more common (but still painful) scenario is that it has to raise new equity capital at a low price, thus permanently diluting shareholders. Of course, plenty of companies use debt to fund growth, without any negative consequences. The first step when considering a company's debt levels is to consider its cash and debt together.\n\nView our latest analysis for Lockheed Martin\n\nWhat Is Lockheed Martin's Net Debt?\n\nAs you can see below, at the end of March 2024, Lockheed Martin had US$19.4b of debt, up from US$15.6b a year ago. Click the image for more detail. On the flip side, it has US$2.79b in cash leading to net debt of about US$16.6b. debt-equity-history-analysis\n\nHow Healthy Is Lockheed Martin's Balance Sheet?\n\nZooming in on the latest balance sheet data, we can see that Lockheed Martin had liabilities of US$17.7b due within 12 months and liabilities of US$30.6b due beyond that. On the other hand, it had cash of US$2.79b and US$16.3b worth of receivables due within a year. So its liabilities outweigh the sum of its cash and (near-term) receivables by US$29.2b.\n\nThis deficit isn't so bad because Lockheed Martin is worth a massive US$112.1b, and thus could probably raise enough capital to shore up its balance sheet, if the need arose. But it's clear that we should definitely closely examine whether it can manage its debt without dilution.\n\nWe measure a company's debt load relative to its earnings power by looking at its net debt divided by its earnings before interest, tax, depreciation, and amortization (EBITDA) and by calculating how easily its earnings before interest and tax (EBIT) cover its interest expense (interest cover). Thus we consider debt relative to earnings both with and without depreciation and amortization expenses.\n\nStory continues\n\nLockheed Martin's net debt of 1.6 times EBITDA suggests graceful use of debt. And the alluring interest cover (EBIT of 9.2 times interest expense) certainly does not do anything to dispel this impression. And we also note warmly that Lockheed Martin grew its EBIT by 18% last year, making its debt load easier to handle. When analysing debt levels, the balance sheet is the obvious place to start. But it is future earnings, more than anything, that will determine Lockheed Martin's ability to maintain a healthy balance sheet going forward. So if you're focused on the future you can check out this freereport showing analyst profit forecasts.\n\nFinally, while the tax-man may adore accounting profits, lenders only accept cold hard cash. So it's worth checking how much of that EBIT is backed by free cash flow. During the last three years, Lockheed Martin generated free cash flow amounting to a very robust 82% of its EBIT, more than we'd expect. That positions it well to pay down debt if desirable to do so.\n\nOur View\n\nLockheed Martin's conversion of EBIT to free cash flow suggests it can handle its debt as easily as Cristiano Ronaldo could score a goal against an under 14's goalkeeper. And that's just the beginning of the good news since its interest cover is also very heartening. Looking at the bigger picture, we think Lockheed Martin's use of debt seems quite reasonable and we're not concerned about it. While debt does bring risk, when used wisely it can also bring a higher return on equity. There's no doubt that we learn most about debt from the balance sheet. However, not all investment risk resides within the balance sheet - far from it. For example - Lockheed Martin has  1 warning sign  we think you should be aware of.\n\nAt the end of the day, it's often better to focus on companies that are free from net debt. You can access our special list of such companies (all with a track record of profit growth). It's free.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-nyse-lmt-using-130011109.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.13,
            "neu": 0.705,
            "pos": 0.165
        }
    }
]