[
    {
        "date": "2024-10-09T17:50:37+00:00",
        "title": "Lockheed names new F-35 fighter jet program leader",
        "content": "By Mike Stone\n\nWASHINGTON (Reuters) - Lockheed Martin announced on Wednesday that Chauncey McIntosh been appointed vice president and general manager of the F-35 Lightning II Program, effective Dec. 1.\n\nMcIntosh will replace Bridget Lauderdale, who will retire at the end of the year after a 38-year career with the aerospace giant.\n\nMcIntosh will inherit an F-35 program is facing challenges, particularly with the delayed rollout of Technology Refresh 3 (TR 3). TR 3 is an upgrade that includes advanced hardware and software enhancements aimed at improving the jet's processing power, memory, and data storage capabilities.\n\nMcIntosh, who has over 20 years of experience in program management, engineering, and customer engagement, previously served as the vice president and deputy of the F-35 program.\n\nIn his new role Lockheed said he will focus on enhancing customer experiences, reinforcing the F-35's capabilities and reliability, and ensuring the program meets the speed, agility, quality, and affordable requirements expected by both U.S. and international clients.\n\n\"Chauncey is an exceptional leader with distinct qualifications needed to lead the F-35 program. His selection showcases the strength and depth of Lockheed Martin's leadership succession planning,\" said Greg Ulmer, president of Lockheed Martin Aeronautics.\n\nMcIntosh's previous roles at Lockheed Martin include leading the Integrated Warfare Systems & Sensors business, where he successfully transformed Aegis Weapon System software development.\n\n(Reporting by Mike Stone in Washington; Editing by Nick Zieminski)",
        "link": "https://ca.finance.yahoo.com/news/lockheed-names-f-35-fighter-175037054.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.931,
            "neg": 0.027,
            "neu": 0.88,
            "pos": 0.093
        }
    },
    {
        "date": "2024-10-09T17:40:00+00:00",
        "title": "Lockheed Martin Announces New F-35 Leader",
        "content": "FORT WORTH, Texas, Oct. 9, 2024 /PRNewswire/ -- Lockheed Martin (NYSE:LMT) announced today Chauncey McIntosh has been named vice president and general manager of the F-35 Lightning II Program, effective Dec. 1. McIntosh succeeds Bridget Lauderdale, who will be retiring at the end of the year following a 38-year career with the company.  Chauncey McIntosh\n\nMcIntosh, who most recently served as the vice president and deputy of the F-35 program, is an exceptional leader with more than 20 years of business, program management, engineering and customer engagement experience. As the vice president and general manager for the F-35 program, McIntosh will be responsible for further strengthening positive customer experiences by reinforcing and continually growing the capability and reliability of the F-35; showcasing significant program progress; and ensuring the F-35 program meets the speed, agility, quality and affordability requirements deserved and expected by U.S. and international customers.\n\nMcIntosh previously led Lockheed Martin's Integrated Warfare Systems & Sensors business, which is responsible for Aegis Weapon System software development. Under his leadership, McIntosh oversaw the successful transformation of Aegis software development. Prior to that role, he served as the vice president and general manager for Lockheed Martin's Training and Logistics Solutions line of business, leading execution and strategic growth of mission readiness and sustainment programs including the F-35. He holds a bachelor's degree in electrical engineering from the Georgia Institute of Technology and a master's degree in business administration from American InterContinental University. A full bio for McIntosh is available on the Lockheed Martin website.\n\n\"Chauncey is an exceptional leader with distinct qualifications needed to lead the F-35 program. His selection showcases the strength and depth of Lockheed Martin's leadership succession planning,\" said Greg Ulmer, president, Lockheed Martin Aeronautics. \"Critical leadership appointments like this will continue to advance our 21st Century Security® solutions to support our growing customer needs.\"\n\nThe F-35 is the most advanced, connected fighter aircraft in the world, providing unmatched 5th Generation capabilities and strengthening allied deterrence for the U.S. and its allies. To date, 19 global customers have chosen the F-35 for its advanced, connected capabilities to strengthen 21st Century Security, enhance global partnerships and power economic growth. More than 1,000 F-35s are currently operational around the globe and have generated more than 922,000 flight hours. F-35s operate from 33 bases worldwide, including 10 nations operating on home soil. As adversaries advance and legacy aircraft age, the F-35 is critical to maintaining air dominance for decades to come.\n\nStory continues\n\nAbout Lockheed Martin Lockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at Lockheedmartin.com.  (PRNewsfoto/Lockheed Martin Aeronautics) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/lockheed-martin-announces-new-f-35-leader-302271894.html\n\nSOURCE Lockheed Martin Aeronautics\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-announces-f-35-174000681.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.023,
            "neu": 0.8,
            "pos": 0.177
        }
    },
    {
        "date": "2024-10-09T10:00:41+00:00",
        "title": "NOAA's 'Hurricane Hunters' utilize Lockheed, Gulfstream planes to get storm data",
        "content": "The NOAA’s Hurricane Hunters have been actively flying missions for Hurricane Milton, the intense storm swirling toward Florida’s west-central coast.\n\nThe National Hurricane Center, which uses data from NOAA and Air Force Reserve Hurricane Hunter flights, said in a Tuesday public advisory that the storm will come onshore Wednesday night in west-central Florida. It became a Category 5 storm again Tuesday after briefly weakening.\n\nThe flights that the NOAA Hurricane hunters have conducted for Hurricane Milton marks the latest instances of the daring group taking to the skies to support vital hurricane forecast models and research through data-gathering.\n\nAccording to the agency, the group uses three aircraft – two made by Lockheed Martin and one by Gulfstream – for traversing through, around and above hurricanes.\n\nSome Florida Store Shelves Nearly Empty As Milton Barrels Toward Coast\n\nThe NOAA’s two Lockheed WP-3D Orion planes feature a \"unique array of scientific instrumentation, radars and recording systems for measurements of the atmosphere, the earth and its environment,\" the NOAA’s Office of Marine and Aviation Operations has said.\n\nRead On The Fox Business App\n\nThat includes lower fuselage and tail Doppler radar systems that can give \"an MRI-like look\" at a given storm and deployable GPS dropwindsondes to measure properties like pressure and wind speed, among other instruments, according to the agency.\n\nThe four-engine turboprop WP-3D Orion planes, which can fly up to 3,800 nautical miles and reach up to 27,000 feet in the air, are nicknamed \"Kermit\" and \"Miss Piggy.\"\n\nDuring a recent flight through Hurricane Milton, \"Miss Piggy\" experienced a \"bump ride\" that jostled but did not appear to phase her passengers, according to a Tuesday X post from the NOAA Aircraft Operations Center.\n\nThe NOAA Hurricane Hunters also operate a Gulfstream IV-SP jet called \"Gonzo.\"\n\nWhen deployed, the aircraft typically traverses around and above hurricanes \"gathering vital high-altitude data with GPS dropwindsondes and tail Doppler radar that enables forecasters to map the steering currents that influence the movements of hurricanes,\" according to the NOAA’S Office of Marine and Aviation Operations. It can fly as high as 45,000 feet.\n\nThe NOAA’s Gulfstream IV-SP has been busy with Milton, making several flights over the past couple of days, FlightAware data indicated.\n\nThe Air Force Reserve also has its own Hurricane Hunters that belong to the 403rd Wing’s 53rd Weather Reconnaissance Squadron and provide support for the NHC. They use 10 WC-130J Hercules planes that also come from Lockheed Martin to fly hurricanes.\n\nStory continues\n\nHurricane Milton Drives Gas Shortage In Florida As Residents Flee Storm\n\nLike the NOAA Hurricane Hunters, they, too, have been investigating Hurricane Milton through missions.\n\nThe NOAA has new aircraft slated to enter its Hurricane Hunter fleet.\n\nIn late September, the agency said it had given Lockheed Martin a contract that \"covers acquisition of two C-130J Hercules aircraft and the NOAA-specific design efforts, with options for additional aircraft.\"\n\nThe pair of \"next-generation hurricane hunter\" planes will replace \"Kermit\" and \"Miss Piggy\" in 2030, according to the NOAA. They are expected to have more room for science payloads as well as additional instruments and technology for more data-gathering capabilities for hurricanes and other research.\n\nDuring the summer, NOAA said it plans to acquire its second \"fully modified\" Gulfstream G550 \"specially configured\" for hurricane forecasts and other initiatives as part of an existing contract with Gulfstream.\n\nHurricane Milton Has Florida Homeowners And The Insurance Market Bracing For Impact\n\nA G550 jet that NOAA is receiving before that one will take over for its current Gulfstream IV-SP in 2025.\n\n\"The acquisition of these highly capable aircraft is a major step forward in the recapitalization of NOAA’s aircraft fleet, which forecasters, researchers and decision-makers depend on for live-saving information,\" NOAA Commissioned Officer Corps and Marine and Aviation Operations Vice Adm. Nancy Hann said of the two G550s.\n\nOriginal article source:NOAA's 'Hurricane Hunters' utilize Lockheed, Gulfstream planes to get storm data\n\nView comments",
        "link": "https://finance.yahoo.com/news/noaas-hurricane-hunters-utilize-lockheed-100041887.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.948,
            "neg": 0.02,
            "neu": 0.935,
            "pos": 0.045
        }
    }
]