[
    {
        "date": "2024-10-17T15:43:38+00:00",
        "title": "Lockheed Martin (LMT): F-35 Program and Global Defense Spending to Drive Growth",
        "content": "We recently published a list of 10 Stocks That Could 10X Over the Next 5 Years. In this article, we are going to take a look at where Lockheed Martin Corporation (NYSE:LMT) stands against other stocks that could 10x over the next 5 years.\n\nDespite ongoing concerns related to the durability of growth and interest rate policy, Deloitte believes that the broader US economy is fundamentally strong. While real GDP growth witnessed some slowness in Q1 2024, growth rebounded to 3.0% in Q2 2024. All the available evidence demonstrates that policymakers have managed to bring inflation under control without a recession.\n\nMarket experts opine that the boom in factory construction is expected to boost the economy’s potential over the upcoming years. Deloitte expects that, in the short term, a faster pace of interest rate cuts by the US Fed is expected to allow households to take on more debt and support continued consumer spending growth. This, together with the elevated government consumption, will help the US economy to grow by 2.7% this year.\n\nPathway for Rate Cuts\n\nS&P Global expects that the global policy rate easing cycle remains in full swing after the 50-bps cut by the US Fed in mid-September.  The US has been outperforming as growth remains above potential, amidst relatively higher policy and market rates. This above-trend growth stems from services and private investment, new business formation, and productivity.\n\nThe firm believes that the US Fed is on a path to a steady series of interest-rate cuts, and the company is expecting policy rates to reach the terminal rate of 3.00%-3.25% by 2025 end, with risks in both directions. It has kept its probability of a recession starting in the upcoming 12 months unchanged at 25%. With healthy consumption, the company expects that fears of a recession in the near term are overblown.\n\nAmidst Noise, What Are Investment Implications?\n\nEY believes that the US economy is expected to slow into 2025, with restrictive monetary policy and elevated costs curbing the private sector activity. On the positive side, it expects that the recession risks are contained. Households are expected to spend more cautiously, with labor market conditions and income growth softening further. Also, still-elevated financing costs will continue to prompt the businesses to hire and deploy capital with discretion. Investors should know that lower inflation and interest rates, together with a balanced labor market, should result in cooler but more sustainable economic growth in 2025. EY expects real GDP growth to average ~2.7% in 2024.\n\nRegarding consumer spending, Vanguard believes that healthy balance sheets, together with a steady labor market, should support consumer spending over the coming quarters, though at a more modest pace as compared to recent quarters.\n\nAs per Merrill (A Bank of America Company), for long-term investors, events such as worker strikes do not often warrant action. Concerning military conflict events, the company has continued to be constructive on Defense stocks for years considering the trend in geopolitical risk. It was highlighted that the pure-play S&P 500 Defense stocks were able to outperform S&P 500 Energy stocks on October 1. This was because of elevated tensions in Israel/Iran and spike in oil prices. Also, defense stocks outperformed when equity volatility increased in July.\n\nTherefore, Merrill believes that defense stocks provide some non-cyclical diversification benefits that cannot be offered by energy. For interest rates, the risks of supply-side inflation warrant the Fed’s attention considering the potential for disinflation to slow or stop. Also, the geopolitical conflict can mean longer-term rates and borrowing rates for the private sector remaining higher for longer.\n\nTo put things in perspective, Wall Street analysts opine that, amidst uncertainties, long-term investors should be inclined towards diversification and fundamentally strong companies that offer strong potential for the next 3-5 years.\n\nOur Methodology\n\nTo list the 10 Stocks That Could 10X Over the Next 5 Years, we conducted extensive research and sifted through several online rankings. After extracting the list of 20-25 stocks, we narrowed the list to the following 10 stocks, and ranked them in the ascending order of their hedge fund sentiments, as of Q2 2024.\n\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here). Lockheed Martin (LMT): F-35 Program and Global Defense Spending to Drive Growth\n\nA military aircraft in flight, showing the strength of the company's combat & air mobility capability.\n\nLockheed Martin Corporation (NYSE:LMT)\n\nNumber of Hedge Fund Holders: 56\n\nLockheed Martin Corporation (NYSE:LMT) is a security and aerospace company, which is engaged in the research, design, development, manufacture, integration, and sustainment of technology systems, products, and services.\n\nWall Street analysts remain optimistic about Lockheed Martin Corporation (NYSE:LMT) primarily because of an improved revenue growth outlook, de-risking of the F-35 program, and favorable market sentiments for the Missiles and Fire Control (MFC) segment. The resumption of F-35 deliveries should help Lockheed Martin Corporation (NYSE:LMT)’s stock for the next 12-18 months. Also, the planned production rate increases because of the US and international demand should aid the MFC segment.\n\nIn the past, the strong performance of this segment stemmed from higher global defense spending and the need for advanced missile systems across geopolitical hotspots. Wall Street assumes that this trend is likely to continue, offering a strong foundation for Lockheed Martin Corporation (NYSE:LMT)’s growth over the coming years. Moreover, increased defense spending in Europe and other regions, primarily because of geopolitical tensions, should help the company’s international business.\n\nLockheed Martin Corporation (NYSE:LMT) appears to be well-placed to benefit from this trend as its diverse portfolio of products and services align with the requirements of international customers. For FY 2024, the company expects net sales in the range of $70,500 million – $71,500 million and free cash flow of between $6,000 million – $6,300 million.\n\nSusquehanna boosted its price target on the shares of Lockheed Martin Corporation (NYSE:LMT) from $540.00 to $565.00, giving a “Positive” rating on 24th July. Wall Street believes that the trend of higher international defense spending creates a significant opportunity for Lockheed Martin Corporation (NYSE:LMT). With countries planning to modernize military capabilities due to evolving global threats, demand for the company’s advanced defense systems should grow.\n\nOverall, LMT ranks 1st on our list of stocks that could 10x over the next 5 years. While we acknowledge the potential of LMT as an investment, our conviction lies in the belief that some deeply undervalued AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for a deeply undervalued AI stock that is more promising than LMT but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nREAD NEXT: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-f-35-154338727.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.052,
            "neu": 0.795,
            "pos": 0.153
        }
    },
    {
        "date": "2024-10-17T13:15:25+00:00",
        "title": "What Analyst Projections for Key Metrics Reveal About Lockheed (LMT) Q3 Earnings",
        "content": "Wall Street analysts expect Lockheed Martin (LMT) to post quarterly earnings of $6.47 per share in its upcoming report, which indicates a year-over-year decline of 4.4%. Revenues are expected to be $17.28 billion, up 2.4% from the year-ago quarter.\n\nOver the past 30 days, the consensus EPS estimate for the quarter has been adjusted upward by 0.3% to its current level. This demonstrates the covering analysts' collective reassessment of their initial projections during this period.\n\nBefore a company reveals its earnings, it is vital to take into account any changes in earnings projections. These revisions play a pivotal role in predicting the possible reactions of investors toward the stock. Multiple empirical studies have consistently shown a strong association between trends in earnings estimates and the short-term price movements of a stock.\n\nWhile investors usually depend on consensus earnings and revenue estimates to assess the business performance for the quarter, delving into analysts' forecasts for certain key metrics often provides a more comprehensive understanding.\n\nGiven this perspective, it's time to examine the average forecasts of specific Lockheed metrics that are routinely monitored and predicted by Wall Street analysts.\n\nThe consensus estimate for 'Net sales- Aeronautics' stands at $6.76 billion. The estimate points to a change of +0.6% from the year-ago quarter.\n\nThe consensus among analysts is that 'Net sales- Rotary and Mission Systems' will reach $4.20 billion. The estimate indicates a year-over-year change of +2%.\n\nIt is projected by analysts that the 'Net sales- Missiles and Fire Control' will reach $3.12 billion. The estimate suggests a change of +6.2% year over year.\n\nThe combined assessment of analysts suggests that 'Net sales- Space' will likely reach $3.17 billion. The estimate suggests a change of +2.4% year over year.\n\nThe average prediction of analysts places 'Operating Profit- Aeronautics' at $665.84 million. The estimate compares to the year-ago value of $671 million.\n\nAnalysts expect 'Operating Profit- Space' to come in at $277.56 million. Compared to the current estimate, the company reported $259 million in the same quarter of the previous year.\n\nBased on the collective assessment of analysts, 'Operating Profit- Rotary and Mission Systems' should arrive at $479.60 million. The estimate compares to the year-ago value of $482 million.\n\nAnalysts forecast 'Operating Profit- Missiles and Fire Control' to reach $362.61 million. The estimate compares to the year-ago value of $398 million.\r\n\r\nView all Key Company Metrics for Lockheed here>>>\r\n\r\nShares of Lockheed have demonstrated returns of +8.4% over the past month compared to the Zacks S&P 500 composite's +3.8% change. With a Zacks Rank #3 (Hold), LMT is expected to mirror the overall market performance in the near future. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/analyst-projections-key-metrics-reveal-131525270.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.988,
            "neg": 0.009,
            "neu": 0.897,
            "pos": 0.094
        }
    },
    {
        "date": "2024-10-17T13:00:10+00:00",
        "title": "How to Boost Your Portfolio with Top Aerospace Stocks Set to Beat Earnings",
        "content": "Quarterly financial reports play a vital role on Wall Street, as they help investors see how a company has performed and what might be coming down the road in the near-term. And out of all of the metrics and results to consider, earnings is one of the most important.\n\nLife and the stock market are both about expectations, and rising above what is expected is often rewarded, while falling short can come with negative consequences. Investors might want to try to capture stronger returns by finding positive earnings surprises.\n\n2 Stocks to Add to Your Watchlist\n\nThe Zacks Expected Surprise Prediction, or ESP, works by locking in on the most up-to-date analyst earnings revisions because they can be more accurate than estimates from weeks or even months before the actual release date. The thinking is pretty straightforward: analysts who provide earnings estimates closer to the report are likely to have more information. With this in mind, the Expected Surprise Prediction compares the Most Accurate Estimate (being the most recent) against the overall Zacks Consensus Estimate. The percentage difference provides the ESP figure.\n\nThe last thing we will do today, now that we have a grasp on the ESP and how powerful of a tool it can be, is to look at a qualifying stock. Lockheed Martin (LMT) holds a Zacks Rank #3 at the moment and its Most Accurate Estimate comes in at $6.56 a share five days away from its upcoming earnings release on October 22, 2024.\n\nLMT has an Earnings ESP figure of 1.29%, which, as explained above, is calculated by taking the percentage difference between the $6.56 Most Accurate Estimate and the Zacks Consensus Estimate of $6.47.\n\nLMT is just one of a large group of Aerospace stocks with a positive ESP figure. Northrop Grumman (NOC) is another qualifying stock you may want to consider.\n\nNorthrop Grumman, which is readying to report earnings on October 24, 2024, sits at a Zacks Rank #2 (Buy) right now. It's Most Accurate Estimate is currently $6.13 a share, and NOC is seven days out from its next earnings report.\n\nNorthrop Grumman's Earnings ESP figure currently stands at 1.12% after taking the percentage difference between its Most Accurate Estimate and its Zacks Consensus Estimate of $6.06.\n\nLMT and NOC's positive ESP figures tell us that both stocks have a good chance at beating analyst expectations in their next earnings report.\n\nFind Stocks to Buy or Sell Before They're Reported\n\nUse the Zacks Earnings ESP Filter to turn up stocks with the highest probability of positively, or negatively, surprising to buy or sell before they're reported for profitable earnings season trading. Check it out here >>\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/boost-portfolio-top-aerospace-stocks-130010515.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.015,
            "neu": 0.853,
            "pos": 0.132
        }
    },
    {
        "date": "2024-10-17T10:09:00+00:00",
        "title": "These 2 Industrial Powerhouses Just Declared Dividend Raises",
        "content": "We can't say that October is a traditionally hot time for dividend raises, but a smattering of publicly traded companies chose the spooky month for their latest payout hikes. Among the better-known lifters were a pair of sturdy industrial sector mainstays, Lockheed Martin(NYSE: LMT) and Honeywell(NASDAQ: HON). Here's a look at this fresh pair of dividend raises.\n\n1. Lockheed Martin\n\nBeing the largest pure-play defense company on this planet gives Lockheed Martin a great deal of power on the market. It also helps power its payout to ever-higher altitudes. The company wasn't shy about mentioning that its latest quarterly dividend raise -- by nearly 5% over its predecessor, to $3.30 per share -- marks the 22nd year in a row it's upped the distribution.\n\nThe beauty of being an active and busy U.S. defense contractor is the prizes a company can earn purely from major government contracts. Our armed forces want contractors they can rely on for many years, so deals in this business can be quite long in duration. They are also lucrative, given the sophisticated hardware required and the immense size of federal coffers.\n\nLockheed Martin has been a go-to defense producer for decades. It's no accident that it's the prime contractor in the F-35 program, taking the lead with the most sophisticated fighter jet in history. These days, we happen to live in a world with high-stakes conflicts either in progress or primed and ready to launch. It wasn't surprising, then, that the company boosted its sales by 9% year over year in its most recently reported quarter to over $18 billion.\n\nWe're barely one week away from Lockheed Martin's scheduled third-quarter earnings release. Analysts are expecting continued top-line growth (by almost 4% to nearly $17.4 billion). Although profitability is expected to slump to $6.47 per share from the year-ago $6.73, the former is still well in the black. At the same time, the company's free cash flow is more than high enough to keep raising the payout, so there are no worries on that front.\n\nLockheed Martin will pay that raised dividend on Dec. 27 to investors of record as of Dec. 2. At the most recent closing share price, it would yield 2.2%.\n\n2. Honeywell\n\nElsewhere in the industrial sector, we have the sprawling engineering company Honeywell. Similar to Lockheed Martin, Honeywell's board of directors recently approved a dividend raise approaching 5%, in this case to $1.13 per quarter. With the move, Honeywell has declared at least one dividend raise annually for 14 years in a row.\n\nWhile this payout profile is close to that of Lockheed Martin, unfortunately Honeywell isn't quite as soaring in terms of performance. It's difficult to effectively manage sprawl, and the storied company has been stumbling over the past few years. Its big throw on the once-promising internet of things (IoT) market has yet to pay off meaningfully, and it isn't a dominant player in any industrial segment that's hot at the moment.\n\nHoneywell's financials tell the tale. Following pandemic-era slumps in both revenue and, especially, profitability, the company has yet to reach pre-pandemic levels in either metric.\n\nThat being said, it hasn't done too badly of late. It managed to grow its top line by 5% year over year in the second quarter to nearly $9.6 billion, although only one of its four divisions -- aerospace -- saw meaningful growth (of 16%). Non-GAAP (adjusted) earnings per share, meanwhile, increased an encouraging 8% to $2.49.\n\nAt the end of 2023, Honeywell management said it would \"align\" its immense product portfolio to three significant global trends -- automation, the future of aviation, and the transition to green energy. It takes time to course-correct a ship this large, so patience will be necessary with the company. Given its history and its vast resources, I'd give it more than a fighting chance to succeed. The Honeywells of this world usually don't stay down forever.\n\nThe company's new dividend is to be handed out on Dec. 6 to stockholders of record as of Nov. 15. It would yield 2.1%.\n\nShould you invest $1,000 in Lockheed Martin right now?\n\nBefore you buy stock in Lockheed Martin, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Lockheed Martin wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $806,459!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of October 14, 2024\n\nEric Volkman has no position in any of the stocks mentioned. The Motley Fool recommends Lockheed Martin. The Motley Fool has a disclosure policy.\n\nThese 2 Industrial Powerhouses Just Declared Dividend Raises was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/2-industrial-powerhouses-just-declared-100900208.html",
        "symbols": [
            "HON.US",
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.055,
            "neu": 0.807,
            "pos": 0.138
        }
    }
]