[
    {
        "date": "2024-08-28T16:21:00+00:00",
        "title": "Air Industries Secures $110M Contract for GTF Engine Parts",
        "content": "Air Industries Group AIRI recently secured its largest contract, a $110 million deal to manufacture Thrust Struts for Geared Turbo-Fan (GTF) jet engines. This contract will begin in January 2025 and run through 2031.\r\n\r\nSuccessful delivery of the thrust struts is likely to bolster AIRI’s top-line performance. Following this contract win, the company’s backlog count has increased to more than $280 million.\n\nAIRI & Combat Jets\n\nAir Industries plays an important role in the military jet market as a leading manufacturer of precision components and assemblies, such as landing gears, flight controls, engine mounts, and components for aircraft jet engines. These components are crucial for the safety and reliability of military jets.\r\n\r\nNotably, the company builds thrust struts for GTF jet engines, made by prominent aircraft engine manufacturer – Pratt & Whitney. The GTF family of jet engines powers some of the most renowned aircraft across the globe, such as Airbus A320neo, A220 and E2 jets of Embraer. The demand for AIRI’s thrust struts, thus, remains solid. The company, therefore, enjoys steady orders for its thrust struts, like the latest one, which in turn are expected to boost its future operating results.\n\nAIRI’s Growth Prospects\n\nMilitary jets are increasingly sought after due to their advanced technological features, including improved stealth capabilities, precision targeting, and enhanced speed. In recent times, solid demand for military jets has been witnessed worldwide, driven by increasing geopolitical tensions and the need for nations to enhance their defense capabilities. As global conflicts and the threat of warfare are on the rise, countries are investing heavily in modernizing their air forces to maintain strategic advantages.\r\n\r\nThis must have led the Morder Intelligence firm to predict that the global fighter aircraft market will witness a CAGR of 37% during the 2024-2029 time period.\r\n\r\nThis trend has benefitted Air Industries, with the company’s products currently being deployed on many high-profile military aircraft such as the Sikorsky UH-60 Black Hawk, Lockheed Martin F-35 Lightning II (Joint Strike Fighter) and F-16 Fighting Falcon, Northrop Grumman E-2C/D, Boeing F-15 Eagle and F-18 Hornet.\n\nAIRI’s Peer Prospects\n\nOther aerospace companies in the sector that are likely to enjoy the perks of the expanding fighter jet market have been discussed below.\r\n\r\nThe Boeing Company’s BA Defense, Space & Security division is a renowned manufacturer of fixed-wing and rotary-wing combat aircraft. The company’s product portfolio includes military jets like the F/A–18 Super Hornet, F-15 EX and EA-18G Growler.\r\n\r\nBoeing has a long-term (three to five years) earnings growth rate of 21.3%. The Zacks Consensus Estimate for BA’s third-quarter 2024 sales indicates an improvement of 10.8% from the prior-year quarter’s figure.\r\n\r\nLockheed Martin Corporation LMT is the producer of some of the most advanced military jets in the world. Its key jet programs include the F-35 Lightning II, F-22 Raptor, F-16 Fighting Falcon and C-130 Hercules.\r\n\r\nLockheed has a long-term earnings growth rate of 4.7%. The Zacks Consensus Estimate for 2024 sales indicates year-over-year growth of 5.3%.\r\n\r\nNorthrop Grumman Corporation NOC is a leading provider of proven manned and unmanned air systems. It builds some of the world’s most advanced aircraft like the B-2 Spirit Stealth Bomber, A-10 Thunderbolt II, B-21 Raider and F-35 Lightning II.\r\n\r\nNorthrop Gruman has a long-term earnings growth rate of 8.7%. The consensus estimate for 2024 sales indicates year-over-year growth of 5.4%.\n\nStory continues\n\nAIRI Stock Price Movement\n\nShares of AIRI have gained 56.8% in the past month compared with the industry’s 2.2% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nAIRI’s Zacks Rank\n\nAIRI currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks Rank #1 (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nAir Industries Group (AIRI) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/air-industries-secures-110m-contract-162100162.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.037,
            "neu": 0.805,
            "pos": 0.158
        }
    },
    {
        "date": "2024-08-28T15:36:00+00:00",
        "title": "Poland and Lockheed Martin Celebrate Debut of Poland's First F-35A \"Husarz\"",
        "content": "FORT WORTH, Texas, Aug. 28, 2024 /PRNewswire/ -- Lockheed Martin (NYSE: LMT) presented Poland's first F-35A Lightning II to the Polish government during a rollout ceremony at Lockheed Martin's F-35 production facility. This event marks a significant milestone in the Polish Air Force's history and strengthens the alliance between the United States and Poland, a key NATO ally. Poland's First F-35\n\n\"Over more than 100-years of the Polish Air Force, there have been many generations of pilots and aircraft. I am proud to be part of history today, introducing the F-35 as the next generation, which will protect and defend Poland's future for many years. We are joining a strong coalition of 5th generation fighters across Europe, bolstering air superiority through allied deterrence,\" said Major General Ireneusz Nowak, Inspector of Polish Air Force.\n\nAs the most advanced 21st Century Security® solution, the F-35 is the NATO aircraft of choice and will help extend Poland's strong leadership in NATO through investment in military modernization and enhanced participation in foreign missions. Poland is one of several NATO nations to invest in the allied deterrence of the F-35. With its unmatched interoperability, Poland's F-35s, named \"Husarz\" to pay homage to a calvary unit from the country's military past, will connect assets across domains to increase situational awareness for Poland and its key European partners.\n\n\"As the NATO aircraft of choice, the F-35 is a powerful force multiplier and critical to deterring and defeating threats for Poland and its allies,\" said Greg Ulmer, president, Lockheed Martin Aeronautics. \"We are honored to strengthen our enduring partnership with Poland through today's celebration, ensuring Polish national security and long-term capability development for decades to come.\"\n\nSenior government and military leaders from Poland and the United States attended the ceremony to celebrate Poland's first of 32 F-35As per its program of record. The first aircraft, designated AZ-01, will be delivered to the Polish Air Force in December and will be based at Ebbing Air National Guard Base, Arkansas, where Poland will be the first international customer to conduct F-35 pilot training.\n\nF-35s are now operating from 32 bases worldwide. To date, Lockheed Martin has delivered more than 1,000 F-35s, trained more than 2,540 pilots and 16,690 maintainers, and the F-35 fleet has surpassed 889,000 cumulative flight hours. Lockheed Martin continues to work side by side with F-35 operators to ensure allies remain ahead of the evolving threat.\n\nStory continues\n\nAbout Lockheed Martin Lockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at Lockheedmartin.com.\n\nPlease follow @LMNews on X for the latest announcements and news across the corporation. (PRNewsfoto/Lockheed Martin Aeronautics) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/poland-and-lockheed-martin-celebrate-debut-of-polands-first-f-35a-husarz-302233097.html\n\nSOURCE Lockheed Martin Aeronautics\n\nView comments",
        "link": "https://finance.yahoo.com/news/poland-lockheed-martin-celebrate-debut-153600417.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.029,
            "neu": 0.814,
            "pos": 0.158
        }
    },
    {
        "date": "2024-08-28T14:03:00+00:00",
        "title": "Leidos Wins a $51M Deal to Upgrade Missile Capabilities",
        "content": "Leidos Holdings, Inc. LDOS recently clinched a contract for Missile Warning/Missile Track Enhancement (MW/MT) from the Space Systems Command, Strategic Warning and Surveillance Systems Acquisition Delta. The value of the award is $51 million.\r\n\r\nPer the terms of the contract, Leidos will deliver mission software and technology-enabled services to improve missile warning capabilities for the Combatant Commanders' Integrated Command and Control Systems.\n\nWhat’s Favoring LDOS?\n\nRapidly increasing geopolitical tensions worldwide, along with heightened regional conflicts in different parts of the globe, like the Middle East and the Russian invasion of Ukraine, have prompted nations to bolster their defense capabilities.  Since missiles constitute a large share of a nation’s defense arsenals, countries are investing heftily these days in advanced missile systems for deterrence and defense. This has been boosting the demand for technologically advanced missile systems.\r\n\r\nThe Mordor Intelligence firm predicts the global market for missiles and missile defense systems to witness a CAGR of 5% between 2024 and 2029. Such growth opportunities offered by the aforementioned market should bode well for Leidos, which also focuses on integrating cutting-edge technologies to enhance missile performance, reliability and effectiveness.\r\n\r\nLeidos is a renowned provider of cutting-edge technology, offering the United States access to several medium Earth orbit and low Earth orbit constellations of infrared sensors that can follow and identify the most sophisticated missile threats, from ballistic to hypersonic and tactical to strategic.\r\n\r\nSuch capabilities of LDOS must have enabled the company to win steady orders for its products that support missile warning and threat detection, like the latest one.\n\nPeer Prospects\n\nAs global threats continue to rise, apart from Leidos, defense contractors that are likely to benefit from the growth opportunities offered by the missile and missile defense system market have been discussed below.\r\n\r\nThe Boeing Company BA: For almost 25 years, the company has been providing air and missile defense systems to the United States, its allies and international partners. Its offerings include the Avenger Air Defense System and Ground-Based Midcourse Defense.\r\n\r\nBoeing boasts a long-term earnings growth rate of 21.3%. The Zacks Consensus Estimate for BA’s 2025 sales implies growth of 20.3% from the prior-year projected figure.\r\n\r\nNorthrop Grumman NOC: The company develops and manufactures warheads, fuses, advanced high-speed propulsion systems and other missile components. It is a leading supplier of solid rocket propulsion for air-launched missiles, interceptors, submarine-launched weapons and hypersonic missile systems.\r\n\r\nNorthrop has a long-term (three to five years) earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales suggests growth of 5.4% from the prior-year reported figure.\r\n\r\nLockheed Martin LMT: The company’s Missiles and Fire Control business unit develops, manufactures and supports advanced missiles and rockets. Some of its renowned products are the PAC-3 family of missiles, M270, RRPR and THHAD.\r\n\r\nLockheed has a long-term earnings growth rate of 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales implies growth of 5.3% from the prior-year reported figure.\n\nStory continues\n\nPrice Movement\n\nIn the past six months, shares of Leidos have rallied 23.3% compared with the industry’s growth of 1.6%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLeidos currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nLeidos Holdings, Inc. (LDOS) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/leidos-wins-51m-deal-upgrade-140300311.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "L1DO34.SA",
            "LDOS.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.044,
            "neu": 0.777,
            "pos": 0.178
        }
    },
    {
        "date": "2024-08-28T12:36:00+00:00",
        "title": "RTX Secures a Contract for Next Generation Jammer Mid-Band System",
        "content": "RTX Corp. RTX recently clinched a contract involving its Next Generation Jammer Mid-Band (NGJ-MB) System. The award has been provided by the Naval Supply Systems Command Weapon Systems Support, Philadelphia, PA.\n\nDetails of the Deal Secured by RTX\n\nValued at $27.7 million, the contract is expected to be completed by August 2026. Per the terms of the deal, RTX will be involved in the repair of several components used in the NGJ-MB System used on the F/A-18 aircraft.\n\nA major portion of the work related to this contract will be executed in Forest, MS, and Fort Wayne, IN.\n\nWhat’s the Purpose of NGJ-MB?\n\nRTX’s NGJ-MB offers enhanced airborne electronic attack capabilities to fighter aircraft. It is the U.S. Navy’s advanced electronic attack system to disrupt enemy technology.\n\nThe NGJ-MB uses digital, software-based and Active Electronically Scanned Array technologies that allow operators to non-kinetically attack multiple targets at greater distances.\n\nWhat’s Favoring the RTX Stock?\n\nEscalating geopolitical tensions worldwide have led to increased defense budgets and modernization initiatives across nations as they strive to strengthen their defense capabilities, electronic warfare (EW) systems being one among them. Notably, EW systems constitute a critical element of a nation’s defense structure, with a rapid evolution in the use of advanced technologies over the last decade.\n\nIn particular, electronic attack systems like RTX’s NGJ-MB help strengthen a nation’s ability to perform threat analysis and respond in a timely manner. They do so by offering countermeasures such as signal jamming, electromagnetic deception (spoofing), lasers and radio frequency (RF) weapons to achieve threat neutralization.\n\nRTX, well-known for its combat-proven missiles and radars, provides the United States and its international partners with the combat power and technology needed to complete any direct attack, standoff and strike missions during times of need. Its NGJ-MB is one such product that boasts the capability to disrupt enemy technology, including air defense systems and communications tools.\n\nFactors like increased integration of AI into EW systems, the advent of cognitive EW systems, and military forces of varied nations deploying more sophisticated electronic and cyber capabilities are boosting the demand for cutting-edge EW technologies lately. This demand is reflected in the projected growth of the EW market, which is projected to expand at a compound annual growth rate (CAGR) of 12.5% from 2023 to 2028, reaching $19.4 billion by 2028, as per a report by the Markets and Markets firm.\n\nStory continues\n\nThis should benefit EW system manufacturers like RTX, in the form of steady order flow from the Pentagon and other U.S. allies for advanced EW systems like NGJ-MB. The latest contract win is an example of that.\n\nOpportunities for RTX Peers\n\nOther defense contractors that are expected to reap the benefits of the expanding EW market are discussed below:\n\nL3Harris Technologies LHX: It manufactures a handful of electronic warfare (EW) systems like AN/ALQ-214 (IDECM) F/A-18 Countermeasure System, Viper Shield AN/ALQ-254(V)1 All-digital Electronic Warfare Suite, AN/ALQ-161A B1-B Countermeasure System, AN/ALQ-172 B-52 and C-130 Self Protection System and CREW Vehicle Receiver/Jammer (CVRJ).\n\nThe long-term growth rate of L3 Harris Technologies is pegged at 9.3%. The consensus estimate for LHX’s 2024 sales indicates a 10% improvement from the prior year's reported figure.\n\nNorthrop Grumman NOC: It has been providing Naval Airborne Electronic Warfare solutions for more than 55 years and is the Airborne Electronic Attack System Integrator for the U.S. Navy warfighter. Some of its EW systems are the ALQ-251 radio frequency countermeasures system and the AN/APR-39 Radar Warning Receiver/Electronic Warfare Management System.\n\nNorthrop boasts a solid long-term earnings growth rate of 8.7%. The consensus estimate for NOC’s 2024 sales indicates a 5.4% improvement from the prior year's reported figure.\n\nLockheed Martin LMT: It provides global ground EW solutions to U.S. forces, as well as partner nations, through a unique next-generation open architecture product platform and open business model.  Its Advanced Off-Board Electronic Warfare (“AOEW”) program delivers persistent electronic surveillance and attack capability against naval threats like anti-ship missiles.\n\nLockheed boasts a solid long-term earnings growth rate of 4.7%. The consensus estimate for LMT’s 2024 sales indicates a 5.3% improvement from the prior year's reported figure.\n\nPrice Movement\n\nShares of RTX have risen 39.3% in the past year against the industry's decline of 1.4%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nRTX's Zacks Rank\n\nRTX currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nL3Harris Technologies Inc (LHX) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-secures-contract-next-generation-123600986.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.XETRA",
            "LHX.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.081,
            "neu": 0.761,
            "pos": 0.158
        }
    },
    {
        "date": "2024-08-28T12:35:00+00:00",
        "title": "Lockheed Martin Wins $114 Million Naval Contract for SEWIP",
        "content": "Lockheed Martin Corp.’s LMT business segment, Rotary and Missions Systems, recently clinched a modification contract involving its Surface Electronic Warfare Improvement Program. The award has been provided by the Naval Sea Systems Command, Washington, D.C.\n\nDetails of the Deal Secured by LMT\n\nValued at $113.6 million, the contract is projected to be completed by October 2026. Per the terms of the deal, Lockheed Martin will be engaged in full-rate production of Surface Electronic Warfare Improvement Program AN/SLQ-32(V)6 and AN/SLQ-32C(V)6 systems.\n\nThe majority of the work related to this contract will be performed in Liverpool, NY.\n\nWhat’s Favoring the LMT Stock?\n\nAs global defense spending escalates, particularly in response to the growing threats posed by anti-ship missiles and other naval challenges, the need for sophisticated surveillance and countermeasure capabilities has become paramount. Amid this, Lockheed Martin's Surface Electronic Warfare Improvement Program (“SEWIP”) plays a crucial role in addressing these demands.\n\nLMT’s SEWIP enhances the electronic warfare capabilities of the U.S. Navy's surface fleet by offering advanced anti-ship missile defense, counter-targeting and counter-surveillance capabilities. This program has become a critical component of the U.S. Navy's electronic warfare strategy, allowing ships to detect and respond to threats with greater speed and accuracy. The ability to conduct both littoral and open-ocean electronic surveillance makes SEWIP a versatile and indispensable tool in modern naval operations.\n\nLooking ahead, the demand for SEWIP is expected to grow significantly as the global electronic warfare market expands, with a projected compound annual growth rate (CAGR) of 12.5% from 2023 to 2028 (as per a report by the Markets and Markets firm).\n\nLockheed Martin's proven track record with SEWIP and its continuous upgrades, including the integration of new defensive technologies and enhanced capabilities, position the company to secure additional contracts and increase revenues from this program.\n\nMoreover, Lockheed Martin's development of the Advanced Off-Board Electronic Warfare (“AOEW”) system further strengthens its market position. The AOEW system, deployed on Seahawk helicopters, provides the U.S. Navy with advanced anti-ship missile detection and countermeasure capabilities, working in conjunction with SEWIP to offer a comprehensive electronic warfare solution.\n\nThese innovations further strengthen Lockheed Martin's role as a leading provider of cutting-edge electronic warfare systems in an increasingly competitive defense market.\n\nStory continues\n\nOpportunities for LMT’s Peers\n\nOther defense contractors that are expected to reap the benefits of the expanding EW market are discussed below:\n\nL3Harris Technologies LHX: It manufactures a handful of electronic warfare (EW) systems like AN/ALQ-214 (IDECM) F/A-18 Countermeasure System, Viper Shield AN/ALQ-254(V)1 All-digital Electronic Warfare Suite, AN/ALQ-161A B1-B Countermeasure System, AN/ALQ-172 B-52 and C-130 Self Protection System and CREW Vehicle Receiver/Jammer (CVRJ).\n\nThe long-term growth rate of L3 Harris Technologies is pegged at 9.3%. The consensus estimate for LHX’s 2024 sales indicates a 10% improvement from the prior year's reported figure.\n\nNorthrop Grumman NOC: It has been providing Naval Airborne Electronic Warfare solutions for more than 55 years and is the Airborne Electronic Attack System Integrator for the U.S. Navy warfighter. Some of its EW systems include the ALQ-251 radio frequency countermeasures system and the AN/APR-39 Radar Warning Receiver/Electronic Warfare Management System.\n\nNorthrop boasts a solid long-term earnings growth rate of 8.7%. The consensus estimate for NOC’s 2024 sales indicates a 5.4% improvement from the prior year's reported figure.\n\nGeneral Dynamics GD: It has been performing as the Lead Systems Integrator for SEWIP Block 1. Its SEWIP, a spiral-block development program, provides an immediate improvement for the legacy surface ship electronic warfare detection and countermeasure system, the AN/SLQ-32.\n\nGeneral Dynamics boasts a solid long-term earnings growth rate of 12.6%. The consensus estimate for GD’s 2024 sales indicates a 13.5% improvement from the prior year's reported figure.\n\nPrice Movement\n\nShares of LMT have risen 23.9% in the past year against the industry's decline of 1.4%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLMT’s Zacks Rank\n\nLMT currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nL3Harris Technologies Inc (LHX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-wins-114-million-123500381.html",
        "symbols": [
            "0IUC.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "GD.MX",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.XETRA",
            "LHX.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.06,
            "neu": 0.781,
            "pos": 0.16
        }
    }
]