[
    {
        "date": "2024-07-26T13:35:32+00:00",
        "title": "Lockheed Martin upgraded, L3Harris downgraded: Wall Street's top analyst calls",
        "content": "Lockheed Martin upgraded, L3Harris downgraded: Wall Street's top analyst calls\n\nThe most talked about and market moving research calls around Wall Street are now in one place. Here are today's research calls that investors need to know, as compiled by The Fly.\n\nTop 5 Upgrades:\n\nDeutsche Bank upgraded Lockheed Martin(LMT) to Buy from Hold with a price target of $600, up from $540. The company's \"strong\" Q2 results point to an \"attractive beat/raise opportunity\" in the second half of 2024, the analyst tells investors in a research note. Evercore ISI upgraded CBRE Group(CBRE) to Outperform from In Line with a price target of $123, up from $100. The company increased its 2024 earnings guidance by 8% to reflect the Q2 beat and an improved outlook across a number of business lines, including a less bad sales environment, improved profitability in the REI segment and better cost controls across the organization, the analyst says. BofA upgraded Duolingo(DUOL) to Buy from Neutral with an unchanged price target of $245 following a 31% pullback in the share price since Q1 earnings in early May. Duolingo boasts the highest growth among the analyst's internet coverage and the firm sees \"ample opportunity\" for user, revenue and EBITDA upside, BofA says. Stifel upgraded FTAI Aviation (FTAI) to Buy from Hold with a price target of $132, up from $69. If the narrow-body engine market is going to be tight through 2027 and beyond, \"this stock is worth buying, even if it is expensive today,\" the analyst tells investors in a research note. Evercore ISI upgraded Invitation Homes(INVH) to Outperform from In Line with an unchanged price target of $37. Despite the minimal changes to estimates and the guidance outlook, Invitation's stock fell nearly 8% on Thursday as investors seemed concerned by the modest downward revision in top line growth, though the firm believes the pullback creates a good entry point.\n\nTop 5 Downgrades:\n\nDeutsche Bank downgraded L3Harris Technologies(LHX) to Hold from Buy with a price target of $257, up from $245. The analyst cites valuation for the downgrade with the shares up 16% year-to-date. Morgan Stanley downgraded WW (WW) to Equal Weight from Overweight with a price target of $1.25, down from $6.50. The firm's data implies \"broad top of funnel issues\" which may pressure the company's subscriber growth and profitability. Deutsche Bank downgraded Southwest Airlines(LUV) to Hold from Buy with a price target of $29, down from $32. Despite reporting record revenues driven by record passenger volumes, Southwest continues to experience margin pressure as its revenue generation continues to lag its elevated cost structure, the analyst tells investors in a research note. JPMorgan downgraded DexCom(DXCM) to Neutral from Overweight with a price target of $75, down from $145. The analyst says \"there's no getting away from the fact\" that the Q2 update was a \"sharp turn in the wrong direction for the Dexcom story.\" Baird downgraded DexCom to Neutral from Outperform with a price target of $80, down from $161. TD Cowen downgraded GlycoMimetics(GLYC) to Hold from Buy without a price target. The analyst cites the \"disappointing\" Phase III miss for uproleselan in acute myeloid leukemia and the \"now much longer timeline\" to potential success in the refractory subgroup for the downgrade.\n\nStory continues\n\nTop 5 Initiations:\n\nStifel initiated coverage of Riot Platforms(RIOT) with a Speculative Buy rating and $18 price target. Riot has faced operational headwinds in the past, but the company is approaching a turning point with the phased build-out of Corsicana, fleet upgrades at Rockdale and the acquisition of Block Mining, says the analyst. Redburn Atlantic initiated coverage of DoorDash(DASH) with a Buy rating and $170 price target, which offers 66% potential upside to the current price. With the \"greatest freedom to invest and best track record for driving share gains,\" DoorDash is well positioned to deliver industry-leading, above-consensus volume growth with multiple levers to achieve above-consensus adjusted EBITDA, the analyst tells investors in a research note. Morgan Stanley initiated coverage of CervoMed(CRVO) with an Overweight rating and $35 price target. The firm says neflamapimod is a selective oral small molecule that inhibits p38N1, a key drug target in central nervous system diseases, and is currently being evaluated for the treatment of pure dementia with Lewy bodies, which is the second most common dementia behind Alzheimer's disease with no currently approved treatments in the U.S. or EU. Lake Street initiated coverage of Dave(DAVE) with a Buy rating and $53 price target. Dave's short-term ExtraCash advances and mobile banking platform are growing share in the underserved and underbanked segments of the market, notes the analyst, who thinks shares have been \"lumped in with the class of 2021-2022 SPACs and have largely been overlooked by institutional investors.\" Piper Sandler initiated coverage of AG Mortgage(MITT) with an Overweight rating and $9 price target. AG is well positioned to see earnings growth throughout 2024 and 2025 as net interest income trends higher while scale and operating efficiencies show through from the WMC acquisition, the analyst tells investors in a research note.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-upgraded-l3harris-downgraded-133532960.html",
        "symbols": [
            "0R3E.LSE",
            "DUOL.US",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.XETRA",
            "LHX.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.045,
            "neu": 0.848,
            "pos": 0.108
        }
    }
]