[
    {
        "date": "2024-10-14T22:00:20+00:00",
        "title": "Lockheed Martin (LMT) Surpasses Market Returns: Some Facts Worth Knowing",
        "content": "The most recent trading session ended with Lockheed Martin (LMT) standing at $610.87, reflecting a +1.11% shift from the previouse trading day's closing. The stock exceeded the S&P 500, which registered a gain of 0.77% for the day. Meanwhile, the Dow gained 0.47%, and the Nasdaq, a tech-heavy index, added 0.87%.\n\nComing into today, shares of the aerospace and defense company had gained 6.01% in the past month. In that same time, the Aerospace sector gained 1.46%, while the S&P 500 gained 4.87%.\n\nThe investment community will be closely monitoring the performance of Lockheed Martin in its forthcoming earnings report. The company is scheduled to release its earnings on October 22, 2024. The company is expected to report EPS of $6.43, down 5.02% from the prior-year quarter. Meanwhile, our latest consensus estimate is calling for revenue of $17.28 billion, up 2.37% from the prior-year quarter.\n\nFor the annual period, the Zacks Consensus Estimates anticipate earnings of $26.46 per share and a revenue of $71.06 billion, signifying shifts of -4.89% and +5.16%, respectively, from the last year.\n\nAdditionally, investors should keep an eye on any recent revisions to analyst forecasts for Lockheed Martin. These recent revisions tend to reflect the evolving nature of short-term business trends. Therefore, positive revisions in estimates convey analysts' confidence in the company's business performance and profit potential.\n\nOur research suggests that these changes in estimates have a direct relationship with upcoming stock price performance. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.\n\nThe Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed a 0.14% increase. As of now, Lockheed Martin holds a Zacks Rank of #3 (Hold).\n\nWith respect to valuation, Lockheed Martin is currently being traded at a Forward P/E ratio of 22.83. This denotes a premium relative to the industry's average Forward P/E of 20.82.\n\nInvestors should also note that LMT has a PEG ratio of 4.87 right now. The PEG ratio bears resemblance to the frequently used P/E ratio, but this parameter also includes the company's expected earnings growth trajectory. As of the close of trade yesterday, the Aerospace - Defense industry held an average PEG ratio of 2.1.\n\nStory continues\n\nThe Aerospace - Defense industry is part of the Aerospace sector. This industry, currently bearing a Zacks Industry Rank of 32, finds itself in the top 13% echelons of all 250+ industries.\n\nThe Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nTo follow LMT in the coming trading sessions, be sure to utilize Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-surpasses-market-220020069.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0,
            "neu": 0.9,
            "pos": 0.1
        }
    },
    {
        "date": "2024-10-14T14:52:00+00:00",
        "title": "Textron's Arm Secures Army Contract to Supply Bell 412 EPX Helicopter",
        "content": "Textron Inc.’s TXT business segment, Bell, recently secured a $37.7 million contract to supply Bell 412 EPX helicopter. The work related to this contract will be carried out in Fort Worth, TX.\r\n\r\nThe deal is projected to be completed by Dec. 31, 2025. The contract has been offered by the Army Contracting Command, Redstone Arsenal, AL.\n\nWhat’s Favoring TXT?\n\nWith global defense spending rising amid growing hostilities across the world, the investment in advanced defense products, including multi-mission helicopters, has also been increasing. These aircraft serve a nation in military operations, as well as other crucial missions such as troop transportation and search and rescue, which are conducted by different law enforcement agencies, apart from the army. With Bell being a renowned manufacturer of such multi-role helicopters, the company thus enjoys a solid inflow of contracts from the Pentagon and other U.S. allies frequently, like the latest one.\r\n\r\nNotably, Bell Textron’s Bell 412 EPX offers seating for up to 14 passengers and has the widest cabin opening in its class. This ensures ample space for both personnel and cargo, making it highly versatile for various missions such as emergency services, transport or utility roles. It is also equipped with a modern flight deck that enhances pilot awareness and safety.\r\n \r\nIts four high-resolution displays provide access to critical information, including maps, terrain data and touch controls for easy navigation and smooth operation. The aircraft’s standard BLR Strake and Fast Fin system optimize airflow around the tail boom, improving handling and stability even in challenging conditions like high-speed crosswinds or high-altitude environments.\r\n\r\nSuch notable features of the aforementioned helicopter of TXT are likely to have been boosting their demand, which is further evident from the latest contract win.\n\nTXT Stock’s Growth Prospects\n\nWith rising geopolitical tensions and evolving security concerns, nations are increasingly focusing on strengthening their helicopter fleet to support both civilian and defense-related operations. The demand for multi-role helicopters is surging, driven by their adaptability across sectors such as law enforcement, medical emergencies, firefighting and offshore transport. Additionally, these rotorcraft are playing an expanding role in disaster relief, humanitarian missions and infrastructure maintenance, providing rapid response capabilities in difficult-to-access areas.\r\n\r\nThis is likely to have prompted Market Research Future to forecast a compound annual growth rate of 3.5% for the global military multirole helicopter market during the 2024-2032 time period.\r\n\r\nThis is likely to benefit TXT, a prominent manufacturer of military and multi-role helicopters that are used in public safety missions. TXT’s helicopters used in safety missions include the Bell 429, Bell 505, Bell 407 and Bell 525, in addition to the Bell 412 EPX. These aircraft are widely used across sectors like law enforcement, medical evacuation and search-and-rescue missions.\n\nStory continues\n\nProspects of TXT’s Peers\n\nOther defense companies that are likely to enjoy the perks of the expanding global commercial helicopter market have been discussed below.\r\n\r\nLockheed Martin Corporation LMT: Through its subsidiary, Sikorsky, LMT produces a range of helicopters for both military and civilian use. The Sikorsky S-76 and S-92 are well-known models used in operations such as offshore transport and search and rescue.\r\n\r\nThe company’s long-term (three to five years) earnings growth rate is 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales indicates year-over-year growth of 5.2%.\r\n\r\nThe Boeing Company BA: While Boeing is primarily recognized for its defense and commercial aircraft, it also produces helicopters through its defense division. Its CH-47 Chinook is a heavy-lift helicopter that has been used in multiple missions like cargo and troop transport, search and rescue, casualty evacuation, special operations and humanitarian and disaster relief.\r\n \r\nThe company’s long-term earnings growth rate is 21.3%. The Zacks Consensus Estimate for BA’s 2025 sales indicates year-over-year growth of 22.2%.\r\n\r\nAirbus Group EADSY: Airbus Helicopters, a division of Airbus, produces several multi-role helicopters, including the H145M and H225M, which are used for a variety of military and civilian purposes. These helicopters are widely utilized for search and rescue, emergency medical services, offshore transport and defense operations.\r\n\r\nThe company’s long-term earnings growth rate is 12%. The Zacks Consensus Estimate for EADSY’s 2024 sales indicates year-over-year growth of 5.4%.\n\nTXT Stock’s Price Movement\n\nShares of TXT have gained 9.4% in the year-to-date period against the industry’s 6.7% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nTXT’s Zacks Rank\n\nTXT currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/textrons-arm-secures-army-contract-145200695.html",
        "symbols": [
            "0BOE.LSE",
            "0KVV.IL",
            "0LF0.LSE",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.031,
            "neu": 0.798,
            "pos": 0.171
        }
    },
    {
        "date": "2024-10-14T14:16:00+00:00",
        "title": "RTX Secures $736M Deal to Build Upgraded AIM-9X Sidewinder Missiles",
        "content": "RTX Corporation’s RTX business unit, Raytheon, won a $736-million contract to manufacture the improved Block II variant of its AIM-9X Sidewinder missiles. The award has been offered by the U.S. Navy.\r\n\r\nThe work related to this deal will be executed in various locations within the continental United States through 2029.\n\nMore About RTX’s AIM-9X Sidewinder Missiles\n\nAIM-9X is a sophisticated short-range air-to-air and surface-to-air missile, which is also capable of tracking infrared light. It offers reliable layered defense with ground-launched capabilities, including the National Advanced Surface-to-Air Missile System. The missiles are designed for installation on a variety of modern aircraft, including the F-15C Eagle, F-15E Strike Eagle, F-16 Fighting Falcon, F/A-18 Super Hornet, E/A-18G Growler, F-22 Raptor and all F-35 Joint Strike Fighter variants.\r\n\r\nThe company’s Block II model has a modified fuze and a digital ignition safety system to upgrade handling and in-flight safety. It has improved electronics, including a lock-on-after-launch capability that uses a new weapon datalink to assist engagements beyond visual range.\r\n\r\nThe robust demand that RTX’s AIM-9X Sidewinder Missiles enjoy in the missile defense industry is demonstrated by the fact that it is currently being used by more than 30 allied and partner nations of the United States. The latest contract win is yet another bright example of that.\n\nWhat’s Favoring RTX Stock?\n\nRapidly increasing geopolitical tensions worldwide, along with heightened regional conflicts in different parts of the globe, like the Middle East and the Russian invasion of Ukraine, have prompted nations to bolster their defense capabilities significantly in recent times.  Since missiles constitute a large share of a nation’s defense arsenals, countries are investing heftily in advanced missile systems for deterrence and defense. This has been boosting the demand for technologically advanced missile systems.\r\n\r\nTo this end, the Mordor Intelligence firm predicts the global market for missiles and missile defense systems to witness a CAGR of 5% between 2024 and 2029. This should benefit RTX, which has a handful of combat-proven missiles in its product portfolio like the TOW missile, Guidance Enhanced Missile, the National Advanced Surface-to-Air Missile System, Tomahawk and Standard Missile 2, in addition to the AIM-9X Sidewinder missiles.\n\nProspects of RTX’s Peers\n\nAs global threats rise, military contractors that are projected to gain from the growth prospects presented by the missiles and missile defense system market are as follows:\r\n\r\nThe Boeing Company BA: For almost 25 years, the company has been providing air and missile defense systems to the United States, its allies and international partners. Its offerings include the Avenger Air Defense System, Aegis Ballistic Missile Defense and Ground-Based Midcourse Defense.\r\n\r\nBoeing boasts a long-term (three to five years) earnings growth rate of 21.3%. The Zacks Consensus Estimate for BA’s 2025 sales implies growth of 22.2% from the 2024 estimated figure.\r\n\r\nLockheed Martin LMT: The company’s Missiles and Fire Control business unit develops, manufactures, and supports advanced missiles and rockets. Some of its renowned products are the PAC-3 family of missiles, M270, RRPR and THAAD.\r\n\r\nLockheed has a long-term earnings growth rate of 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales indicates growth of 5.2% from the prior-year reported figure.\r\n\r\nNorthrop Grumman NOC: The company provides high-speed, long-range strike weapons like the AARGM-ER, which is a supersonic, air-launched tactical missile system. It also develops and manufactures warheads, fuses, advanced high-speed propulsion systems and other missile components.\r\n\r\nNorthrop has a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales suggests growth of 5.4% from the prior-year reported figure.\n\nStory continues\n\nRTX Stock Price Movement\n\nIn the past six months, RTX shares have risen 23.9% compared with the industry’s growth of 5.5%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nRTX’s Zacks Rank\n\nRTX currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-secures-736m-deal-build-141600732.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.039,
            "neu": 0.768,
            "pos": 0.193
        }
    },
    {
        "date": "2024-10-14T11:07:00+00:00",
        "title": "Why Is the Pentagon Buying $12 Billion Worth of Bombs and Missiles From Boeing, Lockheed Martin, and RTX?",
        "content": "The Pentagon's fiscal year 2024 has come to an end. And just like the end of every year, the Pentagon ended with more of a bang than a whimper.\n\nIn contrast to the usual handful of contracts announced on an average day any other time of the year, the last few days of the Pentagon's fiscal year can see anywhere from dozens to more than a hundred contracts handed out in a single day.\n\nWhy?\n\nPresumably, because the Pentagon has an annual budget, and if it doesn't spend its budget before the year is over, Congress might get the impression that it doesn't need as much money next fiscal year -- and might cut the budget.\n\nThis existential fear of an accidental budget cut causes the Pentagon to shovel contracts out the door as fast as it can as the deadline approaches. And this year, three of America's biggest defense stocks benefited mightily from this spending spree: Boeing(NYSE: BA), Lockheed Martin(NYSE: LMT), and RTX (NYSE: RTX).\n\n$6.9 billion for Boeing\n\nOn Sept. 30, literally the last day of the fiscal year, Boeing landed a monster $6.9 billion order to supply small diameter bombs (SDB) to the U.S. Air Force.\n\nThe Air Force describes the SDB as a 250-pound guided air-to-surface munition that can be deployed by a variety of fighters and bombers, including the F-15E, F-22, F-35, and even by F-16s such are now being delivered to Ukraine. Perhaps not coincidentally, while most of these bombs are on order for the U.S. Air Force, Bulgaria, Japan, and Ukraine are also named as recipients in the Pentagon's contract announcement.\n\n$3.6 billion for Lockheed Martin\n\nNot to be left out of the Pentagon's largesse, Lockheed Martin won two missile contracts on the second-to-last day of the fiscal year. The larger contract, worth $3.2 billion, covers the supply of both joint air-to-surface standoff missiles (JASSM) and long-range anti-ship missiles (LRASM) to the U.S. Air Force and various U.S. allies (Finland, Japan, the Netherlands, and Poland).\n\nThe Air Force describes JASSM as a GPS/INS (that's internation navigation system -- useful when GPS is being jammed)-guided air-to-surface missile used primarily for air-to-ground use. Lockheed clarifies that LRASM is similar, and in fact derived from JASSM's design, but designed primarily to target ships at sea.\n\nA separate contract announced on the same day, worth $358.4 million, relates solely to the supply of LRASM missiles, bringing total missile orders for the company to just under $3.6 billion.\n\n$1.5 billion for RTX\n\nFinally, RTX won three separate contracts worth $1.5 billion in total -- awarded on the same day as Lockheed's contracts.\n\nStory continues\n\nRTX's biggest award, worth $736.6 million, covers the supply of more than 1,100 AIM-9X Sidewinder air-to-air missiles for the U.S. Navy, Air Force, Army, and for foreign allies. For $525.5 million, RTX will also supply Evolved Seasparrow air defense guided missiles for the U.S. Navy and American allies. Finally, RTX will receive $254.5 million for maintenance of standard missiles, also used for air defense.\n\nAdd it all up, and the total bill for all these bombs and missiles comes to a nice, round $12 billion.\n\nWhat it means for investors\n\nBut which of these contracts is most significant from an investor's point of view? Your instinct might be to say, \"Boeing, of course,\" because its $6.9 billion SDB contract is bigger than the five contracts won by Lockheed Martin and RTX combined -- but I think that would be a mistake.\n\nThe $6.9 billion SDB contract, you see, will be run through Boeing's Defense and Space business unit (BDS). It's a big contract, worth nearly 28% of that business's annual revenue. Problem is, BDS isn't currently profitable, and hasn't been for two years. As such, even $6.9 billion in revenue might not be enough to add value (i.e., earn a profit) for Boeing.\n\nContrast that with how even their smaller contracts would benefit the more consistently profitable defense businesses at Lockheed Martin and RTX. Lockheed's missiles and fire control (MFC) division earns the best operating profit margin of any of these defense contractors -- nearly 13% of the revenue it collects. According to data from S&P Global Market Intelligence, RTX earns less, about 9% margin at its Raytheon defense business. Applied to their respective missile contracts, this implies that RTX's contracts could result in about a 2% increase over 2023 operating profit, while Lockheed's earnings could grow 5%.\n\nAdmittedly, these numbers seem like small improvements in the context of the multibillion-dollar defense contracts the companies have just won. This just goes to show that it takes a lot of money to move the needle on businesses as big as Lockheed ($67.6 billion in 2023 revenue) and RTX ($68.9 billion). Still, in each case, at least the contracts will move the needle, and will add profit for investors.\n\nUltimately, this makes RTX stock a better bet than Boeing, and Lockheed Martin stock arguably the best choice of all.\n\nShould you invest $1,000 in Boeing right now?\n\nBefore you buy stock in Boeing, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Boeing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $826,069!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of October 7, 2024\n\nRich Smith has no position in any of the stocks mentioned. The Motley Fool recommends Lockheed Martin and RTX. The Motley Fool has a disclosure policy.\n\nWhy Is the Pentagon Buying $12 Billion Worth of Bombs and Missiles From Boeing, Lockheed Martin, and RTX? was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/why-pentagon-buying-12-billion-110700046.html",
        "symbols": [
            "BA.US",
            "LMT.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.038,
            "neu": 0.836,
            "pos": 0.126
        }
    }
]