[
    {
        "date": "2024-07-12T15:40:00+00:00",
        "title": "Lockheed Martin (LMT) Wins $252M Deal for UH-60M Helicopter",
        "content": "Lockheed Martin Corp.’s LMT business unit, Sikorsky, recently clinched a contract for UH-60M helicopter. The award has been provided by the Army Contracting Command, Redstone Arsenal, AL.\n\nValued at $251.5 million, the project is expected to be completed by Jun 30, 2027. Work related to this deal will be executed in Stratford, CT.\n\nWhat’s Favoring Lockheed?\n\nRising geopolitical conflicts across the globe have prompted nations to significantly enhance investments in strengthening their defense capabilities. Aerial security is one of the pillars of a country’s defense structure, and combat helicopters play a critical role in bolstering airborne safety.\n\nTherefore, with nations boosting their defensive abilities, demand for technologically advanced combat helicopters is rising. This trend has been benefiting prominent defense contractors like Lockheed Martin, a well-known name in military helicopter manufacturing.\n\nNotably, LMT’s UH-60M Black Hawk helicopters are used for multiple purposes ranging from delivering and extracting troops, saving lives as a MEDEVAC or casualty evacuation platform, providing critical supplies to troops, delivering emergency supplies during natural disasters, to performing as an aerial firefighter and border patroller.\n\nConsequently, this multirole helicopter serves the U.S. military and the armed forces of 34 other countries worldwide. Its solid demand can be further gauged from the fact that over 4,000 Black Hawk helicopters of all types are in service worldwide today.\n\nWhat Lies Ahead for LMT?\n\nOngoing military modernization initiatives undertaken by varied nations to procure more advanced helicopters to protect their borders from rising cross-border disputes and territorial invasions, along with the evolving nature of modern warfare bolstering the need for more technologically advanced rotorcraft, have been boosting the growth prospects of combat helicopter market.\n\nThis must have led Morder Intelligence to project that the global military helicopter market will witness a CAGR of 2.9% during the 2024-2029 time period.\n\nSuch projections further indicate immense growth opportunities for Lockheed Martin. Apart from UH-60M, Lockheed’s Sikorsky unit manufactures CH-148 Cyclone, CH-53K, RAIDER X, HH-60W, MH-60R Seahawk and a few more combat rotorcraft, which enjoy consistent demand in the military helicopter market.\n\nOpportunities for Peers\n\nOther notable defense contractors that have a significant presence in the global military helicopter market and are expected to gain from this market’s growth are mentioned below:\n\nStory continues\n\nTextron TXT: Its Bell segment supplies advanced military helicopters as well as parts and support services to the U.S. Government and other U.S. allies. Bell’s primary military helicopter programs include V-22 tiltrotor aircraft, primarily for the U.S. Department of Defense, and H-1 helicopters for the U.S. Marine Corps. It also manufactures 407 light attack helicopters and 429M multi-mission helicopters.\n\nTextron has a long-term earnings growth rate of 10.1%. The Zacks Consensus Estimate for TXT’s 2024 sales indicates an improvement of 5.7% from the 2023 reported figure.\n\nBoeing BA: It supports the vital missions of defense forces worldwide with combat-proven helicopters. Its H-47 Chinook, AH-64 Apache, AH-6 Little Bird and V-22 Osprey helicopters have redefined the limits of technology, capability and sustainability to ensure the production and delivery of reliable, maintainable and mission-ready aircraft.\n\nBoeing’s long-term earnings growth rate is pegged at 25.5%. The stock holds an average four-quarter earnings surprise of 17.83%.\n\nAirbus Group EADSY: It is one of the world's largest suppliers of advanced military helicopters. Its military helicopter portfolio comprises the H125M, Military Training H135, H145M, AS565 MBe, H160M, H215M, H225M, Tiger and NH90 (TTH and NFH).\n\nAirbus boasts a long-term earnings growth rate of 14%. The Zacks Consensus Estimate for EADSY’s 2024 sales indicates an improvement of 6.2% from the 2023 reported figure.\n\nPrice Movement\n\nIn the past three months, shares of Lockheed Martin have risen 1.6% against the industry’s fall of 0.2%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLockheed Martin currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-wins-252m-154000200.html",
        "symbols": [
            "0BOE.LSE",
            "0KVV.IL",
            "0LF0.LSE",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.052,
            "neu": 0.782,
            "pos": 0.166
        }
    },
    {
        "date": "2024-07-12T14:13:51+00:00",
        "title": "Lockheed Lands $4.6M AI DARPA Contract",
        "content": "Lockheed Martin on Monday announced a $4.6 million contract from the Defense Advanced Research Projects Agency (DARPA) to develop Artificial Intelligence (AI) tools for dynamic, airborne missions as part of its Artificial Intelligence Reinforcements (AIR) program. The project hopes to provide advanced modeling and simulation (M&S) approaches and dominant AI agents for live, multi-ship, beyond visual range (BVR) missions. According to Lockheed, the deal is a critical step in prioritizing and investing in breakthrough technologies for national security and to meet the evolving needs of customers.\n\nDARPA’s AIR program will improve the government-provided baseline models' speed and predictive performance to better match how the Department of Defense's systems perform in the real world.\n\nMost Read on IEN:\n\nAutomatic Ammo Vending Machines with AI Begin Operating at Grocery Stores Mitsubishi Robot Solves Rubik's Cube in Less Than Half a Second Samsung Electronics Workers Announce 'Indefinite' Strike Southwest Jet in 'Dutch Roll' Incident Was Parked Outside During Severe Storm\n\nDuring the 18-month period of performance, Lockheed will apply AI and machine learning (ML) techniques to create surrogate models of aircraft, sensors, electronic warfare and weapons within dynamic and operationally representative environments.\n\nIn a statement, Gaylia Campbell, vice president of engineering and technology for Lockheed Martin Missiles and Fire Control said the DARPA AIR program will use state-of-the-art scientific ML technology and Lockheed's ARISE infrastructure to deliver unprecedented amounts of data that service members can use to make faster and more informed decisions. Campbell says the deal will provide significant cost savings opportunities for the DOD and serve as a foundation for future AI defense solutions.\n\nClick here to subscribe to our daily newsletter featuring breaking manufacturing industry news.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-lands-4-6m-ai-141351649.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.967,
            "neg": 0.046,
            "neu": 0.823,
            "pos": 0.131
        }
    },
    {
        "date": "2024-07-12T13:30:00+00:00",
        "title": "RTX Secures $1.2B Contract for Patriot Missile Defense Systems",
        "content": "RTX Corporation’s RTX business segment, Raytheon, recently won a $1.2 billion contract for delivering its Patriot air and missile defense systems to Germany. The successful delivery of the aforementioned missile system should improve revenue growth for RTX in the future years.\r\n\r\nPer the terms of the agreement, RTX will offer the most current Patriot Configuration 3+ radars, launchers, command and control stations, associated spares and support to the German government.\n\nSignificance of the Patriot System\n\nPatriot is a long-range, high-altitude, all-weather missile defense system intended to counter tactical ballistic missiles, cruise missiles and sophisticated fighter aircraft. The Patriot system is made up of radars, command-and-control technologies and a variety of interceptors.\r\n\r\nThe robust demand for Patriots in the missile defense sector is demonstrated by the fact that 240 Patriot fire units have been delivered to date and that 19 nations are currently using PATRIOT for their integrated air and missile defense.\n\nWhat’s Favoring RTX?\n\nIn the wake of the global upsurge in geopolitical tensions, countries have been bolstering their military capabilities on several fronts in recent years. Rapid technical advancements have made missile defense an increasingly important component of a country's military policy. RTX, being a well-known missile manufacturer, has been witnessing a solid flow of orders for its combat-proven missiles, backed by the growing use of missile defense by countries worldwide. The aforementioned contract award is a prime illustration of that.\r\n\r\nOf late, hostile activities like the Russian invasion of Ukraine and the ongoing unrest in the Middle East have been bolstering the demand scenario in the missile market even more. To this end, the Mordor Intelligence firm predicts the global market for missiles and missile defense systems to witness a CAGR of 5% between 2024 and 2029. This should benefit RTX, which has a handful of combat-proven missiles in its product portfolio, like the TOW missile, Guidance Enhanced Missile, the National Advanced Surface-to-Air Missile System, Tomahawk, Standard Missile 2 and a few more, in addition to the Patriot missile.\n\nPeer Prospects\n\nAs global threats rise, apart from RTX, military contractors that are projected to gain from the growth prospects presented by the missiles and missile defense system industry are as follows:\r\n\r\nNorthrop Grumman NOC: It creates and manufactures warheads, fuses, sophisticated high-speed propulsion systems and other missile components. The company is one of the top suppliers of solid rocket propulsion for air-launched missiles, interceptors, submarine-launched weapons and hypersonic missile systems.\r\n\r\nNorthrop has a long-term (three to five years) earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales suggests growth of 4.6% from the prior-year reported figure.\r\n\r\nLockheed Martin LMT: Its Missiles and Fire Control business unit develops, manufactures and supports advanced combat, missile, rocket, manned and unmanned systems for military customers. Some of its renowned products are the PAC-3 family of missiles, M270, RRPR, THHAD and a few more.\r\n\r\nLockheed has a long-term earnings growth rate of 4.1%. The Zacks Consensus Estimate for LMT’s 2024 sales implies growth of 3.2% from the prior-year reported figure.\r\n\r\nGeneral Dynamics GD: Its Mission Systems unit has designed, produced, installed and sustained every version of the Weapon Control System (Fire Control) for Polaris, Poseidon, Trident I and Trident II Submarine Launched Ballistic Missiles. The company has been recently selected to perform the intercontinental ballistic missile Concept Design and Architecture-Guidance study.\r\n\r\nGeneral Dynamics’ long-term earnings growth rate is pegged at 12%. The Zacks Consensus Estimate for GD’s 2024 sales calls for growth of 10.5% from the prior-year reported figure.\n\nStory continues\n\nPrice Movement\n\nIn the past six months, shares of RTX Corp. have risen 17.8% against the industry’s decline of 6.8%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nRTX Corporation currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-secures-1-2b-contract-133000886.html",
        "symbols": [
            "0IUC.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.03,
            "neu": 0.8,
            "pos": 0.17
        }
    },
    {
        "date": "2024-07-12T13:00:10+00:00",
        "title": "These 2 Aerospace Stocks Could Beat Earnings: Why They Should Be on Your Radar",
        "content": "Quarterly financial reports play a vital role on Wall Street, as they help investors see how a company has performed and what might be coming down the road in the near-term. And out of all of the metrics and results to consider, earnings is one of the most important.\n\nWe know earnings results are vital, but how a company performs compared to bottom line expectations can be even more important when it comes to stock prices, especially in the near-term. This means that investors might want to take advantage of these earnings surprises.\n\n2 Stocks to Add to Your Watchlist\n\nThe Zacks Earnings ESP, or Expected Surprise Prediction, aims to find earnings surprises by focusing on the most recent analyst revisions. The basic premise is that if an analyst reevaluates their earnings estimate ahead of an earnings release, it means they likely have new information that could possibly be more accurate. The core of the ESP model is comparing the Most Accurate Estimate to the Zacks Consensus Estimate, where the resulting percentage difference between the two equals the Expected Surprise Prediction.\n\nThe last thing we will do today, now that we have a grasp on the ESP and how powerful of a tool it can be, is to look at a qualifying stock. Lockheed Martin (LMT) holds a Zacks Rank #3 at the moment and its Most Accurate Estimate comes in at $6.60 a share 11 days away from its upcoming earnings release on July 23, 2024.\n\nBy taking the percentage difference between the $6.60 Most Accurate Estimate and the $6.44 Zacks Consensus Estimate, Lockheed Martin has an Earnings ESP of 2.59%.\n\nLMT is part of a big group of Aerospace stocks that boast a positive ESP, and investors may want to take a look at Northrop Grumman (NOC) as well.\n\nNorthrop Grumman, which is readying to report earnings on July 25, 2024, sits at a Zacks Rank #3 (Hold) right now. It's Most Accurate Estimate is currently $6.03 a share, and NOC is 13 days out from its next earnings report.\n\nThe Zacks Consensus Estimate for Northrop Grumman is $5.98, and when you take the percentage difference between that number and its Most Accurate Estimate, you get the Earnings ESP figure of 0.86%.\n\nBecause both stocks hold a positive Earnings ESP, LMT and NOC could potentially post earnings beats in their next reports.\n\nFind Stocks to Buy or Sell Before They're Reported\n\nUse the Zacks Earnings ESP Filter to turn up stocks with the highest probability of positively, or negatively, surprising to buy or sell before they're reported for profitable earnings season trading. Check it out here >>\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/2-aerospace-stocks-could-beat-130010552.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0,
            "neu": 0.855,
            "pos": 0.145
        }
    },
    {
        "date": "2024-07-12T11:42:44+00:00",
        "title": "Lockheed Martin Cash Boosted By F-35 Restart",
        "content": "Lockheed Martin will start delivering some of the dozens of parked F-35s after the Pentagon agreed to accept jets with an interim software fix that would allow them to be used for training. They won't be combat ready until next year.\n\nContinue reading\n\nView comments",
        "link": "https://finance.yahoo.com/m/5449032f-663f-3676-8975-c7148449a2b2/lockheed-martin-cash-boosted.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.678,
            "neg": 0.029,
            "neu": 0.809,
            "pos": 0.162
        }
    }
]