[
    {
        "date": "2024-08-29T16:25:39+00:00",
        "title": "Lockheed-Raytheon JV secures $1.3 billion Javelin missile contract from U.S. Army",
        "content": "(Reuters) - A joint venture between Lockheed Martin and RTX's Raytheon was awarded a $1.3 billion follow-on contract by the U.S. army for its Javelin missiles, which has played a major role in Ukraine's defense against Russia's invasion, Lockheed said on Thursday.\n\nThis latest agreement is part of a larger contract awarded last year, which could reach up to $7.2 billion for an \"indefinite quantity\" of missiles between 2023 and 2026.\n\nSince then, the joint venture has been ramping up Javelin production, with plans to reach an annual manufacturing capacity of around 4,000 missiles by late 2026.\n\nThe new contract includes the production of more than 4,000 Javelins specifically to replenish stocks sent to Ukraine, the Maryland-based defense contractor said.\n\nDemand for U.S. weaponry, particularly shoulder-mounted Javelin systems, remains high in Europe due to the ongoing conflict between Ukraine and Russia.\n\n(Reporting by Pratyush Thakur in Bengaluru; Editing by Tasim Zahid)",
        "link": "https://ca.finance.yahoo.com/news/lockheed-raytheon-jv-secures-1-162539449.html",
        "symbols": [
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.818,
            "neg": 0.036,
            "neu": 0.86,
            "pos": 0.103
        }
    },
    {
        "date": "2024-08-29T15:36:00+00:00",
        "title": "Embraer Secures Deal to Supply A-29 Super Tucano Aircraft to Uruguay",
        "content": "Embraer S.A. ERJ recently announced that it has secured a contract from the Uruguayan Air Force to deliver up to six A-29 Super Tucano aircraft. The deal includes one aircraft with the option to purchase five more, with deliveries slated to begin in 2025.\r\n \r\nWith the successful execution of the deal, Uruguay will become the sixth South American nation to adopt A-29 Super Tucano.\r\n\r\nThe successful delivery of the aircraft is likely to bolster ERJ’s top-line performance.\n\nEmbraer & A-29 Super Tucano Aircraft\n\nEmbraer offers a wide range of advanced aircraft and complete solutions for air traffic management, border control, communications, naval systems, space systems and cybersecurity.\r\n\r\nThe A-29 Super Tucano is operationally versatile in various environments, from the Amazon rainforest to Chile’s cold regions. It is used widely for border surveillance, reconnaissance and advanced training. The A-29 Super Tucano continues to be a preferred choice in the South American region, which contributes to its strong presence with more than 160 units in this region.\r\n\r\nEmbraer’s A-29 Super Tucano is recognized globally for its multi-mission capabilities, combining cost-effectiveness, advanced technology and reliable performance. The aircraft has a simple maintenance concept and the ability to operate in harsh conditions, making it the ideal choice for nations looking to enhance their air defense capabilities.\n\nERJ’s Growth Prospects\n\nMilitary jets are increasingly sought after due to their advanced technology, including improved stealth, precision targeting, and enhanced speed. This surge in demand is driven by rising geopolitical tensions and the need for nations to strengthen their defense capabilities. With the rise in global conflicts and the threat of warfare, countries are investing heavily in modernizing their air forces to maintain strategic advantages.\r\n\r\nThis must have led Morder Intelligence to predict that the global fighter aircraft market will witness a CAGR of 37% during the 2024-2029 period.\r\n\r\nSuch growth projections should benefit Embraer, whose aircraft, such as the A-29 Super Tucano and C-390 Millennium are being deployed in various high-profile military operations.\n\nERJ’s Peer Prospects\n\nOther aerospace companies that are likely to enjoy the perks of the expanding fighter aircraft market have been discussed below.\r\n\r\nThe Boeing Company’s BA Defense, Space & Security division is a renowned manufacturer of fixed-wing and rotary-wing combat aircraft. The company’s product portfolio includes military jets like the F/A–18 Super Hornet, F-15 EX and EA-18G Growler.\r\n\r\nBoeing has a long-term (three to five years) earnings growth rate of 21.3%. The Zacks Consensus Estimate for BA’s third-quarter 2024 sales indicates an improvement of 10.8% from the prior-year quarter’s figure.\r\n\r\nLockheed Martin Corporation LMT is the manufacturer of some of the most advanced military jets in the world. Its key jet programs include the F-35 Lightning II, F-22 Raptor, F-16 Fighting Falcon and C-130 Hercules.\r\n\r\nLockheed has a long-term earnings growth rate of 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales indicates year-over-year growth of 5.3%.\r\n\r\nNorthrop Grumman Corporation NOC is a leading provider of proven manned and unmanned air systems. It builds some of the world’s most advanced aircraft like the B-2 Spirit Stealth Bomber, A-10 Thunderbolt II, B-21 Raider and F-35 Lightning II.\r\n\r\nNorthrop Gruman has a long-term earnings growth rate of 8.7%. The consensus estimate for NOC’s 2024 sales indicates year-over-year growth of 5.4%.\n\nStory continues\n\nERJ Stock Price Movement\n\nShares of ERJ have gained 9.6% in the past month, compared with the industry’s 1.4% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nERJ’s Zacks Rank\n\nERJ currently carries a Zacks Rank #4 (Sell).\n\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nEmbraer-Empresa Brasileira de Aeronautica (ERJ) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/embraer-secures-deal-supply-29-153600735.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "EMBR3.SA",
            "EMY.F",
            "ERJ.US",
            "LMT.MX",
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.03,
            "neu": 0.767,
            "pos": 0.203
        }
    },
    {
        "date": "2024-08-29T15:31:05+00:00",
        "title": "Why Is Leidos (LDOS) Up 8.3% Since Last Earnings Report?",
        "content": "It has been about a month since the last earnings report for Leidos (LDOS). Shares have added about 8.3% in that time frame, outperforming the S&P 500.\n\nWill the recent positive trend continue leading up to its next earnings release, or is Leidos due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recent earnings report in order to get a better handle on the important catalysts.\n\nLeidos Holdings Beats on Q2 Earnings, Ups '24 EPS View\n\nLeidos Holdings’ second-quarter 2024 adjusted earnings of $2.63 per share beat the Zacks Consensus Estimate of $2.26 by 16.4%. The bottom line also increased 46.1% from $1.80 registered in the prior-year quarter.\n\nThe year-over-year upside was driven by increased volumes and higher earned incentives on managed health services and improved cost control across the company.\n\nLDOS reported GAAP earnings of $2.37 per share, up from the prior-year quarter’s level of $1.50.\n\nTotal Revenues\n\nTotal revenues of $4.13 billion beat the Zacks Consensus Estimate of $4.04 million by 2.2%.\n\nThe top line also improved 7.7% year over year, driven by increased demand across all customer segments, especially for managed health services.\n\nBacklog\n\nThe company recorded a total backlog of $36.49 billion, down from $36.57 billion in the first quarter of 2024. Of this amount, $8.02 billion was funded.\n\nOperational Statistics\n\nThe cost of revenues increased 4.8% year over year to $3,427 million. The company reported an operating income of $475 million compared with $331 million in the year-ago quarter.\n\nThe adjusted operating margin was 12.7% compared with 10.1% in the prior-year period.\n\nInterest expenses totaled $51 million, down 8.9% year over year.\n\nSegmental Performance\n\nNational Security and Digital: Net revenues in this segment improved 1.2% year over year to $1.81 billion. The increase can be attributed to increased volumes from the Sentinel contract, Defense Enclave Services (“DES”) program and several contracted research as well as development efforts.\n\nThis segment’s adjusted operating income increased to $188 million from the year-ago quarter’s level of $183 million. The segment’s adjusted operating margin was 10.4%, up 20 basis points (bps) from the prior-year quarter’s 10.2%.\n\nHealth & Civil: The segment recorded revenues of $1.26 billion, up 22.1% year over year. This improvement can be attributed to increased volumes and case complexity within the managed health services business.\n\nThis unit’s adjusted operating income totaled $314 million compared with $145 million in the year-ago quarter. The segment’s adjusted operating margin was 24.9%, up 1,090 bps year over year.\n\nStory continues\n\nCommercial & International: Revenues in this segment amounted to $561 million, up 3.7% year over year. The upside was driven by increased deliveries of security products and higher volumes within the commercial energy and Australian IT businesses.\n\nThis segment recorded an adjusted operating income of $42 million compared with $23 million in the year-ago period. The adjusted operating margin was 8.3%, up 360 bps year over year.\n\nDefense Systems: Revenues in this segment amounted to $495 million, up 6.2% year over year. The upside was driven by increased volumes within the airborne surveillance and reconnaissance and hypersonics businesses.\n\nThis segment recorded an adjusted operating income of $4 million compared with $45 million in the year-ago period. The adjusted operating margin was 0.7%, down 750 bps year over year.\n\nFinancials\n\nCash and cash equivalents as of Jun 28, 2024, totaled $823 million compared with $777 million as of Dec 29, 2023.\n\nThe long-term debt, net of the current portion, amounted to $4.11 billion as of Jun 28, 2024, compared with $4.66 billion as of Dec 29, 2023.\n\nNet cash flow from operating activities totaled $437 million at the end of the second quarter of 2024 compared with $66 million recorded a year ago.\n\n2024 Guidance\n\nLeidos Holdings has partially raised its 2024 guidance. The company now expects to generate adjusted earnings in the range of $8.60-$9.00 per share, up from the prior guidance of $8.40-$8.80. The Zacks Consensus Estimate for earnings is pegged at $8.75 per share, lower than the mid-point of the company’s projected range.\n\nLDOS currently expects 2024 revenues to be in the band of $16.10-$16.40 billion, narrower than the earlier guidance of $16.0-$16.4 billion. The Zacks Consensus Estimate for revenues is pegged at $16.12 billion, lower than the mid-point of the company’s new guided range.\n\nThe company continues to expect cash flow from operating activities of approximately $1.3 billion in 2024.\n\nHow Have Estimates Been Moving Since Then?\n\nIt turns out, estimates revision have trended downward during the past month.\n\nThe consensus estimate has shifted -6.36% due to these changes.\n\nVGM Scores\n\nAt this time, Leidos has a nice Growth Score of B, though it is lagging a lot on the Momentum Score front with an F. However, the stock was allocated a grade of B on the value side, putting it in the second quintile for this investment strategy.\n\nOverall, the stock has an aggregate VGM Score of B. If you aren't focused on one strategy, this score is the one you should be interested in.\n\nOutlook\n\nEstimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. Notably, Leidos has a Zacks Rank #2 (Buy). We expect an above average return from the stock in the next few months.\n\nPerformance of an Industry Player\n\nLeidos is part of the Zacks Aerospace - Defense industry. Over the past month, Lockheed Martin (LMT), a stock from the same industry, has gained 4.1%. The company reported its results for the quarter ended June 2024 more than a month ago.\n\nLockheed reported revenues of $18.12 billion in the last reported quarter, representing a year-over-year change of +8.6%. EPS of $7.11 for the same period compares with $6.73 a year ago.\n\nLockheed is expected to post earnings of $6.40 per share for the current quarter, representing a year-over-year change of -5.5%. Over the last 30 days, the Zacks Consensus Estimate has changed -0.3%.\n\nLockheed has a Zacks Rank #3 (Hold) based on the overall direction and magnitude of estimate revisions. Additionally, the stock has a VGM Score of D.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLeidos Holdings, Inc. (LDOS) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/why-leidos-ldos-8-3-153105387.html",
        "symbols": [
            "0R3E.LSE",
            "L1DO34.SA",
            "LDOS.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "S6IA.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.011,
            "neu": 0.901,
            "pos": 0.088
        }
    },
    {
        "date": "2024-08-29T14:36:00+00:00",
        "title": "Textron Ships Its Beechcraft T-6C Trainer to Tunisian Air Force",
        "content": "Textron Inc. TXT recently revealed the successful shipment of its Beechcraft T-6C Texan II Operational Flight Trainer (“OFT”) to the Tunisian Air Force. Two Avionics Desktop Trainings, a Computer-Based Training Lab with eight workstations and field services are among the other elements supplied with the OFT.\r\n\r\nAfter all eight Beechcraft T-6C Texan II aircraft are delivered to the Tunisian Air Force, the OFT will be utilized for pilot and maintenance professional training.\n\nSignificance of TXT’s Beechcraft T-6C Texan II\n\nThe Beechcraft T-6C Texan II military training aircraft is a next-generation military trainer jet designed for a wide range of training capabilities, long-term reliability and cost-effective operations.\r\n\r\nThe Beechcraft T-6C OFT offers a realistic cockpit with real aircraft hardware, a visual system with 70 degrees vertical by 270 degrees horizontal field of view, and a dynamic seat with onset and disturbance queues. These features will support military pilot trainees to get realistic training, making them mission-ready.\n\nTXT’s Growth Prospects\n\nMilitary flight simulators are positioned for considerable expansion, driven by increasing geopolitical tensions worldwide, improvements in technology, increased expenditures on combat jets and the demand for cost-effective training options. Per a report by the Mordor Intelligence firm, the global market for Military Aircraft Simulation & Training is projected to witness a CAGR of 2% between 2024 and 2031. Such growth opportunities offered by the aforementioned market should bode well for Textron in the coming years.\r\n\r\nTextron’s business unit, TRU Simulation, focuses on building quality training devices for the business aviation, helicopter and military markets. It develops, manufactures and maintains state-of-the-art, high-fidelity flight training solutions, from classroom training tools to flight training devices and full-motion simulators for defense aircraft. In the latest development in this section, in August 2024, TXT announced the delivery of its Cessna Citation Longitude Full Flight Simulator for FlightSafety International's Columbus, OH, Learning Center.\r\n\r\nSuch capabilities of TXT must have enabled the company to win steady orders for its products that support Military Aircraft Simulation & Training, like the latest one.\n\nOpportunities for TXT’s Peers\n\nAerospace companies that are likely to reap the benefits of the growing Military Aircraft Simulation & Training market are as follows:  \r\n\r\nLockheed Martin LMT: The company’s F-35 Full Mission Simulators are high-fidelity systems that replicate the F-35’s advanced avionics, stealth capabilities and combat systems. It also provides Mission Rehearsal Training solutions and offers high-end training with reduced hardware requirements to train pilots with 5th Generation Tactics, Techniques and Procedures.\r\n\r\nLockheed’s long-term (three to five years) earnings growth rate is 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales implies an improvement of 5.3% from the prior-year figure.\r\n\r\nBAE Systems BAESY: Its Hawk advanced jet trainer, equipped with advanced airborne simulation technology and new generation cockpit environment, provides a smoother and more cost-effective transition to the front line. This allows for student pilot and Weapons System Officer output at the most appropriate skill levels in readiness for front-line operations.\r\n\r\nBAE Systems has a long-term earnings growth rate of 12.4%. The Zacks Consensus Estimate for BAESY’s 2024 sales suggests growth of 36.3% from the prior-year reported figure.\r\n\r\nRTX Corporation RTX: Its Joint Secure Air Combat Training System provides the first certified, four-level Multiple Independent Levels of Security test and training equipment in both airborne and ground equipment, allowing for tethered and autonomous operations.\r\n\r\nRTX has a long-term earnings growth rate of 10.4%. The Zacks Consensus Estimate for RTX’s 2024 sales implies growth of 7% from the prior-year reported figure.\n\nStory continues\n\nTXT Stock Price Movement\n\nIn the past year, shares of Textron have risen 16.2% against the industry’s decline of 1.4%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nTXT’s Zacks Rank\n\nTextron currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 (Strong Buy) Rank stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nBae Systems PLC (BAESY) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/textron-ships-beechcraft-t-6c-143600443.html",
        "symbols": [
            "0LF0.LSE",
            "0R3E.LSE",
            "BA.LSE",
            "BAESF.US",
            "BAESY.US",
            "BSP.BE",
            "BSP.DU",
            "BSP.F",
            "BSP.STU",
            "BSP.XETRA",
            "BSPA.F",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "TXT.BE"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.024,
            "neu": 0.842,
            "pos": 0.134
        }
    },
    {
        "date": "2024-08-29T13:00:12+00:00",
        "title": "Lockheed Martin Corporation (LMT) is Attracting Investor Attention: Here is What You Should Know",
        "content": "Lockheed Martin (LMT) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\n\nOver the past month, shares of this aerospace and defense company have returned +4.1%, compared to the Zacks S&P 500 composite's +2.6% change. During this period, the Zacks Aerospace - Defense industry, which Lockheed falls in, has gained 2.5%. The key question now is: What could be the stock's future direction?\n\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\n\nRevisions to Earnings Estimates\n\nHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\n\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nFor the current quarter, Lockheed is expected to post earnings of $6.40 per share, indicating a change of -5.5% from the year-ago quarter. The Zacks Consensus Estimate has changed -0.3% over the last 30 days.\n\nThe consensus earnings estimate of $26.49 for the current fiscal year indicates a year-over-year change of -4.8%. This estimate has changed -0.2% over the last 30 days.\n\nFor the next fiscal year, the consensus earnings estimate of $28.86 indicates a change of +8.9% from what Lockheed is expected to report a year ago. Over the past month, the estimate has changed +0.4%.\n\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Lockheed.\n\nStory continues\n\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n\n12 Month EPS\n\nRevenue Growth Forecast\n\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\n\nFor Lockheed, the consensus sales estimate for the current quarter of $17.45 billion indicates a year-over-year change of +3.4%. For the current and next fiscal years, $71.14 billion and $73.99 billion estimates indicate +5.3% and +4% changes, respectively.\n\nLast Reported Results and Surprise History\n\nLockheed reported revenues of $18.12 billion in the last reported quarter, representing a year-over-year change of +8.6%. EPS of $7.11 for the same period compares with $6.73 a year ago.\n\nCompared to the Zacks Consensus Estimate of $17.12 billion, the reported revenues represent a surprise of +5.88%. The EPS surprise was +10.23%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\n\nValuation\n\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\n\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\n\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\n\nLockheed is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\n\nBottom Line\n\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Lockheed. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-corporation-lmt-attracting-130012210.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.009,
            "neu": 0.865,
            "pos": 0.126
        }
    }
]