[
    {
        "date": "2024-07-25T14:05:00+00:00",
        "title": "Greece signs deal to buy 20 US-made F-35 jets in major military overhaul",
        "content": "ATHENS, Greece (AP) — Greece formally approved an offer to buy 20 F-35 Joint Strike Fighters from the United States as part of a major defense overhaul, government officials said Thursday.\n\nDefense Minister Nikos Dendias said while visiting a military air base near Athens that the purchase would create “a powerful deterrent presence in our region.” A letter of acceptance for the deal has been signed and sent to the U.S., he said.\n\nDelivery of the fifth-generation jet made by Lockheed Martin is expected to start in 2028, while Greece maintains the option to purchase 20 additional F-35 jets as part of an $8.6 billion deal.\n\nThe purchase of the first 20 jets along with additional support will cost some $3.5 billion, Greek officials said.\n\nGreece is overhauling its military in a decade-long program following a protracted financial crisis and continued tension with neighbor and NATO ally Turkey, mostly over a volatile sea boundary dispute.\n\nTurkey was dropped from the F-35 program five years ago over its decision to buy Russian-made S-400 surface-to-air missile system, a move seen in the United States as compromising NATO security.\n\nIn Athens, government spokesman Pavlos Marinakis described the current military modernization campaign as the most significant in “many decades.”\n\n“We will continue to implement this major program, equipping our country and armoring its defenses,” Marinakis said.\n\nAthens has been seeking an advantage in the air since Turkey’s exclusion from F-35 purchases and has also acquired advanced French-made Rafale fighter jets. Deliveries to the Greek air force began in 2021, starting with jets previously used by France’s military that will be supplemented by new aircraft built by French defense contractor Dassault Aviation.\n\nBridget Lauderdale, Lockheed Martin’s vice president and general manager of the F-35 program, described her company's aircraft as being ideal to “strengthen Greece’s sovereignty and operational capability with allies.”\n\n\"It is our honor to continue (our) relationship as Greece becomes the 19th nation to join the F-35 program,” she said,\n\nThe U.S. State Department in January approved the sale that could eventually total 40 F-35 aircraft, along with 42 engines as well as services and equipment including secure communications devices, electronic warfare systems, training, logistics, and maintenance support.\n\nCurrent members of the F-35 program, either as participants or through military sales, are: the United States, Britain, Italy, the Netherlands, Canada, Australia, Denmark, Norway, Israel, Japan, Korea, Belgium, Poland, Singapore, Finland, Switzerland, Germany, and the Czech Republic.\n\nView comments",
        "link": "https://finance.yahoo.com/news/greece-signs-deal-buy-20-140500429.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.986,
            "neg": 0.037,
            "neu": 0.838,
            "pos": 0.126
        }
    },
    {
        "date": "2024-07-25T10:43:33+00:00",
        "title": "Lockheed Martin Corporation (NYSE:LMT) Just Beat Earnings: Here's What Analysts Think Will Happen Next",
        "content": "Lockheed Martin Corporation (NYSE:LMT) defied analyst predictions to release its second-quarter results, which were ahead of market expectations. The company beat expectations with revenues of US$18b arriving 6.5% ahead of forecasts. Statutory earnings per share (EPS) were US$6.85, 6.0% ahead of estimates. This is an important time for investors, as they can track a company's performance in its report, look at what experts are forecasting for next year, and see if there has been any change to expectations for the business. We thought readers would find it interesting to see the analysts latest (statutory) post-earnings forecasts for next year.\n\nCheck out our latest analysis for Lockheed Martin  earnings-and-revenue-growth\n\nTaking into account the latest results, Lockheed Martin's 20 analysts currently expect revenues in 2024 to be US$70.9b, approximately in line with the last 12 months. Statutory earnings per share are forecast to shrink 6.6% to US$26.38 in the same period. Before this earnings report, the analysts had been forecasting revenues of US$69.7b and earnings per share (EPS) of US$26.26 in 2024. The consensus analysts don't seem to have seen anything in these results that would have changed their view on the business, given there's been no major change to their estimates.\n\nThe analysts reconfirmed their price target of US$515, showing that the business is executing well and in line with expectations. The consensus price target is just an average of individual analyst targets, so - it could be handy to see how wide the range of underlying estimates is. Currently, the most bullish analyst values Lockheed Martin at US$577 per share, while the most bearish prices it at US$387. Analysts definitely have varying views on the business, but the spread of estimates is not wide enough in our view to suggest that extreme outcomes could await Lockheed Martin shareholders.\n\nOne way to get more context on these forecasts is to look at how they compare to both past performance, and how other companies in the same industry are performing. These estimates imply that revenue is expected to slow, with a forecast annualised decline of 0.4% by the end of 2024. This indicates a significant reduction from annual growth of 3.0% over the last five years. By contrast, our data suggests that other companies (with analyst coverage) in the same industry are forecast to see their revenue grow 2.6% annually for the foreseeable future. So although its revenues are forecast to shrink, this cloud does not come with a silver lining - Lockheed Martin is expected to lag the wider industry.\n\nStory continues\n\nThe Bottom Line\n\nThe most obvious conclusion is that there's been no major change in the business' prospects in recent times, with the analysts holding their earnings forecasts steady, in line with previous estimates. Fortunately, the analysts also reconfirmed their revenue estimates, suggesting that it's tracking in line with expectations. Although our data does suggest that Lockheed Martin's revenue is expected to perform worse than the wider industry. The consensus price target held steady at US$515, with the latest estimates not enough to have an impact on their price targets.\n\nFollowing on from that line of thought, we think that the long-term prospects of the business are much more relevant than next year's earnings. We have forecasts for Lockheed Martin going out to 2026, and you can see them free on our platform here.\n\nYou should always think about risks though. Case in point, we've spotted  1 warning sign for Lockheed Martin you should be aware of.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-corporation-nyse-lmt-104333350.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.884,
            "neg": 0.029,
            "neu": 0.922,
            "pos": 0.05
        }
    },
    {
        "date": "2024-07-25T10:00:00+00:00",
        "title": "3 Defense Stocks to Buy as the Geopolitical Temperature Rises",
        "content": "Like it or not, defense stocks have always been an important sector of the market. Some might make the argument that it’s the most important segment. Essentially, while the subject is controversial, free societies must establish mechanisms to keep honest people honest. The threat of extreme violence is what has kept the peace. But that paradigm may soon change.\n\nI really laid out the case for defense stocks in a TipRanks article I wrote recently. Essentially, a strong case can be made that Donald Trump and the Republicans have an easy road to the White House (and perhaps other seats of power). And because the so-called MAGA conservatives favor an isolationist foreign policy, U.S. partners are sweating bullets.\n\nWhere the matter gets especially murky is that Trump constantly talks about peace. The word aligns with basic Christian theology, likely in a bid among Republicans to court evangelicals. However, reasonable people understand that sanctification cannot precede justification.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nIsolationism of the MAGA variety reverses this established narrative – and that’s what has global partners freaked out. The only “good” that can come out of it is potential profitability of these defense stocks to buy.\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) Space Systems sign in Sunnyvale, California.\n\nSource: Ken Wolter / Shutterstock.com\n\nOne of the biggest defense stocks in the world, Lockheed Martin (NYSE:LMT) is really in the spotlight right now. Just recently, the company disclosed blowout earnings for the second quarter. While analysts presently rate LMT stock as a consensus hold, that might change over the next several days. Further, if Donald Trump is elected to a second term, demand for Lockheed’s defense solutions could skyrocket.\n\nWhat has international partners worried is Trump’s broadcasting of isolationist sentiments. Not too long ago, he bemoaned that Taiwan doesn’t do enough to support its own defense. At the same time, the former president accused the island nation of basically grabbing the entire share of the burgeoning semiconductor ecosystem. Now, reports are coming out that many Taiwanese favor boosting defense spending.\n\nIt’s going to have to considering that China has its eyes on it. Further, if the U.S. goes through with a hands-off policy, then Taiwan may have to defend itself. After all, under this contrarian framework, a little bit of violence should be allowed to prevent excessive violence.\n\nHonestly, I’m not sure what that means. However, it does seem cynically positive for LMT and other defense stocks.\n\nHuntington Ingalls (HII) Person holding smartphone with logo of US company Huntington Ingalls Industries Inc (HII) on screen in front of website Focus on phone display\n\nSource: Wirestock Creators / Shutterstock.com\n\nStory continues\n\nEven with an isolationist policy – assuming that Trump wins in November – the U.S. cannot afford to shirk its unofficial responsibilities. Sure, the populist movement (ala former Congressman Ron Paul) decries foreign intervention. Here’s the problem: if the U.S. doesn’t impose its hegemony on others, then other countries will eagerly fill the power gap. And that’s what brings us to Huntington Ingalls (NYSE:HII).\n\nHuntington Ingalls is a defense contractor specializing in maritime solutions. Basically, if you want to invest in the U.S. Navy, you acquire shares of HII stock. That’s about as close as you can get. Most importantly, all great powers project their strength through the high seas. In this case, China’s naval ambitions present a huge threat to the U.S. and global democracies.\n\nAlmost certainly, this framework will lead to significant growth in Huntington sales over the next several years. Even with Trump’s populist and isolationist message, presumably no American politician can survive a deliberate acquiescence to the Chinese. It’s just not going to happen, especially because of our heated economic rivalry.\n\nSo, forget about the day-to-day financials. Instead, I’d look to HII as one of the defense stocks to consider for the long term.\n\nAeroVironment (AVAV) The logo for AeroVironment (AVAV) is seen through a magnifying glass on the company's website.\n\nSource: Pavel Kapysh / Shutterstock.com\n\nWhen it comes to AeroVironment (NASDAQ:AVAV), the catalyst for the business is a kinetic motivation. In contrast, Lockheed Martin and Huntington Ingalls represent more strategic investments; that is, their core products represent a show of power that may prevent/discourage war. Should conflicts go hot, these weapons systems would be ready to go. In AeroVironment’s case, the core product essentially assumes a hot conflict.\n\nThat’s because AereoVironment specializes in unmanned drones that loiter in the air, seeking out targets. When a human operator that is miles away from the shooting spots a target, the drone slams into it, causing damage or outright destruction. AeroVironment became sort of a household name thanks to its tremendous success in Ukraine.\n\nIn the years ahead, I anticipate company sales to soar – and that’s especially the case under a second Trump administration. An isolationist policy essentially green lights dictators to see what they can get away with. And then said dictators can profit from their warmongering because the White House would push for “peace.”\n\nThreatened democracies would be on notice: protect yourself because America is staying home. That’s bad for stability but good for defense stocks like AVAV.\n\nOn the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nA former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post 3 Defense Stocks to Buy as the Geopolitical Temperature Rises appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-defense-stocks-buy-geopolitical-100000295.html",
        "symbols": [
            "0J76.LSE",
            "0R3E.LSE",
            "AVAV.US",
            "HI4.F",
            "HI4.STU",
            "HII.US",
            "JPX.BE",
            "JPX.F",
            "JPX.STU",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.989,
            "neg": 0.051,
            "neu": 0.84,
            "pos": 0.11
        }
    },
    {
        "date": "2024-07-25T00:00:00+00:00",
        "title": "3 Defense Stocks to Buy as the Geopolitical Temperature Rises",
        "content": "A second Trump term would probably mean foreign policy turmoil. But that’s great news for these defense stocks.",
        "link": "https://investorplace.com/2024/07/3-defense-stocks-to-buy-as-the-geopolitical-temperature-rises/",
        "symbols": [
            "AVAV.US",
            "HII.US",
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.477,
            "neg": 0.113,
            "neu": 0.633,
            "pos": 0.253
        }
    }
]