[
    {
        "date": "2024-09-17T11:45:00+00:00",
        "title": "L3Harris Wins $587M Contract for Next Generation Jammer-Low Band",
        "content": "L3Harris Technologies LHX announced that it has received a five-year contract, worth $587.4 million, to deliver custom tactical jamming pods designed to modernize the U.S. Navy’s Aerial Electronic Attack capability.\n\nDetails of LHX’s New Contract\n\nThe Next Generation Jammer-Low Band (NGJ-LB) is an advanced airborne electronic warfare system. The L3Harris solution will be simpler to maintain than the Navy's present system because of its modular, open-system architecture, which allows for seamless updates.\r\n\r\nIt also combines enhanced processing with greater jamming capability. The L3Harris system will work with combined and allied forces to offer expansion potential for future technological integration.\r\n\r\nOver the course of the next five years, the company will provide more test assets for airworthiness and design verification, in addition to eight operational prototype pods for the U.S. Naval Air Systems Command to evaluate the fleet. The Navy intends to replace the outdated AN/ALQ-99 Tactical Jamming System, and the NGJ-LB pods will aid the initiative by flying on the EA-18G Growler.\n\nBenefits of NGJ-LB\n\nWith high-power RF jamming, LHX’s NGJ-LB pod transforms the Growler's capacity to carry out its main mission, Suppression of Enemy Air Defense, from standoff ranges. This results in improved lethality and scalability for upcoming technological advancements.\r\n\r\nThe NGJ-LB helps cover a broad spectrum of frequencies to serve diverse Department of Defense-wide electronic warfare (EW) demands.\r\n\r\nThe NGJ-LB reduces aircrew workload and cockpit distractions while increasing the number of simultaneous targets that aircrews can attack through high Equivalent, Isotropically Radiated Power and tailored waveforms. The cutting-edge technology of the NGJ-LB significantly improves availability and sustainment while eradicating existing system capability gaps.\n\nPeer Prospects\n\nAlong with LHX, other defense companies like RTX Corp. RTX, Northrop Grumman NOC and Lockheed Martin LMT are also set to take advantage of the expanding EW market.\r\n\r\nIn August 2024, RTX won a contract involving its Next Generation Jammer Mid-Band (NGJ-MB) System. Valued at $27.7 million, the contract is expected to be completed by August 2026. Per the terms of the deal, RTX will be involved in the repair of several components used in the NGJ-MB System employed on the F/A-18 aircraft.\r\n\r\nRTX’s long-term (three to five-year) earnings growth rate is 10.42%. The Zacks Consensus Estimate for 2024 EPS indicates a year-over-year increase of 7.7%.\r\n\r\nNorthrop Grumman has been providing Naval Airborne EW solutions for more than 55 years and is the Airborne Electronic Attack System Integrator for the U.S. Navy warfighter. Some of its EW systems are the ALQ-251 radio frequency countermeasures system and the AN/APR-39 Radar Warning Receiver/Electronic Warfare Management System.\r\n\r\nNOC’s long-term earnings growth rate is 8.68%. The Zacks Consensus Estimate for 2024 EPS indicates a year-over-year increase of 7.9%.\r\n\r\nLMT provides global ground EW solutions to U.S. forces, as well as partner nations, through a unique next-generation open architecture product platform and open business model.  Its Advanced Off-Board EW program delivers persistent electronic surveillance and attack capability against naval threats like anti-ship missiles.\r\n\r\nLMT’s long-term earnings growth rate is 4.67%. The Zacks Consensus Estimate for 2024 sales indicates a year-over-year increase of 5.3%.\n\nStory continues\n\nLHX’s Stock Price Performance\n\nIn the past six months, shares of LHX have risen 9.9% compared with the industry’s 2.8% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLHX’s Zacks Rank\n\nLHX currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nL3Harris Technologies Inc (LHX) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/l3harris-wins-587m-contract-next-114500035.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.XETRA",
            "LHX.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.043,
            "neu": 0.831,
            "pos": 0.126
        }
    }
]