[
    {
        "date": "2024-10-18T21:50:19+00:00",
        "title": "Lockheed Martin (LMT) Gains But Lags Market: What You Should Know",
        "content": "Lockheed Martin (LMT) closed the latest trading day at $611.81, indicating a +0.36% change from the previous session's end. The stock fell short of the S&P 500, which registered a gain of 0.4% for the day. Elsewhere, the Dow saw an upswing of 0.09%, while the tech-heavy Nasdaq appreciated by 0.63%.\n\nHeading into today, shares of the aerospace and defense company had gained 7.86% over the past month, outpacing the Aerospace sector's loss of 1.22% and the S&P 500's gain of 3.76% in that time.\n\nInvestors will be eagerly watching for the performance of Lockheed Martin in its upcoming earnings disclosure. The company's earnings report is set to be unveiled on October 22, 2024. The company's upcoming EPS is projected at $6.47, signifying a 4.43% drop compared to the same quarter of the previous year. Meanwhile, our latest consensus estimate is calling for revenue of $17.28 billion, up 2.36% from the prior-year quarter.\n\nFor the full year, the Zacks Consensus Estimates are projecting earnings of $26.47 per share and revenue of $71.06 billion, which would represent changes of -4.85% and +5.16%, respectively, from the prior year.\n\nAdditionally, investors should keep an eye on any recent revisions to analyst forecasts for Lockheed Martin. These recent revisions tend to reflect the evolving nature of short-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.\n\nEmpirical research indicates that these revisions in estimates have a direct correlation with impending stock price performance. To take advantage of this, we've established the Zacks Rank, an exclusive model that considers these estimated changes and delivers an operational rating system.\n\nRanging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Over the past month, the Zacks Consensus EPS estimate has shifted 0.05% upward. Right now, Lockheed Martin possesses a Zacks Rank of #3 (Hold).\n\nWith respect to valuation, Lockheed Martin is currently being traded at a Forward P/E ratio of 23.03. This indicates a premium in contrast to its industry's Forward P/E of 20.99.\n\nMeanwhile, LMT's PEG ratio is currently 4.91. The PEG ratio bears resemblance to the frequently used P/E ratio, but this parameter also includes the company's expected earnings growth trajectory. The average PEG ratio for the Aerospace - Defense industry stood at 2.16 at the close of the market yesterday.\n\nStory continues\n\nThe Aerospace - Defense industry is part of the Aerospace sector. This industry currently has a Zacks Industry Rank of 63, which puts it in the top 25% of all 250+ industries.\n\nThe Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nBe sure to follow all of these stock-moving metrics, and many more, on Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-gains-lags-215019297.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.006,
            "neu": 0.892,
            "pos": 0.102
        }
    },
    {
        "date": "2024-10-18T16:07:29+00:00",
        "title": "Stocks to watch next week: Tesla, Lloyds, L'Oréal, Coca-Cola and Unilever",
        "content": "The third-quarter earnings season is well under way, with companies across a range of sectors due to report in the coming week.\n\nTesla is set to take centre stage next week, as investors await the latest set of results from Elon Musk's EV company, on the back of its recent robotaxi event.\n\nIn the world of finance, the focus so far this earnings season has been on the major US banks, but it is now the turn of UK giants Lloyds, Barclays and NatWest to report in the coming week.\n\nMeanwhile, French cosmetics company L'Oréal is set to release its third-quarter sales figures.\n\nInvestors will also be looking to see if momentum from Coca-Cola's strong second quarter has carried on into its latest set of results.\n\nConsumer goods company Unilever will also be in focus, as investors keep an eye out for further progress on the business' growth action plan.\n\nHere's more on what to look out for:\n\nTesla (TSLA) — Reports third-quarter results on Wednesday 23 October\n\nShares in Tesla slumped after its recent robotaxi event, in which the electric carmaker revealed its fully autonomous \"Cybercab\", as well as unveiling its \"Robovan\" concept.\n\nA lack of details surrounding the rollout plan and regulatory approval, plus no mention of a more affordable regular EV, left Wall Street wanting more. This most recently volatility in the stock, has left shares down nearly 11% year-to-date.\n\nIn fact, AJ Bell's Russ Mould, Danni Hewson and Dan Coatsworth point out that Tesla is the only one of the \"Magnificent Seven\", which includes tech giants such as Apple (AAPL) and Microsoft (MSFT), to have seen such declines over the past year.\n\nRead more: The best stocks to buy in the UK, according to Barclays\n\n\"Indeed, the shares are down by almost 50% from their 2021 peak, despite ongoing investor enthusiasm for electric vehicles and autonomous driving and — more specifically to Tesla — the Cybertruck, Cybercab and the roll out of its supercharger network,\" they said.\n\nThat said, recently released figures showed that Tesla's deliveries were up 6% for the third quarter. AJ Bell's investment experts noted that this \"understandably led analysts to expect better again for the third quarter\" results more broadly.\n\nThey said analysts were expecting sales to come in at $25.5bn (£19.5bn) for the third quarter, which would be 9% higher than a year ago.\n\nAnalysts are also said to be expecting to see further improvement in earnings per share (EPS) of $0.57 in the third-quarter, which would mean a return to year-on-year growth. Tesla's EPS of $0.47 in the second quarter missed expectations and was below the $0.78 it generated for the same period in the previous year.\n\nStory continues\n\nLloyds Banking Group (LLOY.L) — Reports third-quarter results on Wednesday 23 October\n\nThree big UK banks are set to report this week, with Lloyds kicking things off on Wednesday, followed by Barclays (BARC.L) on Thursday and NatWest (NWG.L) on Friday.\n\n\"The banking sector has shown good performance in the past year, despite the shallow recession in the UK in the second half of 2023,\" said AJ Bell's Mould, Hewson and Coatsworth.\n\nAcross those three banks alone, they said that stated pre-tax profit is expected to be generally flat in 2024 and 2025, at around £20bn.\n\nRead more: Interest rate cut in November near certain after inflation drops\n\n\"Thanks to the combination of competition, interest rate cuts from the Bank of England and political and public pressure, net interest margins and net interest income look to have peaked and that is a key reason why analysts think the banks may struggle to grow earnings substantially from here onwards,\" they said.\n\nLooking at Lloyds specifically, the consensus estimate on its headline pre-tax income for the third quarter is £1.6bn, versus £1.9bn for the same period last year.\n\nIn the second quarter, the bank delivered pre-tax profit of £1.7bn, which was higher than the £1.6bn it generated in Q2 2023 and beat market expectations of £1.58bn.\n\nIn terms of dividends, Lloyds is forecast to pay just over 3p a share, which added to its declared £2bn buyback programme, gives a total cash return of £3.9bn for 2024.\n\nYear-to-date Lloyds Banking Group shares are up 29%.\n\nL'Oréal (OR.PA) — Reports quarterly sales figures on Tuesday 22 October\n\nThe world's largest cosmetic's company, L'Oréal is set to report after the market close on Tuesday.\n\nShares have been under pressure this year, down more than 17% year-to-date, with it seeing further declines after the release of half-year results at the end of July.\n\nWhile L'Oréal reported that like-for-like sales had risen 7.3% to €22.1bn (£18.4bn) in the first half, the company noted \"depressed beauty demand in China\" amid its economic slowdown.\n\nIn terms of its third quarter, Barclays' equity research team said in a note released on Friday that it was looking for organic sales growth of upwards of 6.2%.\n\nRead more: How to minimise a capital gains tax impact on your investments\n\nBarclays' team said the focus would be on the US consumer in these results and highlighted that growth in its fragrance business \"remains strong and continues to outperform other categories with some share gains for L'Oréal\".\n\nThe team said they had hoped for a rebound in cosmetics in China in the second half of the year \"but that now seems unlikely given the current weak state of Chinese consumer confidence\".\n\nOverall, they said that L'Oréal's valuation looks \"undemanding\" relative to where it's stood historically and that \"conversations with investors suggest many are tempted to add or buy at these levels\".\n\n\"We see risks as skewed to the upside, with expectations low and any sense of sequential stabilisation likely well received,\" they added.\n\nCoca-Cola (KO) — Reports third-quarter results on Wednesday 23 October\n\nShares in soft drinks company Coca-Cola hit an all-time high closing price last month of $73.01 per share, with the stock up 19% year-to-date.\n\nAarin Chiekrie, equity analyst at Hargreaves Lansdown, said that the company's second-quarter results in July \"blew the lid off market expectations\".\n\nCoco-Cola reported net revenues were up 3% in the second quarter to $12.4bn, while organic sales grew by 15%.\n\nRead more:What UK wealth managers and investment platforms want to see in the budget\n\nThis led management to upgrade full-year guidance for the second time this year, expecting organic revenue to grow between 9% and 10% in 2024.\n\n\"When the group reports results next week, investors expect to hear that some of this momentum has spilled into the third quarter,\" Chiekrie said. \"But Coca-Cola’s rolling into some tough comparable periods for growth over the second half of the year, so don’t expect the same level of positive surprise as in the first half.\"\n\nHe added: \"Cash generation remains very healthy, providing scope for increased share buybacks and potentially even new acquisitions in the near to medium term.”\n\nUnilever (ULVR.L) — Reports third-quarter results on Thursday 24 October\n\nConsumer goods giant Unilever has been trading close to five-year highs, point out AJ Bell's investment experts, as investors \"respond favourably to chief executive Hein Schumacher’s growth action plan\".\n\nThe plan, launched in March, will see the group spin off its ice cream business, cut €800m in costs — which includes 7,500 redundancies — and invest heavily in its thirty \"power brands\".\n\nUnliever's group underlying sales are forecast to have risen by 4.2% in the third quarter, up slightly from 3.9% in Q2. Meanwhile, stated revenues are forecast to have risen by 1.5% to €15.5bn.\n\nAJ Bell's Mould, Hewson and Coatsworth point out that Unilever’s \"long-term target range for sales growth is 3% to 5% a year and current guidance from Mr Schumacher is for underlying sales growth to come within that range in 2024 overall\".\n\nRead more: European Central Bank cuts interest rates for the third time this year\n\nWhile they said that Unliever may not offer too much detail on profits, analysts will look for any comment on its underlying operating margin for the year, which it had said was expected to exceed 18% versus 16.7% last year.\n\n\"Analysts will also look for an update on the planned demerger of the ice cream business, which is due to occur by the end of 2025, especially with regard to whether the company will list its shares in London or Amsterdam,\" they said.\n\nIn addition, AJ Bell's investment experts said that shareholders will be keeping an eye out any further hints of wider merger and acquisition activity, \"given Mr Schumacher’s plan to make selective purchases and also prune the range of brands by means of disposals.\"\n\nOther companies reporting this week include:\n\nMonday 21 October\n\nTristel (TSTL.L)\n\nSAP (SAP.DE)\n\nSandvik (SAND.ST)\n\nTuesday 22 October\n\nVirgin Wine (VINO.L)\n\nInterContinental Hotels (IHG.L)\n\nGear4Music (G4M.L)\n\nChina Mobile (600941.SS)\n\nSK Hynix (000660.KS)\n\nDeutsche Boerse (DB1.DE)\n\nLogitech (LOGN.SW)\n\nSaab (SAAB-B.ST)\n\nRandstad (RAND.AS)\n\nGE Aerospace (GE)\n\nDanaher (DHR)\n\nVerizon Communications (VZ)\n\nPhilip Morris International (PM)\n\nTexas Instruments (TXN)\n\nRTX (RTX)\n\nLockheed Martin (LMT)\n\n3M (MMM)\n\nFreeport-McMoRan (FCX)\n\nGeneral Motors (GM)\n\nKimberly-Clark (KMB)\n\nCoStar Group (CSGP)\n\nBaker Hughes (BKR)\n\nSeagate (STX)\n\nPackaging Corp (PKG)\n\nInterpublic (IPG)\n\nWednesday 23 October\n\nReckitt Benckiser (RKT.L)\n\nWPP (WPP.L)\n\nBarratt Redrow (BTRW.L)\n\nFresnillo (FRES.L)\n\nHong Kong Exchanges (0388.HK)\n\nRoche (ROG.SW)\n\nAtlas Copco (ATCO-A.ST)\n\nIberdrola (IBE.MC)\n\nKering (KER.PA)\n\nHeineken (HEIA.AS)\n\nAssa Abloy (ASSA-B.ST)\n\nAkzo Nobel (AKZA.AS)\n\nDeutsche Bank (DBK.DE)\n\nMichelin (ML.PA)\n\nCarrefour (CA.PA)\n\nVolvo Cars (VOLV-B.ST)\n\nSSAB (SSAB-B.ST)\n\nSaipem (SPM.MI)\n\nViscofan (VIS.MC)\n\nAT&T (T)\n\nIBM (IBM)\n\nLAM Research (LRCX)\n\nBoeing (BA)\n\nAmphenol (APH)\n\nGE Vernova (GEV)\n\nNewmont (NEM)\n\nUnited Rentals (URI)\n\nTeradyne (TER)\n\nOtis Worldwide (OTIS)\n\neBay (EBAY)\n\nMattel (MAT)\n\nThursday 24 October\n\nRELX (REL.L)\n\nLondon Stock Exchange (LSEG.L)\n\nAnglo American (AAL.L)\n\nInchape (INCH.L)\n\nRenishaw (RSW.L)\n\nEssentra (ESNT.L)\n\nDunelm (DNLM.L)\n\nBloomsbury Publishing (BMY.L)\n\nLuceco (LUCE.L)\n\nCanon (7751.T)\n\nRenasas (6723.T)\n\nCNOOC (0883.HK)\n\nHyundai Motor (005380.KS)\n\nBudweiser Brewing Company (1876.HK)\n\nHermès (RMS.PA)\n\nUniCredit (UCG.MI)\n\nVinci (DG.PA)\n\nDassault Systèmes (DSY.PA)\n\nDanone (BN.PA)\n\nBeiersdorf (BEI.DE)\n\nKone (KNEBV.HE)\n\nOrange (ORA.PA)\n\nAlfa Laval (ALFA.ST)\n\nSodexo (SW.PA)\n\nBE Semiconductor (BESI.AS)\n\nRenault (RNO.PA)\n\nStora Enso (STERV.HE)\n\nUnion Pacific (UNP)\n\nHoneywell (HON)\n\nUPS (UPS)\n\nNorthrop Grumman (NOC)\n\nKeurig Dr Pepper KDP (KDP)\n\nDow (DOW)\n\nWestern Digital (WDC)\n\nHasbro (HAS)\n\nSouthwest Airlines (LUV)\n\nUS Steel (X)\n\nFriday 25 October\n\nNatWest (NWG.L)\n\nAirtel Africa (AAF.L)\n\nRecord (REC.L)\n\nFanuc (6954.T)\n\nICBC (601398.SS)\n\nPing An Insurance (601318.SS)\n\nGreat Wall Motor (601633.SS)\n\nSanofi (SAN.PA)\n\nSafran (SAF.PA)\n\nPorsche (PAH3.DE)\n\nMercedes Benz (MBG.DE)\n\nHolcim (HOLN.SW)\n\nENI (ENI.MI)\n\nSika.SW (SIKA.SW)\n\nSGS (SGSN.SW)\n\nKonecranes (KCR.HE)\n\nRémy Cointreau (RCO.PA)\n\nKindred (KIND-SDB.ST)\n\nColgate-Palmolive (CL)\n\nAON (AON)\n\nDownload the Yahoo Finance app, available for Apple and Android.",
        "link": "https://uk.finance.yahoo.com/news/tesla-lloyds-loreal-coca-cola-unilever-stocks-to-watch-160729628.html",
        "symbols": [
            "000660.KO",
            "005380.KO",
            "005385.KO",
            "005387.KO",
            "005389.KO",
            "0388.HK",
            "0883.HK",
            "0941.HK",
            "0A00.LSE",
            "0BOE.LSE",
            "0CXC.IL",
            "0CXC.LSE",
            "0GWL.LSE",
            "0H3T.LSE",
            "0HFB.LSE",
            "0HIT.LSE",
            "0HTP.IL",
            "0HTP.LSE",
            "0HV2.LSE",
            "0IU8.LSE"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.027,
            "neu": 0.87,
            "pos": 0.103
        }
    },
    {
        "date": "2024-10-18T15:57:00+00:00",
        "title": "ERJ to Invest in U.S. MRO Facilities to Aid E-Jet Fleet Expansion",
        "content": "Embraer S.A. ERJ recently announced its plan to invest up to $70 million in new Maintenance, Repair and Overhaul (MRO) facilities in the United States, with the launch of a new service center at the Perot Field Alliance Airport, in Fort Worth, TX. The expansion aims to support the growing fleet of Embraer’s E-Jets in the United States.\r\n\r\nThe MRO expansion operation is projected to start in an existing hangar at the onset of the second quarter of 2025 whereas construction of a new facility is underway and expected to be completed by 2027.\n\nGrowth Prospects for ERJ in the MRO Industry\n\nThe aircraft MRO industry is growing rapidly backed by the rising demand for maintaining and extending the life of existing aircraft. Airlines are focusing on keeping their fleet in top condition as buying new aircraft is costly and regulatory bodies impose strict safety and maintenance standards. Additionally, the increasing number of aging aircraft in both commercial and military sectors requires more frequent maintenance.\r\n\r\nThis is likely to have prompted Grand View Research to forecast a compound annual growth rate of 5% for the global aircraft MRO market during the 2023-2030 time period.\n\nSuch solid growth trends are likely to have enticed aerospace companies like Embraer that also facilitate MRO capabilities to expand their operating abilities to meet the evolving needs of the aviation industry. Its latest investment strategy revelation reflects the same.\r\n \r\nNotably, Embraer’s global MRO network consists of more than 80 authorized centers and 12 owned service centers, which ensure that it can effectively maintain and upgrade its aircraft. The company’s focus on expanding its U.S. MRO operations, particularly with this new investment at Perot Field Alliance Airport, highlights its commitment to enhancing support for the growing fleet of its E-Jets in North America. It projects air passenger traffic in North America to grow 2.4% annually through 2043. This move is aligned with the broader industry trend of increasing reliance on MRO services as airlines prioritize fleet maintenance over purchasing new aircraft due to high capital costs.\n\nProspects of ERJ’s Peers\n\nOther aerospace companies that are likely to benefit from the expanding global aircraft MRO market are discussed below.\r\n\r\nThe Boeing Company BA: It offers extensive MRO services through its Global Services division, supporting both military and commercial aircraft. Boeing Defense, Space & Security provides MRO services for its defense aircraft like the C-17 Globemaster and F-15 fighters, ensuring fleet readiness worldwide.\r\n\r\nThe company has a long-term (three to five years) earnings growth rate of 21.3%. The Zacks Consensus Estimate for BA’s 2025 sales indicates year-over-year growth of 24.5%.\r\n\r\nLockheed Martin Corporation LMT: It provides MRO services, which support both military and commercial aircraft. The company operates sustainment programs that focus on aircraft maintenance, logistics support and upgrades to extend the life and performance of its defense systems.\r\n\r\nThe company has a long-term earnings growth rate of 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales indicates year-over-year growth of 5.2%.\r\n\r\nRTX Corporation RTX: Through its subsidiaries - Pratt & Whitney and Collins Aerospace- it delivers extensive MRO services. Pratt & Whitney specializes in engine MRO for both commercial and military aircraft while Collins Aerospace focuses on avionics, interiors and mechanical systems for maintenance and repair.\r\n\r\nThe company has a long-term earnings growth rate of 10.3%. The Zacks Consensus Estimate for RTX’s 2024 sales indicates year-over-year growth of 6.8%.\n\nStory continues\n\nERJ Stock’s Price Movement\n\nIn the past year, shares of ERJ have gained 141.3% compared with the industry’s 8.9% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nERJ’s Zacks Rank\n\nERJ currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nEmbraer-Empresa Brasileira de Aeronautica (ERJ) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/erj-invest-u-mro-facilities-155700512.html",
        "symbols": [
            "0BOE.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "EMBR3.SA",
            "EMY.F",
            "ERJ.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.008,
            "neu": 0.822,
            "pos": 0.17
        }
    },
    {
        "date": "2024-10-18T15:40:12+00:00",
        "title": "NOC or LMT: Which Is the Better Value Stock Right Now?",
        "content": "Investors with an interest in Aerospace - Defense stocks have likely encountered both Northrop Grumman (NOC) and Lockheed Martin (LMT). But which of these two stocks presents investors with the better value opportunity right now? Let's take a closer look.\n\nThere are plenty of strategies for discovering value stocks, but we have found that pairing a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system produces the best returns. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits.\n\nNorthrop Grumman and Lockheed Martin are sporting Zacks Ranks of #2 (Buy) and #3 (Hold), respectively, right now. This system places an emphasis on companies that have seen positive earnings estimate revisions, so investors should feel comfortable knowing that NOC is likely seeing its earnings outlook improve to a greater extent. But this is just one piece of the puzzle for value investors.\n\nValue investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels.\n\nOur Value category grades stocks based on a number of key metrics, including the tried-and-true P/E ratio, the P/S ratio, earnings yield, and cash flow per share, as well as a variety of other fundamentals that value investors frequently use.\n\nNOC currently has a forward P/E ratio of 20.99, while LMT has a forward P/E of 23.03. We also note that NOC has a PEG ratio of 2.42. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. LMT currently has a PEG ratio of 4.91.\n\nAnother notable valuation metric for NOC is its P/B ratio of 5.40. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. By comparison, LMT has a P/B of 23.53.\n\nBased on these metrics and many more, NOC holds a Value grade of B, while LMT has a Value grade of C.\n\nNOC has seen stronger estimate revision activity and sports more attractive valuation metrics than LMT, so it seems like value investors will conclude that NOC is the superior option right now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nStory continues\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/noc-lmt-better-value-stock-154012131.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.004,
            "neu": 0.726,
            "pos": 0.269
        }
    }
]