[
    {
        "date": "2024-05-10T23:59:44+00:00",
        "title": "Palantir Stock (NYSE:PLTR): Should You Buy the Post-Earnings Dip?",
        "content": "Palantir stock (NYSE:PLTR) dipped by about 16% after its Q1 earnings report, prompting me to ponder whether this downturn presents a buying opportunity. Notably, Palantir showcased yet another quarter of solid revenue growth, promising client base expansion, and strong profitability metrics. That said, concerns persist regarding the stock’s elevated valuation. Consequently, despite my belief in Palantir’s long-term prospects as a shareholder, I maintain a neutral stance towards the stock at present and don’t believe the dip is worth buying.\n\nAccelerating Growth Driven by Government and Commercial Clients\n\nPalantir Q1’s marked a period of accelerating growth, driven by solid performance in both the company’s Government and Commercial segments. Revenues landed at $634.4 million, up 20.8% year-over-year. This implies an acceleration from last year’s growth of 17.7% and the third consecutive quarter of accelerating revenue growth on a sequential basis. Let’s take a deeper look at both Palantir’s segments in Q1 to better understand what precisely drove this result.\n\nGovernment Revenue Fueled by Domestic Acceleration, International Expansion\n\nStarting with Palantir’s Government segment, which accounted for about 53% of its Q1 revenue mix, total revenue growth in this segment was 16%, at $335 million. This growth was mainly driven by accelerating revenues in the domestic division and rapid international expansion. Source: Palantir’s Q1-2024 Investor Presentation\n\nDomestically, revenue growth accelerated in Q1 in the U.S. Government business, increasing by 12% year-over-year and 8% quarter-over-quarter to $257 million. This compares against a 3% quarter-over-quarter increase in Q4, with Palantir’s software becoming increasingly critical for the U.S. Government in today’s unstable geopolitical environment. Palantir’s International Government division further compounded the segment’s growth, with its revenues rising by 33% to $79 million.\n\nAn important milestone in Q1 was that the U.S. Army granted Palantir an exclusive prime contract worth over $178.4 million to develop a next-generation targeting node as part of the TITAN program. This marks a historic moment for Palantir, as it became the first software company ever to win a prime contract for a hardware system. This effectively positions Palantir to establish itself as a prime vendor akin to giants like Lockheed Martin (NYSE:LMT) or Northrop Grumman (NYSE:NOC) in the field of weapons and aerospace products.\n\nCommercial Revenue Surges Following Rapid Client Base Expansion\n\nTransitioning to Palantir’s Commercial segment, revenues experienced another notable surge, driven by the increasing uptake of its artificial intelligence platform (AIP) and the solid expansion of the company’s clientele.\n\nStory continues\n\nIn a prior update on Palantir, I emphasized the pivotal role of Bootcamps in bolstering Palantir’s corporate customer base. Palantir organizes these hands-on workshops to showcase the capabilities of its software, notably its AIP. Successful demonstrations should allow potential clients to realize the value proposition Palantir offers and potentially commit to a contract.\n\nThis strategy seems to be working extremely well for the company. In Q1, Palantir added 41 net new customers in its U.S. Commercial segment (see the image below). This marked a 69% increase in Palantir’s customer count year-over-year and 19% quarter-over-quarter. Palantir also recorded a significant acceleration here, compared to the 8% quarter-over-quarter growth of last year’s Q1. Source: Palantir’s Q1-2024 Investor Presentation\n\nRapidly Improving Profitability, But Valuation Concerns Remain\n\nPalantir’s strong revenue growth has gradually allowed the company to record improving unit economics, thus improving its profitability metrics. The company’s adjusted operating margin landed at 36%, up from 34% in the previous quarter and 24% last year, marking the sixth consecutive quarter of expansion. It led to an adjusted operating income of $226.5 million, up 81% compared to last year. Further, Palantir’s adjusted free cash flow came in at $149 million, also achieving a noteworthy margin of 23%.\n\nWith additional cash flowing into Palantir’s balance sheet, the company ended the quarter with a record cash position of $3.87 billion, all while maintaining a debt-free status. Nevertheless, investors should still take into account the underlying risks involved in Palantir’s current valuation, no matter how impressive its profitability metrics and robust financial standing are.\n\nAt the end of the day, Palantir is still trading at approximately 65 times this year’s expected earnings per share (EPS) and 54 times next year’s expected EPS. Its revenue growth acceleration and ongoing margin expansion may allow the company to grow into these multiples sooner rather than later. Still, Palantir’s investment case offers a notably lower margin of safety compared to last year’s levels, even after the post-earnings dip—and this is coming from a shareholder with high hopes.\n\nIs PLTR Stock a Buy, According to Analysts?\n\nThe present sentiment on Wall Street seems bearish, even after Palantir’s post-earnings share price decline. According to Wall Street, Palantir Technologies features a Moderate Sell consensus rating based on two Buys, five Holds, and six Sells in the past three months. At $19.67, the average PLTR stock price target suggests 4.5% downside potential.\n\nIf you’re wondering which analyst you should follow if you want to buy and sell PLTR stock, the most profitable analyst covering the stock (on a one-year timeframe) is Mariana Perez from Bank of America (NYSE:BAC) Securities, with an average return of 61.42% per rating and a 92% success rate. Click on the image below to learn more.\n\nThe Takeaway\n\nTo sum up, Palantir’s Q1 report reflects an ongoing acceleration in revenue growth, evident in both its Government and Commercial segments. With Governments relying increasingly on Palantir’s software during an unstable geopolitical environment and corporate clients gradually realizing the capabilities of AIP, Palantir’s long-term prospects appear more promising than ever.\n\nHowever, the persistent concern over the stock’s valuation cannot be overlooked. While Palantir shows promise for long-term investors, and I am one of them, a neutral stance on the stock seems reasonable, given its elevated valuation multiples. Accordingly, I wouldn’t buy the stock on this dip if I were looking to initiate a position in Palantir. I’d rather wait for a potentially more attractive entry point.\n\nDisclosure\n\nView comments",
        "link": "https://finance.yahoo.com/news/palantir-stock-nyse-pltr-buy-235944234.html",
        "symbols": [
            "BAC.US",
            "LMT.US",
            "NOC.US",
            "P2LT34.SA",
            "PLTR.US",
            "PTX.F",
            "PTX.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.018,
            "neu": 0.831,
            "pos": 0.151
        }
    },
    {
        "date": "2024-05-10T13:00:11+00:00",
        "title": "Is Trending Stock Lockheed Martin Corporation (LMT) a Buy Now?",
        "content": "Lockheed Martin (LMT) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\n\nOver the past month, shares of this aerospace and defense company have returned +3.6%, compared to the Zacks S&P 500 composite's +0.2% change. During this period, the Zacks Aerospace - Defense industry, which Lockheed falls in, has gained 3.4%. The key question now is: What could be the stock's future direction?\n\nAlthough media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision.\n\nRevisions to Earnings Estimates\n\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\n\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\n\nLockheed is expected to post earnings of $6.44 per share for the current quarter, representing a year-over-year change of -4.3%. Over the last 30 days, the Zacks Consensus Estimate has changed +0.9%.\n\nFor the current fiscal year, the consensus earnings estimate of $26.26 points to a change of -5.6% from the prior year. Over the last 30 days, this estimate has changed +0.1%.\n\nFor the next fiscal year, the consensus earnings estimate of $28.31 indicates a change of +7.8% from what Lockheed is expected to report a year ago. Over the past month, the estimate has changed -0.3%.\n\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Lockheed.\n\nStory continues\n\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n\n12 Month EPS 12-month consensus EPS estimate for LMT _12MonthEPSChartUrl\n\nProjected Revenue Growth\n\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\n\nFor Lockheed, the consensus sales estimate for the current quarter of $17.03 billion indicates a year-over-year change of +2.1%. For the current and next fiscal years, $69.5 billion and $72.29 billion estimates indicate +2.9% and +4% changes, respectively.\n\nLast Reported Results and Surprise History\n\nLockheed reported revenues of $17.2 billion in the last reported quarter, representing a year-over-year change of +13.7%. EPS of $6.33 for the same period compares with $6.43 a year ago.\n\nCompared to the Zacks Consensus Estimate of $16.19 billion, the reported revenues represent a surprise of +6.21%. The EPS surprise was +9.14%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\n\nValuation\n\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\n\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S) and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\n\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\n\nLockheed is graded B on this front, indicating that it is trading at a discount to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\n\nConclusion\n\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Lockheed. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/trending-stock-lockheed-martin-corporation-130011522.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.007,
            "neu": 0.861,
            "pos": 0.132
        }
    },
    {
        "date": "2024-05-10T03:38:18+00:00",
        "title": "$59 Billion Australia Pension Reviews Investments as Israel-Linked Firms Face Pressure",
        "content": "(Bloomberg) -- Cbus, one of Australia’s largest pension funds, is reviewing its investment policy following pressure from a major union to divest shares in companies that supply weapons and defense technology to Israel.\n\nMost Read from Bloomberg\n\n‘Seriously Underwater’ Home Mortgages Tick Up Across the US Microsoft’s Xbox Is Planning More Cuts After Studio Closings Marjorie Taylor Greene Finally Got What She Deserved: Defeat Apple Apologizes for iPad Pro Ad, Scraps Plan to Air It on TV\n\nThe fund, which oversees A$90 billion ($59 billion) of assets, is assessing its policy amid “community concern over the conflict and loss of life in Gaza and Israel”, a spokesman said in a statement. The fund already excludes direct investments in some weapons manufacturers.\n\n“Cbus’s exclusions framework is currently under review to ensure it remains reflective of the current environment and responsive to our members’ concerns, while also ensuring we meet all of our regulatory obligations,” the spokesman said, without naming any investments.\n\nThe review was first reported by The Guardian earlier Friday, which referred to companies including Lockheed Martin Corp. and RTX Corp. The firms that were cited represent about 0.01% of Cbus’s portfolio, the spokesman said.\n\n“However, we understand that even a small holding in the current climate may cause concern,” he added.\n\nThe Construction, Forestry, Maritime and Energy Union approached Cbus’s top management about its policy as part of a broader push for all industry pension funds to divest, the union said in a statement. It was concerned about retirement savings being invested with companies involved in the Middle East conflict.\n\nThe union sponsors three of the board positions at Cbus, a fund that was originally set up for construction workers, but is now open to anyone.\n\n“We welcome Cbus urgently reviewing its portfolio,” CFMEU National Secretary Zach Smith said in an emailed statement. “Now it’s up to other industry funds to follow their lead.”\n\nIsrael has faced international pressure over its operations in response to the October 7 attack by Hamas that triggered the ongoing war in Gaza. The US has paused some arms shipments to Israel amid concerns about a ground invasion of the Gazan city of Rafah, while students are staging nationwide protests urging their universities to divest from companies tied to the conflict.\n\nCbus owned around A$3 million of shares in Lockheed Martin, which supplies Israel with F-35 fighter jets, at the end of last year, according to latest disclosures on its website. It also owned about A$3.5 million of shares in RTX, which has sold weapons to Israel.\n\nStory continues\n\n“Questions regarding investment strategy and related policies are best addressed by Cbus,” a Lockheed Martin spokesperson said. RTX didn’t respond to an email.\n\nMost Read from Bloomberg Businessweek\n\nHow Uniqlo’s ‘Millennial Birkin’ Is Beating Designer Bags Tim Cook Can’t Run Apple Forever. Who’s Next? The Company Preaching America’s Nuclear Revival ‘It’s a Money Loser’: Tax Breaks for Data Centers Are Under Fire A New Kind of Power Company Will Put a Battery in Every Home\n\n©2024 Bloomberg L.P.\n\nView comments",
        "link": "https://finance.yahoo.com/news/59-billion-australia-pension-reviews-033818986.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.833,
            "neg": 0.079,
            "neu": 0.854,
            "pos": 0.067
        }
    }
]