[
    {
        "date": "2024-09-05T15:02:00+00:00",
        "title": "Lockheed Wins a $3.4B Deal for Guided Multiple Launch Rocket System",
        "content": "Lockheed Martin Corp. LMT recently clinched a modification contract for the Guided Multiple Launch Rocket System (GMLRS). The U.S. Army Contracting Command, Redstone Arsenal, AL, has provided the award.\n\nValued at $3.43 billion, the contract is projected to be completed by Oct. 20, 2027.\n\nWhat’s Favoring LMT Stock?\n\nSpending on defense products has increased manifold in the last decade as frequent cross-border conflicts along with civil unrest in different countries have instilled fear among nations across the globe.  With missile strength constituting a key element of a nation’s defense backbone, the demand for more technologically advanced and lethal missiles has been rising lately. Lockheed, being a prominent missile manufacturer, has been witnessing a solid inflow of contracts from the Pentagon and other U.S. allies involving the design, build and upgrade of its combat-proven missiles. The latest contract win is a bright example of that.\n\nNotably, LMT’s MLRS family of munitions includes a variety of precision-strike rockets and missiles, with ongoing evolutionary development to meet the needs of today’s warfighter. These are fired from both the MLRS M270 family of launchers and the HIMARS launchers.\n\nIn particular, GMLRS fires surface-to-surface rockets and has been highly effective in recent combat operations. The fact that Lockheed has manufactured more than 60,000 GMLRS rockets to date reflects the solid demand that this product enjoys in the global defense space.\n\nLMT’s Growth Prospects\n\nIncreasingly violent conflicts witnessed in the past few years in different parts of the world have led to rapid deterioration in global peacefulness, thereby setting the stage for more nations to invest heftily in defense products. This should bode well for the missile market, as nations worldwide strive to protect their borders from unprecedented attacks.\n\nA notable surge in global demand and supply must have prompted Mordor Intelligence to project a CAGR of 5% for the missile and missile defense systems market in the 2024-2029 period.\n\nSuch a solid market growth projection should benefit Lockheed, considering its proven proficiency in missile manufacturing. The company’s Missiles and Fire Control unit provides a handful of combat-proven air and missile defense systems as well as tactical missiles, apart from MLRS. These include Joint Air-to-Surface Standoff Missile, Long Range Anti-Ship Missile and a few more missile programs.\n\nOpportunities for Peers\n\nApart from LMT, other prominent defense contractors that stand to benefit from the expanding missile and missile defense systems market are as follows:\n\nNorthrop Grumman NOC: Northrop is a prominent developer of missile systems and counter systems, including strategic deterrents, subsystems and components. On Aug. 27, 2024, the company announced that it is redesigning the Intercontinental Ballistic Missile target vehicle for the Missile Defense Agency (MDA).\n\nNOC boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for Northrop’s 2024 sales indicates an improvement of 5.4% from the 2023 reported figure.\n\nL3Harris Technologies LHX: The company produces the solid propellant rocket motor for the GMLRS. To further strengthen its footprint in the missile market, L3Harris acquired Aerojet Rocketdyne, which is a renowned provider of rocket propulsion system, in 2023. In recent developments, L3Harris completed its 1,000th delivery of both the solid rocket boost motor and Liquid Divert and Attitude Control System for the MDA’s Terminal High Altitude Area Defense system.\n\nLHX has a long-term earnings growth rate of 9.3%. The Zacks Consensus Estimate for L3Harris’ 2024 sales indicates an improvement of 10% from the 2023 reported figure.\n\nRTX Corp. RTX: Its business unit, Missiles and Defense, is a prominent U.S. missile maker. Its portfolio includes the AIM-9X Sidewinder missile, the AIM-9X Block II missile, RAM-guided missile weapon system. In August 2024, the company won a $478 million contract from the NATO Support and Procurement Agency to supply additional GEM-T missiles to Germany.\n\nRTX boasts a long-term earnings growth rate of 10.4%. The Zacks Consensus Estimate for its 2024 sales indicates an improvement of 7% from the 2023 reported figure.\n\nPrice Movement of LMT\n\nIn the past year, shares of Lockheed Martin have risen 29.1% against the industry’s 0.2% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLockheed Martin currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nL3Harris Technologies Inc (LHX) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-wins-3-4b-deal-150200228.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.XETRA",
            "LHX.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.039,
            "neu": 0.797,
            "pos": 0.164
        }
    },
    {
        "date": "2024-09-05T14:15:00+00:00",
        "title": "Lockheed Martin Welcomes Egypt to the C-130J Super Hercules Fleet",
        "content": "EL ALAMEIN, Egypt, Sept. 5, 2024 /PRNewswire/ -- The Egyptian Armed Forces announced today at the Egypt International Air Show that Lockheed Martin (NYSE: LMT) will deliver two C-130J-30 Super Hercules tactical airlifters to the Egyptian Air Force (EAF) through a Foreign Military Sale (FMS) with the U.S. Air Force. Egypt is the 23rd nation to join the worldwide Super Hercules operating community. Egypt is the 23rd nation to join the global C-130J Super Hercules fleet with the acquisition of two C-130J-30 tactical airlifters.\n\nAs the most advanced and proven tactical airlifter in the world, the C-130J-30 delivers enhanced capability, additional versatility and increased power to EAF crews. Egypt operates one of the world's largest C-130H fleets, which has a significant presence in the Middle East North Africa (MENA) region, supporting military, peacekeeping, humanitarian and natural disaster response mission requirements. Egypt joins seven MENA operators that have chosen the C-130J as a preferred medium-sized tactical airlifter and tanker.\n\n\"Egypt is a distinguished C-130 operator, flying its Hercules fleet to support some of the most challenging mission requirements,\" said Rod McLean, vice president and general manager of Lockheed Martin's Air Mobility & Maritime Missions line of business. \"Welcoming Egypt to the C-130J Super Hercules global fleet is an honor that truly represents the longstanding partnership between our two nations and with Lockheed Martin. With these new C-130J-30s, the Egyptian Air Force's tactical airlift presence will deliver unmatched capabilities and aligned force amplification to serve Egypt, North Africa and the world.\"\n\nAlways evolving, continually innovating and ready for what's next, the Super Hercules leads the charge by setting standards and shaping the future of tactical airlift missions, offering many advantages found in no other medium-sized tactical airlifter in production or operation today. To date, Lockheed Martin has delivered more than 545 C-130Js and the Super Hercules global fleet has surpassed more than 3 million flight hours.\n\nSuper Hercules discriminators include proven operational readiness with the greatest ease of transition, increased reliability, superior tactical airlift and combat airdrop capabilities, certification by more than 20 airworthiness authorities, and enhanced survivability. The C-130J also delivers unmatched interoperability with NATO and partner nations, robust industrial partnerships and verified low life-cycle costs with significant fuel savings, resulting in a reduced carbon footprint compared to other medium-sized jet airlifters.\n\nStory continues\n\nSee how and why the C-130J continues to be the worldwide choice in tactical airlift through the newest episode of \"Into the Cockpit\"  on Lockheed Martin's YouTube channel, which offers exclusive behind-the-scenes access to the Super Hercules.\n\nFor more information, visit www.lockheedmartin.com/c130.\n\nAbout Lockheed Martin Lockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at Lockheedmartin.com. (PRNewsfoto/Lockheed Martin Aeronautics) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/lockheed-martin-welcomes-egypt-to-the-c-130j-super-hercules-fleet-302239545.html\n\nSOURCE Lockheed Martin Aeronautics\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-welcomes-egypt-c-141500694.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.024,
            "neu": 0.783,
            "pos": 0.192
        }
    },
    {
        "date": "2024-09-05T13:00:00+00:00",
        "title": "Lockheed Martin Chairman, President and CEO and CFO to Speak at the Morgan Stanley Conference",
        "content": "BETHESDA, Md., Sept. 5, 2024 /PRNewswire/ -- Lockheed Martin (NYSE: LMT) will webcast live a presentation by Chairman, President and CEO Jim Taiclet and CFO Jay Malave at the Morgan Stanley Conference on Thursday, Sept. 12 at 3:15 p.m. to 3:45 p.m. ET. Lockheed Martin Logo. (PRNewsFoto/Lockheed Martin)\n\nAccess to the webcast will be available at: http://www.lockheedmartin.com/investor. An audio replay will be available for two weeks following the presentation.\n\nAbout Lockheed Martin Lockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at LockheedMartin.com. Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/lockheed-martin-chairman-president-and-ceo-and-cfo-to-speak-at-the-morgan-stanley-conference-302239077.html\n\nSOURCE Lockheed Martin Corporation\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-chairman-president-ceo-130000611.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.927,
            "neg": 0,
            "neu": 0.871,
            "pos": 0.129
        }
    }
]