[
    {
        "date": "2024-05-16T14:09:00+00:00",
        "title": "Lockheed (LMT) Secures a Contract to Aid F-35 Jet Program",
        "content": "Lockheed Martin Corp.’s LMT business segment, Aeronautics, recently secured a contract involving its F-35 fighter jet program. The award has been provided by the Naval Air Systems Command, Patuxent River, MD.\n\nDetails of the Deal\n\nValued at $79 million, the contract is expected to be completed by December 2024. Per the terms of the deal, Lockheed will procure diminishing manufacturing sources of parts required for the production and sustainment of F-35 jets.\n\nThe work related to this contract will be executed in Fort Worth, TX. The award will serve the U.S. Air Force, Marine Corps, Navy, Foreign Military Sales customers and non-U.S. Department of Defense participants.\n\nSignificance of F-35 Jets\n\nLockheed’s F-35 is the most lethal, survivable and connected fighter jet in the world. It can securely connect high-tech platforms to share information across every domain,  air, land, sea, space and cyber. The aircraft comes in three main variants, which are F-35A (conventional takeoff and landing), F-35B (short take-off and vertical landing) and F-35C (carrier-based).\n\nSuch remarkable features of this fighter jet are likely to have been ushering in solid contract wins for LMT, like the latest one. Consequently, the F-35 program remains a major revenue contributor for the United States’ largest defense contractor.\n\nThe F-35 program was the largest revenue generator for Lockheed’s Aeronautics business unit, accounting for 64% of the segment’s net sales in 2023 and 26% of LMT’s total consolidated net sales. Lockheed has delivered 992 F-35 airplanes since the program's inception, with 373 jets in the backlog as of Dec 31, 2023.\n\nLMT expects to deliver 147-153 jets in 2024 and 156 in 2025 and beyond. This, along with the latest contract win, reflects the solid demand that the F-35 program enjoys in the combat jet market.\n\nGrowth Prospects\n\nAmid the geopolitical tensions prevalent across the globe, nations are rapidly augmenting defense purchases to strengthen their warfare capabilities. This has led to an increased demand for fighter jets, which form an integral part of a country’s defense products. Per a report by the Mordor Intelligence firm, the global military aviation market is estimated to witness a CAGR of 5.23% during 2024-2030.\n\nSuch projections indicate immense growth opportunities for prominent combat jet manufacturers like Lockheed. Its Aeronautics segment is engaged in the research, design, development, manufacture, integration, sustainment, support and upgradation of advanced military aircraft, including combat and air mobility aircraft, unmanned air vehicles and related technologies. The company’s fighter jet portfolio includes C-130 Super Hercules, F-16 Fighting Falcon jet and F-16 Fighting Falcon, in addition to F-35 jets.\n\nStory continues\n\nPeer Opportunities\n\nOther defense players that can gain from the expanding military aircraft market are Airbus SE EADSY, Boeing BA and Northrop Grumman NOC.\n\nAirbus’ military aircraft consists of the A400M, C295 tactical transporter, the new-generation A330 Multi Role Tanker Transport and the Eurofighter, the most advanced swing-role fighter ever conceived. The company delivered a total of 1,783 military aircraft as of Dec 31, 2023.\n\nEADSY boasts a long-term (three-to-five years) earnings growth rate of 12.4%. The Zacks Consensus Estimate for Airbus’ 2024 sales indicates an improvement of 8.2% from the top line reported in 2023.\n\nBoeing’s product portfolio includes a range of combat-proven aircraft like the F/A-18 Super Hornet, P-8, C-17 Globemaster III, EA-18G and a few more. In 2023, Boeing delivered 22 F/A-18s, nine F-15s, three T-7A Red Hawks and 11 P-8 models.\n\nBA has a long-term earnings growth rate of 4%. The consensus estimate for Boeing’s 2024 sales indicates an improvement of 4.6% from the top line reported in 2023.\n\nNorthrop Grumman has built some of the world’s most advanced aircraft, ranging from the innovative B-2 Spirit stealth bomber to the game-changing E-2D Advanced Hawkeye. The significant awards won by NOC in 2023 included $2.1 billion for F-35 programs, $1.7 billion for E-2 and $1.5 billion for Triton.\n\nNOC boasts a long-term earnings growth rate of 9.9%. The Zacks Consensus Estimate for Northrop Grumman’s 2024 sales indicates an improvement of 4.6% from the top line reported in 2023.\n\nPrice Performance\n\nIn the past three months, shares of LMT have risen 9.5% against the industry’s 3% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLockheed currently has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-secures-contract-aid-140900056.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0KVV.IL",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.024,
            "neu": 0.782,
            "pos": 0.193
        }
    },
    {
        "date": "2024-05-16T10:10:00+00:00",
        "title": "7 Blue-Chip Stocks to Protect Your Wealth as the Economy Slows",
        "content": "For Q1 2024, GDP growth in the United States decelerated to 1.6% from 3.4% in the last quarter. There is no doubt that factors like high interest rates and geopolitical tensions have impacted growth. At the same time, inflation has been relatively stubborn, and potential rate cuts will likely be delayed. The markets are, therefore, likely to witness some nervousness. From an investment perspective, it’s a good idea to look at blue-chip stocks to buy with a low beta.\n\nI must mention here that rate cuts are inevitable. However, a delay will likely translate into some correction for the broad markets. I would use any sharp decline as an opportunity to accumulate growth stocks. For now, the focus should be on blue-chip stocks for capital preservation.\n\nAlso, if the blue-chip stocks are undervalued, total returns can be healthy from these ideas in the next 24 to 36 months. The focus of this column is on blue-chip stocks to buy that have remained largely sideways in the last 12 months. A breakout seems imminent for these stock ideas.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) Space Systems sign in Sunnyvale, California.\n\nSource: Ken Wolter / Shutterstock.com\n\nGlobal defense spending has been increasing at a robust pace. Further, the defense sector is immune to economic shocks. Even during the pandemic year, defense spending increased on a year-on-year basis.\n\nAmong blue-chip defense stocks,Lockheed Martin (NYSE:LMT) looks attractive. The stock has remained sideways for the last 12 months and offers a dividend yield of 2.7%. Considering industry tailwinds and business developments, I expect LMT stock to break out on the upside. Even if the broad markets correct, the low-beta stock will likely remain resilient.\n\nAs of Q1 2024, Lockheed reported an order backlog of $159 billion. I expect order intake to remain robust, ensuring steady top-line growth. Besides growing defense allocation, investment in next-generation defense technology ensures a robust backlog.\n\nIt’s worth noting that Lockheed has guided for free cash flow of $6.2 billion for the year. That implies value creation through dividends and share repurchases.\n\nNewmont (NEM) Silver Stocks to Buy - Newmont Corp (NEM)\n\nNewmont (NYSE:NEM) has started trending higher recently. However, in the last 12 months, NEM stock has had negative returns of 8%. I see this as a golden accumulation opportunity, with gold trading at over $2,350 an ounce. With potential rate cuts due in the coming quarters, I expect a further rally for the precious metal.\n\nSpecific to Newmont, an investment grade balance sheet is the first reason to be positive. The company can pursue aggressive capital investments to boost production and benefit from higher realized gold prices.\n\nStory continues\n\nAs of 2023, Newmont reported 128 million ounces of gold reserves and 155 million ounces of resources. A deep tier-one asset base will ensure a positive long-term trend in production and cash flows.\n\nLast year, Newmont reported operating cash flow of $2.8 billion. With a higher realized price, OCF will likely be around $3.5 billion for 2024. Robust cash flows will ensure healthy dividend growth. NEM stock already has an attractive dividend yield of 2.35%.\n\nChevron (CVX) Chevron (CVX) sing with \"diesel,\" \"food mart\" and \"car wash\" written underneath\n\nSource: Sundry Photography / Shutterstock.com\n\nChevron (NYSE:CVX) is another quality blue-chip stock that trades at a valuation gap. The 3.99% dividend yield stock has remained sideways in the last 12 months. While slower GDP growth is negative for oil demand, the possibility of rate cuts will trigger a rally in energy prices. I am, therefore, bullish on CVX stock.\n\nThere are multiple reasons to like Chevron. First, the company has an investment-grade balance sheet and reported a low net-debt ratio of 8.8% as of Q1 2024. Therefore, there is high financial flexibility to make aggressive capital investments.\n\nFurther, even with the relatively depressed oil prices, Chevron reported an operating cash flow of $6.8 billion for Q1. That implies an annualized OCF potential of $27 billion. However, if oil trades in the zone of $90 to $100 per barrel, OCF is likely to be above $35 billion. Chevron will, therefore, be positioned to pursue aggressive buybacks and deliver robust dividend growth.\n\nAstraZeneca (AZN) Exterior of the AstraZeneca's manufacturing facility at Snackviken\n\nSource: Roland Magnusson / Shutterstock.com\n\nIn general, healthcare stocks have been ignored in a post-pandemic world. This is a good opportunity to accumulate quality blue chips trading at a valuation gap. AstraZeneca (NASDAQ:AZN) stock has been sideways in the last 12 months and looks attractive at a forward price-earnings ratio of 18. The low-beta stock also offers a dividend yield of 2.51%.\n\nFor Q1 2024, AstraZeneca reported stellar numbers. Revenue increased by 19% on a year-on-year basis to $12.7 billion. Further, earnings per share growth was impressive at 21%.\n\nIt’s worth noting that the company has a pipeline of 182 molecular entities. With an attractive late-stage pipeline, robust growth will likely sustain. To put things into perspective, the company had 30 phase three trials last year. Of this, there are 10 potential blockbuster opportunities. The impact will likely be seen on growth in the next 24 to 36 months.\n\nAnother positive catalyst for AstraZeneca is its strong geographical presence. In emerging markets, revenue growth for Q1 was 26% on a year-on-year basis. Excluding China, year-on-year growth was 40%.\n\nRio Tinto (RIO) Mining cart in a silver, copper, and gold mine representing VOXR Stock.\n\nSource: TTstudio / Shutterstock\n\nRio Tinto (NYSE:RIO) is a commodity major that looks undervalued and has a low beta. RIO stock has trended higher by 12% in the last 12 months but remains attractive at a forward P/E ratio of 9.5. Considering the valuation, the downside for this 7.34% dividend yield stock is capped. On the other hand, potential rate cuts can be a catalyst for a rally in industrial commodities and will benefit Rio Tinto.\n\nTalking about fundamentals, Rio Tinto has delivered an average annual free cash flow of $10.6 billion in the last five years. Besides attractive shareholder returns, Rio has a strong balance sheet and flexibility to make aggressive growth investments.\n\nThis is important since Rio Tinto has been focusing on investing in energy transition metals. That includes the likes of copper, lithium and aluminum — among others. While the iron ore business remains the cash cow, Rio will likely be well diversified in the next five years.\n\nWalmart (WMT) Image of Walmart (WMT) logo on Walmart store with clear blue sky in the background\n\nSource: Jonathan Weiss / Shutterstock.com\n\nAn important point to note is that the consumption sector is the primary growth driver for the U.S. economy. Within that sector, retail spending is a key component. Therefore, I would hold quality retail stocks in the portfolio regardless of the economic scenario. Walmart (NYSE:WMT) is a low-beta stock worth holding amidst economic uncertainty.\n\nI must add here that there is a possibility of multiple rate cuts in the next 12 to 18 months. The lower cost of money will boost retail spending, and Walmart will be a beneficiary.\n\nFor Q4 2024, Walmart reported healthy revenue growth of 5.7% on a year-on-year basis to $173.4 billion. It’s worth noting that the e-commerce segment revenue increased by 23% globally. Walmart surpassed $100 billion in annual revenue from the e-commerce business. Clearly, the company has built a strong omni-channel presence. Further, Walmart International sales increased by 13.5% in the last financial year. With a presence in big markets like China and India, I expect sales growth to remain robust.\n\nStarbucks (SBUX) It's Time to Wake Up and Smell the Coffee on Starbucks Stock\n\nSource: Shutterstock\n\nStarbucks (NASDAQ:SBUX) stock has been in a correction mode with a downside of 21% year-to-date. The decline has been triggered by Starbucks’ warning on cautious consumer spending. At the same time, the company lowered its full-year guidance.\n\nHowever, with the negatives discounted in the stock, it’s a good time to accumulate. SBUX stock offers a dividend yield of 3% and looks attractive at a forward price-earnings ratio of 20.4.\n\nFor Q2 2024, Starbucks reported a 2% decline in net revenue on a year-on-year basis to $8.6 billion. Comparable sales declined in U.S. and international markets. However, it’s worth noting that as of Q2, 61% of the company’s stores were concentrated in the U.S. and China.\n\nStarbucks has ample headroom for expansion in other emerging markets in the next 5 to 10 years. The weakness in SBUX stock is an opportunity to gradually accumulate for dividends and steady returns.\n\nOn the date of publication, Faisal Humayun did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nFaisal Humayun is a senior research analyst with 12 years of industry experience in the field of credit research, equity research and financial modeling. Faisal has authored over 1,500 stock specific articles with focus on the technology, energy and commodities sector.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 7 Blue-Chip Stocks to Protect Your Wealth as the Economy Slows appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/7-blue-chip-stocks-protect-101000374.html",
        "symbols": [
            "0R3E.LSE",
            "AZN.US",
            "CRA1.F",
            "CVX.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "N1EM34.SA",
            "NEM.AU",
            "NEM.US",
            "NGT.TO",
            "NMM.DU",
            "NMM.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.042,
            "neu": 0.812,
            "pos": 0.146
        }
    },
    {
        "date": "2024-05-16T00:00:00+00:00",
        "title": "7 Blue-Chip Stocks to Protect Your Wealth as the Economy Slows",
        "content": "These are the low-beta blue-chip stocks to buy, as they represent fundamentally strong ideas with robust cash flow potential.\n",
        "link": "https://investorplace.com/2024/05/7-blue-chip-stocks-to-protect-your-wealth-as-the-economy-slows/",
        "symbols": [
            "AZN.US",
            "CVX.US",
            "LMT.US",
            "NEM.US",
            "RIO.US",
            "SBUX.US",
            "WMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.691,
            "neg": 0,
            "neu": 0.749,
            "pos": 0.251
        }
    }
]