[
    {
        "date": "2024-09-26T14:49:00+00:00",
        "title": "Boeing Secures a Contract to Support F/A-18 E/F Aircraft",
        "content": "The Boeing Company BA recently clinched a deal to support its F/A-18 E/F aircraft. The award has been provided by the Naval Supply Systems Command Weapon Systems Support, Philadelphia, PA.\n\nBA’s New Deal: Details to Note\n\nThe deal, valued at $44.7 million, is slated to be completed by March 2029. According to the agreement, Boeing will provide 31 cylinder and piston spares for the F/A-18 E/F aircraft.\r\n\r\nThe work related to this deal will be carried out in Ajax, Ontario, Canada and St. Louis, MI.\n\nWhat’s Favoring BA Stock?\n\nNations are strengthening their military capabilities in response to the world's expanding threat environment. In such circumstances, military aircraft that play an important part in military operations have been witnessing a major increase in demand. This is likely to have led the Mordor Intelligence firm to predict that the global fighter aircraft market will witness a CAGR of 3.7% during the 2024-2029 period. These projections indicate significant growth opportunities for leading combat jet manufacturers like Boeing.\r\n\r\nIts F/A-18 Block III Super Hornet is the most advanced, cost-effective and readily accessible combat aircraft in the U.S. Navy arsenal. It provides cutting-edge, next-generation multi-role strike fighter capabilities that will outperform existing and new adversaries for many years to come. The Super Hornet comes in two versions — the single-seat E model and the two-seat F model — and it can perform almost any tactical mission, such as air superiority, day and night strikes with precision-guided weapons, fighter escort and close air support.\r\n\r\nThe company’s military jet portfolio also includes other combat-proven aircraft, such as the F-15, P-8, T-7A Red Hawk, EA-18 Growler and C-17 Globemaster III.\n\nOpportunities for BA’s Peers\n\nOther aerospace companies that are likely to reap the benefits of the global fighter aircraft market are as follows:\r\n\r\nNorthrop Grumman Corp. NOC: It is a leading provider of manned and unmanned air systems. It builds some of the world’s most advanced aircraft like the E-2C Hawkeye 2000, A-10 Thunderbolt II, F-5 Tiger Fighter Jet, F-35 Lightning II and many more.\r\n\r\nNorthrop has a long-term (three to five years) earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales calls for an improvement of 5.4% from the prior-year reported figure.\r\n\r\nEmbraer ERJ: The company offers a comprehensive portfolio of the most advanced aircraft in the combat market, which includes the A-29 Super Tucano light attack and advanced trainer and the C-390 Millennium military multi-mission aircraft.\r\n\r\nEmbraer delivered an average earnings surprise of 52.28% in the last four quarters. The Zacks Consensus Estimate for ERJ’s 2024 sales implies an improvement of 19.1% from the prior-year reported figure.\r\n\r\nLockheed Martin Corp. LMT: The company is among the leaders in the combat aircraft space, with its product portfolio constituting some of the most advanced military aircraft like the F-35 Lightning II, C-130 J Super Hercules, F-16 Fighting Falcon and a few more.\r\n\r\nLockheed Martin boasts a long-term earnings growth rate of 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales suggests an improvement of 5.3% from the prior-year reported figure.\n\nStory continues\n\nBA Stock Price Movement\n\nIn the past month, shares of Boeing have fallen 12% against the industry’s growth of 0.2%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nBoeing currently carries a Zacks Rank #4 (Sell).\n\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nEmbraer-Empresa Brasileira de Aeronautica (ERJ) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/boeing-secures-contract-support-f-144900413.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "EMBR3.SA",
            "EMY.F",
            "ERJ.US",
            "LMT.US",
            "LMTB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.05,
            "neu": 0.767,
            "pos": 0.183
        }
    },
    {
        "date": "2024-09-26T14:45:00+00:00",
        "title": "RTX Secures a Contract to Support Stinger Weapon Systems",
        "content": "RTX Corporation’s RTX business unit, Raytheon Missiles Defense, recently won a $46.8 million contract to provide engineering and technical services for supporting the Stinger Weapon System. The award has been offered by the Army Contracting Command, Redstone Arsenal, AL.\n\nMore About RTX’s Stinger Missile\n\nThe Stinger missile is a lightweight, self-contained air defense system that can be quickly deployed by ground forces. The weapon is currently deployed in 19 countries, which reflects the solid demand it enjoys in the missile market.\r\n\r\nIts Stinger-Reprogrammable Microprocessor version missile boasts a dependability and training test success rate of more than 90%. The weapon's supersonic speed, agility, and extremely precise guidance and control system offer it an operational advantage against cruise missiles and all types of aircraft.\n\nWhat’s Favoring RTX Stock?\n\nRapidly increasing geopolitical tensions worldwide, along with heightened regional conflicts in different parts of the globe, like the Middle East and the Russian invasion of Ukraine, have prompted nations to bolster their defense capabilities significantly in recent times.  Since missiles constitute a large share of a nation’s defense arsenals, countries are investing heftily these days in advanced missile systems for deterrence and defense. This has been boosting the demand for technologically advanced missile systems.\r\n\r\nTo this end, the Mordor Intelligence firm predicts the global market for missiles and missile defense systems to witness a CAGR of 5% between 2024 and 2029. This should benefit RTX, which has a handful of combat-proven missiles in its product portfolio, like the TOW missile, Guidance Enhanced Missile, the National Advanced Surface-to-Air Missile System, Tomahawk, Standard Missile 2 and a few more, in addition to the Stinger missile.\n\nProspects of RTX’s Peers\n\nAs global threats rise, military contractors that are projected to gain from the growth prospects presented by the missiles and missile defense system market are as follows:\r\n\r\nThe Boeing Company BA: For almost 25 years, the company has been providing air and missile defense systems to the United States, its allies and international partners. Its offerings include the Avenger Air Defense System, Aegis Ballistic Missile Defense and Ground-Based Midcourse Defense.\r\n\r\nBoeing boasts a long-term (three to five years) earnings growth rate of 21.3%. The Zacks Consensus Estimate for BA’s 2025 sales implies growth of 20.5% from the 2024 estimated figure.\r\n\r\nLockheed Martin LMT: The company’s Missiles and Fire Control business unit develops, manufactures and supports advanced missiles and rockets. Some of its renowned products are the PAC-3 family of missiles, M270, RRPR, THHAD and a few more.\r\n\r\nLockheed has a long-term earnings growth rate of 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales calls for growth of 5.3% from the prior-year reported figure.\r\n\r\nNorthrop Grumman NOC: The company provides high-speed, long-range strike weapons like the AARGM-ER, which is a supersonic, air-launched tactical missile system. It also develops and manufactures warheads, fuses, advanced high-speed propulsion systems and other missile components.\r\n\r\nNorthrop has a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales suggests growth of 5.4% from the prior-year reported figure.\n\nStory continues\n\nRTX Stock Price Movement\n\nIn the past six months, RTX shares have risen 24.1% against the industry’s decline of 0.4%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nRTX Zacks Rank\n\nRTX currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-secures-contract-support-stinger-144500453.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.032,
            "neu": 0.794,
            "pos": 0.174
        }
    },
    {
        "date": "2024-09-26T13:40:13+00:00",
        "title": "Has Bae Systems (BAESY) Outpaced Other Aerospace Stocks This Year?",
        "content": "For those looking to find strong Aerospace stocks, it is prudent to search for companies in the group that are outperforming their peers. Has Bae Systems PLC (BAESY) been one of those stocks this year? By taking a look at the stock's year-to-date performance in comparison to its Aerospace peers, we might be able to answer that question.\n\nBae Systems PLC is one of 46 individual stocks in the Aerospace sector. Collectively, these companies sit at #2 in the Zacks Sector Rank. The Zacks Sector Rank considers 16 different groups, measuring the average Zacks Rank of the individual stocks within the sector to gauge the strength of each group.\n\nThe Zacks Rank is a proven system that emphasizes earnings estimates and estimate revisions, highlighting a variety of stocks that are displaying the right characteristics to beat the market over the next one to three months. Bae Systems PLC is currently sporting a Zacks Rank of #2 (Buy).\n\nWithin the past quarter, the Zacks Consensus Estimate for BAESY's full-year earnings has moved 1% higher. This shows that analyst sentiment has improved and the company's earnings outlook is stronger.\n\nBased on the latest available data, BAESY has gained about 17.4% so far this year. Meanwhile, stocks in the Aerospace group have gained about 5% on average. This shows that Bae Systems PLC is outperforming its peers so far this year.\n\nOne other Aerospace stock that has outperformed the sector so far this year is Lockheed Martin (LMT). The stock is up 27.5% year-to-date.\n\nOver the past three months, Lockheed Martin's consensus EPS estimate for the current year has increased 1.8%. The stock currently has a Zacks Rank #2 (Buy).\n\nLooking more specifically, Bae Systems PLC belongs to the Aerospace - Defense Equipment industry, a group that includes 23 individual stocks and currently sits at #76 in the Zacks Industry Rank. This group has gained an average of 27.7% so far this year, so BAESY is slightly underperforming its industry in this area.\n\nOn the other hand, Lockheed Martin belongs to the Aerospace - Defense industry. This 22-stock industry is currently ranked #33. The industry has moved -1.9% year to date.\n\nBae Systems PLC and Lockheed Martin could continue their solid performance, so investors interested in Aerospace stocks should continue to pay close attention to these stocks.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBae Systems PLC (BAESY) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nStory continues\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/bae-systems-baesy-outpaced-other-134013596.html",
        "symbols": [
            "0R3E.LSE",
            "BA.LSE",
            "BAESF.US",
            "BAESY.US",
            "BSP.BE",
            "BSP.DU",
            "BSP.F",
            "BSP.STU",
            "BSP.XETRA",
            "BSPA.F",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.989,
            "neg": 0.003,
            "neu": 0.905,
            "pos": 0.092
        }
    },
    {
        "date": "2024-09-26T03:24:19+00:00",
        "title": "Is Lockheed Martin Corporation (LMT) the Best Low Beta Stock to Buy Now?",
        "content": "We recently compiled a list of the 10 Best Low Beta Stocks To Buy.In this article, we are going to take a look at where Lockheed Martin Corporation (NYSE:LMT) stands against the other low beta stocks.\n\nAfter a rough few years, the market is coming together and is on a healthy trajectory. The recent Fed rate cuts triggered a lot of bullish sentiment toward the broader market. For example, on September 20, Business Insider reported that Brian Belski from BMO raised his S&P 500 price target for 2024 to 6,100 from 5,600, followed by the Fed's recent rate cut and strong seasonal market data.\n\nMoreover, Belski talked about broadening stock market gains and the increased likelihood of a soft landing for the U.S. economy. He finds current elevated valuations justified as he compared the situation to the mid-1990s when the market sustained high multiples.\n\nIn addition, Tom Lee of Fundstrat is bullish on the market for several upcoming years and expects the broader market to nearly triple to 15,000 by 2030. His bullish sentiment is driven by demographic shifts, millennial spending, and technology advancements. He mentioned the prime earning years of millennials and Gen Z, which mirror previous periods of high stock market returns. Furthermore, he also highlighted the role of technology in addressing global labor shortages and projects significant spending on AI and tech solutions.\n\nBroadening Market Participation and the Outlook for Recession Risks\n\nOn September 24, Prashant Bhayani of BNP Paribas Wealth Management joined CNBC to discuss the current market conditions. He discussed the improving liquidity and noted the tight credit spreads, near-record equities, and steady lending. While U.S. hiring is slowing, he explained that rising unemployment is partly due to labor force growth, not just layoffs, which makes it different from past cycles. Bhayani stressed that employment data, like jobless claims, will be important in determining market outlooks.\n\nOn market valuations, Bhayani acknowledged some sectors are overvalued but sees broader market participation beyond AI-related stocks. He suggested that stocks could outperform bonds if a soft landing or no recession occurs.\n\nAddressing concerns about potential triggers for volatility, Bhayani said that a credit event, similar to those seen in 2000 or 2007, could lead to significant market declines. However, current credit spreads and a healthy banking system support the soft landing view.\n\nOur Methodology\n\nFor this article, we used the Yahoo Finance stock screener to identify over 30 mid to mega-cap stocks with a 5-year beta (monthly) between 0.2 to 0.8. Next, we narrowed the list to 10 stocks most widely held by institutional investors. The 10 best low-beta stocks to buy are listed in ascending order of their hedge fund sentiment and we used the beta as a tie-breaker as well.\n\nStory continues\n\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here). 5 Countries with the Most Special-Mission Aircraft in the World\n\nA military aircraft in flight, showing the strength of the company's combat & air mobility capability.\n\nLockheed Martin Corporation (NYSE:LMT)\n\n5-year Beta (monthly): 0.47\n\nNumber of Hedge Fund Holders: 56\n\nLockheed Martin Corporation (NYSE:LMT) is a Maryland-based global aerospace, defense, and security company. The company focuses primarily on the research, design, development, manufacture, and integration of advanced technological systems and services. The company’s expertise spans key sectors, including aerospace, military defense, cybersecurity, and space exploration.\n\nThe company operates through key segments, namely, Aeronautics, Missiles and Fire Control, Rotary and Mission Systems, and Space. Its Aeronautics division is known for developing military several aircraft like the F-35 Lightning II, one of the most advanced fighter jets in the world. The Missiles and Fire Control division focuses on precision weaponry and advanced missile systems, while Rotary and Mission Systems covers naval warfare, radar technologies, and cybersecurity. Lastly, the Space segment handles satellite technologies, missile defense, and space exploration.\n\nLockheed Martin (NYSE:LMT) has been receiving a significant number of contracts recently, including the latest NASA contract. NASA has awarded the company with a contract to develop the next-generation GeoXO Lightning Mapper instruments for the National Oceanic and Atmospheric Administration (NOAA). The initial contract is valued at around $297 million for two instruments, with options for two more.\n\nThe innovation is designed to provide meteorologists with improved tools for issuing timely warnings about severe weather events, including rapidly intensifying hurricanes. The company’s joint venture (JV) with RTX, Javelin, has received several contracts in September.\n\nEarlier in August, Reuters reported that Lockheed Martin’s (NYSE:LMT) JV secured a follow-on contract valued at $1.3 billion from the U.S. Army for Javelin missiles, which have been crucial in Ukraine's defense against Russia. The contract is part of a broader agreement awarded last year, potentially worth up to $7.2 billion, which covers an unspecified quantity of missiles from 2023 to 2026.\n\nLockheed Martin (NYSE:LMT) tops our list of 10 best low beta stocks as its stock was held by 56 hedge funds, at a combined value of $2.056 billion in Q2. Two Sigma Advisors is the company’s largest shareholder with 855,600 shares worth $399.65 million as of the second quarter.\n\nOverall LMT ranks 1st on our list of the best low beta stocks to buy. While we acknowledge the potential of LMT as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for an AI stock that is promising and trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nRead Next: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-corporation-lmt-best-032419735.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.048,
            "neu": 0.797,
            "pos": 0.155
        }
    }
]