[
    {
        "date": "2024-05-28T21:50:10+00:00",
        "title": "Lockheed Martin (LMT) Stock Dips While Market Gains: Key Facts",
        "content": "Lockheed Martin (LMT) closed the latest trading day at $458.48, indicating a -1.9% change from the previous session's end. The stock's change was less than the S&P 500's daily gain of 0.03%. Elsewhere, the Dow saw a downswing of 0.56%, while the tech-heavy Nasdaq appreciated by 0.59%.\n\nPrior to today's trading, shares of the aerospace and defense company had lost 0.04% over the past month. This has lagged the Aerospace sector's gain of 4.27% and the S&P 500's gain of 4.19% in that time.\n\nInvestors will be eagerly watching for the performance of Lockheed Martin in its upcoming earnings disclosure. The company's earnings per share (EPS) are projected to be $6.45, reflecting a 4.16% decrease from the same quarter last year. Our most recent consensus estimate is calling for quarterly revenue of $17.03 billion, up 2.04% from the year-ago period.\n\nFor the annual period, the Zacks Consensus Estimates anticipate earnings of $26.26 per share and a revenue of $69.72 billion, signifying shifts of -5.61% and +3.18%, respectively, from the last year.\n\nAdditionally, investors should keep an eye on any recent revisions to analyst forecasts for Lockheed Martin. Recent revisions tend to reflect the latest near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.\n\nOur research demonstrates that these adjustments in estimates directly associate with imminent stock price performance. To exploit this, we've formed the Zacks Rank, a quantitative model that includes these estimate changes and presents a viable rating system.\n\nRanging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. Within the past 30 days, our consensus EPS projection has moved 0.24% higher. Lockheed Martin currently has a Zacks Rank of #3 (Hold).\n\nLooking at valuation, Lockheed Martin is presently trading at a Forward P/E ratio of 17.8. For comparison, its industry has an average Forward P/E of 18.77, which means Lockheed Martin is trading at a discount to the group.\n\nIt is also worth noting that LMT currently has a PEG ratio of 4.38. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. As of the close of trade yesterday, the Aerospace - Defense industry held an average PEG ratio of 1.79.\n\nThe Aerospace - Defense industry is part of the Aerospace sector. Currently, this industry holds a Zacks Industry Rank of 79, positioning it in the top 32% of all 250+ industries.\n\nStory continues\n\nThe strength of our individual industry groups is measured by the Zacks Industry Rank, which is calculated based on the average Zacks Rank of the individual stocks within these groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nBe sure to follow all of these stock-moving metrics, and many more, on Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-stock-dips-215010191.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.01,
            "neu": 0.877,
            "pos": 0.113
        }
    },
    {
        "date": "2024-05-28T13:57:00+00:00",
        "title": "Lockheed (LMT) Clinches Navy Contract to Support LCS Program",
        "content": "Lockheed Martin Corp.’s LMT business segment, Rotary and Mission Systems (RMS), recently clinched a modification contract to provide industrial post-delivery availability support for the Freedom-variant Littoral Combat Ship USS Cleveland (LCS 31). The award has been offered by the Naval Sea Systems Command, Washington, D.C.\n\nValued at $22.7 million, the contract is expected to be completed by March 2025. Work related to this deal will be executed in Marinette, WI.\n\nWhat’s Favoring Lockheed?\n\nLCS is a class of small surface combatant ships, which play a critical role in defending a nation. These ships offer agile, mission-focused platforms and are capable of operating in near-shore and open-ocean environments. Currently, there are two variants of LCS in the United States. The Freedom variant is being constructed by Lockheed, which remains one of the prominent defense contractors providing combat-proven naval solutions.\n\nImpressively, the Freedom-variant LCS is a resilient, flexible warship, with more than a third of its hull being open and equipped to take on new capabilities, including advanced sensors, missiles and cutting-edge cyber systems.\n\nSuch remarkable features of this variant of LCS must have been boosting its demand significantly. This can be gauged from the fact that Lockheed is in full-rate production mode for the Freedom-variant LCS and has delivered 13 ships to the U.S. Navy, with three more in various stages of production as of April 2023.\n\nWhat’s the Potential for Growth?\n\nNations across the globe are fortifying their defense spending on military weapons and arsenals as they look to strengthen their defense capabilities amid the widespread hostilities witnessed worldwide. This also includes augmented spending on navy combat vehicles, including LCS, for enhanced sea warfare capabilities.\n\nIn this regard, according to a report by the Morder Intelligence firm, the global naval combat vessels market is projected to witness a CAGR of 6.5% during the 2024-2029 period.\n\nThis obviously bolsters growth prospects for Lockheed, considering its ability to deliver versatile and cutting-edge naval solutions. Notably, apart from LCS, Lockheed’s RMS unit designs Multi-Mission Surface Combatant (MMSC), which is a lethal and highly maneuverable warship capable of littoral and open ocean operation. It has a range of 5,000 nautical miles and can reach a speed of more than 30 knots, with the ability to confront modern maritime and economic security threats.\r\n\r\nGiven the expertise Lockheed has in providing agile maritime securities, we may expect the company to win more contracts involving its naval solutions like the latest one, in coming days. Such contract wins should bolster the top-line performance of its RMS unit, which contributes nearly 24% to the company’s total revenues.\n\nStory continues\n\nOpportunities for Peers\n\nConsidering the solid growth opportunities offered by the global naval combat vessels market, other defense primes like Huntington Ingalls Industries HII, Northrop Grumman NOC and General Dynamics GD, with a strong presence in this market, should benefit as well.\n\nHuntington Ingalls’ Shipbuilding and Newport News Shipbuilding segments design and construct non-nuclear ships, including amphibious assault ships, expeditionary warfare ships, surface combatants and national security cutters. During 2023, 81% of the company’s revenues were generated from the U.S. Navy.\n\nHII boasts a long-term (three-to-five-years) earnings growth rate of 7.2%. The Zacks Consensus Estimate for 2024 sales implies growth of 2% from the prior-year figure.\n\nNorthrop Grumman delivers components like Airborne LASER Mine Detection System, Surface Electronic Warfare Improvement Program Block III, Fire Scout and bridge and navigation systems for both the Freedom and Independence variants of LCS. During 2023, 15% of NOC’s sales came from the Navy.\n\nNOC boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for 2024 sales implies growth of 4.6% from the prior-year figure.\n\nGeneral Dynamics is the lead integrator for the Independence-variant LCS. It is responsible for the design, integration and testing of the navigation, command, control, computing and aviation systems on each ship. In 2023, its Marins Systems business segment generated 23% of its total revenues.\n\nGD boasts a long-term earnings growth rate of 12%. The Zacks Consensus Estimate for 2024 sales implies growth of 10.5% from the prior-year reported figure.\n\nPrice Performance\n\nIn the past year, shares of LMT have rallied 4.2% against the industry’s 7% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLockheed currently has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nHuntington Ingalls Industries, Inc. (HII) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-clinches-navy-contract-135700602.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.048,
            "neu": 0.77,
            "pos": 0.182
        }
    },
    {
        "date": "2024-05-28T13:55:00+00:00",
        "title": "RTX Secures a Navy Contract Involving AIM-9X Block II Missile",
        "content": "RTX Corp. RTX recently clinched a modification contract involving the AIM-9X Block II missile. The award has been provided by the Naval Air Systems Command, Patuxent River, MD.\n\nDetails of the Deal\n\nValued at $18 million, the contract is expected to be completed by June 2026. The latest modification adds scope for RTX to offer continued studies involving future updates to the AIM-9X missile system, in conjunction with the AIM-9X Block II and Block II+ System Improvement Program Increment IV.\n\nWork related to this deal will be executed in Tucson, AZ. The contract is set to serve the U.S. Navy, Air Force and Army, as well as foreign military sales customers.\n\nWhat’s Favoring RTX?\n\nNations are reinforcing their military capabilities to strengthen their defense structure in the growing threat environment. In this context, increased spending has been witnessed on missile capabilities, resulting in a significant order inflow for companies like RTX, which is a prominent missile maker in the United States with a strong international presence.\n\nNotably, RTX’s AIM-9X Sidewinder is the most advanced infrared-tracking, short-range, air-to-air and surface-to-air missile in the world. It is configured for easy installation in a range of modern aircraft, including Boeing’s F-15, F/A-18 and E/A-18G, and Lockheed’s F-22 and F-35 fighters.\n\nThe latest variant of AIM-9X Sidewinder, the AIM-9X Block II missile features a redesigned fuse and a digital ignition safety device that enhances ground handling and in-flight safety. Backed by such advanced technology, the company witnesses significant orders for the same, like the latest one. The demand for this product line of RTX can be further gauged from the fact that the AIM-9X SIDEWINDER missile has 31 foreign military sales partners.\n\nGrowth Prospects\n\nThe global peace index reflects an unstable environment worldwide, with the Russia-Ukraine war continuing for more than two years now, in addition to the ongoing hostility in different parts of the Middle East. This has set the stage for the defense sector to witness rising demand for military products, particularly missiles, as nations worldwide strive to protect their borders from unprecedented attacks.\n\nTherefore, the growth prospect for the missile and missile defense systems market remains solid. To this end, the Mordor Intelligence firm projects the market to witness a CAGR of 5% over the 2024-2029 period.\n\nSuch a solid market growth projection stands to benefit RTX, which enjoys an extensive missile portfolio, including SM-6, SM-3 interceptor, TOW missiles and many more weapons, apart from the AIM-9X missile.\n\nStory continues\n\nPeer Opportunities\n\nOther defense contractors that are likely to benefit from the growth opportunities offered by the missile and missile defense market are as follows:\r\n\r\nNorthrop Grumman NOC: Northrop is a prominent developer of missile systems and counter systems, including strategic deterrents, as well as subsystems and components. Its product portfolio includes the Integrated Air and Missile Defense Battle Command System, the Guided Multiple Launch Rocket System propulsion and warhead subsystems, the Hypersonic Attack Cruise Missile, the Advanced Anti-Radiation Guided Missile and a few other combat-proven products that support missile defense systems.\r\n\r\nNOC boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for 2024 sales indicates an improvement of 4.6% from the 2023 reported figure.\r\n\r\nLockheed Martin LMT: Lockheed’s Missiles and Fire Control business unit develops, manufactures and supports advanced combat missiles and rockets for military customers, including the U.S. Army, Navy, Air Force, Marine Corps, NASA and dozens of foreign allies. Some of its prominent products are the PAC-3 missile and the Terminal High Altitude Area Defense missile.\n\nLMT boasts a long-term earnings growth rate of 4.1%. The Zacks Consensus Estimate for 2024 sales indicates an improvement of 3.2% from the 2023 reported figure.\n\nGeneral Dynamics GD: The company’s Ordnance and Tactical Systems unit is the system integrator of the 2.75-inch Hydra-70 family of rockets. It also produces composite rocket motor cases and launch tubes for tactical and strategic missiles.\n\nGD boasts a long-term earnings growth rate of 12%. The Zacks Consensus Estimate for 2024 sales indicates growth of 10.5% from the 2023 reported figure.\n\nPrice Movement\n\nIn the past year, shares of RTX have risen 14% against the industry’s decline of 7%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nRTX currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-secures-navy-contract-involving-135500151.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.051,
            "neu": 0.77,
            "pos": 0.179
        }
    },
    {
        "date": "2024-05-28T12:00:21+00:00",
        "title": "These 4 Measures Indicate That Lockheed Martin (NYSE:LMT) Is Using Debt Reasonably Well",
        "content": "David Iben put it well when he said, 'Volatility is not a risk we care about. What we care about is avoiding the permanent loss of capital.' When we think about how risky a company is, we always like to look at its use of debt, since debt overload can lead to ruin. Importantly, Lockheed Martin Corporation (NYSE:LMT) does carry debt. But is this debt a concern to shareholders?\n\nWhat Risk Does Debt Bring?\n\nDebt is a tool to help businesses grow, but if a business is incapable of paying off its lenders, then it exists at their mercy. Ultimately, if the company can't fulfill its legal obligations to repay debt, shareholders could walk away with nothing. However, a more frequent (but still costly) occurrence is where a company must issue shares at bargain-basement prices, permanently diluting shareholders, just to shore up its balance sheet. Of course, plenty of companies use debt to fund growth, without any negative consequences. The first thing to do when considering how much debt a business uses is to look at its cash and debt together.\n\nCheck out our latest analysis for Lockheed Martin\n\nHow Much Debt Does Lockheed Martin Carry?\n\nThe image below, which you can click on for greater detail, shows that at March 2024 Lockheed Martin had debt of US$19.4b, up from US$15.6b in one year. However, it does have US$2.79b in cash offsetting this, leading to net debt of about US$16.6b. debt-equity-history-analysis\n\nA Look At Lockheed Martin's Liabilities\n\nWe can see from the most recent balance sheet that Lockheed Martin had liabilities of US$17.7b falling due within a year, and liabilities of US$30.6b due beyond that. Offsetting these obligations, it had cash of US$2.79b as well as receivables valued at US$16.3b due within 12 months. So it has liabilities totalling US$29.2b more than its cash and near-term receivables, combined.\n\nThis deficit isn't so bad because Lockheed Martin is worth a massive US$112.1b, and thus could probably raise enough capital to shore up its balance sheet, if the need arose. But it's clear that we should definitely closely examine whether it can manage its debt without dilution.\n\nWe measure a company's debt load relative to its earnings power by looking at its net debt divided by its earnings before interest, tax, depreciation, and amortization (EBITDA) and by calculating how easily its earnings before interest and tax (EBIT) cover its interest expense (interest cover). This way, we consider both the absolute quantum of the debt, as well as the interest rates paid on it.\n\nLockheed Martin's net debt of 1.6 times EBITDA suggests graceful use of debt. And the fact that its trailing twelve months of EBIT was 9.2 times its interest expenses harmonizes with that theme. And we also note warmly that Lockheed Martin grew its EBIT by 18% last year, making its debt load easier to handle. The balance sheet is clearly the area to focus on when you are analysing debt. But ultimately the future profitability of the business will decide if Lockheed Martin can strengthen its balance sheet over time. So if you're focused on the future you can check out this freereport showing analyst profit forecasts.\n\nStory continues\n\nFinally, while the tax-man may adore accounting profits, lenders only accept cold hard cash. So it's worth checking how much of that EBIT is backed by free cash flow. During the last three years, Lockheed Martin generated free cash flow amounting to a very robust 82% of its EBIT, more than we'd expect. That puts it in a very strong position to pay down debt.\n\nOur View\n\nHappily, Lockheed Martin's impressive conversion of EBIT to free cash flow implies it has the upper hand on its debt. And the good news does not stop there, as its interest cover also supports that impression! Zooming out, Lockheed Martin seems to use debt quite reasonably; and that gets the nod from us. After all, sensible leverage can boost returns on equity. There's no doubt that we learn most about debt from the balance sheet. But ultimately, every company can contain risks that exist outside of the balance sheet. For example - Lockheed Martin has  2 warning signs  we think you should be aware of.\n\nWhen all is said and done, sometimes its easier to focus on companies that don't even need debt. Readers can access a list of growth stocks with zero net debt100% free, right now.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/4-measures-indicate-lockheed-martin-120021862.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.118,
            "neu": 0.702,
            "pos": 0.18
        }
    },
    {
        "date": "2024-05-28T10:00:00+00:00",
        "title": "Hidden Stocks, Huge Gains: 7 Picks the Market Mispriced for Triple-Digit Returns",
        "content": "For long-term investors seeking to capitalize on undervalued opportunities, there are several undervalued stocks that present attractive valuations relative to their intrinsic worth. These companies offer a unique combination of discounted prices and strong growth potential.\n\nAs we look to the future, these companies are well-positioned for substantial growth, underpinned by favorable industry tailwinds and strategic expansions.\n\nInvesting in the stocks outlined in this article could potentially lead to market-beating returns in the foreseeable future. While some of these stocks may be less risky than others, focusing on an income strategy, they all have the potential to add stability and impressive gains to one’s portfolio.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nSo with that being said, here are seven undervalued stocks that investors should consider adding to their portfolios. I think that these names represent the best value for money in the market right now.\n\nQuantum Computing (QUBT) A concept image showing a quantum computer with a matrix background; quantum computing. leading quantum stocks, Best Quantum Computing Stocks to Buy\n\nSource: Shutterstock\n\nQuantum Computing (NASDAQ:QUBT) focuses on quantum computing solutions. Despite recent financial misses, it’s poised for significant long-term growth.\n\nIn Q1 2024, Quantum Computing reported a revenue of $0.08 million and an earnings per share (EPS) of -$0.09, missing analyst expectations. However, the company remains committed to developing its quantum computing technologies.\n\nQuantum Computing has made progress in product development, including the release of five new products since acquiring QPhoton. The company is also expanding its manufacturing capacity and building a quantum chip facility to support future product design and development. This includes the production of various lithium niobate chips, such as physical unclonable function (PUF) and electro-optic modulator (EOM) chips, expected to launch in 2024.\n\nFinancially, Quantum Computing is exploring non-dilutive funding options to support its growth and maintain shareholder value. The company’s balance sheet remains stable with $71.4 million in cash, providing a solid foundation.\n\nAirbus (EADSY) An image of an orange eVTOL sitting on a helipad, the ocean in the background. best flying car stocks\n\nSource: Chesky / Shutterstock\n\nAirbus (OTCMKTS:EADSY) is actively developing the CityAirbus project, aiming to introduce a fleet of electric flying taxis for urban transportation.\n\nThe CityAirbus NextGen is a fully electric, four-seat vertical take-off and landing (eVTOL) aircraft designed for urban air mobility. It features fixed wings, a V-shaped tail, and eight electrically powered propellers. The CityAirbus NextGen project has made significant strides, with the prototype set for its maiden flight later in 2024. Airbus has leveraged years of research and development, incorporating insights from its previous demonstrators.\n\nStory continues\n\nEADSY is one of the two major airliners in the world, so I think that it could have an entrenched advantage in terms of its competitive positioning for flying cars.\n\nFinancially, Airbus reported strong performance in the first quarter of 2024, with consolidated revenues increasing by 9% year-over-year to €12.8 billion, driven by higher commercial aircraft deliveries.\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) C-130J Super Hercules of the United States Air Force performing at Aero India 2017.\n\nSource: Joe Ravi / Shutterstock.com\n\nLockheed Martin (NYSE:LMT) has stable government contracts and is undervalued with a low P/E ratio as one of the most important defense contractors in the world.\n\nLMT has shown stable performance and provided a positive outlook for 2024. In the first quarter of 2024, LMT reported net sales of $17.2 billion, up from $15.1 billion in Q1 2023. Despite this increase in sales, net earnings decreased to $1.5 billion or $6.39 per share, compared to $1.7 billion or $6.61 per share in Q1 2023. LMT’s backlog remains strong at $159 billion, reflecting significant national security space awards.\n\nLooking forward to 2024, LMT reaffirms its financial guidance, projecting net sales between $68.5 billion and $70 billion and diluted earnings per share in the range of $25.65 to $26.35. The company expects free cash flow between $6 billion and $6.3 billion for the year​. It could then be seen as one of those undervalued picks that investors should pay attention to.\n\nAltria Group (MO) Altria office sign in Virginia capital city tobacco business closeup by road street\n\nSource: Kristi Blokhin / Shutterstock.com\n\nAltria Group (NYSE:MO), known for its tobacco products, offers a high dividend yield and is diversifying into alternative products. Its undervaluation and stable cash flow make it an attractive option for value investors.\r\n\r\nMO’s cigarette shipment volume dropped by 10% in Q1 2024, primarily due to industry decline rates and the rise of illicit e-vapor products. Marlboro’s retail share in the cigarette category remained stable at 42%.\r\n\r\nFor 2024, MO reaffirms its guidance, expecting full-year adjusted diluted EPS to be between $5.05 and $5.17, reflecting a growth rate of 2% to 4.5% from a base of $4.95 in 2023​.\n\nMO’s top-line has been decreasing, but it still produces an absurd amount of free cash flow, much of which it distributes to investors as a dividend. It has plenty of runway left to successfully transition to the smokeless products segment.\n\nIntel (INTC) Intel (INTC) logo is seen outside of the Robert Noyce Building at Intel Corporation's headquarters in Santa Clara, California.\n\nSource: Tada Images / Shutterstock.com\n\nIntel (NASDAQ:INTC) is investing heavily in semiconductor manufacturing and innovation. Despite recent challenges, its market position and ongoing investments in new technologies suggest that it is undervalued and poised for a strong recovery.\n\nINTC reported first-quarter 2024 revenue of $12.8 billion, which is within its guidance range of $12.5-13.5 billion. However, this guidance was below analyst expectations of $14.2 billion. The company’s gross margin was 40.2% on a GAAP basis and 43.5% on a non-GAAP basis​.\n\nFor Q1 2024, INTC’s EPS was $0.13, also lower than the expected $0.33 per share. Despite these lower-than-expected figures, INTC remains focused on its long-term investments in semiconductor manufacturing.\r\n\r\nINTC also plans to continue its IDM 2.0 strategy, focusing on expanding its foundry business and investing in new semiconductor fabrication facilities, including a new plant in Ireland with $2 billion in funding.\n\nLithium Americas (LAC) smartphone with logo of Canadian company Lithium Americas Corp on screen\n\nSource: Wirestock Creators / Shutterstock.com\n\nLithium Americas (NYSE:LAC) is advancing its Thacker Pass project in Nevada, which holds the largest-known lithium reserve in the U.S. The company secured a $2.26 billion loan from the U.S. Department of Energy..\n\nThe project is expected to produce 40,000 tonnes per annum (tpa) of battery-quality lithium carbonate. The construction of Thacker Pass is projected to create approximately 1,800 direct jobs over the three-year build period​.\n\nIn Q1 2024, LAC reported an increase in total assets, largely due to the capitalization of Thacker Pass costs.\n\nAnalyst ratings for LAC are generally positive, with a consensus rating of “Moderate Buy” and an average price target suggesting significant potential upside.\n\nAt just $3.91 per share, LAc could be significantly undervalued relative to its long-term growth potential.\n\nIris Energy (IREN) An image of a miner with a pickaxe mining digital coins, computer code and various numbers are overlaid on the image\n\nSource: Yev_1234 / Shutterstock\n\nIris Energy (NASDAQ:IREN), based in Australia, focuses on renewable energy for Bitcoin (BTC-USD) mining.\n\nThe demand for companies like IREN, which provide sustainable power solutions for Bitcoin miners, is expected to rise. Bitcoin mining is highly energy-intensive, and regulatory scrutiny over its environmental impact is likely. IREN offers a competitive edge for Bitcoin miners by mitigating these risks with its renewable energy approach.\n\nIREN’s growth outlook for 2024 is a key reason for its perceived undervaluation. The company plans to significantly expand its operations, aiming to increase its operating capacity from 5.6 EH/s to 20 EH/s by year-end. This growth will be supported by 9 EH/s of miner purchase options available for exercise in the second half of 2024.\n\nCombined with its forward P/E ratio of 8 times earnings, IREN presents a compelling investment opportunity in the blockchain sector.\n\nOn the date of publication, Matthew Farley did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nMatthew started writing coverage of the financial markets during the crypto boom of 2017 and was also a team member of several fintech startups. He then started writing about Australian and U.S. equities for various publications. His work has appeared in MarketBeat, FXStreet, Cryptoslate, Seeking Alpha, and the New Scientist magazine, among others.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post Hidden Stocks, Huge Gains: 7 Picks the Market Mispriced for Triple-Digit Returns appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/hidden-stocks-huge-gains-7-100000877.html",
        "symbols": [
            "0KVV.IL",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "EADSF.US",
            "EADSY.US",
            "INTC.US",
            "IREN.US",
            "LAC.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.012,
            "neu": 0.861,
            "pos": 0.127
        }
    },
    {
        "date": "2024-05-28T00:00:00+00:00",
        "title": "Hidden Stocks, Huge Gains: 7 Picks the Market Mispriced for Triple-Digit Returns",
        "content": "Discover seven undervalued stocks the market has mispriced. Invest now in these hidden gems for potential triple-digit returns.",
        "link": "https://investorplace.com/2024/05/hidden-stocks-huge-gains-7-picks-the-market-mispriced-for-triple-digit-returns/",
        "symbols": [
            "EADSY.US",
            "INTC.US",
            "LMT.US",
            "MO.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0,
            "neg": 0,
            "neu": 1,
            "pos": 0
        }
    }
]