[
    {
        "date": "2024-09-19T21:50:22+00:00",
        "title": "Lockheed Martin (LMT) Stock Slides as Market Rises: Facts to Know Before You Trade",
        "content": "Lockheed Martin (LMT) closed the latest trading day at $565.18, indicating a -0.05% change from the previous session's end. The stock's performance was behind the S&P 500's daily gain of 1.7%. Elsewhere, the Dow gained 1.26%, while the tech-heavy Nasdaq added 2.51%.\n\nPrior to today's trading, shares of the aerospace and defense company had gained 2.12% over the past month. This has outpaced the Aerospace sector's gain of 0.38% and the S&P 500's gain of 1.27% in that time.\n\nThe investment community will be closely monitoring the performance of Lockheed Martin in its forthcoming earnings report. On that day, Lockheed Martin is projected to report earnings of $6.40 per share, which would represent a year-over-year decline of 5.47%. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $17.45 billion, up 3.37% from the year-ago period.\n\nFor the entire fiscal year, the Zacks Consensus Estimates are projecting earnings of $26.49 per share and a revenue of $71.14 billion, representing changes of -4.78% and +5.28%, respectively, from the prior year.\n\nFurthermore, it would be beneficial for investors to monitor any recent shifts in analyst projections for Lockheed Martin. Recent revisions tend to reflect the latest near-term business trends. Hence, positive alterations in estimates signify analyst optimism regarding the company's business and profitability.\n\nResearch indicates that these estimate revisions are directly correlated with near-term share price momentum. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.\n\nThe Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the past month, there's been no change in the Zacks Consensus EPS estimate. Lockheed Martin is currently sporting a Zacks Rank of #3 (Hold).\n\nIn the context of valuation, Lockheed Martin is at present trading with a Forward P/E ratio of 21.35. This expresses a premium compared to the average Forward P/E of 20.83 of its industry.\n\nWe can also see that LMT currently has a PEG ratio of 4.57. Comparable to the widely accepted P/E ratio, the PEG ratio also accounts for the company's projected earnings growth. Aerospace - Defense stocks are, on average, holding a PEG ratio of 2.03 based on yesterday's closing prices.\n\nThe Aerospace - Defense industry is part of the Aerospace sector. This group has a Zacks Industry Rank of 36, putting it in the top 15% of all 250+ industries.\n\nStory continues\n\nThe Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nTo follow LMT in the coming trading sessions, be sure to utilize Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-stock-slides-215022242.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.004,
            "neu": 0.867,
            "pos": 0.129
        }
    },
    {
        "date": "2024-09-19T15:34:00+00:00",
        "title": "Kratos Secures a Contract for BQM-167A Target Aircraft Systems",
        "content": "Kratos Defense & Security Solutions, Inc. KTOS recently secured a $79.8 million contract for the procurement of 60 aircraft, mission kits, certain flight consumables and other technical data for BQM-167A Air Force subscale aerial target systems.\r\n \r\nThe latest contract incorporates the most significant enhancements to the BQM-167A to date, including gas, aero, payload and power upgrades. These upgrades are designed to replicate more advanced threats, thereby allowing the U.S. Air Force to enhance its weapons systems’ verification and training efforts.\n\nMore on KTOS’ BQM-167A Target System\n\nThe BQM-167A system is important for the U.S. military training because it acts as a realistic target, allowing the test of its weapons and defense systems. The system has been used for more than 20 years and it is continuously evolving to meet the stringent demands of more advanced enemy technologies.\r\n\r\nThe recent upgrades to the BQM-167A will allow it to imitate even more complex threats. This in turn will help the U.S. military to stay ahead of potential enemies by training with the latest technology. By improving the way it simulates enemy attacks, the BQM-167A enables the U.S. military to better protect the country.\n\nKTOS’ Growth Prospects in Military Training\n\nThe worldwide training market is seeing strong growth, driven by the need to prepare for more advanced and complex threats. With rising global tensions, the military is actively focusing on training with cutting-edge and advanced technology to stay ready for any situation.\r\n \r\nThis must have led Morder Intelligence to predict that the global military simulation and training market will witness a CAGR of 5.2% during the 2024-2029 period.\r\n\r\nKTOS is in a strong position to benefit from the aforementioned market expansion with its BQM product line, including the BQM-167A and BQM-177A, which is crucial for training the Air Force and Navy.\r\n\r\nNotably, KTOS has an advantage as the only supplier of the BQM-177A to the U.S. Navy. Recent contract wins, like the $58 million deal in March 2024 for 70 surface-launched aerial targets, show the growing demand for its products in the training market.\n\nOpportunities for KTOS’ Peers\n\nOther defense companies that are likely to enjoy the perks of the expanding military training and simulation market have been discussed below.\r\n \r\nNorthrop Grumman Corporation’s NOC Combat Electromagnetic Environment Simulator (CEESIM) simulates true-to-war conditions, offering the most cost-effective means of testing and validating the effectiveness of sophisticated electronic warfare equipment.\r\n\r\nNorthrop Grumman has a long-term (three to five years) earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales indicates year-over-year growth of 5.4%.\r\n\r\nLockheed Martin Corporation’s LMT Close Combat Tactical Trainer integrates all facets of combat vehicle operations to immerse warfighters in simulated battlefield scenarios. Soldiers move, shoot and communicate on this battlefield by operating combat vehicles and employing simulated weapon systems.\r\n\r\nLockheed Martin has a long-term earnings growth rate of 4.7%. The consensus estimate for LMT’s 2024 sales indicates year-over-year growth of 5.3%.\r\n\r\nRTX Corporation’s RTX High-Fidelity Simulation system provides realistic training scenarios for both military and civilian personnel, focusing on enhanced decision-making and tactical readiness. The system replicates real-world operational environments with advanced threat emulation, allowing users to train in complex, high-pressure situations.\r\n\r\nRTX has a long-term earnings growth rate of 10.4%. The consensus estimate for RTX’s 2024 sales indicates year-over-year growth of 7%.\n\nStory continues\n\nKTOS Stock’s Price Movement\n\nShares of KTOS have gained 36.9% in the past six months compared with the industry’s 14.4% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nKTOS Stock’s Zacks Rank\n\nKTOS currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nKratos Defense & Security Solutions, Inc. (KTOS) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/kratos-secures-contract-bqm-167a-153400329.html",
        "symbols": [
            "0JS0.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "KTOS.US",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU",
            "WF5A.BE",
            "WF5A.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.07,
            "neu": 0.755,
            "pos": 0.175
        }
    },
    {
        "date": "2024-09-19T13:13:00+00:00",
        "title": "Lockheed Finishes Risk Reduction Test for TPY-4 Radar: Time to Buy?",
        "content": "Lockheed Martin Corp. LMT recently completed the risk reduction testing for the TPY-4 radar, thereby making progress in the Three-Dimensional Expeditionary Long-Range Radar (“3DELRR”) program. Notably, in February 2022, the U.S. Air Force selected Lockheed as the primary contractor for the 3DELRR program to provide a radar that will perform long-range detection of both air-breathing threats and theater ballistic missiles.\n\nThe selection of Lockheed as the provider of the radar under the 3DELRR program, which constitutes a crucial part of the U.S. air surveillance, and the aforementioned progress in the TPY-4 radar fielding surely reflect Lockheed’s proven dominance in the military radar market.\n\nThis might encourage investors to add LMT stock to their portfolio. However, before making any hasty decision, let’s delve into the company’s year-to-date performance, growth prospects as well as risks (if any).\n\nLMT Stock Outperforms Industry, Sector & S&P500\n\nShares of Lockheed have surged 24.8% in the year-to-date period, outperforming the Zacks aerospace-defense industry’s decline of 5.3%. It has also outpaced the broader Zacks Aerospace sector’s rise of 1.6% as well as the S&P 500’s gain of 18% in the same time frame.\n\nA similar trend can be seen in the performance of other industry players, Embraer ERJ, Leidos Holdings LDOS and RTX Corp. RTX, which have witnessed a surge of 88.6%, 42.1% and 40.2%, respectively, year to date.\n\nLMT’s YTD Performance Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nWhat is Driving LMT Stock Up?\n\nSolid order flow for its varied products — ranging from agile fighter aircraft and helicopters to littoral combat ships and space products — from Pentagon as well as the U.S. allies has always played the role of a key catalyst in Lockheed’s growth story. Such order flows culminate into a strong backlog count for the company, thereby bolstering its revenue prospects and instilling investors’ confidence in the stock. Notably, Lockheed’s total backlog came in at a record $158.34 billion as of June 30, 2024.\n\nAn increasing defense budget, adopted by the U.S. administration, remains another major growth driver for defense contractors like Lockheed. Notably, the fiscal 2025 U.S. defense budget, which includes funding of $850 billion for the U.S. Department of Defense, reflects an increase of 1% over the fiscal 2024 enacted funding amount.  It constitutes continuous funding support for many of Lockheed’s significant programs.\n\nThe company’s stable financial position must have also been attracting investors. Notably, Lockheed’s cash and cash equivalents at the end of the second quarter of 2024 totaled $2.52 billion, while its current debt was $0.14 billion.  So, it would be safe to conclude that the stock holds a strong solvency position, at least in the near term.\n\nStory continues\n\nHeadwinds to Keep an Eye On\n\nDespite being a prominent defense contractor, Lockheed faces some notable industry challenges. One such challenge is the shortage of skilled labor, which, along with an aging workforce, has become a major cause of concern for aerospace manufacturers like LMT. As aircraft manufacturers have started to ramp up their production rates, labor shortages might affect aerospace stocks like Lockheed.\n\nMoreover, the company has a contract with the Canadian Government for the Canadian Maritime Helicopter Program (“CMHP”) under its Rotary and Missions Systems business segment to provide for the design, development and production of CH-148 aircraft, and offer logistical support to the fleet. This program experienced performance issues, including delays in the final aircraft deliveries from the original contract requirement.\n\nThe Royal Canadian Air Force’s flight hours have been significantly less than originally anticipated. This has affected program revenues and the recovery of Lockheed’s costs under this program. As of June 30, 2024, the company’s cumulative losses in relation to CMHP were approximately $100 million.\n\nWhat Lies Ahead for LMT Stock?\n\nDespite the challenges mentioned above, one may remain optimistic about the company’s near-term growth prospects. A quick sneak peek at its earnings and sales estimates reflects the same.\n\nLMT Stock’s Upbeat Estimates\n\nThe Zacks Consensus Estimate for LMT’s 2024 and 2025 sales reflects an improvement of 5.3% and 4%, respectively, year over year.\n\nThe Zacks Consensus Estimate for 2024 and 2025 earnings per share reflects an upward movement of 1% and 1.7%, respectively, over the past 60 days. The upward revision in earnings estimates indicates analysts’ increasing confidence in the stock. Zacks Investment Research\n\nImage Source: Zacks Investment Research Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLMT Stock Trading at a Premium\n\nIn terms of valuation, LMT’s forward 12-month price-to-earnings (P/E) is 20.06X, a premium to its peer group’s average of 19.23X. This suggests that investors will be paying a higher price than the company's expected earnings growth compared to that of its peers. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nShould You Buy LMT Now?\n\nTo summarize, investors interested in Lockheed should wait for a better entry point, considering its premium valuation. Also, LMT currently has a VGM Score of C, which is not a very favorable indicator of strong performance.\n\nHowever, those who already own this Zacks Rank #3 (Hold) stock may stay invested as the company's financial stability, upbeat estimates and solid backlog count offer solid future revenue prospects.\n\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nEmbraer-Empresa Brasileira de Aeronautica (ERJ) : Free Stock Analysis Report\n\nLeidos Holdings, Inc. (LDOS) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-finishes-risk-reduction-test-131300380.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.027,
            "neu": 0.827,
            "pos": 0.146
        }
    }
]