[
    {
        "date": "2024-05-20T23:48:58+00:00",
        "title": "Lockheed Martin's (NYSE:LMT) investors will be pleased with their notable 58% return over the last five years",
        "content": "If you buy and hold a stock for many years, you'd hope to be making a profit. Better yet, you'd like to see the share price move up more than the market average. But Lockheed Martin Corporation (NYSE:LMT) has fallen short of that second goal, with a share price rise of 38% over five years, which is below the market return. The last year hasn't been great either, with the stock up just 2.7%.\n\nSo let's assess the underlying fundamentals over the last 5 years and see if they've moved in lock-step with shareholder returns.\n\nView our latest analysis for Lockheed Martin\n\nThere is no denying that markets are sometimes efficient, but prices do not always reflect underlying business performance. By comparing earnings per share (EPS) and share price changes over time, we can get a feel for how investor attitudes to a company have morphed over time.\n\nOver half a decade, Lockheed Martin managed to grow its earnings per share at 7.5% a year. This EPS growth is reasonably close to the 7% average annual increase in the share price. Therefore one could conclude that sentiment towards the shares hasn't morphed very much. Indeed, it would appear the share price is reacting to the EPS.\n\nYou can see how EPS has changed over time in the image below (click on the chart to see the exact values). earnings-per-share-growth\n\nWe like that insiders have been buying shares in the last twelve months. Having said that, most people consider earnings and revenue growth trends to be a more meaningful guide to the business. Before buying or selling a stock, we always recommend a close examination of historic growth trends, available here..\n\nWhat About Dividends?\n\nAs well as measuring the share price return, investors should also consider the total shareholder return (TSR). The TSR is a return calculation that accounts for the value of cash dividends (assuming that any dividend received was reinvested) and the calculated value of any discounted capital raisings and spin-offs. Arguably, the TSR gives a more comprehensive picture of the return generated by a stock. As it happens, Lockheed Martin's TSR for the last 5 years was 58%, which exceeds the share price return mentioned earlier. The dividends paid by the company have thusly boosted the total shareholder return.\n\nA Different Perspective\n\nLockheed Martin provided a TSR of 5.6% over the last twelve months. Unfortunately this falls short of the market return. On the bright side, the longer term returns (running at about 10% a year, over half a decade) look better. It's quite possible the business continues to execute with prowess, even as the share price gains are slowing. While it is well worth considering the different impacts that market conditions can have on the share price, there are other factors that are even more important. Take risks, for example - Lockheed Martin has  2 warning signs  we think you should be aware of.\n\nStory continues\n\nLockheed Martin is not the only stock that insiders are buying. For those who like to find lesser know companies this freelist of growing companies with recent insider purchasing, could be just the ticket.\n\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martins-nyse-lmt-investors-234858514.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.031,
            "neu": 0.813,
            "pos": 0.156
        }
    },
    {
        "date": "2024-05-20T13:44:00+00:00",
        "title": "Bell-Boeing Wins a Defense Contract to Supply V-22 Jets' Parts",
        "content": "Bell-Boeing, a joint venture between The Boeing Company BA and Bell Helicopter, a unit of Textron Inc. TXT, recently secured a contract involving the V-22 Osprey aircraft. The award has been provided by the Defense Logistics Agency Aviation, Philadelphia, PA.\n\nDetails of the Deal\n\nValued at $13.6 million, the contract is estimated to be completed by May 10, 2025. Per the terms of the deal, Bell-Boeing will provide spare consumable and depot-level repairable parts for the V-22 aircraft.\n\nThe work related to this deal will be carried out in Texas and Pennsylvania.\n\nGrowing Jet Demand & V-22 Jets\n\nA rapid increase in terror attacks across the globe has compelled nations to strengthen their arsenal and bump up their defense budget.  The United States is the largest exporter of defense equipment across the world and therefore, the country witnesses a steady flow of contracts for its combat-proven weaponry from both the Pentagon and its foreign allies. With military jets and helicopters constituting a major portion of a nation’s armaments, prominent jet manufacturers in the United States, like Textron and Boeing, frequently witness notable contract wins for combat-proven aircraft.\n\nTo this end, it is imperative to mention that Bell-Boeing’s primary product, V-22 Osprey, is a family of multi-mission, tiltrotor military aircraft with both vertical as well as short takeoff and landing capabilities. V-22 Osprey is designed to combine the functionality of a conventional helicopter with the long-range, high-speed cruise performance of a turboprop aircraft.\n\nConsidering these features of the aforementioned family of tiltrotors and the growing demand for military aircraft, V-22 enjoys solid demand in the military jet market across the globe. The latest contract win is an example of that.\n\nGrowth Prospects\n\nAmid geopolitical tensions like the Russian invasion of Ukraine and the ongoing conflict in the Middle East, nations are rapidly augmenting their defense spending to procure more fighter jets. This, in turn, has been bolstering the prospects of the military aviation industry.\r\n\r\nPer a report by the Mordor Intelligence firm, the global military aviation market is estimated to witness a CAGR of 5.23% in the 2024-2030 period. This will surely benefit major U.S. combat aircraft manufacturers like Textron, Boeing, Lockheed Martin LMT and Northrop Grumman NOC, with North America dominating this market space.\n\nLockheed is one of the pioneers in the combat aircraft space, with its product portfolio constituting some of the most advanced military aircraft like the F-35, C-130, F-16, F-22 and a few more. Of these, the F-35 is the company’s largest program.\n\nStory continues\n\nLMT boasts a long-term earnings growth rate of 4.2%. The Zacks Consensus Estimate for LMT’s 2024 sales indicates an improvement of 3.2% from the 2023 reported figure.\n\nOn the other hand, Northrop is a renowned manufacturer of autonomous and manned aircraft like MQ-4C Triton and Global Hawk. These jets are used for battle management, strike and intelligence, surveillance and reconnaissance.\n\nNorthrop boasts a long-term earnings growth rate of 9.9%. The Zacks Consensus Estimate for NOC’s 2024 sales indicates an improvement of 4.6% from the 2023 reported figure.\n\nPrice Movement & Zacks Rank\n\nTextron’s shares have risen 37.7% in the past year against the industry’s 8% decline. Boeing’s shares have lost 10.2% in the past year. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nTextron currently carries a Zacks Rank #3 (Hold), while Boeing carries a Zacks Rank #4 (Sell).\n\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/bell-boeing-wins-defense-contract-134400394.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0LF0.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.044,
            "neu": 0.788,
            "pos": 0.169
        }
    },
    {
        "date": "2024-05-20T13:30:00+00:00",
        "title": "General Dynamics (GD) Wins a $185M Deal to Provide Cybersecurity",
        "content": "General Dynamics Corp.’s GD business unit, General Dynamics Information Technology (“GDIT”), recently secured a $185 million task order to provide cybersecurity services to the U.S. Air Force Civil Engineer Center. The award has been offered by the 772nd Enterprise Sourcing Squadron at Tyndall Air Force Base, FL.\n\nAbout the Contract\n\nPer the terms of the contract, GDIT will conduct research and create new techniques to reduce cybersecurity threats to the Air Force's industrial control systems. These systems include building automation, life safety, utility monitoring and airport control.\r\n\r\nGeneral Dynamics will use its cybersecurity and zero trust capabilities to carry out this operation at 188 installations worldwide.\n\nGrowth Prospects\n\nAmid growing geopolitical tensions worldwide, cyber security threats have been posing as a major risk factor to a nation’s security. As nations are rapidly expanding their investment in defense cybersecurity, the availability of safe and reliable networks to connect the operational base and fighters on the air has emerged as the need of the hour.\r\n\r\nConsequently, as defense sectors across the board are focusing more on making their data transmission more secure, defense contractors like General Dynamics are witnessing solid contract flows involving the strengthening of cybersecurity capabilities. The latest contract win is a bright example of that.\r\n\r\nThe Defense Cybersecurity market’s prospects remain robust, driven by the continuously evolving and rising sophisticated nature of cyber-attacks. To this end, per a report by Mordor Intelligence, the Defense Cybersecurity market is projected to witness a CAGR of 12.82% during the 2024-2029 period.\r\n\r\nSuch a solid market prediction offers strong growth opportunities to General Dynamics, with its GDIT unit capable of delivering dynamic and proactive cybersecurity services as threat actors adopt new tactics and techniques. Its Everest Zero Trust solution has been designed to accelerate mission objectives by providing dynamic access to only the data and services where and when people need them, thereby securely sharing information with mission partners to achieve desired outcomes.\r\n\r\nMeanwhile, GD’s Eclipse Defensive Cyber solution provides a comprehensive set of strategies and technologies to provide real-time threat detection, advanced incident response and remediation, as well as automated threat mitigation. Such capabilities of GDIT should enable it to win more such contracts, like the latest one, backed by the growing Defense Cybersecurity market size, which can be expected to boost its future revenue growth.\n\nStory continues\n\nPeer Prospects\n\nApart from General Dynamics, defense contractors that are expected to enjoy the perks of the growing Defense Cybersecurity spending market are as follows:   \r\n\r\nNorthrop Grumman NOC: It offers resilient, full-spectrum cyber solutions across every domain for a decisive advantage, giving cyber warfighters the defensive and offensive edge they need against evolving threats. Its products include Cyberdefense Platform for Weapon Systems, which enables cutting-edge AI/ML techniques to identify threats in mission and weapon systems that are currently undetectable by traditional network-based IDS solutions.\r\n\r\nNorthrop has a long-term (three to five years) earnings growth rate of 9.9%. The Zacks Consensus Estimate for NOC’s 2024 sales suggests growth of 4.6% from the prior-year reported figure.\r\n\r\nLockheed Martin LMT: It remains a leading provider of defense technology in comprehensive cyber systems for its defense and global security customers. LMT’s MR2 platform is helping the U.S. military digitally transform with real-time reports on employee training and readiness.\r\n\r\nLockheed has a long-term earnings growth rate of 4.2%. The Zacks Consensus Estimate for LMT’s 2024 sales implies growth of 3.2% from the prior-year reported figure.\r\n\r\nBAE Systems BAESY: The company designs and builds a portfolio of cutting-edge cybersecurity technologies. Its product portfolio includes one-way transfer devices, guards and Field Programmable Gate Arrays like the Data Diode Solution, which is a one-way transfer device enabling secure unidirectional transfer of data between networks.\r\n\r\nBAESY has a long-term earnings growth rate of 12.2%. The Zacks Consensus Estimate for BAESY’s 2024 sales calls for growth of 34.1% from the prior-year reported figure.\n\nPrice Movement\n\nIn the past three months, shares of General Dynamics have risen 11.2% against the industry’s decline of 0.2%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nGeneral Dynamics currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nBae Systems PLC (BAESY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/general-dynamics-gd-wins-185m-133000845.html",
        "symbols": [
            "0IUC.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.LSE",
            "BAESF.US",
            "BAESY.US",
            "BSP.BE",
            "BSP.DU",
            "BSP.F",
            "BSP.STU",
            "BSP.XETRA",
            "BSPA.F",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.039,
            "neu": 0.715,
            "pos": 0.246
        }
    },
    {
        "date": "2024-05-20T07:13:00+00:00",
        "title": "How Northrop Grumman, Lockheed Martin, and Boeing All Lost a $30 Billion Air Force Contract",
        "content": "The United States Air Force needs a few good drones. It just doesn't need Boeing(NYSE: BA), Lockheed Martin(NYSE: LMT), or Northrop Grumman(NYSE: NOC) to build them. That's the surprising upshot of a new contract announcement out of the Pentagon last month, in which the government chose none of its three leading publicly traded defense contractors to do the work -- and picked privately held General Atomics and Anduril instead.\n\nFor Boeing, Lockheed, and Northrop, the damage from this decision is substantial: At least $30 billion in lost potential revenues.\n\nEvery fighter pilot needs a good drone sidekick -- or even better, two sidekicks\n\nThe Air Force calls the contract in question its Collaborative Combat Aircraft (CCA) program, in which the aircraft that will be \"collaborating\" are piloted fighter jets, and their armed military drone sidekicks. All five of the named companies submitted drone designs to the Air Force for consideration. These five designs have now been winnowed down to two -- General Atomics' \"Gambit\" drone and Anduril's \"Fury\" -- and those two companies will now proceed to build prototypes for further evaluation.\n\nUSAF intends to then pick at least one of these prototypes to order sometime in fiscal year 2026, meaning a decision could happen as early as next year. (The Pentagon's fiscal year begins on October 1, 2025.)\n\nHow big is the CCA contract?\n\nWhoever wins that contest stands to inherit a real windfall of cash. As Breaking Defense reported in March, the Air Force wants to equip each of its 300 F-35 stealth fighter jets, plus a further 200 Next Generation Air Dominance fighters (a plane yet to be built) with two CCA drones each -- so 1,000 drones in all.\n\nWith an estimated $30 million production cost per drone, that makes CCA potentially a $30 billion program.\n\nAnd that's just to start with. BD notes that 1,000 drones is just the Air Force's initial requirement through \"the end of the decade.\" As CCAs are damaged or obsolesced, they will need to be replaced. Additionally, the U.S. currently possesses more than 450 F-35s, and intends to eventually fly nearly 2,500 of them.\n\nOver time, the CCA program could theoretically grow five times in size -- and five times in value, to as much as $180 billion -- just by equipping pairing its F-35s with two drone wingmen apiece.\n\nWhat it means for defense contractors\n\nIt's hard to overstate how bad this news looks for Boeing, Lockheed, and Northrop. \"$180 billion\" -- that's a number roughly equal to the entire annual revenue of all three of these giant defense contractors, combined, according to data from S&P Global Market Intelligence. Admittedly, with the money spread out over six years, from now through 2030, the annual lost revenue is smaller, but it's still a pretty big number.\n\nStory continues\n\nBut all is not yet lost.\n\nGeneral Atomics and/or Anduril will supply CCA's initial requirement for 1,000 military drones. But as the Air Force noted, \"the companies not selected to build these production representative CCA vehicles, and execute the flight test program, will continue to be part of the broader industry partner vendor pool consisting of more than 20 companies to compete for future efforts, including future production contracts.\"\n\nSo it's entirely possible that Boeing, Lockheed, and Northrop could still find work as subcontractors for whoever wins the first production contract(s). It's also possible that as the CCA program grows in size and expands beyond its initial requirements, the contract will be recompeted, and the publicly traded defense stocks will get a second bite at the apple.\n\nIn the meantime, however, momentum clearly favors the non-publicly traded defense contractors, General Atomics and Anduril. They've won the first round, and have pole position heading into the next round. At this point, investors' best bet on benefiting from the Pentagon's biggest-ever military drone program may be to hope for an Anduril IPO.\n\nShould you invest $1,000 in Northrop Grumman right now?\n\nBefore you buy stock in Northrop Grumman, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Northrop Grumman wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $566,624!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of May 13, 2024\n\nRich Smith has no position in any of the stocks mentioned. The Motley Fool recommends Lockheed Martin. The Motley Fool has a disclosure policy.\n\nHow Northrop Grumman, Lockheed Martin, and Boeing All Lost a $30 Billion Air Force Contract was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/northrop-grumman-lockheed-martin-boeing-071300775.html",
        "symbols": [
            "BA.US",
            "LMT.US",
            "NOC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.991,
            "neg": 0.043,
            "neu": 0.862,
            "pos": 0.095
        }
    }
]