[
    {
        "date": "2024-10-08T22:00:23+00:00",
        "title": "Lockheed Martin (LMT) Gains But Lags Market: What You Should Know",
        "content": "In the latest trading session, Lockheed Martin (LMT) closed at $608.05, marking a +0.41% move from the previous day. The stock fell short of the S&P 500, which registered a gain of 0.97% for the day. Meanwhile, the Dow experienced a rise of 0.3%, and the technology-dominated Nasdaq saw an increase of 1.45%.\n\nThe the stock of aerospace and defense company has risen by 5.02% in the past month, leading the Aerospace sector's gain of 2.48% and undershooting the S&P 500's gain of 5.41%.\n\nThe investment community will be closely monitoring the performance of Lockheed Martin in its forthcoming earnings report. The company is scheduled to release its earnings on October 22, 2024. It is anticipated that the company will report an EPS of $6.38, marking a 5.76% fall compared to the same quarter of the previous year. Simultaneously, our latest consensus estimate expects the revenue to be $17.37 billion, showing a 2.94% escalation compared to the year-ago quarter.\n\nRegarding the entire year, the Zacks Consensus Estimates forecast earnings of $26.51 per share and revenue of $71.14 billion, indicating changes of -4.71% and +5.28%, respectively, compared to the previous year.\n\nInvestors should also note any recent changes to analyst estimates for Lockheed Martin. Recent revisions tend to reflect the latest near-term business trends. Consequently, upward revisions in estimates express analysts' positivity towards the company's business operations and its ability to generate profits.\n\nOur research shows that these estimate changes are directly correlated with near-term stock prices. To exploit this, we've formed the Zacks Rank, a quantitative model that includes these estimate changes and presents a viable rating system.\n\nThe Zacks Rank system, which varies between #1 (Strong Buy) and #5 (Strong Sell), carries an impressive track record of exceeding expectations, confirmed by external audits, with stocks at #1 delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 0.13% higher. Right now, Lockheed Martin possesses a Zacks Rank of #3 (Hold).\n\nWith respect to valuation, Lockheed Martin is currently being traded at a Forward P/E ratio of 22.84. This valuation marks a premium compared to its industry's average Forward P/E of 21.24.\n\nWe can also see that LMT currently has a PEG ratio of 4.87. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The Aerospace - Defense was holding an average PEG ratio of 2.04 at yesterday's closing price.\n\nStory continues\n\nThe Aerospace - Defense industry is part of the Aerospace sector. With its current Zacks Industry Rank of 44, this industry ranks in the top 18% of all industries, numbering over 250.\n\nThe Zacks Industry Rank is ordered from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nBe sure to follow all of these stock-moving metrics, and many more, on Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-gains-lags-220023345.html",
        "symbols": [
            "0R3E.LSE",
            "GSPC.INDX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.009,
            "neu": 0.886,
            "pos": 0.104
        }
    },
    {
        "date": "2024-10-08T16:10:15+00:00",
        "title": "Why Lockheed (LMT) Could Beat Earnings Estimates Again",
        "content": "Looking for a stock that has been consistently beating earnings estimates and might be well positioned to keep the streak alive in its next quarterly report? Lockheed Martin (LMT), which belongs to the Zacks Aerospace - Defense industry, could be a great candidate to consider.\n\nThis aerospace and defense company has an established record of topping earnings estimates, especially when looking at the previous two reports. The company boasts an average surprise for the past two quarters of 9.69%.\n\nFor the last reported quarter, Lockheed came out with earnings of $7.11 per share versus the Zacks Consensus Estimate of $6.45 per share, representing a surprise of 10.23%. For the previous quarter, the company was expected to post earnings of $5.80 per share and it actually produced earnings of $6.33 per share, delivering a surprise of 9.14%.\n\nFor Lockheed, estimates have been trending higher, thanks in part to this earnings surprise history. And when you look at the stock's positive Zacks Earnings ESP (Expected Surprise Prediction), it's a great indicator of a future earnings beat, especially when combined with its solid Zacks Rank.\n\nOur research shows that stocks with the combination of a positive Earnings ESP and a Zacks Rank #3 (Hold) or better produce a positive surprise nearly 70% of the time. In other words, if you have 10 stocks with this combination, the number of stocks that beat the consensus estimate could be as high as seven.\n\nThe Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a version of the Zacks Consensus whose definition is related to change. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.\n\nLockheed has an Earnings ESP of +5% at the moment, suggesting that analysts have grown bullish on its near-term earnings potential. When you combine this positive Earnings ESP with the stock's Zacks Rank #3 (Hold), it shows that another beat is possibly around the corner. The company's next earnings report is expected to be released on October 22, 2024.\n\nInvestors should note, however, that a negative Earnings ESP reading is not indicative of an earnings miss, but a negative value does reduce the predictive power of this metric.\n\nMany companies end up beating the consensus EPS estimate, but that may not be the sole basis for their stocks moving higher. On the other hand, some stocks may hold their ground even if they end up missing the consensus estimate.\n\nStory continues\n\nBecause of this, it's really important to check a company's Earnings ESP ahead of its quarterly release to increase the odds of success. Make sure to utilize our Earnings ESP Filter to uncover the best stocks to buy or sell before they've reported.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/why-lockheed-lmt-could-beat-161015756.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.031,
            "neu": 0.834,
            "pos": 0.135
        }
    },
    {
        "date": "2024-10-08T11:45:00+00:00",
        "title": "4 Stocks That Recently Announced Dividend Hikes",
        "content": "The domestic macroeconomic scenario in the United States is favorable after the Federal Reserve’s interest-rate easing, declining inflation numbers, and resilient labor market. If future incoming data remains favorable the Fed plans to gradually bring back the key interest rates to the 2.75-3% range by 2026.  However, investors are more worried about the Middle East conflict. The growing war situation hasdisrupted the global supply chain and pushed oil prices higher.\n\nAmid such volatile market conditions, investors who wish to diversify their portfolio can invest in dividend-paying stocks. Companies that pay out dividends consistently indicate a healthy business model. Stocks that have raised dividends recently exhibit a sound financial structure and can counter market upheavals. Some of the prominent names are RPM International RPM, Lockheed Martin LMT, Bank OZK OZK and American Financial Group AFG.\n\nMiddle East Tensions Drive Crude Oil Prices\n\nCrude oil prices surged due to rising tensions in the Middle East over the past week. The growing concerns on how Israel would respond to Iran's missile strikes have led to an increase, in crude oil prices. Higher energy prices for an extended period raise the possibility of an increase in petrol, gas, and electricity bills, pushing up the inflation rate.\n\nU.S. Predental Election Ahead\n\nAll eyes are on the upcoming U.S. Presidential Election which is scheduled for next months. Amid the tussle between Republicans and Democrats, stock markets could enter one of its most volatile periods over the years and witness a variety of policy changes.\n\nDividend Stocks to Watch: RPM, LMT, OZK, AFG\n\nGiven the high volatility in the market, stocks that tend to reward investors with a high dividend payout outperform non-dividend-paying stocks in a highly volatile market.\n\nRPM International\n\nRPM International manufactures and markets high-performance coatings, sealants and specialty chemicals, primarily for maintenance and improvement applications. This Medina, OH-based company currently carries a Zacks Rank #3 (Hold). You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\n\nOn Oct. 3, RPM declared that its shareholders would receive a dividend of 51 cents a share on Oct. 31, 2024. RPM has a dividend yield of 1.4%.\n\nOver the past five years, RPM has increased its dividend six times, and its payout ratio presently sits at 36% of earnings. Check RPM International’s dividend history here.\n\nRPM International Inc. Dividend Yield (TTM) RPM International Inc. Dividend Yield (TTM)\n\nRPM International Inc. dividend-yield-ttm | RPM International Inc. Quote\n\nStory continues\n\nLockheed Martin\n\nLockheed Martin is headquartered in Bethesda, MD. This Zacks Rank #3 company is the largest defense contractor in the world.\n\nOn Oct. 2, LMT declared that its shareholders would receive a dividend of $3.30 a share on Dec. 27, 2024. LMT has a dividend yield of 2.1%.\n\nIn the past five years, LMT has increased its dividend six times. Its payout ratio at present sits at 45% of earnings. Check Lockheed Martin’s dividend history here.\n\nLockheed Martin Corporation Dividend Yield (TTM) Lockheed Martin Corporation Dividend Yield (TTM)\n\nLockheed Martin Corporation dividend-yield-ttm | Lockheed Martin Corporation Quote\n\nBank OZK\n\nBank OZK is a bank holding company that offers a wide range of retail and commercial banking services to businesses, individuals, and non-profit and governmental entities. The Zacks Rank #3 company is headquartered in Little Rock, AR.\n\nOn Oct. 1, OZK announced that its shareholders would receive a dividend of 41 cents a share on Oct 18, 2024. OZK has a dividend yield of 3.8%.\n\nOver the past five years, OZK has increased its dividend 21 times. Its payout ratio now sits at 26% of earnings. Check Bank OZK's dividend history here.\n\nBank OZK Dividend Yield (TTM) Bank OZK Dividend Yield (TTM)\n\nBank OZK dividend-yield-ttm | Bank OZK Quote\n\nAmerican Financial Group\n\nAmerican Financial Group engages primarily in property and casualty insurance, with focus on specialized commercial products for businesses. This Cincinnati, OH-based company currently carries a Zacks Rank #3.\n\nOn Oct. 1, AFG declared that its shareholders would receive a dividend of 80 cents a share on Oct. 25, 2024. AFG has a dividend yield of 2.1%.\n\nOver the past five years, AFG has increased its dividend 16 times, and its payout ratio presently sits at 27% of earnings. Check American Financial Group’s dividend history here.\n\nAmerican Financial Group, Inc. Dividend Yield (TTM) American Financial Group, Inc. Dividend Yield (TTM)\n\nAmerican Financial Group, Inc. dividend-yield-ttm | American Financial Group, Inc. Quote\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nAmerican Financial Group, Inc. (AFG) : Free Stock Analysis Report\n\nRPM International Inc. (RPM) : Free Stock Analysis Report\n\nBank OZK (OZK) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/4-stocks-recently-announced-dividend-114500434.html",
        "symbols": [
            "0R3E.LSE",
            "AFG.US",
            "BO8.BE",
            "BO8.F",
            "BO8.STU",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "OZK.US",
            "QFI.BE",
            "QFI.F",
            "RP8.BE",
            "RP8.F",
            "RP8.STU",
            "RPM.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.987,
            "neg": 0.039,
            "neu": 0.869,
            "pos": 0.091
        }
    },
    {
        "date": "2024-10-08T09:36:00+00:00",
        "title": "Lockheed Martin Secures $1.2B Contract for Trident Fleet Support",
        "content": "Lockheed Martin Corporation LMT has secured a $1.17 billion contract to provide crucial fleet support for the Trident II Strategic Weapon System. Per the terms of the deal, Lockheed Martin will offer shipboard integration as well as support the development of navigation subsystems for the Trident II missile.\r\n\r\nMost of the work under this contract will take place in Mitchel Field, NY. The award has been provided by the Strategic Systems Programs, Washington, DC. The deal is expected to be completed by Sept. 29, 2031.\n\nWhat’s Favoring LMT?\n\nWith countries worldwide enhancing their defense capabilities, spending on advanced military arms and ammunition has been rapidly increasing. This also includes growing investments in missiles and missile systems, which are crucial for warfare missions. Lockheed Martin, as a prominent manufacturer of missiles and missile defense systems, has thus been witnessing a steady flow of orders for its combat-proven missiles from the Pentagon and other U.S. allies. The latest contract win is an example of that.\r\n \r\nLMT's Trident II D5 is one of the most advanced ballistic missiles available. It's a three-stage missile that uses solid fuel and is guided by an internal system. The missile can travel up to 4,000 nautical miles and can carry multiple warheads that can hit different targets independently.\r\n\r\nSuch notable features of the aforementioned missiles of Lockheed Martin are likely to have been boosting their demand, which is further evident from the latest contract win.\n\nLMT’s Growth Prospects\n\nRising military conflicts, terrorism and border disputes have led nations to increase their focus on national security, particularly on missile and missile defense systems, backed by the rapid development of advanced missile technologies over the last decade.\r\n \r\nThis is likely to have prompted Mordor Intelligence to forecast a compound annual growth rate of 5% for the global missiles and missile defense systems market during the 2024-2029 time period.\r\n\r\nThis should benefit Lockheed Martin, with its Missile and Fire Control unit being a recognized developer of high-performance missiles. The unit pursues business in more than 50 countries worldwide. Some of its major programs are the Patriot Advanced Capability-3 and Terminal High Altitude Area Defense air and missile defense programs as well. Its prominent missiles include the Precision Strike Missile, Joint Air-to-Surface Standoff Missile and Long Range AntiShip Missile.\n\nProspects of LMT’s Peers\n\nOther defense companies that are likely to enjoy the perks of the expanding global missiles and missile system market have been discussed below.\r\n\r\nNorthrop Grumman Corporation NOC: Northrop Grumman provides high-speed, long-range strike weapons like the AARGM-ER, which is a supersonic, air-launched tactical missile system. It also develops and builds advanced missile defense technology, ranging from command systems to directed energy weapons, advanced munitions and powerful sensors.\r\n\r\nThe company’s long-term (three to five years) earnings growth rate is 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales indicates year-over-year growth of 5.4%.\r\n\r\nRTX Corporation RTX: It is well known for its missile defense systems like the Patriot and SM-6, which are in high demand globally. RTX also provides advanced sensors and interceptors to identify, track and defeat threats as part of a layered missile defense.\r\n \r\nThe company’s long-term earnings growth rate is 10.4%. The Zacks Consensus Estimate for RTX’s 2024 sales indicates year-over-year growth of 7%.\r\n\r\nThe Boeing Company BA: It manufactures various missile defense systems, including the Ground-based Midcourse Defense, Aegis Ballistic Missile Defense and Avenger. Boeing-built and supported air and missile defense systems have been protecting its customers for nearly 25 years against threats ranging from intercontinental ballistic missiles to hostile aircraft.\r\n\r\nThe company has a long-term earnings growth rate of 21.3%. The Zacks Consensus Estimate for BA’s 2025 sales indicates year-over-year growth of 22.6%.\n\nStory continues\n\nLMT Stock’s Price Movement\n\nShares of LMT have gained 32.3% in the past three months compared with the industry’s 10.2% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLMT’s Zacks Rank\n\nLMT currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-secures-1-2b-093600089.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.047,
            "neu": 0.77,
            "pos": 0.183
        }
    }
]