[
    {
        "date": "2024-07-19T17:30:00+00:00",
        "title": "3 Defense Stocks to Buy if Biden Wins in November",
        "content": "It’s no secret that since the start of the Biden administration 2020, America’s involvement in foreign wars has increased. Whether through funding or covert operations, America is once more active on the global stage as a supplier and supporter of foreign wars. Whatever your perspectives on this might be, it does lend itself to a lucrative military-industrial complex. As such, investors may want to consider which defense stocks to buy in the event of four more years of the Biden administration.\n\nThe companies selected for this discussion are those actively producing weapons and materials for the current major wars in Ukraine and Israel. They are also companies that have actively funded and supported the Biden campaign, and are likely to receive preferential treatment in the event of his reelection. Thus, these are three defense stocks to buy should the Democrats win reelection in the presidency, and continue their foreign policy of supporting long-term wars.\n\nBAE Systems (BAESY) BAE Systems' (BAESY) M777 155mm Ultra light towed howitzer at Eurosatory 2008 military exhibition\n\nSource: Flying Camera / Shutterstock.com\n\nShould the war in Ukraine continue to drag on, BAE Systems (OTCMKTS:BAESY) is likely one of the biggest beneficiaries due to the multitude of technologies it supplies to the Ukrainian army through Western aid packages. Two prominent examples are the M2 Bradley infantry fighting vehicle and the M777 howitzer, both of which have been considered instrumental tools for the Ukrainians in their war against Russia.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nIn fact, since the start of the war in February 2022, BAE Systems has seen its stock soar by 49%. Thanks to the demand generated by an active war for its artillery systems and armored vehicles, BAE currently retains the investor favor that has led to its successful run in the market over the past two years. This would make it one of the defense stocks to buy in the event of a second Biden administration, as it would likely prolong the war.\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) Space Systems sign in Sunnyvale, California.\n\nSource: Ken Wolter / Shutterstock.com\n\nAs the producer of one of the most famous weapons of the current Russo-Ukrainian war, Lockheed Martin (NYSE:LMT) stands to gain a lot more revenue generation should Biden win a second term and prolong the war in Ukraine. That’s because LMT is the primary producer of the Javelin antitank missile system. With this weapon being considered so instrumental to the war in Ukraine, it’s practically guaranteed that LMT will fulfill its current contract to supply even more missiles and launchers to the Ukrainian army.\n\nBeyond this weapon system, Lockheed Martin also stands to gain from Biden’s strong willingness to supply NATO with the F-35, and the necessary components to keep them running. This multi-million dollar aircraft is one of Lockheed Martin’s biggest revenue drivers of the 21st century. Thus, should Biden win the coming presidential election, LMT remains as one of the best defense stocks to buy.\n\nStory continues\n\nNorthrop Grumman (NOC) Northrop Grumman (NOC) logo on a corporate building\n\nSource: Kristi Blokhin / Shutterstock.com\n\nOne of the top five defense contractors in the world Northrop Grumman (NYSE:NOC) currently has a critical contract with its new B-21 raider bomber which is likely to maintain its funding status, so long as the current government stays in power. Thus, a Biden victory would likely result in a more willing spending environment that would continue to raise the national debt in order to cover many of Northrop Grumman’s major programs.\n\nMoreover, the company recently became the first U.S. weapons manufacturer to strike a deal with the Ukrainian government to produce medium-caliber ammunition for things like autocannons and Gatling guns to aid Ukraine in its war effort.\n\nIf Biden wins the presidency again, this deal will likely be even more lucrative for the company as the Ukrainian government and surrounding nations are likely to become a long-time customer. This, paired with NOC’s successes in the space sector through its International Space Station refueling program and reconnaissance satellites, makes it one of the best defense stocks to buy in the case of an interventionist executive.\n\nOn the date of publication, Viktor Zarev did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or\r\nindirectly) any positions in the securities mentioned in this article.\n\nViktor Zarev is a scientist, researcher, and writer specializing in explaining the complex world of technology stocks through dedication to accuracy and understanding.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post 3 Defense Stocks to Buy if Biden Wins in November appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-defense-stocks-buy-biden-173000492.html",
        "symbols": [
            "0K92.LSE",
            "BA.LSE",
            "BAESF.US",
            "BAESY.US",
            "BSP.BE",
            "BSP.DU",
            "BSP.F",
            "BSP.STU",
            "BSP.XETRA",
            "BSPA.F",
            "LMT.US",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.964,
            "neg": 0.081,
            "neu": 0.805,
            "pos": 0.114
        }
    },
    {
        "date": "2024-07-19T14:43:48+00:00",
        "title": "Stocks to watch next week: Tesla, Microsoft, Alphabet and Amazon",
        "content": "As the second-quarter earnings season approaches, key companies worldwide will provide insights into sector performance. Investors will be particularly focused on updates from some of the 'Magnificent Seven', which will reveal whether the artificial intelligence (AI) trend continues.\n\nThe Mag 7 stocks have endured a challenging period, with the S&P 500’s (^GSPC) major players—Nvidia (NVDA), Microsoft (MSFT), Google (GOOGL), Tesla (TSLA), Apple (AAPL), Meta Platforms (META), and AmazonAJa (AMZN)—experiencing a dramatic decline in market capitalisation. Over recent sessions, these tech giants have collectively shed $1.128tn in market value, marking the largest such loss since May 2022.\n\nWill the upcoming earnings reports show strong performance or a lack of momentum? Here’s what to watch for:\n\nTesla (TSLA) — Reports second-quarter results on Tuesday 23 July\n\nTesla shares have experienced a dramatic surge this month, with the company's stock price surging by 33%. This increase has propelled Tesla's market valuation by $209bn in the first eight trading days of the month alone, surpassing the combined market value of European automotive giants Mercedes-Benz, Volkswagen, and Stellantis, which stands at $198bn.\n\nThis surge cannot be attributed to Tesla’s first-quarter financial results, which revealed the lowest quarterly profits since Q2 2021, diminishing cash flow, and rising inventory levels. The second-quarter production and delivery figures, released earlier this month, indicated a 14% year-on-year decline in vehicle production and a 5% drop in unit sales, although this may have contributed to reducing some of the inventory backlog.\n\nADVERTISEMENT\n\n“Quite what inspired this romp is hard to divine, barring ongoing investor enthusiasm for companies that are perceived as AI (and autonomous driving) plays, Elon Musk’s courtroom victories at Tesla and X and ongoing hopes surrounding the Cybertruck, the supercharger network and the ride-hailing app,” Russ Mould, investment director, Danni Hewson, head of financial analysis, and Dan Coatsworth, investment analyst, all of AJ Bell, wrote.\n\nStory continues\n\nRead more: How to invest in AI as the rally continues\n\nFor the third quarter, the current consensus is sales of $25.7bn and that would signify a return to growth in the top line of some 10% year-on-year.\n\nAnalysts and investors are also paying close attention to Tesla’s revenue composition. In the first quarter of 2024, energy storage, energy generation, and other business lines contributed 19% to total revenues, up from 10% in the same period in 2022.\n\nEarnings per share (EPS) fell to $0.37 in Q1, but analysts expect a rebound to $0.62 in Q2, though this still marks a one-third decrease compared to the same period last year. The consensus EPS forecast for Q3 stands at $0.63.\n\nAJ Bell also highlighted Tesla's strong financial position, with a net cash reserve of $21.5bn. Although a few quarters of weak cash flow are not overly concerning, shareholders will be looking for improvements in this area as an indicator of higher profitability and a more streamlined balance sheet through inventory reduction.\n\nMicrosoft (MSFT) — Reports second-quarter results on Tuesday 23 July*\n\nMicrosoft Corp is set to report its fiscal fourth-quarter earnings on Tuesday, July 30, with analysts from Bank of America (BofA) forecasting potential revenue upside for the period.\n\nWall Street's consensus projects Microsoft to announce revenue of $64.2bn and earnings per share (EPS) of $2.90 for Q4. However, BofA analysts anticipate a 1% increase from their estimate of $64bn, indicating a 14% year-over-year growth, primarily driven by the robust performance of Azure, a premium mix in Office E3/E5, Copilot’s initial success, and a stabilising PC/Windows market.\n\nAzure’s growth is expected to remain balanced across sustained AI and core workloads, translating into a projected growth rate of 31.5%, slightly above the base expectation of 30.5%. The early traction of Copilot is also anticipated to bolster Office growth, maintaining its current valuation multiple.\n\nIn the more personal computing (MPC) segment, analysts foresee a $50m increase over the $15.5bn estimate, attributed to stronger-than-expected PC shipments.\n\nLooking ahead to fiscal 2025, BofA analysts predict continued double-digit revenue growth fuelled by ongoing strength in Azure and Office. However, they anticipate a 100 basis point decrease in margins due to increased capital expenditures driving higher cost of sales.\n\n“In an upside scenario, we believe the Office business could achieve 20% growth by Q1 fiscal 2026,” the analysts noted.\n\nBofA has reiterated its ‘buy’ rating for Microsoft and raised the price target to $510 from $480, citing the potential for higher Office growth in fiscal 2025. They acknowledge that the current share price reflects a considerable amount of near-term upside.\n\n\"Microsoft is set to deliver fourth quarter results at some point next week. Investors will be hoping to see another strong showing from the cloud business, Azure. Analysts are looking for top line growth of 19.5% from Azure, which looks very achievable. Back in April, management said cloud-AI demand was outstripping supply. Despite a mammoth effort to build out compute, that supply/demand imbalance is likely to help underpin Azure growth for some time yet,\" Matt Britzman, senior equity analyst at Hargreaves Lansdown, said.\n\n*Date not confirmed\n\nAlphabet (GOOG) — Reports second-quarter results on Tuesday 23 July\n\nThe parent company of Google (GOOGL), is set to announce its second-quarter earnings, with analysts predicting robust performance driven by its Android platform and continued momentum in its search and cloud businesses. The company's expanding generative AI capabilities are also anticipated to have significantly contributed to its positive results.\n\nFor Q2, the Zacks Consensus Estimate places Alphabet's revenues at $70.55bn, reflecting a 13.7% increase compared to the same quarter last year. The consensus estimate for earnings stands at $1.85 per share, marking a 28.5% rise from the previous year's reported figures. This estimate has seen a slight upward revision of 0.5% over the past week.\n\nHowever, rising litigation issues and associated expenses remain areas of concern for the tech giant.\n\nOne key risk is the US Department of Justice's so-called adtech trial, in which the government charges that Google monopolises key digital advertising technologies, collectively referred to as the adtech stack. Website publishers depend on that stack to sell ads and advertisers rely on it to buy ads.\n\n\"As Alphabet’s second quarter earnings approach, the M&A rumour mill is swirling. If reports are true and Alphabet is in talks to buy cybersecurity firm Wizz for $23bn, it would mark a major move to beef up its security offering. Wizz has successfully taken on the likes of Microsoft and Palo Alto in the cyber space, taking market share over the past couple of years. Perhaps the biggest hurdle could be a regulator that’s been a blocker for many large-scale deals – though a new team in the White House later this year could help things in that regard,\" Britzman said.\n\nRead more: How to invest in the Indian stock market\n\nBank of America Securities analyst Justin Post remains bullish on the integration of Google’s AI chatbot.\n\n“We remain positive on growing Gemini integration across [the] Google ecosystem and think [the] broader rollout of AI overviews will likely help drive higher usage, while AI integration can increase monetisation across Google,” Post said. “Moreover, with a focus on expense management, we think year-over-year margin growth in 2024 will be a bright spot and potential EPS upside driver.”\n\nPost affirmed a buy rating and $200 price target for Alphabet.\n\nBMO Capital Markets raised its their price target from $215 to $222, driven by potential gains in YouTube revenue.\n\nAmazon (AMZN) — Reports second-quarter results on Thursday 25 July*\n\nAmazon is in the spotlight with a \"positive\" near-term view, as Morgan Stanley anticipates the e-commerce giant to significantly outperform in its Q2 earnings and provide optimistic guidance for Q3.\n\nMorgan Stanley analysts project that Amazon will exceed consensus estimates for earnings before interest and taxes (EBIT) by 17% for Q2 and 10% for Q3. This optimistic forecast is driven by enhanced profitability in North America tetail and accelerating growth in Amazon Web Services (AWS).\n\n\"North America retail profitability and the accelerating growth of AWS are key factors behind our projections,\" the analysts noted.\n\nAs Amazon continues to leverage its robust retail operations and expand its cloud computing dominance, investors are looking forward to a strong financial performance in the upcoming quarters.\n\nIt is also a top pick for JPMorgan analyst Doug Anmuth both in the near and long term.\n\nHe anticipates a near-term acceleration in AWS, forecasting a 20% growth in Q4 2024. This growth is expected to be driven by easing optimisations, new workload migrations, and the ramping up of GenAI monetisation.\n\nRead more: UK to lose half a million millionaires by 2028\n\nAnmuth also projects a 190 basis point expansion in Amazon's North America operating income (OI) margin in 2024, supported by enhancements in shipping and inventory placement, increased automation, and stronger advertising revenue. Amazon's free cash flow is expected to reach $66bn in 2024 and $86bn in 2025.\n\nFor Q2, investors are looking for net sales to fall between $148bn and $150bn, with operating income ranging from $14bn to $15bn or more.\n\n\"There was also a strong showing from both the e-commerce and advertising segments over the first quarter, something investors will be keen to see continue. But markets were a little unhappy with the second quarter profit guidance of $10-14bn, anything toward the top end of that range will likely be met with a positive reaction,\" Britzman said.\n\n* Date not confirmed as the company might decide to announce results on 1 August.\n\nOther companies reporting next week include:\n\nMonday 22 July\n\nMONY (MONY.L)\n\nAscential (ASCL.L)\n\nSAP (SAP)\n\nRyanair (RYA.IR)\n\nVerizon Communications (VZ)\n\nNXP Semiconductor (NXPI)\n\nTuesday 23 July\n\nSThree (STEM.L)\n\nCompass (CPG.L)\n\nMitie (MTO.L)\n\nSK Hynix (HY9H.MU)\n\nLVMH (MC.PA)\n\nASM International (ASM.AS)\n\nThales (HO.PA)\n\nLindt (LISN.SW)\n\nAlfa Laval (ALFA.L)\n\nLogitech (LOGNE.SW)\n\nNorsk Hydro (NHY.OL)\n\nAkzo Nobel (AKZOY)\n\nRandstad (RSH.DU)\n\nVisa (V)\n\nCoca-Cola (KO)\n\nSpotify (SPOT)\n\nTexas Instruments (TXN)\n\nGE Aerospace (GE)\n\nDanaher (DHR)\n\nComcast (CMCSA)\n\nLockheed Martin (LMT)\n\nMondelez (MDLZ)\n\n3M (MMM)\n\nGeneral Motors (GM)\n\nMattel (MAT)\n\nWednesday 24 July\n\nReckitt Benckiser (RKT.L)\n\nUNITE (UTG.L)\n\nRHI Magnesita (RHIM.L)\n\nBreedon (BREE.L)\n\nAston Martin Lagonda (AML.L)\n\nPrimary Health Properties (PHP.L)\n\nFresnillo (FRES.L)\n\nEasyJet (EZJ.L)\n\nOxford Nanopore (ONT.L)\n\nIberdrola (IBE.MC)\n\nBNP Paribas (BNP.PA)\n\nEquinor (EQNR)\n\nBanco Santander (BNC.L)\n\nUniCredit (UCG.MI)\n\nKering (KER.PA)\n\nDeutsche Boerse (DB1.DE)\n\nOrange (ORA.PA)\n\nMichelin (ML.PA)\n\nRepsol (REP.MC)\n\nMoncler (MOV.F)\n\nJerónimo Martins (JMT.LS)\n\nCarrefour (CA.PA)\n\nSSAB (SSAB-A.ST)\n\nKindred (UNBA.MU)\n\nQualcomm (QCOM)\n\nIBM (IBM)\n\nLAM Research (LRCX)\n\nAT&T (T)\n\nUPS (UPS)\n\nKLA-Tencor (KLAC)\n\nFord (F)\n\nNewmont (NEM)\n\nUnited Rentals (URI)\n\nInternational Paper (IP)\n\nThursday 25 July\n\nRELX (REL.L)\n\nLloyds (LLOY.L)\n\nAnglo American (AAL.L)\n\nRentokil Initial (RTO.L)\n\nInforma (INF.L)\n\nCentrica (CNA.L)\n\nCentamin (CEY.L)\n\nHowden Joinery (HWDN.L)\n\nAirtel Africa (AAF.L)\n\nITV (ITV.L)\n\nHammerson (HMSO.L)\n\nVodafone (VOD.L)\n\nBT (BT-A.L)\n\nBritvic (BVIC.L)\n\nWorkspace (WKP.L)\n\nCVS Group (CVSG.L)\n\nNestlé (NESNE.SW)\n\nHermès (RMS.PA)\n\nRoche (ROG.SW)\n\nChristian Dior (CDI.PA)\n\nSanofi (SAN.PA)\n\nEssilorLuxxotica (EL.PA)\n\nStellantis (STLA)\n\nENI (ENI.F)\n\nSt. Gobain (GOB.MU)\n\nRenault (RNO.PA)\n\nMastercard (MA)\n\nAbbVie (ABBV)\n\nLinde (LIN)\n\nHoneywell (HON)\n\nIntel (INTC)\n\nStarbucks (SBUX)\n\nNorthrop Grumman (NOC)\n\nKeurig-Dr Pepper (KDP)\n\nBaker Hughes (BKR)\n\nSouthwest Airlines (LUV)\n\nBaxter (BAX)\n\nSkyworks (SWKS)\n\nLiberty Global (LBTYK)\n\nHarley-Davidson (HOG)\n\nFriday 26 July\n\nSEGRO (SGRO.L)\n\nIMI (IMI.L)\n\nRightmove (RMV.L)\n\nDrax (DRX.L)\n\nNEC (6701.T)\n\nKomatsu (6301.T)\n\nAir Liquide (AI.PA)\n\nMercedes Benz (MBG.HA)\n\nHolcim (HOLN.SW)\n\nBASF (BASA.BE)\n\nCapGemini (CGM.HM)\n\nAlstom (ALO.PA)\n\nVallourec (VK.PA)\n\nKone Cranes (KNCRY)\n\nExxon Mobil (XOM)\n\nBristol Meyers Squibb (BMY)\n\nConocoPhillips (COP)\n\nAON (AON)\n\nYou can read Yahoo Finance's full calendar here.\n\nDownload the Yahoo Finance app, available for Apple and Android.",
        "link": "https://uk.finance.yahoo.com/news/tesla-microsoft-alphabet-amazon-stocks-watch-144348903.html",
        "symbols": [
            "000660.KO",
            "0A00.LSE",
            "0BFA.LSE",
            "0EXG.LSE",
            "0H3T.LSE",
            "0HAU.LSE",
            "0HAZ.LSE",
            "0HB5.LSE",
            "0HV2.LSE",
            "0IW5.LSE",
            "0JCB.LSE",
            "0JPO.LSE",
            "0JT5.LSE",
            "0JZH.LSE",
            "0K92.LSE",
            "0L77.LSE",
            "0L8F.LSE",
            "0LJ9.LSE",
            "0LQQ.LSE",
            "0M2B.IL"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.015,
            "neu": 0.847,
            "pos": 0.139
        }
    },
    {
        "date": "2024-07-19T14:03:00+00:00",
        "title": "How to Play Lockheed Martin (LMT) Ahead of Q2 Earnings?",
        "content": "Lockheed Martin Corporation LMT is slated to release second-quarter 2024 results on Jul 23, before the opening bell.\n\nThe Zacks Consensus Estimate for LMT’s revenues is pegged at $17.06 billion, implying 2.2% growth from the year-ago quarter's reported figure. The consensus mark for second-quarter earnings is pegged at $6.45, suggesting a 4.2% decline from $6.73 reported in the prior-year quarter. The bottom-line estimate has inched up a penny in the past seven days. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLMT, America’s largest defense contractor, has an impressive earnings surprise history. Its earnings outpaced the Zacks Consensus Estimate in each of the trailing four quarters, the average surprise being 6.07%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nEarnings Whisper\n\nOur proven model predicts an earnings beat for Lockheed this time around. The combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the chances of an earnings beat, which is the case here. You can uncover the best stocks to buy or sell before they are reported with our Earnings ESP Filter.\n\nLockheed Martin has a Zacks Rank #3 and an Earnings ESP of +0.59%. You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nKey Factors to Note\n\nA potential solid sales improvement from each of LMT’s four business segments is likely to have bolstered the company’s top-line performance.\n\nAeronautics to Post Solid Sales\n\nThe Aeronautics segment, which primarily manufactures advanced, combat-proven jets, and contributes almost 40% to the company’s top line, is likely to deliver impressive second-quarter results.\r\n\r\nA ramp-up in the production of the F-16 program, along with higher sales volume from production, development and sustainment contracts for the F-35 program, is likely to have bolstered this segment’s top line. Higher sales volume from classified programs might have also boosted this unit’s revenues.\n\nThe Zacks Consensus Estimate for the Aeronautics unit’s second-quarter revenues is pegged at $6,915.9 million, indicating a 0.6% rise from the prior-year period’s reported figure.\n\nImpressive Projections From Other Segments\n\nThe remaining three segments are also projected to have performed favorably in the to-be-reported quarter.\n\nHigher sales volume from the fleet ballistic missile program, as well as that from space development agency transport and tracking layer programs, must have boosted the Space segment’s top line.  Also, a production ramp-up of hypersonic and next-generation interceptor programs might have contributed favorably to this segment’s revenue growth.\n\nStory continues\n\nThe Zacks Consensus Estimate for the segment’s revenues is pinned at $3,176.8 million, indicating a 0.3% improvement from the prior-year quarter’s reported number.\n\nLMT’s Missiles and Fire Control (“MFC”) segment provides critical missile defense support to the United States and foreign allies. A higher sales volume from tactical and strike missile programs, as well as integrated air and missile defense, is likely to have benefited this unit’s quarterly sales performance.\n\nThe Zacks Consensus Estimate for MFC’s second-quarter revenues is currently pegged at $2,906.8 million, indicating 5.5% growth from the top line recorded a year ago.\n\nHigher sales volume from the Sikorsky unit, particularly driven by CH-53K, Blackhawk and Seahawk helicopters, is likely to have bolstered the Rotary and Mission Systems (“RMS”) segment’s sales in the quarter under review.\n\nThe Zacks Consensus Estimate for RMS’ revenues is currently pegged at $4,013.8 million, indicating a 3% improvement from the top line registered in the prior-year quarter.\n\nExpenses to Consider\n\nHigher interest expenses remain a headwind for the majority of U.S. companies, with Lockheed Martin being no exception. Since no reduction has been made in the nation’s interest rate in recent times, notable interest expenses can be expected to have weighed on LMT’s second-quarter earnings.\n\nOur model estimate for second-quarter interest expenses is $298.9 million, reflecting a solid 34% increase year over year.\n\nDuring the first quarter of 2024, LMT recognized a reach-forward loss of $100 million associated with a classified missile program at its MFC unit, thereby bringing the cumulative losses recognized on the program to approximately $150 million.\n\nWith a potential loss of $1.3 billion associated with this program, LMT is expected to have incurred a notable loss in the second quarter as well. This, in turn, must have adversely impacted its margin performance and, thereby, bottom-line growth.\n\nPrice Performance & Valuation\n\nLockheed Martin’s shares have exhibited an upward trend, gaining a notable percentage over the year-to-date period. Specifically, the stock soared 5% year to date, outperforming the Zacks aerospace-defense industry’s decline of 9.9%.\n\nYTD Performance Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nAs evident from the image, other notable stocks from the same industry have also rallied year to date and comfortably outpaced the industry’s performance. Shares of General Dynamics GD and L3Harris Technologies LHX have risen 12.9% each, while that of Textron TXT rallied 15.1%.\n\nFrom a valuation perspective, LMT is trading at a relatively cheaper level when compared to its industry. Currently, LMT is trading at 17.35X forward 12 months earnings, which is lower than the industry’s forward earnings multiple of 18.83X. However, its five-year median is 15.70X. So, the company’s valuation looks somewhat stretched compared with its own range.\n\nLMT’s Price-to-Earnings (forward 12 Months) Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nInvestment Thesis\n\nWith geopolitical tensions looming hard in the global map lately, defense contractors like Lockheed Martin have succeeded in clinching major orders for its varied products in recent quarters. This, in turn, can be expected to have boosted its second-quarter revenues. Revenues earned from sustainment contracts for providing valuable services of its renowned products like the F-35 fighter jet and Black Hawk helicopters must have also contributed to its top-line growth.\n\nBacked by its solid top-line prospects, the company has been offering notable rewards to its shareholders. Impressively, LMT’s dividend yield of 2.65% outpaces that of S&P 500 (1.25%).\n\nHowever, increasing interest expenses remain a major headwind for the company’s near-term bottom-line growth. These might have also contributed to LMT’s elevated leverage, as evident from its long-term debt-to-capital ratio. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nShould You Buy LMT Now?\n\nDespite the few challenges faced by Lockheed Martin at present, it might not be a risk to make an entry for this stock, before coming Tuesday. This is because it is trading at a discount compared to its industry. This renowned fighter jet maker is less likely to disappoint with its second-quarter results, considering the upward revision in its earnings estimates as well as a positive Earnings ESP.\n\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nL3Harris Technologies Inc (LHX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research",
        "link": "https://finance.yahoo.com/news/play-lockheed-martin-lmt-ahead-140300397.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.027,
            "neu": 0.83,
            "pos": 0.143
        }
    },
    {
        "date": "2024-07-19T13:00:11+00:00",
        "title": "Here is What to Know Beyond Why Lockheed Martin Corporation (LMT) is a Trending Stock",
        "content": "Lockheed Martin (LMT) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\n\nOver the past month, shares of this aerospace and defense company have returned +2.1%, compared to the Zacks S&P 500 composite's +1.1% change. During this period, the Zacks Aerospace - Defense industry, which Lockheed falls in, has lost 0.2%. The key question now is: What could be the stock's future direction?\n\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\n\nRevisions to Earnings Estimates\n\nHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\n\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nLockheed is expected to post earnings of $6.45 per share for the current quarter, representing a year-over-year change of -4.2%. Over the last 30 days, the Zacks Consensus Estimate has changed -1.4%.\n\nThe consensus earnings estimate of $26.20 for the current fiscal year indicates a year-over-year change of -5.8%. This estimate has changed -0.3% over the last 30 days.\n\nFor the next fiscal year, the consensus earnings estimate of $28.38 indicates a change of +8.3% from what Lockheed is expected to report a year ago. Over the past month, the estimate has remained unchanged.\n\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Lockheed is rated Zacks Rank #3 (Hold).\n\nStory continues\n\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n\n12 Month EPS 12-month consensus EPS estimate for LMT _12MonthEPSChartUrl\n\nRevenue Growth Forecast\n\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\n\nIn the case of Lockheed, the consensus sales estimate of $17.1 billion for the current quarter points to a year-over-year change of +2.4%. The $69.8 billion and $72.49 billion estimates for the current and next fiscal years indicate changes of +3.3% and +3.9%, respectively.\n\nLast Reported Results and Surprise History\n\nLockheed reported revenues of $17.2 billion in the last reported quarter, representing a year-over-year change of +13.7%. EPS of $6.33 for the same period compares with $6.43 a year ago.\n\nCompared to the Zacks Consensus Estimate of $16.19 billion, the reported revenues represent a surprise of +6.21%. The EPS surprise was +9.14%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\n\nValuation\n\nWithout considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\n\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\n\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\n\nLockheed is graded B on this front, indicating that it is trading at a discount to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\n\nBottom Line\n\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Lockheed. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research",
        "link": "https://finance.yahoo.com/news/know-beyond-why-lockheed-martin-130011751.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.011,
            "neu": 0.865,
            "pos": 0.124
        }
    },
    {
        "date": "2024-07-19T00:00:00+00:00",
        "title": "3 Defense Stocks to Buy if Biden Wins in November",
        "content": "These could be three of the best defense stocks to buy in the event of another four years of the Biden administration.",
        "link": "https://investorplace.com/2024/07/3-defense-stocks-to-buy-if-biden-wins-in-november/",
        "symbols": [
            "BAESY.US",
            "LMT.US",
            "NOC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.691,
            "neg": 0,
            "neu": 0.778,
            "pos": 0.222
        }
    }
]