[
    {
        "date": "2024-10-02T22:00:21+00:00",
        "title": "Lockheed Martin (LMT) Stock Falls Amid Market Uptick: What Investors Need to Know",
        "content": "In the latest trading session, Lockheed Martin (LMT) closed at $603.20, marking a -0.44% move from the previous day. This change lagged the S&P 500's 0.01% gain on the day. Meanwhile, the Dow gained 0.09%, and the Nasdaq, a tech-heavy index, added 0.08%.\n\nComing into today, shares of the aerospace and defense company had gained 6.81% in the past month. In that same time, the Aerospace sector gained 1.4%, while the S&P 500 gained 1.21%.\n\nInvestors will be eagerly watching for the performance of Lockheed Martin in its upcoming earnings disclosure. The company's earnings report is set to be unveiled on October 22, 2024. On that day, Lockheed Martin is projected to report earnings of $6.40 per share, which would represent a year-over-year decline of 5.47%. Simultaneously, our latest consensus estimate expects the revenue to be $17.45 billion, showing a 3.37% escalation compared to the year-ago quarter.\n\nFor the full year, the Zacks Consensus Estimates are projecting earnings of $26.49 per share and revenue of $71.14 billion, which would represent changes of -4.78% and +5.28%, respectively, from the prior year.\n\nInvestors should also pay attention to any latest changes in analyst estimates for Lockheed Martin. These recent revisions tend to reflect the evolving nature of short-term business trends. Therefore, positive revisions in estimates convey analysts' confidence in the company's business performance and profit potential.\n\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. To capitalize on this, we've crafted the Zacks Rank, a unique model that incorporates these estimate changes and offers a practical rating system.\n\nThe Zacks Rank system, running from #1 (Strong Buy) to #5 (Strong Sell), holds an admirable track record of superior performance, independently audited, with #1 stocks contributing an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed an unchanged state. Lockheed Martin currently has a Zacks Rank of #2 (Buy).\n\nWith respect to valuation, Lockheed Martin is currently being traded at a Forward P/E ratio of 22.87. This signifies a premium in comparison to the average Forward P/E of 21.64 for its industry.\n\nAlso, we should mention that LMT has a PEG ratio of 4.89. Comparable to the widely accepted P/E ratio, the PEG ratio also accounts for the company's projected earnings growth. LMT's industry had an average PEG ratio of 2.14 as of yesterday's close.\n\nThe Aerospace - Defense industry is part of the Aerospace sector. At present, this industry carries a Zacks Industry Rank of 38, placing it within the top 16% of over 250 industries.\n\nStory continues\n\nThe Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nEnsure to harness Zacks.com to stay updated with all these stock-shifting metrics, among others, in the next trading sessions.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-stock-falls-220021986.html",
        "symbols": [
            "0R3E.LSE",
            "GSPC.INDX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.006,
            "neu": 0.872,
            "pos": 0.122
        }
    },
    {
        "date": "2024-10-02T21:20:00+00:00",
        "title": "Is Lockheed Martin the Best Defense Stock to Buy After Middle East Attacks?",
        "content": "It’s been great 2 plus months for Lockheed Martin (LMT). Following its last earnings report, the stock has basically gone nuclear. Heading into its July report, the stock was down under $475. From there, the rally has now taken things over $600 to the $605.86 level it closed at today. In the after-hours session, the stock continues to be bid.\n\nNews keeps dropping left and right about government contracts the company has secured. $422 million for integrating the Czech Republic into the F-35 Joint Strike Fighter program, $3.23 billion for air-to-surface standoff missiles, $358 million added to a now $1.1 billion Foreign Military Sales missile procurement, $3.9 billion for Trident II D5 missile production and $321 million for a US Missile Defense contract from the DoD. That wasn’t a year full of announcements, it was all in the last 4 trading days.\n\nMoving Averages: Bartosiak starts by examining the stock's moving averages, such as the 50-day and 200-day moving averages. He points out the significance of crossovers and divergences between these averages, which can indicate potential trend changes.\n\nSupport and Resistance Levels: Bartosiak identifies key support and resistance levels on the chart. These levels act as barriers that the stock price must breach or hold above, providing traders with critical decision points.\n\nChart Patterns: He discusses chart patterns like head and shoulders, cup and handle, or flags, and their relevance in predicting future price movements. These patterns can offer valuable insights into potential bullish or bearish trends.\n\nVolume Analysis: He emphasizes the importance of volume analysis in confirming price trends. An increase in trading volume during a breakout or breakdown can validate the significance of a price move.\n\nDave Bartosiak's technical analysis approach adds depth to our understanding Lockheed Martin’s stock chart. By paying attention to moving averages, support and resistance levels, chart patterns, technical indicators, and volume, he equips investors with a comprehensive toolkit for making well-informed decisions in the stock market. Remember, while technical analysis is a valuable tool, it's important to consider other factors like fundamental analysis and market sentiment before making investment choices.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-best-defense-stock-212000079.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.992,
            "neg": 0.009,
            "neu": 0.863,
            "pos": 0.127
        }
    },
    {
        "date": "2024-10-02T20:55:00+00:00",
        "title": "Lockheed Martin Declares Fourth Quarter 2024 Dividend",
        "content": "BETHESDA, Md., Oct. 2, 2024 /PRNewswire/ -- The Lockheed Martin (NYSE: LMT) board of directors has authorized a fourth quarter 2024 dividend of $3.30 per share. This is an increase of $0.15 per share over the last quarter and represents the company's 22nd consecutive year of dividend increases. The dividend is payable on Dec. 27, 2024, to holders of record as of the close of business on Dec. 2, 2024. Lockheed Martin Logo. (PRNewsFoto/Lockheed Martin)\n\nThe company's board has also authorized the purchase of up to an additional $3 billion of Lockheed Martin common stock under its share repurchase program. With this increase, total authorization for future repurchases under the share repurchase program is approximately $10 billion. The number of shares purchased and the timing of purchases are at the discretion of management and subject to compliance with applicable laws and regulations.\n\nAbout Lockheed Martin\r\nLockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at LockheedMartin.com. Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/lockheed-martin-declares-fourth-quarter-2024-dividend-302266107.html\n\nSOURCE Lockheed Martin\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-declares-fourth-quarter-205500599.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.976,
            "neg": 0,
            "neu": 0.85,
            "pos": 0.15
        }
    },
    {
        "date": "2024-10-02T20:19:00+00:00",
        "title": "Top Analyst Reports for NextEra Energy, Lockheed Martin &amp; Palo Alto Networks",
        "content": "Wednesday, October 2, 2024\r\n\r\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including NextEra Energy, Inc. (NEE), Lockheed Martin Corp. (LMT) and Palo Alto Networks, Inc. (PANW), as well as two micro-cap stocks Rave Restaurant Group, Inc. (RAVE) and AXIL Brands, Inc. (AXIL). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\r\n\r\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\r\n\r\nYou can see all of today’s research reports here >>>\r\n\r\nNextEra Energy’s shares have outperformed the Zacks Utility - Electric Power industry over the past year (+66.5% vs. +39.4%). The company continues to expand its operations through organic projects and acquisitions. NextEra Energy will add more renewable projects to its portfolio and has nearly 22.6 GW of renewable projects in its backlog. \r\n\r\nEfficient cost management is boosting the company's margins. Florida’s improving economy boosts the company’s subsidiary Florida Power & Light Company’s customer base. NextEra Energy has ample liquidity to meet its short-term debt obligations. \r\n\r\nYet, due to the nature of NextEra Energy’s business, it is subject to complex rules and regulations. Risks in operating nuclear power-based generation units, unfavorable weather conditions, and increasing supply costs can adversely impact earnings.\r\n\r\n(You can read the full research report on NextEra Energy here >>>)\r\n\r\nShares of Lockheed Martin have outperformed the Zacks Aerospace - Defense industry over the past year (+54.1% vs. +19.9%). The company’s broad product offerings allow it to secure major defense contracts, which in turn boosts its backlog count. Lockheed remains the largest U.S. defense contractor with a steady order flow from its leveraged presence in the Army, Air Force, Navy and IT programs. \r\n\r\nThe solid U.S. defense budgetary provisions should boost its business. Its products also witness a strong international demand from the countries like Germany, Taiwan, Japan and Australia. Meanwhile, the company also holds a strong solvency position. \r\n\r\nHowever, Lockheed is facing performance issues concerning some of its products that may affect its results. Shortage of skilled labor may adversely impact the company’s operating results. The sanctions imposed by China on Lockheed might also affect its business.\r\n\r\n(You can read the full research report on Lockheed Martin here >>>)\r\n\r\nPalo Alto Networks’ shares have gained +42.2% over the past year against the Zacks Internet - Software industry’s gain of +45.9%. The company has been benefiting from continuous deal wins and the increasing adoption of its next-generation security platforms, attributable to the rise in the hybrid work environment and the heightened need for stronger security. \r\n\r\nPANW’s strong back-to-back quarterly performances reflect its sustained focus on product innovation, a shift in its business model to subscription-based services, platform integration and continued investments in the go-to-market strategy. The normalization of the supply chain is also aiding growth across the Products, Services and Subscription segments. \r\n\r\nHowever, softening IT spending amid macroeconomic headwinds might hurt its near-term prospects. Forex headwinds and higher marketing and sales expenses are likely to continue hurting its profitability. Also, high acquisition-related expenses are denting margins.\r\n\r\n(You can read the full research report on Palo Alto Networks here >>>)\r\n\r\nShares of Rave Restaurant’s have gained +5.9% over the past year against the Zacks Retail - Restaurants industry’s gain of +21.7%. This microcap company with market capitalization of $32.38 million continues to demonstrate strong financial performance, posting its 17th consecutive quarter of positive earnings. Fiscal 2024 net income rose 53.3% to $2.5 million. \r\n\r\nRave Restaurant’s debt-free balance sheet with $7.8 million in cash reflects financial stability. Its expansion efforts are focused on the Pizza Inn brand, with reimaging initiatives underway for 25% of its buffet restaurants by fiscal 2025 and 21 new domestic sites contracted. \r\n\r\nDespite growth, challenges persist, including declining same-store sales, particularly in the Pie Five brand (which declined 10.6% in fourth-quarter fiscal 2024), rising operating costs and limited unit expansion. Rave Restaurant’s reliance on franchisees, shrinking international presence, modest revenue growth, and geographic concentration further pose risks to sustained growth.\r\n\r\n(You can read the full research report on Rave Restaurant here >>>)\r\n\r\nAXIL Brands’ shares have underperformed the Zacks Consumer Products - Staples industry over the past year (-65.1% vs. +14.2%). This microcap company with market capitalization of $27.17 million is facing risks which include high reliance on Shopify and Amazon (91% of revenues), rising operating expenses, vendor dependence and limited product diversification (95% of revenues from hearing products). Also, dilution risks from stock issuances and geopolitical factors may impact AXIL's performance.\r\n\r\nNevertheless, AXIL presents a compelling growth opportunity through its expanding market reach across the United States, Canada, the EU and Asia. Partnerships with companies, such as Racing Electronics and Kinsey’s, enhance brand visibility and market penetration, positioning AXIL for revenue growth. \r\n\r\nThe company’s focus on innovation in hearing protection and enhancement products, along with its premium Reviv3 Procare hair and skincare line, ensures alignment with evolving consumer demands. AXIL’s revenues grew 17% year over year in fiscal 2024, driven by its hearing products, while maintaining a strong gross margin of 73.4%.\r\n\r\n(You can read the full research report on AXIL Brands here >>>)\r\n\r\nOther noteworthy reports we are featuring today include Intercontinental Exchange, Inc. (ICE), Trane Technologies plc (TT) and Colgate-Palmolive Co. (CL).\r\n\r\nMark Vickery\r\nSenior Editor\r\n\r\nNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\n\nStory continues\n\nToday's Must Read\n\nNextEra (NEE) Gains from Renewable Focus, Steady Investment\n\nOrder Growth Boosts Lockheed (LMT), Tiff With Turkey Ails\n\nPalo Alto (PANW) Rides on Shift to Subscription Services\n\nFeatured Reports\n\nStrength in Global Data Services Aid Intercontinental (ICE)\r\nPer the Zacks analyst, Intercontinental is set to grow on solid portfolio, wide range of risk management services, cost synergies and solid capital position. Yet, rising expenses might weigh on margin\n\nStrong Commercial HVAC Markets Aid Trane Technologies (TT)\r\nPer the Zacks analyst, Trane Technologies' top-line benefits from strong Commercial HVAC Markets. Energy-efficient product installation and decarbonizing the built environment strengthens the market.\n\nColgate (CL) Benefits From Pricing & Productivity Efforts\r\nPer the Zacks analyst, Colgate has been gaining from strong pricing, and the benefits of funding-the-growth initiative. Adjusted gross margin expanded 300 basis points to 60.8% in second-quarter 2024.\n\nInternet Subscriber Growth Aids Rogers Communication (RCI)\r\nPer the Zacks analyst, Rogers Communication is benefiting from solid subscriber gain in Internet segment and shift of Internet users to higher-usage tiers.\n\nAffirm (AFRM) Rides on Innovative Products and Partnerships\r\nPer the Zacks analyst, innovative payment solutions and strong merchant partnerships poise Affirm well for growth.\n\nFresenius Medical Care's (FMS) Sales Strong Amid Competition\r\nPer the Zacks analyst sales of Fresenius Medical Care reflected strong growth so far in 2024 on the back of diverse products & acquisitions. However stiff competition in the niche market is a headwind\n\nAcquisitions Aid Webster Financial (WBS) Amid Rising Costs\r\nPer the Zacks analyst, Webster Financial's acquisition of Ametros is likely to enhance its expertise in HSAs and provide it with a new source of fee income. Yet, rising costs remain a concern.\n\nNew Upgrades\n\nAmvuttra & Givlaari Sales Boost Alnylam (ALNY) Amid Competition\r\nPer the Zacks analyst, ALNY's Amvuttra and Givlaari sales continue to boost revenues. Its ongoing collaboration deals with pharma giants, RHHBY, NVS and REGN, are progressing well.\n\nStrategic Initiatives & Recent Rate Cut Aid Fluor (FLR)\r\nPer the Zacks analyst, Fluor is benefiting from the recent rate cut, further boosting the demand trends for its services. Also, its focus on the new strategy, Building a Better Future, bodes well.\n\nBlackberry's (BB) Performance Gains From Uptake of Solutions\r\nPer the Zacks Analyst, Blackberry's performance is gaining from rapid adoption of the QNX platform and cybersecurity solutions. Cost-cutting and restructuring measures aid margin performance.\n\nNew Downgrades\n\nAsset Concentration, Lack of Hedging to Hurt Magnolia (MGY)\r\nThe Zacks analyst is worried about Magnolia Oil & Gas' lack of geographic dispersal of properties. The absence of any hedge protection also makes it more exposed to commodity price volatility.\n\nDeclining Industry Demand & High Debt Ail CNH Industrial (CNH)\r\nPer the Zacks analyst, decreased industry demand in agricultural and construction segments is likely to hit CNH Industrial's top-line growth. The rising debt level is also concerning.\n\nDismal Comps & High Costs Hurt Jack in the Box (JACK)\r\nPer the Zacks analyst, Jack in the Box's performance is being hurt by dismal comps stemming from reduced transactions and an unfavorable mix shift. Also, high debt levels and costs are a concern.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNextEra Energy, Inc. (NEE) : Free Stock Analysis Report\n\nIntercontinental Exchange Inc. (ICE) : Free Stock Analysis Report\n\nColgate-Palmolive Company (CL) : Free Stock Analysis Report\n\nPalo Alto Networks, Inc. (PANW) : Free Stock Analysis Report\n\nTrane Technologies plc (TT) : Free Stock Analysis Report\n\nRave Restaurant Group, Inc. (RAVE) : Free Stock Analysis Report\n\nAXIL Brands, Inc. (AXIL): Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/top-analyst-reports-nextera-energy-201900708.html",
        "symbols": [
            "0K80.LSE",
            "0R3E.LSE",
            "2IS.BE",
            "2IS.F",
            "2IS.MU",
            "5AP.F",
            "FP3.BE",
            "FP3.DU",
            "FP3.F",
            "FP3.MU",
            "FP3.STU",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NEE.US",
            "NEP.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.047,
            "neu": 0.796,
            "pos": 0.157
        }
    },
    {
        "date": "2024-10-02T15:40:16+00:00",
        "title": "LDOS vs. LMT: Which Stock Should Value Investors Buy Now?",
        "content": "Investors interested in stocks from the Aerospace - Defense sector have probably already heard of Leidos (LDOS) and Lockheed Martin (LMT). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look.\n\nThere are plenty of strategies for discovering value stocks, but we have found that pairing a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system produces the best returns. The Zacks Rank is a proven strategy that targets companies with positive earnings estimate revision trends, while our Style Scores work to grade companies based on specific traits.\n\nRight now, both Leidos and Lockheed Martin are sporting a Zacks Rank of # 2 (Buy). This means that both companies have witnessed positive earnings estimate revisions, so investors should feel comfortable knowing that both of these stocks have an improving earnings outlook. But this is just one piece of the puzzle for value investors.\n\nValue investors also try to analyze a wide range of traditional figures and metrics to help determine whether a company is undervalued at its current share price levels.\n\nOur Value category grades stocks based on a number of key metrics, including the tried-and-true P/E ratio, the P/S ratio, earnings yield, and cash flow per share, as well as a variety of other fundamentals that value investors frequently use.\n\nLDOS currently has a forward P/E ratio of 18.44, while LMT has a forward P/E of 22.87. We also note that LDOS has a PEG ratio of 1.47. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. LMT currently has a PEG ratio of 4.89.\n\nAnother notable valuation metric for LDOS is its P/B ratio of 4.93. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. By comparison, LMT has a P/B of 23.39.\n\nBased on these metrics and many more, LDOS holds a Value grade of B, while LMT has a Value grade of C.\n\nBoth LDOS and LMT are impressive stocks with solid earnings outlooks, but based on these valuation figures, we feel that LDOS is the superior value option right now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLeidos Holdings, Inc. (LDOS) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/ldos-vs-lmt-stock-value-154016518.html",
        "symbols": [
            "0R3E.LSE",
            "LDOS.US",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "S6IA.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.004,
            "neu": 0.753,
            "pos": 0.243
        }
    },
    {
        "date": "2024-10-02T14:25:00+00:00",
        "title": "Northrop Grumman Wins a $387M Deal for Upgrading E-2D Advanced Hawkeye",
        "content": "Northrop Grumman Corporation NOC recently secured a modification contract valued at $387.3 million to continue research and development for upgrading the E-2D Advanced Hawkeye. This contract entails Northrop Grumman providing cockpit redesign, which includes navigation, controls and display systems as well as tactical mission computer upgrades.\r\n \r\nThe award has been provided by the Naval Air Systems Command, Patuxent River, MD. The majority of work related to this contract will be executed in Melbourne, FL. The project is expected to be completed by September 2028.\n\nWhat’s Favoring NOC?\n\nWith countries worldwide enhancing their defense capabilities, spending on advanced military systems, including Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) technologies, has been rapidly increasing. To this end, it is imperative to mention that NOC is a renowned provider of C4ISR technology, offering critical system upgrades across multiple domains. As a result, it continues to secure a steady flow of orders for its advanced C4ISR capabilities from the Pentagon and U.S. allies, with the latest contract win being a prime example.\r\n\r\nNOC’s E-2D Advanced Hawkeye tactical airborne early warning aircraft serves as a game changer in the U.S. Navy's airborne battle command and control management. It helps manage and protect carrier battle groups, providing warfighters with enhanced battlefield awareness, particularly in air and missile defense, by integrating data from multiple sensors. With its advanced radar and network capabilities, the E-2D Hawkeye delivers critical information rapidly, thereby enabling faster decision-making and improving situational awareness during missions.\r\n\r\nThe C4ISR upgrades, mentioned in the latest contract win, will provide the U.S. armed forces with enhanced information about battle command and control management, thereby boosting their mission readiness.\n\nNOC’s Growth Prospects\n\nRising military conflicts, terrorism and border disputes have driven nations across the globe to focus more on national security, particularly in strengthening C4ISR capabilities, backed by the growing demand for advanced technologies like network-based battle control, unmanned vehicles and advanced sensor technologies as well as the rising complexity of warfares.\r\n\r\nThis is likely to have prompted Mordor Intelligence to forecast a compound annual growth rate of 3.2% for the global C4ISR market during the 2024-2029 time period.\r\n\r\nThis should benefit Northrop Grumman, a prominent forerunner in C4ISR technologies and supporter of military operations worldwide. The company has been delivering end-to-end communications and advanced networking capabilities for the United States and allied military forces operating across multiple battlespace domains for the past 60 years. In this context, it is worth mentioning NOC’s autonomous high-altitude, long-endurance systems, which offer unrivaled situational awareness over land and maritime domains.\n\nStory continues\n\nProspects of NOC’s Peers\n\nOther defense companies that are likely to enjoy the perks of the expanding C4ISR market have been discussed below.\r\n\r\nLockheed Martin Corporation LMT: The company provides advanced systems for surveillance, reconnaissance and battle management. One of its key programs includes the Command Control Battle Management Communications, which is the first battle management system capable of integrating across domains.\r\n \r\nThe company’s long-term (three to five years) earnings growth rate is 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales indicates year-over-year growth of 5.3%.\r\n\r\nRTX Corporation RTX: The company focuses on providing integrated defense systems and radar and missile warning systems that improve situational awareness and threat detection. Its Intelligence, Surveillance and Reconnaissance systems and multi-mission sensors are critical to both U.S. and international defense operations.\r\n\r\nThe company’s long-term earnings growth rate is 10.4%. The Zacks Consensus Estimate for RTX’s 2024 sales indicates year-over-year growth of 7%.\r\n\r\nGeneral Dynamics Corporation GD: The company offers advanced communication systems, command and control solutions and ISR platforms that support military forces worldwide. Notably, its subsidiary in Canada offers the Land C4ISR system to the nation’s armed forces to coordinate and conduct modern operations.\r\n \r\nThe company’s long-term earnings growth rate is 12.6%. The Zacks Consensus Estimate for GD’s 2024 sales indicates year-over-year growth of 13.5%.\n\nNOC Stock’s Price Movement\n\nShares of NOC have gained 24.9% in the past three months compared with the industry’s 13.3% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nNOC’s Zacks Rank\n\nNOC currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/northrop-grumman-wins-387m-deal-142500033.html",
        "symbols": [
            "0IUC.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.056,
            "neu": 0.754,
            "pos": 0.19
        }
    },
    {
        "date": "2024-10-02T14:24:00+00:00",
        "title": "Lockheed (LMT) Soars 3.6%: Is Further Upside Left in the Stock?",
        "content": "Lockheed Martin (LMT) shares soared 3.6% in the last trading session to close at $605.86. The move was backed by solid volume with far more shares changing hands than in a normal session. This compares to the stock's 2.9% gain over the past four weeks.\n\nStocks of major defense contractors, which provide their defense products as a part of America’s military aid to Israel, surged following Iran’s latest missile attack on Israel. Lockheed being the largest defense contractor in the United States, thus witnessed a solid boost in its share price, in the last trading session.\n\nThis aerospace and defense company is expected to post quarterly earnings of $6.40 per share in its upcoming report, which represents a year-over-year change of -5.5%. Revenues are expected to be $17.45 billion, up 3.4% from the year-ago quarter.\n\nWhile earnings and revenue growth expectations are important in evaluating the potential strength in a stock, empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nFor Lockheed, the consensus EPS estimate for the quarter has remained unchanged over the last 30 days. And a stock's price usually doesn't keep moving higher in the absence of any trend in earnings estimate revisions. So, make sure to keep an eye on LMT going forward to see if this recent jump can turn into more strength down the road.\n\nThe stock currently carries a Zacks Rank #2 (Buy). You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\n\nLockheed belongs to the Zacks Aerospace - Defense industry. Another stock from the same industry, Virgin Galactic (SPCE), closed the last trading session 4.3% lower at $5.84. Over the past month, SPCE has returned -8.8%.\n\nFor Virgin Galactic , the consensus EPS estimate for the upcoming report has changed +11.2% over the past month to -$4.10. This represents a change of +26.8% from what the company reported a year ago. Virgin Galactic currently has a Zacks Rank of #2 (Buy).\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nVirgin Galactic Holdings, Inc. (SPCE) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-soars-3-6-142400426.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.992,
            "neg": 0.013,
            "neu": 0.845,
            "pos": 0.142
        }
    },
    {
        "date": "2024-10-02T12:56:00+00:00",
        "title": "HEICO Buys Marway Power, Widens Power Distribution Solution Capacity",
        "content": "HEICO Corporation HEI recently signed a contract to acquire Marway Power Solutions, Inc. The acquiree provides the design and construction of power distribution solutions for mission-critical systems used in defense, aerospace, communications, test and measurement, and industrial applications on land, sea and air.\r\n\r\nPer the deal, HEI bought 92.5% of Marway for cash. HEICO indicated that the transaction would be accretive to its earnings within one year of the buyout.\n\nHow Will the Buyout Benefit HEICO?\n\nMarway’s acquisition is expected to strengthen HEICO’s footprint in the aerospace and defense industry, particularly in power distribution solutions for mission-critical systems. It develops and produces power distribution solutions in both standard rackmount and customized enclosures. Marway provides a variety of products, including transformers, switchgear and customized solutions adapted to specific sectors like defense, which are consistent with HEI's value-creating approach.\r\n\r\nThe aforementioned factors will provide HEICO Corporation with an opportunity to expand its customer base, enhance its product offerings and increase its market share in power distribution solutions for mission-critical systems business area.\n\nWhat’s Driving Acquisitions Among Aerospace Defense Players?\n\nThe military industry has seen a notable rise in mergers and acquisitions due to several factors, like the growing emphasis on cost-reduction initiatives, diversifying the portfolio to tackle competition and achieving economies of scale, along with operational efficiency to attain long-term goals. These transactions are becoming more significant, allowing businesses to grow as they see fit by expanding their operations, gaining access to new skills, developing technologies and producing higher-quality goods and services, as well as capturing larger market shares.\r\n\r\nHEICO’s latest decision to acquire Marway Power Solutions also seems to have been motivated by the aforementioned factors.\r\n\r\nSome other defense companies have recently indulged in acquisition deals to expand their operations and widen product offerings.\r\n\r\nIn August 2024, Lockheed Martin Corp. LMT agreed to acquire a manufacturer of satellite products, Terran Orbital, for $450 million, which serves the aerospace and defense industry. Through this acquisition, LMT will be able to expand its customer base, enhance its product offerings and increase its market share in the satellite-based solutions business area.\r\n\r\nLockheed Martin has a long-term (three to five years) earnings growth rate of 4.7%. It delivered an average earnings surprise of 7.46% in the last four quarters.\r\n\r\nIn May 2024, TransDigm Group, Inc. TDG agreed to acquire Raptor Scientific for $655 million, a manufacturer of complex test and measurement solutions serving the aerospace and defense end markets. Through this acquisition, TDG should be able to provide a wider range of products and gain a larger market share in the highly engineered aviation components industry.\r\n\r\nTransDigm Group has a long-term earnings growth rate of 20.7%. The Zacks Consensus Estimate for its fiscal 2024 sales calls for an improvement of 19.9% from the prior-year figure.\r\n\r\nIn April 2024, Curtiss-Wright Corporation CW completed the acquisition of WSC, Inc. for $34 million. The buyout is expected to expand Curtiss-Wright’s portfolio of advanced commercial nuclear technologies utilized in the modernization of existing power plants and the design of new power plants, such as Advanced Small Modular Reactors.\r\n\r\nCurtiss-Wright boasts a four-quarter earnings surprise of 11.52%, on average. The Zacks Consensus Estimate for CW’s 2024 sales implies an improvement of 7.1% from the prior-year figure.\n\nStory continues\n\nHEICO Stock Price Movement\n\nIn the past three months, shares of HEICO have risen 15% compared with the industry’s growth of 12.5%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nHEI’s Zacks Rank\n\nHEI currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTransdigm Group Incorporated (TDG) : Free Stock Analysis Report\n\nCurtiss-Wright Corporation (CW) : Free Stock Analysis Report\n\nHeico Corporation (HEI) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/heico-buys-marway-power-widens-125600565.html",
        "symbols": [
            "0J46.LSE",
            "0R3E.LSE",
            "0REK.LSE",
            "CW.US",
            "CWT.F",
            "CWT.STU",
            "HC1.F",
            "HC1.STU",
            "HC1A.F",
            "HEI-A.US",
            "HEI.US",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "T7D.BE",
            "T7D.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0,
            "neu": 0.821,
            "pos": 0.179
        }
    },
    {
        "date": "2024-10-02T11:00:32+00:00",
        "title": "Calculating The Fair Value Of Lockheed Martin Corporation (NYSE:LMT)",
        "content": "Key Insights\n\nUsing the 2 Stage Free Cash Flow to Equity, Lockheed Martin fair value estimate is US$752 With US$606 share price, Lockheed Martin appears to be trading close to its estimated fair value Our fair value estimate is 35% higher than Lockheed Martin's analyst price target of US$558\n\nToday we'll do a simple run through of a valuation method used to estimate the attractiveness of Lockheed Martin Corporation (NYSE:LMT) as an investment opportunity by taking the forecast future cash flows of the company and discounting them back to today's value. The Discounted Cash Flow (DCF) model is the tool we will apply to do this. It may sound complicated, but actually it is quite simple!\n\nRemember though, that there are many ways to estimate a company's value, and a DCF is just one method. If you still have some burning questions about this type of valuation, take a look at the Simply Wall St analysis model.\n\nSee our latest analysis for Lockheed Martin\n\nThe Model\n\nWe are going to use a two-stage DCF model, which, as the name states, takes into account two stages of growth. The first stage is generally a higher growth period which levels off heading towards the terminal value, captured in the second 'steady growth' period. To start off with, we need to estimate the next ten years of cash flows. Where possible we use analyst estimates, but when these aren't available we extrapolate the previous free cash flow (FCF) from the last estimate or reported value. We assume companies with shrinking free cash flow will slow their rate of shrinkage, and that companies with growing free cash flow will see their growth rate slow, over this period. We do this to reflect that growth tends to slow more in the early years than it does in later years.\n\nA DCF is all about the idea that a dollar in the future is less valuable than a dollar today, and so the sum of these future cash flows is then discounted to today's value:\n\n10-year free cash flow (FCF) forecast\n\n2025 2026 2027 2028 2029 2030 2031 2032 2033 2034 Levered FCF ($, Millions)  US$6.31b US$6.73b US$7.07b US$7.13b US$7.21b US$7.33b US$7.47b US$7.62b US$7.79b US$7.97b Growth Rate Estimate Source Analyst x10 Analyst x8 Analyst x2 Analyst x1 Est @ 1.24% Est @ 1.62% Est @ 1.88% Est @ 2.07% Est @ 2.20% Est @ 2.29% Present Value ($, Millions) Discounted @ 6.1%  US$5.9k US$6.0k US$5.9k US$5.6k US$5.4k US$5.1k US$4.9k US$4.8k US$4.6k US$4.4k\n\n(\"Est\" = FCF growth rate estimated by Simply Wall St)\r\nPresent Value of 10-year Cash Flow (PVCF) = US$53b\n\nAfter calculating the present value of future cash flows in the initial 10-year period, we need to calculate the Terminal Value, which accounts for all future cash flows beyond the first stage. For a number of reasons a very conservative growth rate is used that cannot exceed that of a country's GDP growth. In this case we have used the 5-year average of the 10-year government bond yield (2.5%) to estimate future growth. In the same way as with the 10-year 'growth' period, we discount future cash flows to today's value, using a cost of equity of 6.1%.\n\nStory continues\n\nTerminal Value (TV)= FCF2034 × (1 + g) ÷ (r – g) = US$8.0b× (1 + 2.5%) ÷ (6.1%– 2.5%) = US$228b\n\nPresent Value of Terminal Value (PVTV)= TV / (1 + r)10= US$228b÷ ( 1 + 6.1%)10= US$127b\n\nThe total value, or equity value, is then the sum of the present value of the future cash flows, which in this case is US$179b. In the final step we divide the equity value by the number of shares outstanding. Relative to the current share price of US$606, the company appears about fair value at a 19% discount to where the stock price trades currently. Remember though, that this is just an approximate valuation, and like any complex formula - garbage in, garbage out. dcf\n\nThe Assumptions\n\nNow the most important inputs to a discounted cash flow are the discount rate, and of course, the actual cash flows. If you don't agree with these result, have a go at the calculation yourself and play with the assumptions. The DCF also does not consider the possible cyclicality of an industry, or a company's future capital requirements, so it does not give a full picture of a company's potential performance. Given that we are looking at Lockheed Martin as potential shareholders, the cost of equity is used as the discount rate, rather than the cost of capital (or weighted average cost of capital, WACC) which accounts for debt. In this calculation we've used 6.1%, which is based on a levered beta of 0.868. Beta is a measure of a stock's volatility, compared to the market as a whole. We get our beta from the industry average beta of globally comparable companies, with an imposed limit between 0.8 and 2.0, which is a reasonable range for a stable business.\n\nSWOT Analysis for Lockheed Martin\n\nStrength\n\nDebt is well covered by earnings and cashflows.\n\nDividends are covered by earnings and cash flows.\n\nWeakness\n\nEarnings declined over the past year.\n\nDividend is low compared to the top 25% of dividend payers in the Aerospace & Defense market.\n\nOpportunity\n\nAnnual earnings are forecast to grow for the next 3 years.\n\nGood value based on P/E ratio and estimated fair value.\n\nThreat\n\nAnnual earnings are forecast to grow slower than the American market.\n\nNext Steps:\n\nValuation is only one side of the coin in terms of building your investment thesis, and it shouldn't be the only metric you look at when researching a company. DCF models are not the be-all and end-all of investment valuation. Instead the best use for a DCF model is to test certain assumptions and theories to see if they would lead to the company being undervalued or overvalued. If a company grows at a different rate, or if its cost of equity or risk free rate changes sharply, the output can look very different. For Lockheed Martin, we've put together three essential items you should look at:\n\nRisks: Be aware that  Lockheed Martin is showing  2 warning signs in our investment analysis, you should know about... Management:Have insiders been ramping up their shares to take advantage of the market's sentiment for LMT's future outlook? Check out our management and board analysis with insights on CEO compensation and governance factors. Other Solid Businesses: Low debt, high returns on equity and good past performance are fundamental to a strong business. Why not explore our interactive list of stocks with solid business fundamentals to see if there are other companies you may not have considered!\n\nPS. The Simply Wall St app conducts a discounted cash flow valuation for every stock on the NYSE every day. If you want to find the calculation for other stocks just search here.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/calculating-fair-value-lockheed-martin-110032153.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.028,
            "neu": 0.807,
            "pos": 0.165
        }
    }
]