[
    {
        "date": "2024-09-03T21:50:11+00:00",
        "title": "Lockheed Martin (LMT) Stock Moves -0.15%: What You Should Know",
        "content": "Lockheed Martin (LMT) closed the latest trading day at $567.22, indicating a -0.15% change from the previous session's end. The stock's performance was ahead of the S&P 500's daily loss of 2.12%. Elsewhere, the Dow saw a downswing of 1.51%, while the tech-heavy Nasdaq depreciated by 3.26%.\n\nComing into today, shares of the aerospace and defense company had gained 4.17% in the past month. In that same time, the Aerospace sector gained 6.27%, while the S&P 500 gained 5.78%.\n\nInvestors will be eagerly watching for the performance of Lockheed Martin in its upcoming earnings disclosure. The company's upcoming EPS is projected at $6.40, signifying a 5.47% drop compared to the same quarter of the previous year. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $17.45 billion, up 3.37% from the year-ago period.\n\nFor the full year, the Zacks Consensus Estimates are projecting earnings of $26.49 per share and revenue of $71.14 billion, which would represent changes of -4.78% and +5.28%, respectively, from the prior year.\n\nInvestors should also note any recent changes to analyst estimates for Lockheed Martin. These revisions help to show the ever-changing nature of near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.\n\nOur research reveals that these estimate alterations are directly linked with the stock price performance in the near future. To utilize this, we have created the Zacks Rank, a proprietary model that integrates these estimate changes and provides a functional rating system.\n\nThe Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed a 0.24% decrease. Currently, Lockheed Martin is carrying a Zacks Rank of #3 (Hold).\n\nInvestors should also note Lockheed Martin's current valuation metrics, including its Forward P/E ratio of 21.45. This signifies a premium in comparison to the average Forward P/E of 20.85 for its industry.\n\nIt is also worth noting that LMT currently has a PEG ratio of 4.59. Comparable to the widely accepted P/E ratio, the PEG ratio also accounts for the company's projected earnings growth. As the market closed yesterday, the Aerospace - Defense industry was having an average PEG ratio of 1.88.\n\nThe Aerospace - Defense industry is part of the Aerospace sector. With its current Zacks Industry Rank of 27, this industry ranks in the top 11% of all industries, numbering over 250.\n\nStory continues\n\nThe Zacks Industry Rank evaluates the power of our distinct industry groups by determining the average Zacks Rank of the individual stocks forming the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nMake sure to utilize Zacks.com to follow all of these stock-moving metrics, and more, in the coming trading sessions.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-stock-moves-215011412.html",
        "symbols": [
            "0R3E.LSE",
            "GSPC.INDX",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.008,
            "neu": 0.889,
            "pos": 0.103
        }
    },
    {
        "date": "2024-09-03T17:01:31+00:00",
        "title": "Get a Load of the Profit Margin on These Companies",
        "content": "If a company has a fat profit margin, it's a good sign for two reasons. Customers want its goods or services enough to pay a hefty price. And the company is not letting expenses balloon.\n\nOn the basis of their high profit margins, I recommend ON Semiconductor Corp. (NASDAQ:ON), Martin Marietta Materials Inc. (NYSE:MLM), Devon Energy Corp. (NYSE:DVN), T. Rowe Price Group Inc. and Snap-on Inc. (NYSE:SNA).\n\nThis is the 15th column I've written about companies with pleasingly plump profit margins. In 14 past years, my selections in this series have achieved an average one-year return of 17.50%. That beats the average for the Standard & Poor's 500 Total Return Index, which was 15.80% over the same period.\n\nWarning! GuruFocus has detected 3 Warning Sign with ON.\n\nBear in mind that my column results are hypothetical and shouldn't be confused with results I obtain for clients. Also, past performance doesn't predict the future.\n\nNow, here are five new high-margin selections.\n\nON Semiconductor\n\nSpecializing in semiconductor chips for cars, ON Semiconductor (NASDAQ:ON) boasts a 10-year revenue growth rate of more than 11%, and an earnings growth rate of more than 27%. It hit a bump last year, though, with both revenue and profits falling slightly.\n\nWas that just a bump, or a wall that the company hit? Analysts are divided on that question. Of 33 analysts covering the company, 19 call it a buy and 14 rate it a hold or underperform.\n\nI believe that the cars of the future will need even more chips than the cars of the present. And I like ON's net profit margin of nearly 25%. So I'm guessing that the recent slowdown was merely a bump.\n\nMartin Marietta\n\nThere were two companies named Martin Marietta (NYSE:MLM). One merged with Lockheed Corp. to form Lockheed Martin Corp. (NYSE:LMT), the largest U.S. defense contractor by revenue. The other, Martin Marietta Materials, is the one I'm recommending today.\n\nThe materials company, based in Raleigh, North Carolina, provides crushed stone, gravel, sand and cement. That may sound prosaic but the stock has doubled in the past five years and the company's after-tax margin is nearly 31%.\n\nThe recent increase in federal infrastructure spending has helped this company, and I expect the favorable effects will continue for the next few years.\n\nDevon Energy\n\nEnergy companies are said to be more oily or gassy depending on the mix of oil and gas they produce. Devon, based in Oklahoma City, Oklahoma, is relatively gassy. In the most recent quarter, its production included 29% natural gas and 28% natural-gas liquids.\n\nStory continues\n\nDevon appears to be putting together a fourth consecutive very profitable year, after posting losses in six of the nine years preceding. I find the stock, at 8 times earnings, quite attractive. The net margin lately has been above 22%.\n\nT. Rowe Price\n\nAn investment firm specializing in mutual funds and employee-benefit plans, T. Rowe Price (NASDAQ:TROW) of Baltimore, Maryland, boasts a net margin of more than 28%. In the past five years, the stock has been a dud, sitting today slightly below where it was five years ago.\n\nI think that financial stocks will benefit if the Federal Reserve eases interest rates over the next couple of years. Selling at less than 13 times earnings, the stock looks to me like a good bet.\n\nSnap-on\n\nBased in Kenosha, Wisconsin, Snap-on Inc. (NYSE:SNA) provides repair tools and software to auto shops. It works on a franchise system. Franchisees by a red-and-white truck from Snap-on, along with gear to fill it. Then they distribute it to gas stations and other auto-repair shops.\n\nThe franchisees make about $60,000 to $130,000 a year, according to third-party reports. Snap-on itself made a little over $1 billion in the past four quarters, on revenue of roughly $5 billion.\n\nSome people figure that the advent of electric cars will hurt the company, since electric cars have fewer parts than gasoline-powered cars. My view is that car repairers will need both kinds of tools for the next five years or more.\n\nLast year\n\nMy fat-margin stocks enjoyed a bigger lead over the S&P 500 before the past year. My picks in 2023 were a disaster.\n\nThey fell 7.50%, even as the S&P 500 rose 26.90% with dividends reinvested. None of my picks did especially well. The worst performers were Livent Corp. (now part of Arcadium Lithium PLC (NYSE:ALTM)) and Utah Medical Products Inc. (NASDAQ:UTMD), both down close to 24%.\n\nThe crummy performance was all the more disappointing because it followed a very good one in 2022, when my fat-margin selections returned 32.94%.\n\nJohn Dorfman is chairman of Dorfman Value Investments in Boston, Massachusetts. His firm or clients may own or trade the stocks discussed here. He can be reached at jdorfman@dorfmanvalue.com.\n\nThis article first appeared on GuruFocus.\n\nView comments",
        "link": "https://finance.yahoo.com/news/load-profit-margin-companies-170131674.html",
        "symbols": [
            "0L7G.LSE",
            "ALTM.US",
            "DVN.US",
            "GSPC.INDX",
            "LMT.US",
            "MLM.US",
            "ON.US",
            "SNA.US",
            "SPU.DU",
            "SPU.F",
            "SPU.STU",
            "TROW.US",
            "UTMD.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.99,
            "neg": 0.043,
            "neu": 0.859,
            "pos": 0.098
        }
    },
    {
        "date": "2024-09-03T14:15:00+00:00",
        "title": "3 Big Winners from the Q2 Earnings Season: LLY, LMT, META",
        "content": "The 2024 Q2 earnings season is slowly grinding to a halt, with the majority of S&P 500 companies already delivering quarterly results. Looking ahead, Q3 earnings for the S&P 500 index are expected to be up +3.8% from the same period last year on +4.6% higher revenues, chaining together consecutive periods of positivity.\n\nBelow is a chart illustrating earnings expectations for the coming and recent periods. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nSeveral companies have stolen the spotlight throughout the period, including Meta Platforms META, Lockheed Martin LMT, and Eli Lilly LLY. All three posted robust results and upped guidance, with shares of each seeing bullish activity post earnings.\n\nLet’s take a closer look at each.\n\nMETA Raises AI CapEx\n\nMega-cap giant Meta Platforms was one of the few Mag 7 members to see a positive reaction to its quarterly results, with the company again exceeding both earnings and revenue expectations. The company’s earnings outlook reflects bullishness across all timeframes. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nThe company delivered a stunning statement in the release, with Mark Zuckerberg saying, ‘We had a strong quarter, and Meta AI is on track to be the most used AI assistant in the world by the end of the year,\"\n\nHe continued, \"We've released the first frontier-level open source AI model, we continue to see good traction with our Ray-Ban Meta AI glasses, and we're driving good growth across our apps.\"\n\nMeta also raised its CapEx outlook into a band of $37 - $40 billion ($35 - $40 billion prior) to support its artificial intelligence roadmap.\n\nThe valuation picture for META remains attractive, with the current 22.4X forward 12-month earnings multiple in line with the five-year median and well beneath five-year highs of 31.5X. In addition, the current PEG ratio works out to 1.2X, reflecting that investors are paying a fair price for the forecasted growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nEli Lilly Sees Robust Demand\n\nEli Lilly shares have been red-hot in 2024 thanks to robust results stemming from unrelenting demand, up 65% and widely outperforming relative to the S&P 500. Shares popped following its latest release, with earnings and sales climbing 85% and 35%, respectively.\n\nThe company upgraded its current-year sales guidance by a sizable $3 billion. Analysts have adjusted their sales expectations accordingly, with the now $46.4 billion expected alluding to a 35% climb year-over-year. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nThe story behind Eli Lilly has been driven by its diabetes drug Mounjaro and its weight loss injection Zepbound, which have seen unrelenting demand among consumers. Mounjaro sales jumped 216% year-over-year, whereas Zepbound sales of $1.2 billion also reflected strong demand.\n\nStory continues\n\nEarnings expectations have shot higher across the board following the release, with LLY sporting a favorable Zacks Rank #2 (Buy). Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLMT Generates Significant Cash\n\nLockheed Martin is the largest defense contractor in the world, operating in defense, space, intelligence, homeland security, and information technology. The company’s steady growth continued throughout its latest period, with EPS and revenue growing 6% and 9%, respectively.\n\nThe company has been a long-time favorite among income-focused investors, consistently upping its payout over the years. LMT’s cash-generating abilities have aided its dividend growth, with the company posting nearly $1.3 billion in free cash flow throughout its latest period.\n\nBelow is a chart illustrating the company’s dividends paid annually over the last 15 years. Please note that the final value illustrated is on a trailing twelve-month basis. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nFollowing the favorable quarter, LMT upped its EPS, segment profit, and sales guidance, causing shares to move bullishly following the release.\n\nBottom Line\n\nThe Q2 earnings season overall showed resiliency, with no major spooks hitting the tape. While we saw some mixed reads on the consumer, recent favorable economic data helps alleviate this issue.\n\nAnd concerning a few companies who stole the spotlight during the reporting period, Meta Platforms META, Lockheed Martin LMT, and Eli Lilly LLY all did precisely that.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nEli Lilly and Company (LLY) : Free Stock Analysis Report\n\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-big-winners-q2-earnings-141500731.html",
        "symbols": [
            "0R3E.LSE",
            "1FB.MI",
            "FB20.F",
            "FB2A.F",
            "FB2A.HM",
            "FB2A.MU",
            "FB2A.XETRA",
            "GSPC.INDX",
            "LILY34.SA",
            "LLY.BE",
            "LLY.F",
            "LLY.MU",
            "LLY.MX",
            "LLY.STU",
            "LLY.US",
            "LLY.XETRA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.017,
            "neu": 0.832,
            "pos": 0.151
        }
    },
    {
        "date": "2024-09-03T14:05:00+00:00",
        "title": "Lockheed Stock Upgraded With Big Price Target. Why Shares Are Falling Anyway.",
        "content": "Robert Spingarn of Melius Research upgraded shares of defense giant Lockheed Martin to Buy from Hold on Tuesday. “Simply put, we think consensus estimates are too low and don’t reflect the F-35’s growth potential from price increases and sustainment volumes as the installed base [of F-35 jets] grows 48% by the end of 2026,” wrote Spingarn. “After declining in 2022 and 2023, F-35 sales have returned to growth and should increase at a 4% [annual growth rate] over the next several years compared to the 1% to 2% [annual growth rate] implied in consensus estimates,” added Spingarn.\n\nContinue reading\n\nView comments",
        "link": "https://finance.yahoo.com/m/1ae7ac74-99dc-3266-a27a-138c3b2474e8/lockheed-stock-upgraded-with.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.906,
            "neg": 0.019,
            "neu": 0.833,
            "pos": 0.148
        }
    },
    {
        "date": "2024-09-03T12:39:00+00:00",
        "title": "The Zacks Analyst Blog Highlights NVIDIA, AT&amp;T,  Lockheed Martin, Steel Partners and Natural Resource",
        "content": "For Immediate Release\n\nChicago, IL – September 3, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: NVIDIA Corp. NVDA, AT&T Inc. T, Lockheed Martin Corp. LMT, Steel Partners Holdings L.P. SPLP and Natural Resource Partners L.P. NRP.\n\nHere are highlights from Friday’s Analyst Blog:\n\nTop Stock Reports for NVIDIA, AT&T and Lockheed Martin\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including NVIDIA Corp., AT&T Inc. and Lockheed Martin Corp., as well as two micro-cap stocks Steel Partners Holdings L.P. and Natural Resource Partners L.P.. The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\n\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\n\nYou can see all of today's research reports here >>>\n\nNVIDIA shares have lost some ground following the beat-and-raise quarterly release on Wednesday, August 28th, with market participants seemingly shrugging the company's raised guidance. But this lack of stock market follow through for the shares could very well be a reflection of the stock's impressive gains over the past year rather than a comment on underlying business trends.\n\nThe company is benefiting from the strong growth of artificial intelligence (AI), high-performance and accelerated computing. The data center end-market business is benefiting from the growing demand for generative AI and large language models using graphic processing units (GPUs) based on NVIDIA Hopper and Ampere architectures.\n\nA surge in hyperscale demand and higher sell-ins to partners across the Gaming and ProViz end markets following the normalization of channel inventory are acting as tailwinds. Collaborations with Mercedes-Benz and Audi are likely to advance its presence in the autonomous vehicles and other automotive electronics space.\n\nHowever, its near-term prospects are likely to be hurt by softening IT spending amid macroeconomic headwinds. The United States and China's tit-for-tat trade war is also a major concern.\n\n(You can read the full research report on NVIDIA here >>>)\n\nShares of AT&T have outperformed the Zacks Wireless National industry over the year-to-date period (+23.4% vs. +21.7%). The company is expected to benefit from an integrated fiber expansion strategy that improves broadband connectivity, while steady 5G deployments are likely to boost end-user experience. The deployment of O-RAN architecture is likely to offer more flexibility, lower costs and monetize the network to reduce the huge debt burden.\n\nStory continues\n\nWith a customer-centric business model, AT&T is witnessing healthy momentum in its postpaid wireless business with a lower churn rate and increased adoption of higher-tier unlimited plans. However, lower demand for legacy voice and data services is affecting revenues in the Business Wireline vertical.\n\nDeclining Mobility equipment sales are a concern. Fierce competition in a saturated wireless market will likely strain margins. A muted guidance for 2024 is worrisome while high debt burden remains a perennial problem.\n\n(You can read the full research report on AT&T here >>>)\n\nLockheed Martin shares have outperformed the Zacks Aerospace - Defense industry over the past year (+29.1% vs. +1.9%). The company's broad product offerings allow it to secure major defense contracts, which in turn boosts its backlog count. Lockheed remains the largest U.S. defense contractor with a steady order flow from its leveraged presence in the Army, Air Force, Navy and IT programs.\n\nThe solid U.S. defense budgetary provisions should boost its business. Its products also witness a strong international demand from countries like Germany, Taiwan, Japan and Australia. Meanwhile, the company also holds a strong solvency position.\n\nHowever, Lockheed is facing performance issues concerning some of its products that may affect its results. Shortage of skilled labor may adversely impact the company's operating results. The sanctions imposed by China on Lockheed might also affect its business.\n\n(You can read the full research report on Lockheed Martin here >>>)\n\nShares of Steel Partners' have declined -2.5% over the year-to-date period against the Zacks Diversified Operations industry's decline of -7%. This microcap company with market capitalization of $795.34 million reported strong financial results in second-quarter 2024, with revenues growing 6.4% year over year to $533.2 million and a 113.2% surge in net income to $124.9 million.\n\nRevenues for the six months ended Jun 30, 2024 also increased by 6.7% to $1 billion. This growth reflects the company's effective diversification across its industrial and financial services segments. SPLP's operational efficiency is highlighted by a 15.7% adjusted EBITDA margin, up from 14.7% in second-quarter 2023.\n\nSteel Partners' balance sheet is robust, with $256.4 million in cash and a $112-million debt reduction in the first half of 2024, enhancing financial stability. Investments in the Supply Chain segment, which saw 192% in revenues for the six months ended Jun 30, 2024, position SPLP for long-term growth, particularly as global supply chains evolve.\n\n(You can read the full research report on Steel Partners here >>>)\n\nNatural Resource Partners'shares have declined -0.4% over the year-to-date period against the Zacks Coal industry's decline of -2.4%. This microcap company with market capitalization of $1.13 billion faces significant risks from its heavy reliance on coal royalties, with metallurgical coal accounting for 75% of second-quarter 2024 coal royalty revenues.\n\nWeakened steel demand, particularly in China and Europe, is pressuring coal prices, potentially reducing NRP's cash flow. The secular decline in U.S. thermal coal demand, driven by environmental regulations and competition from natural gas, further threatens long-term revenues.\n\nAdditionally, a surge in Chinese soda ash production is depressing global prices, impacting NRP's profitability. Inflationary pressures, labor shortages, and high financing costs also pose challenges, while stringent environmental regulations and reliance on lessees increase operational risks. Overall, NRP's exposure to volatile coal markets and regulatory risks positions it in a challenging environment.\n\n(You can read the full research report on Natural Resource Partners here >>>)\n\nWhy Haven't You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\n\nToday you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nAT&T Inc. (T) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nNatural Resource Partners LP (NRP) : Free Stock Analysis Report\n\nSteel Partners Holdings LP (SPLP): Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-nvidia-123900260.html",
        "symbols": [
            "0R3E.LSE",
            "1NVDA.MI",
            "ATTB34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NVD.BE",
            "NVD.DU",
            "NVD.F",
            "NVD.HA",
            "NVD.HM",
            "NVD.MU",
            "NVD.STU",
            "NVD.XETRA",
            "NVDA.MX"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.054,
            "neu": 0.821,
            "pos": 0.125
        }
    }
]