[
    {
        "date": "2024-10-11T14:00:16+00:00",
        "title": "Possible Bearish Signals With Lockheed Martin Insiders Disposing Stock",
        "content": "The fact that multiple Lockheed Martin Corporation (NYSE:LMT) insiders offloaded a considerable amount of shares over the past year could have raised some eyebrows amongst investors. When evaluating insider transactions, knowing whether insiders are buying is usually more beneficial than knowing whether they are selling, as the latter can be open to many interpretations. However, when multiple insiders sell stock over a specific duration, shareholders should take notice as that could possibly be a red flag.\n\nWhile insider transactions are not the most important thing when it comes to long-term investing, logic dictates you should pay some attention to whether insiders are buying or selling shares.\n\nCheck out our latest analysis for Lockheed Martin\n\nThe Last 12 Months Of Insider Transactions At Lockheed Martin\n\nOver the last year, we can see that the biggest insider sale was by the Chief Operating Officer, Frank St. John, for US$2.8m worth of shares, at about US$428 per share. That means that even when the share price was below the current price of US$597, an insider wanted to cash in some shares. As a general rule we consider it to be discouraging when insiders are selling below the current price, because it suggests they were happy with a lower valuation. However, while insider selling is sometimes discouraging, it's only a weak signal. This single sale was 100% of Frank St. John's stake.\n\nIn the last year Lockheed Martin insiders didn't buy any company stock. The chart below shows insider transactions (by companies and individuals) over the last year. By clicking on the graph below, you can see the precise details of each insider transaction! insider-trading-volume\n\nIf you are like me, then you will not want to miss this freelist of small cap stocks that are not only being bought by insiders but also have attractive valuations.\n\nInsiders At Lockheed Martin Have Sold Stock Recently\n\nOver the last three months, we've seen significant insider selling at Lockheed Martin. In total, insiders dumped US$3.8m worth of shares in that time, and we didn't record any purchases whatsoever. This may suggest that some insiders think that the shares are not cheap.\n\nDoes Lockheed Martin Boast High Insider Ownership?\n\nAnother way to test the alignment between the leaders of a company and other shareholders is to look at how many shares they own. Usually, the higher the insider ownership, the more likely it is that insiders will be incentivised to build the company for the long term. Insiders own 0.05% of Lockheed Martin shares, worth about US$78m. This level of insider ownership is good but just short of being particularly stand-out. It certainly does suggest a reasonable degree of alignment.\n\nStory continues\n\nSo What Does This Data Suggest About Lockheed Martin Insiders?\n\nInsiders sold stock recently, but they haven't been buying. And even if we look at the last year, we didn't see any purchases. On the plus side, Lockheed Martin makes money, and is growing profits. Insider ownership isn't particularly high, so this analysis makes us cautious about the company. We're in no rush to buy! In addition to knowing about insider transactions going on, it's beneficial to identify the risks facing Lockheed Martin. In terms of investment risks, we've identified 2 warning signs with Lockheed Martin and understanding them should be part of your investment process.\n\nBut note: Lockheed Martin may not be the best stock to buy. So take a peek at this freelist of interesting companies with high ROE and low debt.\n\nFor the purposes of this article, insiders are those individuals who report their transactions to the relevant regulatory body. We currently account for open market transactions and private dispositions of direct interests only, but not derivative transactions or indirect interests.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/possible-bearish-signals-lockheed-martin-140016569.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.984,
            "neg": 0.05,
            "neu": 0.86,
            "pos": 0.09
        }
    },
    {
        "date": "2024-10-11T14:00:00+00:00",
        "title": "Lockheed Secures a Contract to Provide Electronic Warfare for F-16",
        "content": "Lockheed Martin Corp.’s LMT business unit, Aeronautics, recently clinched a modification contract to incorporate the advanced integrated defensive electronic warfare (EW) suite for F-16 aircraft. The award has been offered by the Air Force Lifecycle Management Center, F-16 foreign military sales (FMS) Contracting, Hill Air Force Base, UT.\n\nValued at $28.4 million, the contract is projected to be completed by Dec. 30, 2029. Work related to this deal will be executed in Fort Worth, TX. The contract includes FMS.\n\nWhat’s Favoring LMT Stock?\n\nThe growing demand for EW systems in the defense sector is driven by escalating global geopolitical tensions. As international conflicts and regional disputes have intensified significantly over the last decade, nations have increased their focus on strengthening their military capabilities. A key area of focus has been the development and modernization of EW systems, which are critical for countering a wide range of threats, including cyberattacks, signal jamming and electronic surveillance.\n\nNotably, the increasing complexity of modern warfare, which now involves not only physical combat but also cyber and electronic threats, has elevated the importance of EW systems. In recent times, notable technological advancements have transformed the nature of EW systems, making them far more sophisticated and effective. These cutting-edge technologies allow for better detection, disruption, and neutralization of enemy communications and radar, giving militaries a distinct tactical advantage on the battlefield.\n\nAs a result, many countries are prioritizing the integration of advanced EW systems into their broader defense architectures to ensure that they are prepared for a wide range of modern threats. This must have prompted the Mordor Intelligence firm to predict the global Electronic Warfare market to witness a CAGR of 5.1% during the 2024-2029 period.\n\nThis should boost advanced EW solution providers like Lockheed. Notably, the company offers state-of-the-art EW solutions across multiple domains. In terms of LMT’s predominance in the airborne EW industry, it is imperative to mention that Lockheed Martin has fielded more than 3,000 airborne electronic warfare systems over the past 45 years, including electronic support measure (ESM), electronic attack (EA), radar warning receiver (RWR), electronic intelligence, communications intelligence and anti-jam GPS products.\n\nSome notable EW solutions offered by the company are the AN/ALQ-210 for the U.S. Navy and international MH-60R and the AN/ALQ-217 on the U.S. Navy’s E-2C/D aircraft. Such advanced EW solutions in its product portfolio must have been ushering in solid order flow for LMT, like the latest one, which, in turn, should boost its future revenues.\n\nStory continues\n\nProspects for LMT’s Peers\n\nOther defense contractors that are expected to reap the benefits of the expanding EW market are listed below:\n\nL3Harris Technologies LHX: It manufactures electronic warfare systems like AN/ALQ-214 (IDECM) F/A-18 Countermeasure System, Viper Shield AN/ALQ-254(V)1 All-digital Electronic Warfare Suite, CREW Vehicle Receiver/Jammer and The Next Generation Jammer-Low Band.\r\n\r\nNotably, the Viper Shield all-digital EW suite is custom designed to be baseline on advanced F-16 Block 70/72 aircraft and maximize their survivability and mission success. \r\n\r\nRTX Corp. RTX: Raytheon's NGJ-MB is a jamming system that improves airborne electronic attack capabilities for EA-18G Growler fighter aircraft. The NGJ-MB is the U.S. Navy's sophisticated electronic attack system designed to destroy enemy technology, such as air defense systems and communication tools.\r\n\r\nIt is capable of attacking multiple targets simultaneously. The NGJ-MB program completed Milestone C in 2021 and is now in the production and deployment phase.\r\n\r\nNorthrop Grumman NOC: The company has been providing Naval Airborne Electronic Warfare solutions for more than 55 years now. Some of its EW systems are the ALQ-251 radio frequency countermeasures system and the AN/APR-39 Radar Warning Receiver/Electronic Warfare Management System.\n\nIts AN/ALQ-257 Integrated Viper Electronic Warfare Suite provides full-spectrum radar warning, threat identification and advanced countermeasure capabilities for the F-16 fleet.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nL3Harris Technologies Inc (LHX) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-secures-contract-electronic-warfare-140000517.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.112,
            "neu": 0.694,
            "pos": 0.194
        }
    },
    {
        "date": "2024-10-11T07:05:00+00:00",
        "title": "Want a Decade of Growing Passive Income? Buy This Dividend Growth Stock and Never Sell.",
        "content": "Dividend investing is a tried-and-true strategy for building long-term wealth. It may not be as sexy as buying the hottest hyper-growth stocks or cutting-edge technology companies, but dividend stocks can be the tortoise that drives steady portfolio wealth when looking at a multi-decade period. And it does take time. For example, if you buy a dividend stock yielding 2% that grows its dividend per share by 6% per year, it will be yielding just 3.6% in 10 years. But if that same compounding occurs for 30 years, your initial investment will be yielding over 11% at the end of the time period.\n\nThis may not seem like much for investors accustomed to fast-paced tech stocks, but you should remember that dividend growth stocks will be paying you out a cash payment every year that you can choose to keep in cash or reinvest in a dividend reinvestment program (DRIP). This is the steady compounding that can turn a boring stock into a millionaire-maker investment.\n\nPerhaps the perfect dividend growth stock is Lockheed Martin(NYSE: LMT). The aerospace and defense contractor has grown its dividend payout at a steady rate, leading to a total return (including dividends) of close to 5,000% in the last 30 years. Here's why you should buy this dividend growth stock and never sell.\n\nLockheed Martin: The premier aerospace defense contractor\n\nTo understand Lockheed Martin, we need to understand the defense and aerospace government contract business. Typically, the U.S government will make a proposal for a technology or defense system (for example, a fighter jet) that private companies can bid on. There will also be subcontracts and the ability to sell these products to U.S. allies. Once these contracts are in place, they can last for many decades as the company builds, sells, and maintains these product platforms.\n\nLockheed Martin is the largest defense contractor in the U.S. with a focus on aerospace systems. It is the lead contractor for the F-35 fighter jet, which is the current-generation fighter jet that the U.S. government is spending hundreds of billions on over many decades. As one of the longest-standing defense contractors with a reputation for technological innovation, Lockheed was able to secure the F-35 deal over competitors such as Boeing.\n\nOn top of aerospace, Lockheed also has programs for space exploration, missiles, and mission systems. All four segments are profitable for Lockheed, generating a combined $8.5 billion in operating income in the last 12 months. With the long-term deals in place across these programs, Lockheed Martin has a massive backlog of $158 billion that will provide predictable earnings for many years into the future.\n\nStory continues\n\nPredictable dividend growth\n\nDividend growth is powered by earnings growth. Lockheed Martin has predictable earnings growth because of these long-term government contracts. Let's use the earnings metric free cash flow per share and compare it to Lockheed's dividend per share.\n\nFree cash flow per share has grown by 204% in the last 10 years at Lockheed Martin. This is the fuel for growing dividend payments. No cash flow, and the dividends can't get paid. It's that simple. In conjunction with this cash-flow growth, Lockheed's dividend per share has grown by a cumulative 127% in the last 10 years. Interestingly, cash-flow growth has greatly outpaced dividend growth for Lockheed, which should tell investors that the company could have grown its dividend payout faster than it actually did.\n\nWith free cash flow per share of $28.46 over the last 12 months and a dividend per share of just $12.45, Lockheed Martin can keep growing its dividend for many years even if free cash flow per share growth stagnates. However, as discussed above, these long-term contracts make it extremely unlikely that Lockheed's earnings will stop growing anytime soon. LMT Dividend Per Share (TTM) Chart\n\nDon't forget share repurchases\n\nThe cherry on top of Lockheed Martin's dividend growth is the company's share repurchase program. Share repurchases make a stock's share count decline, which means you have fewer shares to pay dividends to. This makes it easier -- all else equal -- for a company to keep growing its dividend per share. Lockheed has been repurchasing stock for years, with shares outstanding down by around 25% in the last 10 years. As this continues, the dividend per share you get as a remaining shareholder should keep growing as well.\n\nRight now, Lockheed Martin stock has a dividend yield of just 2.1%, which does not look very mouth-watering. However, with its history of dividend growth, this can be a huge winning stock for investors who plan to buy and hold for many decades.\n\nDon’t miss this second chance at a potentially lucrative opportunity\n\nEver feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.\n\nOn rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:\n\nAmazon: if you invested $1,000 when we doubled down in 2010, you’d have $20,855!* Apple: if you invested $1,000 when we doubled down in 2008, you’d have $43,423!* Netflix: if you invested $1,000 when we doubled down in 2004, you’d have $392,297!*\n\nRight now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.\n\nSee 3 “Double Down” stocks »\n\n*Stock Advisor returns as of October 7, 2024\n\nBrett Schafer has no position in any of the stocks mentioned. The Motley Fool recommends Lockheed Martin. The Motley Fool has a disclosure policy.\n\nWant a Decade of Growing Passive Income? Buy This Dividend Growth Stock and Never Sell. was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/want-decade-growing-passive-income-070500336.html",
        "symbols": [
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.037,
            "neu": 0.763,
            "pos": 0.2
        }
    }
]