[
    {
        "date": "2024-09-18T21:43:23+00:00",
        "title": "Is Lockheed Martin Corporation (LMT) The Best Defense Stock to Buy Now?",
        "content": "We recently published a list of 10 Best Defense Stocks To Buy Now. In this article, we are going to take a look at where Lockheed Martin Corporation (NYSE:LMT) stands against other defense stocks to buy now.\n\nAs we move into 2025 and beyond, the defense industry stands at a critical juncture, where technological advancements, evolving geopolitical threats, and increased spending from both public and private sectors are converging to shape the future of aerospace and defense (A&D). The years ahead promise significant growth opportunities for companies within the sector, especially those positioned at the forefront of innovation and strategic alignment. This article aims to provide a detailed overview of the best investment opportunities in the defense sector, which will be heavily influenced by emerging technologies, hypersonic developments, and the ongoing digital transformation of the industry.\n\nAccording to Deloitte, one of the most exciting developments shaping the defense landscape in years ahead is the emergence of supersonic and hypersonic technologies. NASA’s X-59 QueSST program has been pushing the boundaries of quiet supersonic travel, aiming to reduce sonic boom intensity and revolutionize high-speed aviation. While this technology is still in its nascent stages, manufacturers are optimistic about its potential, having already secured significant investments and collaborations with major airlines. This optimism reflects the increasing recognition that supersonic travel may not just be a technological marvel but an economically viable solution for future air travel.\n\nIn addition to supersonic travel, the defense sector is witnessing an unparalleled surge in demand for hypersonic technology, both for offensive and defensive purposes. The U.S. Department of Defense (DOD) has allocated a substantial budget in fiscal year 2024 to develop and test hypersonic capabilities, including glide vehicles and cruise missiles. As this technology inches closer to operationalization, defense companies are expected to accelerate their efforts to bring hypersonic weapons systems to market, which will likely drive growth in the sector for years to come.\n\nLooking ahead, the A&D industry’s growth will be driven by a combination of defense and commercial spending. With escalating geopolitical tensions, the demand for next-generation defense capabilities is at an all-time high. The global defense budget surpassed $2.24 trillion in 2022, and the U.S. DOD has requested $842 billion for fiscal year 2024, a 3.2% increase from the previous year. This funding surge is set to propel innovation in areas such as artificial intelligence (AI), advanced technologies, and the modernization of air, ground, and naval vehicles, all of which will play a crucial role in shaping the defense sector over the next decade.\n\nStory continues\n\nInvestors should pay close attention to companies involved in the defense supply chain, particularly those engaged in research and development (R&D) of cutting-edge defense equipment. The DOD’s emphasis on AI, microelectronics, quantum computing, and advanced propulsion systems is expected to fuel rapid technological advancements. By focusing on these areas, defense firms can maintain their competitive edge, providing ample opportunities for investors looking to capitalize on the sector’s growth potential.\n\nIn addition to traditional defense technologies, the space sector is becoming an increasingly important part of the A&D industry’s future. U.S. spending on space-related defense initiatives has risen sharply, with the U.S. Space Force (USSF) requesting $30.1 billion for fiscal year 2024. This represents a 15% increase from the previous year, and the trend is expected to continue into 2025 and beyond as the U.S. works to maintain its strategic advantage in space. Investments in cybersecurity, space exploration, and resilient space forces will remain a key focus, positioning companies in the space and defense sectors for long-term growth.\n\nWhile the defense industry is set to thrive in the coming years, it is not without its challenges. Inflation, which has been a persistent issue in recent years, is expected to remain a concern as the industry grapples with the rising costs of materials and production. In real terms, the U.S. defense budget increase of 3.2% for fiscal year 2024 may be overshadowed by inflation rates, currently hovering around 6%. This could limit the DOD’s flexibility in launching new missions or advancing certain technologies, as resources are reallocated to cover essential operational costs. Despite these headwinds, companies that can innovate and streamline their supply chains will likely find ways to mitigate these risks.\n\nCommercial aerospace is another area that will see significant investment in the years to come. The recovery of international and domestic passenger traffic to pre-pandemic levels is projected to drive new aircraft orders, with increased spending on digitalization, new product development, and next-generation technologies like Advanced Air Mobility (AAM) and space exploration. Companies that can tap into these emerging markets will find themselves well-positioned to benefit from the broader recovery of the aerospace sector.\n\nMoving forward, the AAM sector, in particular, is expected to transition from R&D to full-scale manufacturing and commercialization. Aircraft manufacturers are targeting type certification for their AAM vehicles, with the first wave of commercialization anticipated in 2025. To support these efforts, substantial investments in infrastructure—such as vertiports, charging stations, and pilot training facilities—are expected to drive long-term growth in this emerging market. Companies that position themselves as leaders in AAM technology will be at the forefront of this transformation, offering attractive investment opportunities for those with a forward-looking perspective.\n\nThe future of the defense industry also hinges on the successful integration of digital tools throughout the supply chain. The concept of the “digital thread,” which connects engineering, manufacturing, and aftermarket activities, is becoming increasingly important as companies look to streamline their operations and reduce time-to-market for new products. By embracing digital transformation, A&D companies can accelerate the certification and commercialization of new technologies, providing a significant competitive advantage in a rapidly evolving industry.\n\nFurthermore, the importance of cybersecurity in the defense sector cannot be overstated. As the industry becomes more digitally interconnected, the risk of cyberattacks increases. In response, defense companies are expected to invest heavily in cyber-resiliency measures to protect sensitive data and critical infrastructure. This focus on cybersecurity will be particularly relevant in 2025 and beyond, as companies work to safeguard their operations against increasingly sophisticated cyber threats.\n\nIn addition to technology and innovation, geopolitical factors will continue to shape the defense industry in years ahead. The ongoing conflict between Russia and Ukraine, tensions in the South China Sea, and the broader competition for global dominance between the U.S. and China are expected to drive further increases in defense spending. The U.S. DOD is investing heavily in next-generation technologies to maintain its strategic advantage in these areas, with a focus on AI, quantum computing, and space capabilities.\n\nMoreover, the private sector’s role in defense innovation is expected to grow as the DOD continues to engage with small businesses, startups, and academia to accelerate the integration of emerging technologies. Initiatives like the Defense Innovation Unit (DIU) and AFWERX are helping to bridge the gap between the government and the private sector, fostering innovation and driving growth in the defense industry.\n\nFor investors, companies that can successfully navigate these partnerships and bring new technologies to market will offer compelling investment opportunities. As the defense industry looks toward the future, the companies that can embrace technological advancements, adapt to changing geopolitical dynamics, and manage inflationary pressures will be best positioned for long-term success. For investors, identifying the best defense stocks to buy now will require a keen understanding of these trends and an eye for companies that are leading the charge in innovation, digital transformation, and operational excellence.\n\nOur Methodology\n\nFor this article we first screened for companies operating in the defense sector and picked the 30 largest companies operating in the space. We then sourced the hedge fund sentiment for these companies from Insider Monkey’s proprietary database of 912 elite money managers. We narrowed down our selection to stocks that were the most widely-held by hedge funds and then ranked them in ascending order of the number of hedge fund holders, as of Q2 2024.\n\nAt Insider Monkey we are obsessed with the stocks that hedge funds pile into. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here). 5 Countries with the Most Special-Mission Aircraft in the World\n\nA military aircraft in flight, showing the strength of the company's combat & air mobility capability.\n\nLockheed Martin Corporation (NYSE:LMT)\n\nNumber of Hedge Fund Holders: 56\n\nLockheed Martin Corporation (NYSE:LMT) is a top defense stock, making it a must-include in any defense-focused portfolio. As a global leader in security and aerospace, the company is renowned for its advanced military aircraft, missile defense systems, and space technologies. With its Aeronautics, Missiles and Fire Control (MFC), Rotary and Mission Systems (RMS), and Space segments, Lockheed Martin Corporation (NYSE:LMT) plays a crucial role in national security and military advancements, positioning it as a key player in the defense sector.\n\nLockheed Martin Corporation (NYSE:LMT) financial performance in the second quarter of 2024 further highlights its solid fundamentals. The company exceeded earnings expectations, reporting an EPS of $7.11, significantly higher than the anticipated $6.46. This strong result was driven by robust sales growth across all four business segments, which rose by 9% year-over-year to over $18 billion. This increase was bolstered by improvements in the supply chain and operational execution. The company also reported an impressive segment operating margin of 11.3%, a 20 basis point improvement compared to the same period last year.\n\nOne of the standout features of Lockheed Martin Corporation (NYSE:LMT) performance is its significant backlog of nearly $160 billion, which is more than twice its annual revenue. This backlog demonstrates strong demand for its defense technologies and ensures steady revenue streams for the future. The company generated over $1.5 billion in free cash flow during the quarter, reflecting both year-over-year and sequential growth, enabling it to invest in innovation while returning over 100% of free cash flow to shareholders through dividends and share buybacks.\n\nLockheed Martin Corporation (NYSE:LMT) F-35 program continues to be a major contributor to its success. The company began deliveries of the Technology Refresh 3 (TR-3) configured F-35 aircraft, enhancing the fighter jet’s capabilities. This program, along with key contracts like the $4 billion multiyear PAC-3 missile defense system order, secures Lockheed Martin Corporation (NYSE:LMT) position as a defense powerhouse with strong growth potential.\n\nOverall, LMT ranks 2nd on our list of best defense stocks to buy now. While we acknowledge the potential of LMT as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than LMT but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nREAD NEXT: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-corporation-lmt-best-214323091.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.028,
            "neu": 0.77,
            "pos": 0.202
        }
    },
    {
        "date": "2024-09-18T15:02:00+00:00",
        "title": "Lockheed Martin Awarded GeoXO Lightning Mapper Contract to Support Forecasters with Severe Weather Monitoring",
        "content": "Next-Generation GeoXO Lightning Mapper enhances capabilities of NOAA's next-generation weather satellite system\n\nDENVER, Sept. 18, 2024 /PRNewswire/ -- NASA has awarded Lockheed Martin (NYSE: LMT) a contract to design and build the next-generation GeoXO Lightning Mapper (LMX) instruments for the National Oceanic and Atmospheric Administration (NOAA). The baseline contract is valued at approximately $297 million for two instruments with options for two additional instruments. An improvement from the Geostationary Lightning Mapper (GLM) seen here, the GeoXO Lightning Mapper (LMX) will be used to detect, locate and measure lightning flashes. [credit NASA]\n\nThe Capabilities\n\nLMX is a single-channel, near-infrared optical instrument developed specifically to detect, locate, and measure the intensity, duration and extent of lightning flashes in near-real-time.\n\nThe LMX instrument detects and measures lightning flashes while onboard NOAA's next-generation GeoXO weather satellites. This lightning data will provide persistent severe weather observations of the Western Hemisphere, improving storm analysis and prediction, and aiding the detection of tornado-producing storms. The imagers will improve hurricane intensity calculations, lightning hazard detection, wildfire ignition detection and aviation threat avoidance.\n\nLMX builds on the work of the first operational lightning mapper flown in geostationary orbit — the Lockheed Martin-built Geostationary Lightning Mapper (GLM). Specifically, LMX will improve on GLM with finer spatial resolution and faster imaging of lightning activity, in addition to a wider field of view of the Western Hemisphere, which will now include Alaska. Lockheed Martin will develop and build the LMX instruments at its Sunnyvale, California, facility.\n\n\"Lockheed Martin improved upon the success of the Geostationary Lighting Mapper and added game-changing technologies to the GeoXO Lightning Mapper, including an advanced imaging sensor that will potentially detect 25% more lightning pulses,\" said Matthew Mahlman, director of Weather, Earth Science and Climate Intelligence at Lockheed Martin. \"This advanced technology will give meteorologists a tool to create greater lead time in alerting people to severe storms and dangerous weather situations such as rapid intensifying hurricanes.\"\n\nBuilding on Success\n\nThe GeoXO weather satellite system is NOAA's next generation of satellites following the successful Geostationary Operational Environmental Satellites (GOES) series – the last of which, GOES-U, launched on June 25, 2024. That satellite is now in geostationary orbit undergoing on-orbit checkout and verification and is has been renamed GOES-19.\n\nIn June, NASA awarded Lockheed Martin a contract to develop and build the GeoXO spacecraft, for NOAA. The baseline contract is for three spacecraft with options for four additional spacecraft. The total estimated value of the contract including options is $2.27 billion and first launch is planned for the early 2030s.\n\nFor over 50 years, Lockheed Martin has designed and built more than 120 weather and environmental spacecraft, and many Earth observation instruments for civil government, military and commercial applications. These one-of-a-kind instruments include the Solar Ultraviolet Imager (SUVI) – which is flying on the GOES-R series satellites – as well the as the Interface Region Imaging Spectrograph (IRIS) and James Webb Space Telescope's primary infrared imager, NIRCam.\n\nAbout Lockheed Martin Lockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at Lockheedmartin.com. Lockheed Martin Logo. (PRNewsfoto/Lockheed Martin) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/lockheed-martin-awarded-geoxo-lightning-mapper-contract-to-support-forecasters-with-severe-weather-monitoring-302251997.html\n\nSOURCE Lockheed Martin\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-awarded-geoxo-lightning-150200637.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.024,
            "neu": 0.859,
            "pos": 0.117
        }
    },
    {
        "date": "2024-09-18T13:20:00+00:00",
        "title": "Lockheed Wins a Deal to Support U.S. Presidential Helicopter Program",
        "content": "Lockheed Martin Corp.’s LMT business unit, Sikorsky Aircraft, recently secured a modification contract, worth $23.1 million, involving the VH-92A Patriot in-service helicopter. The award has been offered by the Naval Air Systems Command, Patuxent River, MD.\n\nPer the terms of the deal, Lockheed will procure sustainment spares and provide repair support of aircraft components for the VH-92A helicopter. A major portion of the work related to this contract will be executed in Stratford, CT, and Woodlawn, WA.\n\nLMT Stock’s Supremacy in the Combat Helicopter Market\n\nLockheed is a well-known manufacturer of combat helicopters, not only in the United States but also around the world. Its Sikorsky business unit has been providing advanced flight solutions ever since 1923.  When it comes to the military section of this unit, Sikorsky offers a handful of combat helicopters like the Black Hawk, CH-148 Cyclone, CH-53K, HH-60W, MH-60R Seahawk, S-97 and a few more to the U.S. Army, Navy as well as armed forces of several other nations across the globe.\n\nThe ability of these helicopters to operate in complex, networked battlefields on the virtue of their increased agility, improved situational awareness through advanced sensors, high speeds, state-of-the-art armors, as well as versatility to operate in different weather conditions and altitude have made them the preferred choice for many nations’ armies. This can be gauged from the solid order flows that the Sikorsky unit enjoys each quarter, with the latest contract being a bright example of that.\n\nAs far as VH-92A is concerned, it is the presidential helicopter in the United States that ensures long-term affordability by utilizing the FAA-certified Sikorsky S-92 aircraft, which is the best-in-class for safety and reliability. The fact that LMT’s aircraft have flown every U.S. president since 1957 surely reflects the company’s supremacy in the U.S. combat helicopter space.\n\nWhat Lies Ahead for LMT Stock?\n\nAs countries worldwide enhance their defense capabilities, spending on advanced military arms and ammunition is rapidly increasing. This includes growing investments in military helicopters, which are crucial for air warfare missions.  This might have prompted the Mordor Intelligence firm to forecast a compound annual growth rate (CAGR) of more than 2.9% for the global military helicopter market from 2024 to 2030.\n\nSuch solid market prospects offer growth opportunities for Lockheed, with its Sikorsky building some of the most agile combat helicopters in the world. The company constantly tries to innovate new military helicopters to maintain its supremacy in the global military helicopter market.\n\nStory continues\n\nEvidently, together with Boeing BA, Lockheed is currently developing the SB-1 Defiant helicopter for the U.S. Army's joint multi-role technology demonstration program. The helicopter can fly twice as far and fast as the Black Hawk.\n\nOpportunities for LMT’s Peers\n\nOther defense companies that are expected to enjoy the perks of the expanding military helicopter market have been discussed below.\n\nBoeing: Its military rotorcraft serves the U.S. Army, Navy, Marines and Air Force and allied defense forces in more than 20 countries across the globe. Boeing’s Defense, Space & Security segment produces rotorcraft and rotary-wing programs, such as H-47 Chinook, AH-64 Apache, AH-6 Little Bird and V-22 Osprey.\n\nThe company has a long-term (three to five years) earnings growth rate of 21.3%.  The Zacks Consensus Estimate for BA’s third-quarter 2024 sales indicates an improvement of 10.8% from the prior-year quarter’s reported figure.\n\nAirbus Group EADSY: It is one of the world's largest suppliers of advanced military helicopters. EADSY’s product portfolio includes the H135 combat helicopter, the H145M helicopter, AS565 MBe, H160M, H175M, H215M, H225M and a few more.\n\nThe company’s long-term earnings growth rate is 11.4%. The Zacks Consensus Estimate for EADSY’s 2024 sales indicates an improvement of 5.4% from the 2023 reported figure.\n\nTextron TXT: Its business unit, Textron Aviation Defense, designs, builds and supports versatile and globally known military helicopters, preferred for training and attack missions. Some of Textron’s renowned products are the Beechcraft T-6C trainer and the AT-6 Wolverine.\n\nTXT boasts a long-term earnings growth rate of 10.1%. The consensus estimate for TXT’s 2024 sales indicates an improvement of 5.6% from the 2023 reported figure.\n\nPrice Movement\n\nIn the past year, shares of Lockheed have risen 33.3% compared with the industry’s growth of 5.4%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLockheed currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-wins-deal-support-u-132000149.html",
        "symbols": [
            "0BOE.LSE",
            "0KVV.IL",
            "0LF0.LSE",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.034,
            "neu": 0.779,
            "pos": 0.187
        }
    },
    {
        "date": "2024-09-18T10:53:04+00:00",
        "title": "A Look Back at Defense Contractors Stocks’ Q2 Earnings: Lockheed Martin (NYSE:LMT) Vs The Rest Of The Pack",
        "content": "A Look Back at Defense Contractors Stocks’ Q2 Earnings: Lockheed Martin (NYSE:LMT) Vs The Rest Of The Pack\n\nEarnings results often indicate what direction a company will take in the months ahead. With Q2 behind us, let’s have a look at Lockheed Martin (NYSE:LMT) and its peers.\n\nDefense contractors typically require technical expertise and government clearance. Companies in this sector can also enjoy long-term contracts with government bodies, leading to more predictable revenues. Combined, these factors create high barriers to entry and can lead to limited competition. Lately, geopolitical tensions–whether it be Russia’s invasion of Ukraine or China’s aggression towards Taiwan–highlight the need for defense spending. On the other hand, demand for these products can ebb and flow with defense budgets and even who is president, as different administrations can have vastly different ideas of how to allocate federal funds.\n\nThe 15 defense contractors stocks we track reported a very strong Q2. As a group, revenues beat analysts’ consensus estimates by 4.7% while next quarter’s revenue guidance was 6.7% below.\n\nInflation progressed towards the Fed’s 2% goal at the end of 2023, leading to strong stock market performance. On the other hand, 2024 has been a bumpier ride as the market switches between optimism and pessimism around rate cuts and inflation. Thankfully, defense contractors stocks have been resilient with share prices up 7% on average since the latest earnings results.\n\nLockheed Martin (NYSE:LMT)\n\nHeadquartered in Maryland, Famous for the F-35 aircraft, Lockheed Martin (NYSE:LMT) specializes in defense, space, homeland security, and information technology products.\n\nLockheed Martin reported revenues of $18.12 billion, up 8.6% year on year. This print exceeded analysts’ expectations by 6.5%. Overall, it was an exceptional quarter for the company with an impressive beat of analysts’ organic revenue estimates and full-year revenue guidance exceeding analysts’ expectations.\n\n\"Over the past few months, Lockheed Martin's people, systems, and platforms have again demonstrated their ability to enhance security in Eastern Europe, the Red Sea, and the Middle East. From the PAC-3's critical role in air defense, to the Aegis Combat System with AI augmentation, to the F-35 with its advanced sensor and data management capabilities, our company has made major contributions to allied and partner defense.\" said Lockheed Martin Chairman, President and CEO Jim Taiclet. Lockheed Martin Total Revenue\n\nInterestingly, the stock is up 19.9% since reporting and currently trades at $569.15.\n\nIs now the time to buy Lockheed Martin? Access our full analysis of the earnings results here, it’s free.\n\nStory continues\n\nBest Q2: Mercury Systems (NASDAQ:MRCY)\n\nFounded in 1981, Mercury Systems (NASDAQ:MRCY) specializes in providing processing subsystems and components for primarily defense applications.\n\nMercury Systems reported revenues of $248.6 million, down 1.8% year on year, outperforming analysts’ expectations by 7.8%. The business had an incredible quarter with an impressive beat of analysts’ organic revenue and earnings estimates. Mercury Systems Total Revenue\n\nThe market seems happy with the results as the stock is up 8.4% since reporting. It currently trades at $36.85.\n\nIs now the time to buy Mercury Systems? Access our full analysis of the earnings results here, it’s free.\n\nWeakest Q2: General Dynamics (NYSE:GD)\n\nCreator of the famous M1 Abrahms tank, General Dynamics (NYSE:GD) develops aerospace, marine systems, combat systems, and information technology products.\n\nGeneral Dynamics reported revenues of $11.98 billion, up 18% year on year, exceeding analysts’ expectations by 4.1%. Still, it was a slower quarter as it posted a miss of analysts’ backlog sales estimates.\n\nInterestingly, the stock is up 3.1% since the results and currently trades at $303.53.\n\nRead our full analysis of General Dynamics’s results here.\n\nLeonardo DRS (NASDAQ:DRS)\n\nDeveloping submarine detection systems for the U.S. Navy, Leonardo DRS (NASDAQ:DRS) is a provider of defense systems, electronics, and military support services.\n\nLeonardo DRS reported revenues of $753 million, up 19.9% year on year. This print surpassed analysts’ expectations by 10.7%. Overall, it was an incredible quarter as it also recorded an impressive beat of analysts’ earnings and operating margin estimates.\n\nLeonardo DRS achieved the biggest analyst estimates beat among its peers. The stock is down 2.1% since reporting and currently trades at $27.59.\n\nRead our full, actionable report on Leonardo DRS here, it’s free.\n\nParsons (NYSE:PSN)\n\nDelivering aerospace technology during the Cold War-era, Parsons (NYSE:PSN) offers engineering, construction, and cybersecurity solutions for the infrastructure and defense sectors.\n\nParsons reported revenues of $1.67 billion, up 23.1% year on year. This result beat analysts’ expectations by 8.2%. It was a strong quarter as it also produced an impressive beat of analysts’ operating margin and earnings estimates. On the other hand, its backlog missed.\n\nParsons delivered the highest full-year guidance raise among its peers. The stock is up 27.1% since reporting and currently trades at $98.10.\n\nRead our full, actionable report on Parsons here, it’s free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/look-back-defense-contractors-stocks-105304339.html",
        "symbols": [
            "0IUC.LSE",
            "0R3E.LSE",
            "2VZ.F",
            "59P.F",
            "59P.STU",
            "DRS.US",
            "GD.MX",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.027,
            "neu": 0.832,
            "pos": 0.141
        }
    }
]