[
    {
        "date": "2024-06-28T22:01:21+00:00",
        "title": "US army awards Lockheed Martin $4.5 billion multi-year Patriot Missiles contract",
        "content": "(Reuters) - The U.S. Army awarded Lockheed Martin a multi-year contract worth $4.5 billion for its Patriot Missiles system, the Pentagon said on Friday.\n\n(Reporting by Nathan Gomes in Bengaluru; Editing by Shinjini Ganguli)\n\nView comments",
        "link": "https://finance.yahoo.com/news/us-army-awards-lockheed-martin-220121103.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.557,
            "neg": 0,
            "neu": 0.874,
            "pos": 0.126
        }
    },
    {
        "date": "2024-06-28T21:50:20+00:00",
        "title": "Lockheed Martin (LMT) Stock Moves -0.01%: What You Should Know",
        "content": "Lockheed Martin (LMT) ended the recent trading session at $467.10, demonstrating a -0.01% swing from the preceding day's closing price. The stock's change was more than the S&P 500's daily loss of 0.41%. Meanwhile, the Dow experienced a drop of 0.12%, and the technology-dominated Nasdaq saw a decrease of 0.71%.\n\nThe aerospace and defense company's stock has climbed by 1.34% in the past month, exceeding the Aerospace sector's loss of 1.78% and lagging the S&P 500's gain of 3.53%.\n\nMarket participants will be closely following the financial results of Lockheed Martin in its upcoming release. In that report, analysts expect Lockheed Martin to post earnings of $6.45 per share. This would mark a year-over-year decline of 4.16%. At the same time, our most recent consensus estimate is projecting a revenue of $17.03 billion, reflecting a 2.04% rise from the equivalent quarter last year.\n\nLooking at the full year, the Zacks Consensus Estimates suggest analysts are expecting earnings of $26.26 per share and revenue of $69.72 billion. These totals would mark changes of -5.61% and +3.18%, respectively, from last year.\n\nAny recent changes to analyst estimates for Lockheed Martin should also be noted by investors. Such recent modifications usually signify the changing landscape of near-term business trends. Consequently, upward revisions in estimates express analysts' positivity towards the company's business operations and its ability to generate profits.\n\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.\n\nThe Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed an unchanged state. Right now, Lockheed Martin possesses a Zacks Rank of #3 (Hold).\n\nFrom a valuation perspective, Lockheed Martin is currently exchanging hands at a Forward P/E ratio of 17.79. This expresses a discount compared to the average Forward P/E of 18.06 of its industry.\n\nMeanwhile, LMT's PEG ratio is currently 4.38. The PEG ratio bears resemblance to the frequently used P/E ratio, but this parameter also includes the company's expected earnings growth trajectory. LMT's industry had an average PEG ratio of 1.72 as of yesterday's close.\n\nStory continues\n\nThe Aerospace - Defense industry is part of the Aerospace sector. Currently, this industry holds a Zacks Industry Rank of 94, positioning it in the top 38% of all 250+ industries.\n\nThe strength of our individual industry groups is measured by the Zacks Industry Rank, which is calculated based on the average Zacks Rank of the individual stocks within these groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nRemember to apply Zacks.com to follow these and more stock-moving metrics during the upcoming trading sessions.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-stock-moves-215020468.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.987,
            "neg": 0.011,
            "neu": 0.91,
            "pos": 0.078
        }
    },
    {
        "date": "2024-06-28T18:00:00+00:00",
        "title": "7 Quiet Blue-Chip Stocks on the Verge of a Big Breakout Rally",
        "content": "In a portfolio, it’s generally growth stocks that grab the limelight. Being high-beta stocks, the price action keeps investors on the edge. However, blue-chip stocks are the silent performers besides acting as a fortress for the portfolio against extreme volatility.\n\nAt the same time, there are phases where blue-chip stocks go ballistic. Before the recent bull run, Nvidia (NASDAQ:NVDA) was subdued for an extended period. However, the stock’s rally in the last 18 months has compensated for the price and time correction.\n\nThe market keeps providing opportunities, and I see multiple subdued blue-chip stocks poised to break out. It’s not necessary for the stocks discussed to rally like NVDA. However, I can say with some conviction that these blue-chip stocks can outperform index returns in the next three to five years.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nLet’s discuss the business factors that make these blue-chip ideas worth considering.\n\nLockheed Martin (LMT) Lockheed Martin (LMT) M142 High Mobility Artillery Rocket System (HIMARS).3D illustration.\n\nSource: Mike Mareen / Shutterstock.com\n\nLast year, global defense spending touched record highs of $2.44 trillion. With rising geopolitical tensions, defense spending will likely continue to increase. Amidst positive industry tailwinds, Lockheed Martin (NYSE:LMT) stock remained sideways in the last 12 months. This is a good accumulation opportunity with the defense blue-chip trading at an attractive forward price-to-earnings ratio of 18x. Further, the blue-chip defense stock offers an attractive dividend yield of 2.7%.\n\nFrom a business perspective, Lockheed reported an order backlog of $159 billion as of the first quarter. A strong backlog offers clear revenue and cash flow visibility. It’s also likely that the backlog will continue to swell, translating into revenue growth acceleration. Further, as Lockheed invests in next-generation defense technologies, top-line growth will be supported.\n\nLockheed also has robust cash flow visibility. For the current year, the defense major has guided for free cash flow of $6.2 billion (mid-range). Healthy FCF will ensure steady dividend growth and value creation through share repurchase.\n\nNewmont (NEM)\n\nSource: Grey82/Shutterstock.com\n\nNewmont (NYSE:NEM) is another high-quality blue-chip stock that remained sideways in the last 12 months. A forward P/E of 15.7x looks attractive and the gold miner offers a dividend yield of 2.4%.\n\nOne potential catalyst for NEM stock trending higher is expansionary monetary policies. I expect the Fed to make its first rate cut before Election Day. A potentially weak dollar is likely to translate into further upside for gold. With the benefit of higher realized prices, NEM stock trend is likely to turn bullish.\n\nStory continues\n\nFrom a business fundamental perspective, Newmont has 128 and 155 million ounces in gold reserves and resources, respectively. Besides a strong asset base, the gold miner has an investment-grade balance sheet with a robust liquidity buffer.\n\nFurther, Newmont reported operating cash flow of $776 million for the first quarter. Considering the upside in realized gold price, it’s likely that the annual operating cash flow will be more than $3.5 billion. This provides Newmont with ample headroom for aggressive investments, dividends and share repurchases.\n\nMerck (MRK) Merck (MRK) logo outside of corporate building\n\nSource: Atmosphere1 / Shutterstock.com\n\nHolding one or a few pharmaceutical stocks in the portfolio is always a good idea. The sector is immune to economic shocks, and pharmaceutical stocks have a significantly low beta. Merck (NYSE:MRK) is among the attractively valued names to consider at a forward P/E of 15.4x. MRK stock also offers a generous dividend yield of 2.3%.\n\nPharma stocks have been relatively subdued since the pandemic. With the global disease burden on the rise, this presents a good buying opportunity. Specific to Merck, a strong pipeline of drugs provides clear growth visibility. Currently, 80 programs are in Phase 2, and 30 candidates are in Phase 3 testing.\n\nThe pipeline is currently diversified, but the oncology segment is likely to be the key growth driver. Merck expects that the oncology pipeline will translate into $20 billion in incremental sales by the mid-2030s.\n\nFor the first quarter, Merck reported healthy sales growth of 9% on a year-on-year basis to $15.8 billion. For the same period, the GAAP earnings per share surged by 68% to $1.87. Based on the guidance, healthy numbers will continue to flow, and MRK stock is likely to trend higher.\n\nChevron (CVX) a Chevron (CVX) gas station\n\nSource: Trong Nguyen / Shutterstock.com\n\nOil has been subdued due to macroeconomic headwinds, which has translated into weakness in oil and gas exploration stocks. With rate cuts impending to drive growth, it’s likely that oil will trend higher. It’s, therefore, a good time to accumulate quality energy stocks. Chevron (NYSE:CVX) remained sideways in the last few quarters and looks undervalued. The 4.1% dividend yield stock is poised for a breakout rally relatively soon.\n\nA key reason to like Chevron is that the business is a cash flow machine. Last year, Chevron reported operating cash flow of $35.6 billion. If oil trends higher, it’s likely that the annual operating cash flow potential will be more than $40 billion. This will provide Chevron with ample flexibility for aggressive investments and dividend growth.\n\nWith an investment-grade balance sheet, Chevron has also pursued inorganic growth. Acquiring Hess (NYSE:HES) will boost production growth and the overall cash flow potential. Overall, with low break-even assets and strong fundamentals, CVX stock is likely to be a long-term value creator.\n\nAT&T (T) AT&T Retail cell phone and mobility store. T stock\n\nSource: Jonathan Weiss / Shutterstock.com\n\nAT&T (NYSE:T) is possibly among the most undervalued blue-chip stocks. Even after a 20% rally in the last 12 months, T stock trades at a forward P/E of 8.5x. Further, the communication services stock offers a robust dividend yield of 5.9%.\n\nA key challenge for AT&T has been a highly leveraged balance sheet. However, the company has focused on deleveraging, and the outcome has been positive. AT&T is on track to achieve a net-debt-to-adjusted-EBITDA of 2.5x in the first half of 2025.\n\nFor the current year, the company expects to report free cash flow of $17 to $18 billion. With positive business metrics, it’s likely that FCF will continue to swell. This will support deleveraging, besides providing flexibility for dividends.\n\nMy view on higher FCF is also supported by the fact that the average revenue per user has been in an uptrend. As 5G adoption increases, the average revenue per user will likely remain healthy.\n\nVale (VALE) the Vale logo displayed on a mobile phone with the company's webpage in the background\n\nSource: rafapress / Shutterstock.com\n\nIndustrial commodities are among the most undervalued asset classes. With expansionary policies on the cards, it’s a good time to bet on blue-chip commodity stocks. Vale (NYSE:VALE) stock trades at a significant valuation gap at a forward P/E of 4.9x. I expect healthy returns from the stock in the next 24 to 36 months.\n\nFor the first quarter, Vale reported iron ore sales increase of 15% from a year ago to 8.2 metric tons. The mining company recorded highest quarterly iron ore production since 2019. For the same period, copper sales increased by 22% to 14.1 kilotons.\n\nWith operational improvements, sales have increased, and Vale reported an adjusted EBITDA of $3.5 billion for the quarter. Further, free cash flow was $2 billion, even with relatively depressed commodity prices. I expect annual FCF to be more than $10 billion if commodities trend higher on expansionary policies.\n\nOverall, Vale has navigated challenging times with a healthy balance sheet. With operational improvements and the potential for an upside in commodity prices, VALE stock will likely surge higher.\n\nAltria (MO) Altria office sign in Virginia capital city tobacco business closeup by road street\n\nSource: Kristi Blokhin / Shutterstock.com\n\nAltria Group (NYSE:MO) stock experienced price correction in the last five years. MO stock trades at a forward P/E of 9x and offers a dividend yield of 8.4%. I believe the consumer staples stock will likely breakout on the upside.\n\nThere are two reasons for an extended time correction in the stock. First, regulatory headwinds have impacted growth in vaping and e-cigarette products.\n\nFurther, Altria is in a phase of business transformation towards the non-smoking category. This has translated into margin revenue de-growth. Having said that, the smokable segment continues to be a cash flow driver.\n\nAltria subsidiary Njoy received authorization from the Food and Drug Administration for its menthol e-vapor products. This is the only menthol e-vapor product authorized by the FDA. The brand has already broadened its distribution to over 80,000 stores.\n\nThe authorization is likely to support growth. At the same time, Altria has been gaining market share in the oral tobacco category. Therefore, the business transformation efforts yield results, and it’s a matter of time before MO stock surges.\n\nOn the date of publication, Faisal Humayun did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nFaisal Humayun is a senior research analyst with 12 years of industry experience in the field of credit research, equity research and financial modeling. Faisal has authored over 1,500 stock specific articles with focus on the technology, energy and commodities sector.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 7 Quiet Blue-Chip Stocks on the Verge of a Big Breakout Rally appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/7-quiet-blue-chip-stocks-180000574.html",
        "symbols": [
            "0QAH.IL",
            "0R3E.LSE",
            "6MK.BE",
            "6MK.DU",
            "6MK.F",
            "6MK.HM",
            "6MK.STU",
            "6MK.XETRA",
            "CVLB.F",
            "CVLB.STU",
            "CVLC.F",
            "CVX.US",
            "HES.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.016,
            "neu": 0.84,
            "pos": 0.143
        }
    },
    {
        "date": "2024-06-28T10:00:00+00:00",
        "title": "7 Defense Stocks to Buy Amid Peace Summit Tensions",
        "content": "Although labeled as the peace summit, an international call for an end to Russia’s invasion of Ukraine effectively did little more than harden ideological lines. While a great many support a roadmap to peace that encompasses Ukraine’s territorial integrity, key players – namely Russia and China, along with a few others – believe differently. What can be said is that defense stocks to buy present a cynically positive framework.\n\nUnless the Russians agree to pull back their troops – something that Moscow has demonstrated zero intention of doing without receiving what Ukraine considers unacceptable concessions – and return to internationally recognized borders, the conflict will likely continue. At this point, then, the U.S. and its allies have little to do except to bolster their military capabilities.\n\nFrankly, the conflict may come down to who is going to blink first. For the U.S. to keep its superpower reputation intact, it just can’t blink at all.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nWhat makes defense stocks to buy even more compelling is that no matter who’s president next, foreign policy will likely play a huge role in any administration. Being the long superpower affords the U.S. with great economic advantages that can be lost if that power is shared with other nations. While it’s a controversial topic, it’s time to consider these defense plays.\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) Space Systems sign in Sunnyvale, California.\n\nSource: Ken Wolter / Shutterstock.com\n\nLockheed Martin (NYSE:LMT) is one of the biggest names in defense stocks to buy. Fundamentally, the company is important for its ability to project power. Thanks to its massive aerospace division, U.S. forces and allies maintain air superiority across vast regions of the world. Of course, Lockheed is vital in myriad other areas. However, the ability to respond to saber rattling has never been more important.\n\nFinancially, LMT stock doesn’t offer the most exciting profile, I’m just keeping it real. However, it benefits from consistency. Between the second quarter of last year to Q1 2024, the company’s average earnings per share hit nearly $6.91. This print translated to an average earnings surprise of 5.5%.\n\nDuring the trailing 12 months (TTM), Lockheed posted net income of $6.78 billion or earnings of $27.34 per share. Revenue in the period reached $69.64 billion. The latest quarterly sales rate (year-over-year) landed at 13.7%.\n\nFor fiscal 2024, covering experts anticipate a slight dip in EPS to $26.27. However, revenue could rise by 3.2% to $69.76 billion. Further, it offers a forward yield of 2.69%. Again, LMT isn’t exciting but it’s one of the top defense stocks to buy.\n\nStory continues\n\nNorthrop Grumman (NOC) Northrop Grumman (NOC) logo on a corporate building\n\nSource: Kristi Blokhin / Shutterstock.com\n\nAnother revered (and feared) name among defense stocks to buy, Northrop Grumman (NYSE:NOC) makes a strong case for inclusion in your portfolio. Frankly, tensions in Europe are only going to rise unless the Russians encounter a catastrophic battlefield defeat. In the meantime, China consistently presents an adversarial presence. Essentially, Northrop’s myriad weapons systems keeps honest people honest.\n\nFinancially, Northrop occupies similar ground to Lockheed Martin. Neither company is particularly riveting from an investment standpoint. However, Northrop – like its rival – is consistent. During the past four quarters, it posted EPS of $6.03. This print translated to an earnings surprise of just under 6%.\n\nDuring the TTM period, Northrop posted net income of $2.16 billion or $14.35 per share. In the cycle, revenue reached $40.12 billion. Further, the company’s most recent quarterly sales growth rate hit 8.9%. For fiscal 2024, experts believe EPS may rise 6.35% to land at $24.77. On the top line, sales could rise 4.6% to reach $41.11 billion.\n\nLastly, Northrop offers a forward dividend yield of 1.92%. It’s a solid idea if you’re looking for a stable candidate among defense stocks to buy.\n\nRTX (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nFormerly known as Raytheon Technologies, RTX (NYSE:RTX) is a key player within the aerospace and defense sector. Per its public profile, RTX provides systems and services for commercial, military and government customers. It’s easily one of the top defense stocks to buy thanks to its weapons systems, especially its interceptor missiles.\n\nRaytheon of course plays a major role in responding to saber rattling. However, it’s also important to back up the tough talk: Raytheon does a lot of backing up, let’s put it that way. Even better, RTX stock isn’t all doom, gloom and boom. In the past four quarters, the underlying company’s EPS landed at roughly $1.27. This print translated to an earnings surprise of 6.45%.\n\nIn the TTM period, RTX posted net income of $3.48 billion or $2.54 per share. Moreover, revenue in the cycle hit $71.01 billion. The latest quarterly sales growth rate stands at 12.1%. For fiscal 2024, analysts see EPS rising by 6.3% to hit $5.38. On the top line, revenue may clock in at $79.07 billion, up 6.4% from last year.\n\nRTX offers a decent forward yield of 2.48% for those on the fence.\n\nHuntington Ingalls Industries (HII) Person holding smartphone with logo of US company Huntington Ingalls Industries Inc (HII) on screen in front of website Focus on phone display\n\nSource: Wirestock Creators / Shutterstock.com\n\nOne of the distinct plays among defense stocks to buy, Huntington Ingalls Industries (NYSE:HII) designs and builds military ships. It’s also responsible for their overhauling and repairs. This business will be increasingly significant, not only from a capacity perspective but also as a projection of power. Unlike the Russians, the U.S. commands a dominant naval force.\n\nFurther, with tensions rising with China, both the current and future administrations can’t afford to show weakness. The U.S. Navy will be called upon to demonstrate the nation’s broader military supremacy. Therefore, I see a huge demand influx for HII stock. So far, the financials bear this out. During the past four quarters, the average earnings surprise came out to a robust 21.03%.\n\nIn the TTM period, Huntington posted net income of $705 million, translating to $17.71 per share. Revenue in this cycle reached $11.59 billion. The most recent quarterly sales growth rate comes in at 4.9%. For fiscal 2024, experts see a slight dip in EPS to $16.56. However, the top line may rise modestly to $11.72 billion from last year’s $11.45 billion.\n\nHuntington also offers a forward yield of 2.07%. While you might not get rich with HII, it’s one of the most relevant defense stocks to buy.\n\nAeroVironment (AVAV) The logo for AeroVironment (AVAV) is seen through a magnifying glass on the company's website.\n\nSource: Pavel Kapysh / Shutterstock.com\n\nA higher-risk, higher-reward idea within the aerospace and defense sector, AeroVironment (NASDAQ:AVAV) flew to fame with its self-destruct zones. Essentially, military operators can hide behind cover while directly an unmanned drone. Should a target be cited, an operator can deliberately crash into it, with the aim of destruction or disablement.\n\nDrone warfare represented one of the key takeaways in the conflict in Ukraine. I’d imagine that future conflicts will involve the same, meaning that AeroVironment may cynically benefit from increased demand. It hasn’t always been the most consistent financial performer, with the company missing in its fiscal Q1 2023 report. However, during the past four quarters, its average earnings surprise clocked in at 107.5%.\n\nDuring the TTM period, AeroVironment posted a net loss of $106.85 million or $4.44 per share in the red. However, sales hit $705.78 million. Further, the most recent sales growth rate soared to 38.8%.\n\nFor fiscal 2024, analysts anticipate a big jump in EPS to $2.81. Also, revenue may reach $708.15 million, a 31% increase from last year. It’s one of the enticing defense stocks to buy.\n\nBoeing (BA) Royal Air Force Boeing (BA) Chinook HC2A (352) [ZH895] lifting off from runway\n\nSource: InsectWorld / Shutterstock.com\n\nAerospace giant Boeing (NYSE:BA) presents a controversial narrative, not just for the underlying relevance to defense stocks to buy but also because of troubles in its civilian unit. Without going into all the details, Boeing for the last few years has struggled due to safety concerns associated with its jetliners. That’s the kind of stuff that happens when doors blow off airplanes.\n\nIt appears that the controversies have weighed on the firm’s financials. In the past four quarters, Boeing incurred an average loss per share of $1.33. In fairness, the red ink came in at a lesser degree than experts anticipated. Therefore, the average quarterly surprise came out to 18.08%. Still, BA stock is down heavily on a year-to-date basis.\n\nIn the TTM period, Boeing suffered a net loss of $2.15 billion or $3.54 per share. Sales in the period landed at $76.44 billion. For fiscal 2024, analysts expect a major improvement to a loss of $1.36. Last year, the company posted a loss of $5.81 per share.\n\nOn the top line, sales may dip 5.4% to $73.58 billion. Still, a recovery could materialize in fiscal 2025, with sales projected to rise to $88.36 billion.\n\nBlacksky Technology (BKSY) futuristic image of earth from space to represent aerospace stocks\n\nIf you want to roll the dice with your defense stocks to buy, Blacksky Technology (NYSE:BKSY) might be an enticing prospect. For all intents and purposes, when you consider the lowly share price and the nothing-burger market capitalization, Blacksky is a penny stock. However, it’s part of the burgeoning geospatial intelligence ecosystem. Therefore, it could play a huge role in critical data collection.\n\nUnderstanding where enemy positions are located along with potential areas of movement will offer military operators a potentially pivotal advantage. Therefore, BKSY stock could reasonably see a demand influx if more people recognize the opportunity. For now, it’s a hit-or-miss affair financially. Still, it must be said that in terms of mitigating expected losses per share, Blacksky posted a quarterly surprise of 11.45% between Q2 2023 and Q1 2024.\n\nDuring the TTM period, the company incurred a net loss of $52.35 million or 37 cents per share. Revenue in the period hit $100.33 million. For fiscal 2024, experts believe Blacksky will post a loss per share of 34 cents, an improvement from last year’s 39 cents in the red.\n\nRevenue may land at $108.94 million, up 15.3%. Further, fiscal 2025 sales could soar to $138.54 million, up 27.2%.\n\nOn the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nA former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 7 Defense Stocks to Buy Amid Peace Summit Tensions appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/7-defense-stocks-buy-amid-100000269.html",
        "symbols": [
            "0J76.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "AVAV.US",
            "BA.US",
            "BKSY.US",
            "HI4.F",
            "HI4.STU",
            "HII.US",
            "JPX.BE",
            "JPX.F",
            "JPX.STU",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.07,
            "neu": 0.797,
            "pos": 0.133
        }
    },
    {
        "date": "2024-06-28T10:00:00+00:00",
        "title": "You’ve Been Warned! 3 Space Stocks to Buy Now or Regret Forever.",
        "content": "As the race to space heats up, the top space stocks to buy are delivering high returns.\n\nIn the last few years, the commercialization of space has reached new highs with governments investing heavily in commercial space assets. Exploring all that space has to offer is becoming more common than ever before. And it has some envisioning the possibility of life on Mars!\n\nGiven the increased interest in space travel, companies leading the charge are experiencing explosive growth. This has served as a boon for investors looking to capitalize on returns beyond earth’s orbit.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nThe potential of the space industry is undeniable. According to McKinsey and Company, the space economy will be worth a whopping $1.8 trillion by 2035. That number is up significantly from $630 billion in 2023. This growth will be driven by demand for positioning and navigation services, satellite connectivity and insights powered by AI.\n\nAs one of the most promising sectors in 2024, space stocks are an attractive investment option for those seeking out of this world returns.\n\nVirgin Galactic Holdings (SPCE) spce stock\n\nSource: rafapress / Shutterstock.com\n\nOnce a fever dream, commercial space travel is now a reality, thanks to companies like Virgin Galactic Holdings (NYSE:SPCE). It stands in contrast to traditional space travel which typically involves launching satellites and drones into space. Yet, SPCE is operating fully manned passenger flights beyond the earth’s orbit. Virgin Galactic Holdings successfully launched its seventh crewed suborbital spaceflight on June 8th. It sent a crew of six on the VSS Unity Space flight.\n\nAnd if fully operational space travel isn’t reason enough to invest in SPCE, the financials are not too shabby either. In its previous quarter, operating expenses came in lower at $164 million compared to $113 million in 2023. This is an impressive feat, given that space travel is a pricey endeavor.\n\nA second metric worth looking at is the backlog. Virgin Galactic Holdings’ space flights currently have a 800 person waitlist. Four passengers a flight at $600,000 a ticket translates into a lot of revenue in the pipeline.\n\nNow the company did lose money this year. But the losses were lower year-over-year (YOY). Moreover, given that space travel is a growing business with massive potential, Virgin Galactic Holdings remains one of the best space stocks to buy.\n\nLockheedMartin (LMT) Close top view of a Lockheed Martin (LMT) F-35C Lightning II with afterburner on\n\nSource: ranchorunner / Shutterstock.com\n\nThe rise in defense spending amidst geopolitical tensions has been a huge tailwind for Lockheed Martin (NYSE:LMT). It’s a leader in the defense sector with several highly-advanced jets, aircraft and weapon systems to its name. LMT stock gives plenty of reasons for investors to get behind its name. However, given that this is a story about space stocks, it’s worth exploring the company’s developments beyond earth’s orbit.\n\nStory continues\n\nRecently, the Lockheed Martin Space business has seen plenty of action. Last week the Pentagon announced that Lockheed was awarded a $997.5 million contract extension for the continued development and testing of missile warning satellites. This brings the total value of the project to $8.2 billion. In other news, NASA selected Lockheed Martin to build a next-gen spacecraft for the National Oceanic and Atmospheric Administration (NOAA). The total value of the contract is approximately $2.27 billion.\n\nAnd, while the future prospects of its space business remain optimistically bright, performance in the previous quarter was just as impressive. Revenue in the Lockheed Space sector came in at $3.3 billion, up from the same period last year. Additionally, operating profits were up by 16% with a $33 billion backlog.\n\nWith a steady stream of contract wins and strong financial performance, LMT is undoubtedly one of the top space stocks to buy right now.\n\nRocket Lab USA (RKLB) Person holding smartphone with logo of aerospace company Rocket Lab USA Inc. (RKLB) on screen in front of website. Focus on phone display. Unmodified photo.\n\nSource: T. Schneider / Shutterstock.com\n\nSpaceX may dominate the rocket industry but Rocket Lab USA (NASDAQ:RKLB) isn’t too far behind. In its first quarter, the company successfully launched four rockets into space and saw its revenue rise by 69%  YOY.\n\nAnd after inking two new deals, RKLB is giving investors more reasons to celebrate this stock. Earlier this month, the company signed its largest deal with the Japanese earth observation company, Synspective. It is scheduled to launch 10 Electron rockets as part of the contract.\n\nThis news comes right after Rocket Lab USA’s deal with the French-based company Kineis to set up IoT satellites across the globe. The contract will include 25 satellites that will be launched over eight months through 2025. Needless to say, Rocket Lab USA is at the top of its game.\n\nWhen considering smaller companies as potential investment opportunities, the pipeline strength is perhaps the best indicator of long-term growth. Rocket Lab USA’s high-value contracts suggest plenty of upside in the long-haul.\n\nShare prices have wavered on profitability concerns in recent months. But as the company delivers on its contracts, this remains one of the best space stocks to buy this year.\n\nOn the date of publication, Divya Premkumar did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nDivya has a background in finance and accounting and has worked in FP&A roles at Fortune 500 companies. She is an avid reader and enjoys writing on a variety of topics including stocks, crypto, blockchain and global policy.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post You’ve Been Warned! 3 Space Stocks to Buy Now or Regret Forever. appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/ve-warned-3-space-stocks-100000262.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RKLB.US",
            "SPCE.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.02,
            "neu": 0.866,
            "pos": 0.114
        }
    },
    {
        "date": "2024-06-28T10:00:00+00:00",
        "title": "Treasure Hunt: 3 Metaverse Stocks Wall Street Hasn’t Discovered Yet",
        "content": "After a couple of rough years during which the sector underwent extensive restructuring, smart investors are once again paying attention to metaverse stocks.\n\nDue to higher spending and focus on AI, investors tend to ignore the metaverse, but the market is too substantial to ignore, expected to be worth about $116.74 billion in 2024 and $669.96 billion by 2029, growing at a rate of 41.83% per year. McKinsey & Companyestimates a $5 trillion metaverse economy by 2030.\n\nPart of the allure of metaverse stocks is that the concept has several use cases; for example, the U.S. military and government are studying metaverse applications, including augmented reality training simulations.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nAt the same time, for companies, the metaverse concept is still relevant post-pandemic, considering the secular growth in the work-from-home trend; roughly 12.7% of full-time employees globally work from home and more remote work means the metaverse can be crucial to future workflow management.\n\nHowever, since this is still a developing sector, it’s best to select metaverse stocks with solid analyst ratings, healthy financials, diversified portfolios, and healthy upside potential.\n\nNVIDIA (NVDA) Nvidia corporation logo displayed on smartphone with stock market chart background. Nvidia is a global leader in artificial intelligence hardware. NVDA stock\n\nSource: Evolf / Shutterstock.com\n\nNVIDIA (NASDAQ:NVDA) is a pick-and-shovel play for those interested in purchasing metaverse stocks, commanding a dominant 88% market share in the discrete GPU market.\n\nNVDA powers virtual and augmented reality, and its diverse operating model gives investors peace of mind; NVDA is a “strong buy” stock with a 25% upside.\n\nBesides the hardware Nvidia is offering, Nvidia’s Omniverse software helps create and test virtual environments in real-time. Recent Blender and Adobe integrations provide Omniverse’s functionality to millions more users. Blender supports USD, and Adobe’s Substance 3D simplifies material changes.\n\nNVIDIA has also teamed up with several big names to promote metaverse technology. For instance, Lockheed Martin (NYSE:LMT) practices wildfire response using Omniverse. Omniverse helps SHoP Architectscollaborate on building plans in real-time and create gorgeous visualizations.\n\nIn addition, NVIDIA leads neural graphics, which blend AI with traditional images to speed up and improve virtual environments. Instant NeRF and other breakthroughs convert 2D images into 3D scenes, speeding up metaverse material creation.​\n\nUltimately, due to its speed and low power consumption, RTX technology is easier for design, visualization, and AI-accelerated tool professionals. For example, the RTX 4000 SFF GPU from NVIDIA lets AR and VR apps draw and visualize at unparalleled speeds for compact computers, giving investors an additional point to invest.\n\nStory continues\n\nRoblox (RBLX) A smartphone displaying a web page for Roblox Corp (RBLX).\n\nSource: Koshiro K / Shutterstock.com\n\nRoblox’s (NYSE:RBLX) new creator roadmap covers ways to make creating simpler and more immersive, containing new features and capabilities to improve platform development and user experience, making it a good pick among metaverse stocks, with a 15% potential upside.\n\nIn addition, Roblox released its Q1 2024 financial figures, which showed that its sales rose 22% year-over-year to $801.3 million. There were 19% more bookings, for a total of $923.8 million. Roblox recorded a net loss of $270.6 million, which is a little more than the same time last year, even though sales went up. However, the results mark the third time in a row RBLX went past Wall Street estimates, displaying post-pandemic robustness.\n\nIn addition, Ikearecently announced a new concept for employing virtual workers in its Roblox metaverse shop. In “The Co-Worker Game,” virtual laborers work in the café and showroom. London online jobs cost £13.15 per hour. This method aims to engage younger people and provide them with a digital shopping experience.\n\nThe NHL has also digitally constructed the 2024 All-Star Game in Roblox, the first major sports league to do so. Fans may engage with the game in a 3D virtual environment, improving the viewing experience and attracting more fans to the sport and Roblox.\n\nMicrosoft (MSFT) Wide angle view of a Microsoft sign at the headquarters for personal computer and cloud computing company, with office building in the background.. MSFT stock\n\nSource: VDB Photos / Shutterstock.com\n\nThrough its AI Cloud Partner Program, Microsoft (NASDAQ:MSFT) puts the industrial metaverse first. This project makes AI and engaging tools for business use better, with the Internet of Things, AI, mixed reality, and digital twins serving as important components. Solutions for the office include Dynamics 365, Azure Digital Twins, and HoloLens 2.\n\nAlso, Microsoft Dynamics 365 Guides uses creative AI to give real-time, relevant, and 3D help to support staff. This mix of advanced training and job management makes operations safer and more efficient.\n\nAnother thing that Microsoft and Meta did was make Mesh for Microsoft Teams work with Meta Quest tablets. People who use VR headsets can record conversations and work together. Microsoft 365 will make Meta Quest VR easier to use.\n\nAdditionally, Qualcomm (NASDAQ:QCOM), Magic Leap, and Microsoft are working on MRTK3, a platform that will help partners and users make MR systems better.\n\nAzure is a key part of Microsoft’s plan for a metaverse. IoT, Azure Digital Twins, and Maps are all used to automate and improve how businesses work. MR glasses let Mesh for Teams users work together virtually. This service links real and virtual computers to make working from home easier.\n\nOn the date of publication, Faizan Farooque did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nFaizan Farooque is a contributing author for InvestorPlace.com and numerous other financial sites. Faizan has several years of experience in analyzing the stock market and was a former data journalist at S&P Global Market Intelligence. His passion is to help the average investor make more informed decisions regarding their portfolio.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post Treasure Hunt: 3 Metaverse Stocks Wall Street Hasn’t Discovered Yet appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/treasure-hunt-3-metaverse-stocks-100000357.html",
        "symbols": [
            "LMT.US",
            "MSFT.US",
            "NVDA.US",
            "QCOM.US",
            "R2BL34.SA",
            "RBLX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.009,
            "neu": 0.832,
            "pos": 0.159
        }
    },
    {
        "date": "2024-06-28T08:43:11+00:00",
        "title": "Reflecting On Defense Contractors Stocks’ Q1 Earnings: AeroVironment (NASDAQ:AVAV)",
        "content": "Reflecting On Defense Contractors Stocks’ Q1 Earnings: AeroVironment (NASDAQ:AVAV)\n\nEarnings results often indicate what direction a company will take in the months ahead. With Q1 now behind us, let’s have a look at AeroVironment (NASDAQ:AVAV) and its peers.\n\nDefense contractors typically require technical expertise and government clearance. Companies in this sector can also enjoy long-term contracts with government bodies, leading to more predictable revenues. Combined, these factors create high barriers to entry and can lead to limited competition. Lately, geopolitical tensions–whether it be Russia’s invasion of Ukraine or China’s aggression towards Taiwan–highlight the need for defense spending. On the other hand, demand for these products can ebb and flow with defense budgets and even who is president, as different administrations can have vastly different ideas of how to allocate federal funds.\n\nThe 14 defense contractors stocks we track reported a strong Q1; on average, revenues beat analyst consensus estimates by 3.2%. while next quarter's revenue guidance was 0.7% above consensus. Inflation progressed towards the Fed's 2% goal at the end of 2023, leading to strong stock market performance. The start of 2024 has been a bumpier ride, as the market switches between optimism and pessimism around rate cuts due to mixed inflation data, and while some of the defense contractors stocks have fared somewhat better than others, they collectively declined, with share prices falling 0.5% on average since the previous earnings results.\n\nAeroVironment (NASDAQ:AVAV)\n\nFocused on the future of autonomous military combat, AeroVironment (NASDAQGS:AVAV) specializes in advanced unmanned aircraft systems and electric vehicle charging solutions.\n\nAeroVironment reported revenues of $197 million, up 5.9% year on year, topping analysts' expectations by 4.2%. It was a strong quarter for the company, with an impressive beat of analysts' revenue and earnings estimates. AeroVironment Total Revenue\n\nThe stock is down 6.7% since the results and currently trades at $180.\n\nIs now the time to buy AeroVironment? Access our full analysis of the earnings results here, it's free.\n\nBest Q1: Northrop Grumman (NYSE:NOC)\n\nResponsible for the development of the first stealth bomber, Northrop Grumman (NYSE:NOC) specializes in providing aerospace, defense, and security solutions for various industry applications.\n\nNorthrop Grumman reported revenues of $10.13 billion, up 8.9% year on year, outperforming analysts' expectations by 3.8%. It was a stunning quarter for the company, with an impressive beat of analysts' organic revenue and EPS estimates.\n\nStory continues Northrop Grumman Total Revenue\n\nThe stock is down 8.3% since the results and currently trades at $434.99.\n\nIs now the time to buy Northrop Grumman? Access our full analysis of the earnings results here, it's free.\n\nWeakest Q1: Mercury Systems (NASDAQ:MRCY)\n\nListed on the NASDAQ in 1998, Mercury Systems (NASDAQGS:MRCY) specializes in providing processing subsystems and components for defense applications.\n\nMercury Systems reported revenues of $208.3 million, down 21% year on year, falling short of analysts' expectations by 2.9%. It was a weak quarter for the company, with a miss of analysts' revenue and earnings estimates.\n\nMercury Systems had the weakest performance against analyst estimates and slowest revenue growth in the group. The stock is down 8% since the results and currently trades at $26.76.\n\nRead our full analysis of Mercury Systems's results here.\n\nRTX (NYSE:RTX)\n\nOriginally focused on refrigeration technology, Raytheon (NSYE:RTX) provides a a variety of products and services to the aerospace and defense industries.\n\nRTX reported revenues of $19.31 billion, up 12.1% year on year, surpassing analysts' expectations by 4.9%. It was a very strong quarter for the company, with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates.\n\nThe stock is down 1.3% since the results and currently trades at $100.3.\n\nRead our full, actionable report on RTX here, it's free.\n\nLockheed Martin (NYSE:LMT)\n\nResponsible for renowned military systems like the F-35 fighter jet, Lockheed Martin Lockheed Martin (NYSE:LMT) specializes in defense, space, intelligence, homeland security, and information technology solutions.\n\nLockheed Martin reported revenues of $17.2 billion, up 13.7% year on year, surpassing analysts' expectations by 7.5%. It was a stunning quarter for the company, with an impressive beat of analysts' organic revenue estimates.\n\nThe stock is up 1.3% since the results and currently trades at $467.57.\n\nRead our full, actionable report on Lockheed Martin here, it's free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/reflecting-defense-contractors-stocks-q1-084311160.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "AVAV.US",
            "JPX.BE",
            "JPX.F",
            "JPX.STU",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "MCY.F",
            "MCY.MU",
            "MCY.STU",
            "MRCY.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.035,
            "neu": 0.805,
            "pos": 0.16
        }
    },
    {
        "date": "2024-06-28T00:00:00+00:00",
        "title": "7 Defense Stocks to Buy Amid Peace Summit Tensions",
        "content": "With the latest peace summit lacking substance, the simmering tensions will likely bolster these defense stocks to buy.",
        "link": "https://investorplace.com/2024/06/7-defense-stocks-to-buy-amid-peace-summit-tensions/",
        "symbols": [
            "AVAV.US",
            "BA.US",
            "HII.US",
            "LMT.US",
            "NOC.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.318,
            "neg": 0.119,
            "neu": 0.661,
            "pos": 0.22
        }
    },
    {
        "date": "2024-06-28T00:00:00+00:00",
        "title": "You&#039;ve Been Warned! 3 Space Stocks to Buy Now or Regret Forever.",
        "content": "As the space race heats up, investors look at three space stocks to buy this year for their long-term potential.",
        "link": "https://investorplace.com/2024/06/youve-been-warned-3-space-stocks-to-buy-now-or-regret-forever/",
        "symbols": [
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0,
            "neg": 0,
            "neu": 1,
            "pos": 0
        }
    },
    {
        "date": "2024-06-28T00:00:00+00:00",
        "title": "7 Quiet Blue-Chip Stocks on the Verge of a Big Breakout Rally",
        "content": "These are the undervalued blue-chip stocks to buy as they represent companies with a steady growth and robust cash flow outlook.",
        "link": "https://investorplace.com/2024/06/7-quiet-blue-chip-stocks-on-the-verge-of-a-big-breakout-rally/",
        "symbols": [
            "CVX.US",
            "LMT.US",
            "MO.US",
            "MRK.US",
            "NEM.US",
            "T.US",
            "VALE.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.612,
            "neg": 0,
            "neu": 0.783,
            "pos": 0.217
        }
    }
]