[
    {
        "date": "2024-06-10T21:50:17+00:00",
        "title": "Lockheed Martin (LMT) Stock Sinks As Market Gains: Here's Why",
        "content": "Lockheed Martin (LMT) closed the most recent trading day at $467.46, moving -0.57% from the previous trading session. The stock trailed the S&P 500, which registered a daily gain of 0.26%. Meanwhile, the Dow gained 0.18%, and the Nasdaq, a tech-heavy index, added 0.35%.\n\nThe aerospace and defense company's stock has climbed by 0.27% in the past month, falling short of the Aerospace sector's gain of 1.95% and the S&P 500's gain of 3.25%.\n\nMarket participants will be closely following the financial results of Lockheed Martin in its upcoming release. On that day, Lockheed Martin is projected to report earnings of $6.45 per share, which would represent a year-over-year decline of 4.16%. In the meantime, our current consensus estimate forecasts the revenue to be $17.03 billion, indicating a 2.04% growth compared to the corresponding quarter of the prior year.\n\nLMT's full-year Zacks Consensus Estimates are calling for earnings of $26.26 per share and revenue of $69.72 billion. These results would represent year-over-year changes of -5.61% and +3.18%, respectively.\n\nIt is also important to note the recent changes to analyst estimates for Lockheed Martin. Such recent modifications usually signify the changing landscape of near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.\n\nEmpirical research indicates that these revisions in estimates have a direct correlation with impending stock price performance. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.\n\nThe Zacks Rank system, ranging from #1 (Strong Buy) to #5 (Strong Sell), possesses a remarkable history of outdoing, externally audited, with #1 stocks returning an average annual gain of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has moved 0.18% higher. Right now, Lockheed Martin possesses a Zacks Rank of #3 (Hold).\n\nLooking at valuation, Lockheed Martin is presently trading at a Forward P/E ratio of 17.91. This valuation marks a discount compared to its industry's average Forward P/E of 18.06.\n\nIt's also important to note that LMT currently trades at a PEG ratio of 4.41. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. The average PEG ratio for the Aerospace - Defense industry stood at 1.79 at the close of the market yesterday.\n\nThe Aerospace - Defense industry is part of the Aerospace sector. Currently, this industry holds a Zacks Industry Rank of 141, positioning it in the bottom 45% of all 250+ industries.\n\nStory continues\n\nThe Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nDon't forget to use Zacks.com to keep track of all these stock-moving metrics, and others, in the upcoming trading sessions.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-stock-sinks-215017792.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.991,
            "neg": 0.002,
            "neu": 0.902,
            "pos": 0.095
        }
    },
    {
        "date": "2024-06-10T12:16:00+00:00",
        "title": "Northrop (NOC) Wins $119M Contract to Aid E-2 Hawkeye Jet Program",
        "content": "Northrop Grumman Corp.’s NOC, business unit, Northrop Grumman Systems Corp., recently secured a contract involving its E-2 Hawkeye aircraft. The award has been provided by the Naval Supply Systems Command Weapon Systems Support, Philadelphia, PA.\n\nDetails of the Deal\n\nValued at $119.6 million, the contract is estimated to be completed by December 2025. Per terms of the deal, Northrop will provide long-term, requirements contract for the repair of 17 weapon replaceable assemblies and shop replaceable assemblies to support the E-2 Hawkeye jets.\n\nMajority of the work related to this deal will be carried out in Syracuse, NY.\n\nWhat’s Favoring Northrop?\n\nOver the past decade, a rapid rise in global terrorism and adverse geopolitical situations across borders have boosted the demand for defense products. With combat aircraft constituting a major portion of this portfolio, prominent defense aircraft manufacturers like Northrop witness a solid inflow of orders. The latest contract win is a bright example of that.\n\nTo this end, it is imperative to mention that Northrop’s all-weather E-2 Hawkeye airborne early warning and battle management (AEW&BM) aircraft has been serving as the \"eyes\" of the U.S. Navy fleet for more than 30 years. The E-2D Advanced Hawkeye is the next-generation aircraft in this family of jets, which comes with a two-generation leap in radar sensor capability and a robust network-enabled capability.\n\nOn the other hand, the E-2C Hawkeye 2000 variant possesses the most advanced AEW&BM capabilities in service today. It is the fifth-generation production E-2C Hawkeye and incorporates significant enhancements in data management, connectivity, and situational awareness to support the Navy's evolving Theater Air and Missile Defense mission.\n\nSuch features of the E-2 Hawkeye family of jets make it an attractive choice for the military, resulting in NOC winning multiple orders for the same, like the latest one. Such orders are likely to boost Northrop’s revenue generation prospects in the military aircraft business arena.\n\nNOC’s Growth Prospects\n\nFactors like increasing defense spending by developed nations, rising defense investment from emerging economies, rapidly rising geopolitical tensions worldwide like the ongoing hostility in the Middle East and solid development in technological advancement of lethal aircraft have been bolstering the growth prospects of the combat jet market.\n\nThis must have prompted the Mordor Intelligence firm to project a CAGR of 5.2% for the global military aviation market over the 2024-2030 period. Such growth prospects should benefit Northrop as its product portfolio offers a wide range of manned and unmanned aircraft that already enjoys an established position in the military aviation market.\n\nStory continues\n\nNotably, NOC’s Aeronautics Systems is a leader in the design, development, production, integration, sustainment and modernization of military aircraft systems for the U.S. Air Force, the U.S. Navy, other U.S. government agencies, and international customers. Its major products include strategic long-range strike aircraft; tactical fighter and air dominance aircraft; airborne battle management and command and control systems; and unmanned autonomous aircraft systems, including high-altitude long-endurance strategic intelligence, surveillance and reconnaissance (ISR) systems and vertical take-off and landing tactical ISR systems.\n\nApart from E-2D, Northrop’s product portfolio includes many other combat-proven aircraft like the RQ-4 Global Hawk unmanned aircraft system (UAS), which provides high-resolution imagery of land masses for theater awareness and strategic ISR to the U.S. Air Force, Japan and the Republic of Korea. On the other hand, its B-2 Spirit stealth bomber aircraft is a key component of the United States’ long-range strike arsenal and one of the most survivable aircraft in the world.\n\nOpportunities for Peers\n\nThe abounding growth prospects of the military aviation market should also benefit other defense majors that manufacture combat jets, such as Lockheed Martin LMT, Boeing BA and Textron TXT.\r\n\r\nLockheed Martin’s Aeronautics segment is engaged in the research, design, development, manufacture, integration, sustainment, support and upgrade of advanced military aircraft, including combat and air mobility aircraft, unmanned air vehicles and related technologies. Its major programs are the F-35 Lightning II Joint Strike Fighter jet, the C-130 Hercules airlifter, the F-16 Fighting Falcon jet and the F-22 Raptor jet.\n\nLMT’s long-term earnings growth rate is 4.1%. Shares of LMT have returned 5.1% to its investors in the past year.\n\nBoeing’s Defense, Space & Security segment engages in the research, development, production and modification of manned and unmanned military aircraft and weapons systems for strike, surveillance and mobility, including fighter and trainer aircraft; vertical lift, including rotorcraft and tilt-rotor aircraft and commercial derivative aircraft, including anti-submarine and tanker aircraft. Its primary products include fixed-wing military aircraft, F/A-18E/F Super Hornet, F-15 programs, P-8 programs, KC-46A Tanker and T-7A Red Hawk.\n\nBoeing’s long-term earnings growth rate is 27.5%. The Zacks Consensus Estimate for its 2024 sales indicates growth of 2.1% from the 2023 reported figure.\n\nTextron’s business unit, Textron Aviation Defense, designs, builds and supports versatile and globally known military aircraft, preferred for training and attack missions. Some of Textron’s renowned products are the Beechcraft T-6C trainer and the AT-6 Wolverine.\n\nThe company boasts a long-term earnings growth rate of 10.1%. The Zacks Consensus Estimate for its 2024 sales indicates growth of 5.6% from the previous year’s reported number.\n\nPrice Movement\n\nIn the past year, shares of Northrop have lost 1.4% compared with the industry’s 9.5% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nNorthrop currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/northrop-noc-wins-119m-contract-121600321.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0LF0.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.05,
            "neu": 0.778,
            "pos": 0.172
        }
    }
]