[
    {
        "date": "2024-08-15T18:16:17+00:00",
        "title": "Lockheed to buy satellite products maker Terran in $450 million deal",
        "content": "(Reuters) - Lockheed Martin on Thursday agreed to acquire satellite products maker Terran Orbital in a $450 million deal, months after the defense contractor withdrew it previous bid to take it private.\n\nLockheed will pay 25 cents per share in cash, representing a 37.5% discount to Terran's last close. The company in March had offered $1 per Terran share.\n\nTerran's shares plunged nearly 41% to 24 cents on the New York Stock Exchange.\n\nLockheed, which had invested in Terran's Series A round in 2017, is its largest customer and currently uses the company's satellite bus for the U.S. Space Development Agency's (SDA) transport and tracking layer programs.\n\n\"The acquisition consolidates a supplier, with Terran Orbital providing buses for Lockheed's prime position on the SDA's Tracking and Transport layer,\" analysts said in a Jefferies note.\n\nFlorida-based Terran Orbital is engaged in satellite design, production, launch planning, mission operations, and on-orbit support for aerospace and defense clients.\n\nThe transaction, which is expected to close in the fourth quarter, will retire Terran's existing debt and establish a new $30 million working capital facility.\n\nA month back, Terran posted quarterly net loss of $35.4 million, adding to several quarters of losses since going public in 2022.\n\nEarlier this year, Lockheed was awarded $890 million as part of a $2.55 billion contract along with peers L3Harris Technologies and Sierra Space to deliver 18 satellites to the SDA as part of its missile tracking program.\n\n(Reporting by Aatreyee Dasgupta in Bengaluru; Editing by Maju Samuel)",
        "link": "https://ca.finance.yahoo.com/news/lockheed-buy-satellite-products-maker-181617651.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.836,
            "neg": 0.035,
            "neu": 0.888,
            "pos": 0.077
        }
    },
    {
        "date": "2024-08-15T18:09:24+00:00",
        "title": "Top Midday Decliners",
        "content": "Top Midday Decliners",
        "link": "https://finance.yahoo.com/news/top-midday-decliners-180924464.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.202,
            "neg": 0,
            "neu": 0.526,
            "pos": 0.474
        }
    },
    {
        "date": "2024-08-15T17:00:16+00:00",
        "title": "While Tech Giants Tumble, Defense Titans Take Off: Who's Leading The Charge?",
        "content": "While Tech Giants Tumble, Defense Titans Take Off: Who's Leading The Charge?\n\nBenzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\n\nIn a month marked by global market turmoil, where leading tech giants like Alphabet Inc, Apple Inc, and Tesla Inc saw their valuations drop by a combined trillion dollars, the defense sector has shown resilience.\n\nStocks of three major companies—Lockheed Martin Corp (NYSE:LMT), RTX Corporation (NYSE:RTX), and Northrop Grumman Corp (NYSE NOC) have surged between 14% and 20% over the past month.\n\nAs the world grapples with escalating geopolitical tensions, these defense behemoths have not only weathered the storm but thrived, making them standout investments in a time of uncertainty.\n\nDon’t miss out on the next NVIDIA – you can invest in the future of AI for only $10. **This is a paid advertisement. Carefully consider the investment objectives, risks, charges and expenses of the Fundrise Innovation Fund before investing. This and other information can be found in the Fund's prospectus. Read them carefully before investing.\n\nLockheed Martin: Up 19.69%\n\nLockheed Martin, a cornerstone of the American aerospace and defense industry, has seen its stock rise by nearly 20% over the past month.\n\nThe company recently made headlines with the introduction of its Mako hypersonic missile, an \"affordable\" multi-mission weapon capable of flying at speeds exceeding Mach 5. This missile is being developed for the U.S. Air Force as well as international customers, highlighting Lockheed Martin's pivotal role in modern warfare.\n\nAdding to its recent achievements, Lockheed Martin delivered the first of five C-130J Super Hercules military transport aircraft to the Royal New Zealand Air Force. This delivery is part of a significant $902.3 million program aimed at replacing New Zealand's aging C-130H fleet, which has been in operation since the 1960s.\n\nThese advancements have not only strengthened Lockheed Martin’s market position but also fueled investor optimism, propelling its stock to new heights.\n\nRTX Corporation: Up 15.41%\n\nRTX Corporation, formerly known as Raytheon Technologies, has also been on an upward trajectory, with its stock climbing over 15% in the past month.\n\nThe company's recent $1.2 billion deal with Poland to produce Patriot air-defense battery components has further solidified its standing in the defense industry. This agreement, which involves the production of 48 Patriot M903 launch stations, is a significant boost for RTX, expanding its collaboration with the Polish defense sector and positioning it for future contracts that could extend through the end of the decade.\n\nStory continues\n\nThis deal comes at a time when Europe is increasingly focusing on bolstering its defense capabilities amid rising geopolitical tensions. For investors, RTX’s expanding role in European defense is a key factor driving its stock’s strong performance.\n\nDon’t Miss:\n\nThis city is the clear winner of Zillow's 2024 Home Value Forecast — No surprise as the number of millionaires there grew by 75% in the last decade. Institutional investors are increasingly turning to private credit for higher potential returns and lower volatility. You can copy their strategy by investing in your own private credit deals. With returns as high as 300%, it’s no wonder this asset is the investment choice of many billionaires. Uncover the secret.\n\nNorthrop Grumman: Up 13.92%\n\nNorthrop Grumman has seen its stock price increase by nearly 14% over the past month, driven by a series of strategic advancements.\n\nThe company successfully launched the Arctic Satellite Broadband Mission (ASBM) for Space Norway, a critical project aimed at extending broadband connectivity to the Arctic region. This launch, conducted from Vandenberg Space Force Base in California, underscores Northrop Grumman’s leadership in space-based defense technologies.\n\nAdditionally, Northrop Grumman is advancing its Cannon-Based Air Defense (CBAD) program, which aims to create a multi-layered anti-aircraft system. This system, designed to counter modern threats like cruise missiles and attack drones, highlights Northrop’s innovative approach to addressing the evolving needs of global defense.\n\nMoreover, the company’s collaboration with South Korea’s Genohco to support the KMCH program further cements its position as a key player in international defense.\n\nA Defensive Stronghold In A Volatile Market\n\nFor investors navigating the current market volatility, the defense sector has proven to be a stronghold.\n\nLockheed Martin, RTX Corporation, and Northrop Grumman have not only weathered the recent market crash but have thrived amid rising global tensions.\n\nTheir stock performance over the past month, coupled with their recent strategic advancements, suggests that these companies are well-positioned to continue delivering value to shareholders.\n\nAs the world continues to grapple with geopolitical instability, these defense stocks offer a beacon of stability and growth potential in an otherwise turbulent market.\n\nLooking For Higher-Yield Opportunities?\n\nThe current high-interest-rate environment has created an incredible opportunity for income-seeking investors to earn massive yields, but not through dividend stocks... Certain private market real estate investments are giving retail investors the opportunity to capitalize on these high-yield opportunities and Benzinga has identified some of the most attractive options for you to consider.\n\nFor instance, the Ascent Income Fund from EquityMultiple targets stable income from senior commercial real estate debt positions and has a historical distribution yield of 12.1% backed by real assets. With payment priority and flexible liquidity options, the Ascent Income Fund is a cornerstone investment vehicle for income-focused investors. First-time investors with EquityMultiple can now invest in the Ascent Income Fund with a reduced minimum of just $5,000. Benzinga Readers: Earn a 1% return boost on your first EquityMultiple investment when you sign up here (accredited investors only).\n\nDon't miss out on this opportunity to take advantage of high-yield investments while rates are high. Check out Benzinga's favorite high-yield offerings.\n\nThis article While Tech Giants Tumble, Defense Titans Take Off: Who's Leading The Charge? originally appeared on Benzinga.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/while-tech-giants-tumble-defense-170016129.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.054,
            "neu": 0.787,
            "pos": 0.159
        }
    },
    {
        "date": "2024-08-15T12:39:00+00:00",
        "title": "Lockheed Martin to Acquire Terran Orbital",
        "content": "Strategic Acquisition Reinforces Lockheed Martin's Commitment to Expanding Advanced Satellite Manufacturing and Responsive Space Capabilities\n\nBETHESDA, Md., Aug. 15, 2024 /PRNewswire/ -- Lockheed Martin [NYSE: LMT] today announced the signing of a definitive agreement to acquire Terran Orbital [NYSE: LLAP], a global leader of satellite-based solutions primarily supporting the aerospace and defense industries. Lockheed Martin Logo. (PRNewsfoto/Lockheed Martin)\n\nTerran Orbital brings a high throughput, robotic manufacturing capacity and high-performing modular space vehicle designs. Combined with Lockheed Martin's record of performance and innovation, this transaction will usher in an even broader range of capabilities and value for customers. Lockheed Martin uses Terran Orbital's satellites for its work, most notably with the Space Development Agency's Transport and Tracking Layer programs, and in several of its self-funded technology demonstrations.\n\n\"We've worked with Terran Orbital for more than seven years on a variety of successful missions,\" said Robert Lightfoot, president, Lockheed Martin Space. \"Their capabilities, talent and business momentum align with Lockheed Martin Space's strategic plans – and we're looking forward to welcoming them to our team. Our customers require advanced technology and even faster product development, and that's what we can achieve together.\"\n\nThe transaction stands to pave a path for further advancement, as Lockheed Martin continues to invest in technology, people, and capacity to support future customer needs.\n\n\"This transaction combines our strengths and expertise,\" said Marc Bell, chairman, CEO, and co-founder of Terran Orbital. \"This move will open new opportunities for growth and innovation, and we couldn't be more excited about the future. Access to Lockheed Martin's incredible engineers and world class facilities will only accelerate our business plan to provide low-cost, high-value solutions to our ever-growing customer base.\"\n\nTransaction Details\n\nThe enterprise value of the transaction is approximately $450 million. Lockheed Martin will acquire Terran Orbital for $0.25 in cash for each outstanding share of common stock and retire its existing debt. This transaction also provides for Lockheed Martin and other current Terran Orbital creditors establishing a new, $30 million working capital facility that has been put in place as of signing.\n\nThe transaction is expected to close in fourth quarter of 2024 and is subject to the satisfaction of customary closing conditions, including regulatory and Terran Orbital stockholder approvals. Upon closing, Terran Orbital will remain a commercial merchant supplier to industry.\n\nStory continues\n\nProven Spacecraft Portfolio and Technology\n\nTerran Orbital has a track record of supporting more than 80 missions over the past decade for government and commercial customers with complex mission requirements, from low earth orbit to the Moon and beyond. As of today, Lockheed Martin is Terran Orbital's largest customer. This longstanding working relationship between the companies underpins a strong cultural alignment and ability to recognize synergies between the two businesses.\n\nTerran Orbital joined the Lockheed Martin Ventures (LM Ventures) portfolio – a fund that makes investments in technology innovations to drive growth in existing, adjacent and new segments for the company – with an initial investment in 2017. LM Ventures has since made two additional investments in Terran Orbital in 2020 and 2022. This marks the first LM Ventures company that Lockheed Martin has sought to acquire since founding the fund in 2007.\n\nAbout Lockheed Martin\n\nLockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at www.Lockheedmartin.com.\n\nAbout Terran Orbital\n\nTerran Orbital is a leading manufacturer of satellite products primarily serving the aerospace and defense industries. Terran Orbital provides end-to-end satellite solutions by combining satellite design, production, launch planning, mission operations, and on-orbit support to meet the needs of the most demanding military, civil, and commercial customers. Learn more at www.terranorbital.com.\n\nAdditional Information and Where to Find It\n\nThis communication may be deemed to be solicitation material in respect of the proposed acquisition of Terran Orbital Corporation (\"Terran Orbital\") by Lockheed Martin Corporation (\"Lockheed Martin\"). In connection with the proposed transaction, Terran Orbital intends to file with the Securities and Exchange Commission (the \"SEC\") a proxy statement on Schedule 14A. Promptly after filing its definitive proxy statement with the SEC, Terran Orbital intends to mail the definitive proxy statement and a proxy card to each stockholder entitled to vote at the special meeting relating to the proposed transaction. STOCKHOLDERS OF TERRAN ORBITAL ARE URGED TO READ THE PROXY STATEMENT (INCLUDING ANY AMENDMENTS OR SUPPLEMENTS THERETO) AND ANY OTHER RELEVANT DOCUMENTS IN CONNECTION WITH THE PROPOSED TRANSACTION THAT TERRAN ORBITAL FILES WITH THE SEC WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT THE PROPOSED TRANSACTION. The definitive proxy statement, the preliminary proxy statement and any other documents filed by Terran Orbital with the SEC may be obtained free of charge at the SEC's website at www.sec.gov or at Terran Orbital's website at www.terranorbital.com.\n\nParticipants in the Solicitation\n\nTerran Orbital, Lockheed Martin and their respective directors and executive officers may be deemed to be participants in the solicitation of proxies from Terran Orbital's stockholders with respect to the proposed transaction. Information regarding the identity of participants in the solicitation of proxies, and their direct or indirect interests in the proposed transaction, by security holdings or otherwise, will be set forth in the proxy statement and other materials to be filed with the SEC in connection with the proposed transaction. Additional information about Terran Orbital's directors and executive officers and their ownership of Terran Orbital common stock is set forth in Terran Orbital's definitive proxy statement for its 2024 annual meeting of stockholders filed with the SEC on April 10, 2024 (the \"Terran Orbital 2024 Proxy Statement\"), under \"Board of Directors and Corporate Governance,\" \"Executive Officers,\" \"Executive Compensation\" and \"Security Ownership of Certain Beneficial Owners and Management.\" To the extent that holdings of Terran Orbital's securities by directors and executive officers have changed since the amounts disclosed in the Terran Orbital 2024 Proxy Statement, such changes have been or will be reflected on Initial Statements of Beneficial Ownership on Form 3 and Statements of Changes in Ownership on Form 4 filed with the SEC. Information about Lockheed Martin's directors and executive officers is set forth in Lockheed Martin's definitive proxy statement for its 2024 annual meeting of stockholders filed with the SEC on March 15, 2024 (the \"Lockheed Martin 2024 Proxy Statement\"), under \"Director Nominees,\" \"Executive Compensation\" and \"Security Ownership of Management and Certain Beneficial Owners.\" To the extent holdings of Lockheed Martin's securities by directors and executive officers have changed since the amounts disclosed in the Lockheed Martin 2024 Proxy Statement, such changes have been or will be reflected on Initial Statements of Beneficial Ownership on Form 3 and Statements of Changes in Ownership on Form 4 filed with the SEC. You can obtain free copies of these documents at the SEC's website at www.sec.gov or by accessing the respective companies' websites at www.terranorbital.com (Terran Orbital) and www.lockheedmartin.com (Lockheed Martin).\n\nForward-Looking Statements\n\nThis news release contains statements that, to the extent they are not recitations of historical fact, constitute \"forward-looking statements\" within the meaning of the federal securities laws, and are based on Lockheed Martin's and Terran Orbital's current expectations and assumptions, including, among other things, statements regarding the proposed transaction and the expected benefits of the proposed transaction; the anticipated timing of the proposed transaction and financing of the proposed transaction; and the future performance of Lockheed Martin's or of Terran Orbital's business if the proposed transaction is completed. The words \"believe,\" \"estimate,\" \"anticipate,\" \"project,\" \"intend,\" \"expect,\" \"plan,\" \"outlook,\" \"will,\" \"should,\" \"could,\" \"scheduled,\" \"forecast,\" and similar expressions are intended to identify forward-looking statements. There can be no assurance that the proposed transaction or any other future events will occur as anticipated, if at all, or that actual results will be as expected. These statements are not guarantees of future performance and are subject to risks and uncertainties. Actual results may differ materially due to factors such as: the failure to obtain, delays in obtaining, or adverse conditions contained in any required regulatory or other approvals for consummation of the proposed transaction, the possibility that Terran Orbital stockholders may not approve the proposed transaction; the failure to consummate or a delay in consummating the proposed transaction for other reasons; the occurrence of any event, change or other circumstance or condition that could give rise to the termination of the merger agreement related to the proposed transaction; Lockheed Martin's or Terran Orbital's business being disrupted due to transaction-related uncertainty; the diversion of Terran Orbital's management's or employees' attention during the pendency of the proposed transaction from Lockheed Martin's or Terran Orbital's ongoing business operations and other opportunities; the failure to successfully and timely integrate Terran Orbital and realize the benefits of the proposed transaction; the risk of litigation relating to the proposed transaction; competitive responses to the proposed transaction; unexpected liabilities, costs, charges or expenses resulting from the proposed transaction; and potential adverse reactions or changes to business relationships from the announcement or completion of the proposed transaction. These are only some of the factors that may affect the forward-looking statements contained in this news release. For a discussion identifying additional important factors that could cause actual results to differ materially from those anticipated in the forward-looking statements, see Lockheed Martin's filings with the SEC, including, but not limited to, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and \"Risk Factors\" in Lockheed Martin's most recent Annual Report on Form 10-K and subsequent quarterly reports on Form 10-Q, and Terran Orbital's filings with the SEC, including, but not limited to, Terran Orbital's Annual Report on Form 10-K for the fiscal year ended December 31, 2023, filed with the SEC on April 1, 2024, its Quarterly Report on Form 10-Q for the quarter ended June 30, 2024 filed with the SEC on August 12, 2024, and the prospectus supplements dated September 18, 2023 and July 23, 2024, each related to its Registration Statement on Form S-3, as amended (File No. 333-271093), which was declared effective by the SEC on April 18, 2023. Lockheed Martin's filings may be accessed through the investor relations page of its website, www.lockheedmartin.com/investor or through the website maintained by the SEC at www.sec.gov. Terran Orbital's filings may be accessed through the investor relations page of its website, www.investors.terranorbital.com or through the website maintained by the SEC at www.sec.gov. Except where required by applicable law, each of Lockheed Martin and Terran Orbital expressly disclaims a duty to provide updates to forward-looking statements after the date of this news release to reflect subsequent events, changed circumstances, changes in expectations, or the estimates and assumptions associated with them. The forward-looking statements in this news release are intended to be subject to the safe harbor protection provided by the federal securities laws. Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/lockheed-martin-to-acquire-terran-orbital-302223551.html\n\nSOURCE Lockheed Martin\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-acquire-terran-orbital-123900130.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.019,
            "neu": 0.908,
            "pos": 0.073
        }
    },
    {
        "date": "2024-08-15T12:00:23+00:00",
        "title": "Lockheed Martin Corporation's (NYSE:LMT) Intrinsic Value Is Potentially 34% Above Its Share Price",
        "content": "Key Insights\n\nThe projected fair value for Lockheed Martin is US$754 based on 2 Stage Free Cash Flow to Equity Lockheed Martin is estimated to be 25% undervalued based on current share price of US$563 The US$547 analyst price target for LMT is 27% less than our estimate of fair value\n\nToday we'll do a simple run through of a valuation method used to estimate the attractiveness of Lockheed Martin Corporation (NYSE:LMT) as an investment opportunity by taking the expected future cash flows and discounting them to their present value. We will use the Discounted Cash Flow (DCF) model on this occasion. Models like these may appear beyond the comprehension of a lay person, but they're fairly easy to follow.\n\nWe would caution that there are many ways of valuing a company and, like the DCF, each technique has advantages and disadvantages in certain scenarios. If you still have some burning questions about this type of valuation, take a look at the Simply Wall St analysis model.\n\nView our latest analysis for Lockheed Martin\n\nThe Calculation\n\nWe use what is known as a 2-stage model, which simply means we have two different periods of growth rates for the company's cash flows. Generally the first stage is higher growth, and the second stage is a lower growth phase. To begin with, we have to get estimates of the next ten years of cash flows. Where possible we use analyst estimates, but when these aren't available we extrapolate the previous free cash flow (FCF) from the last estimate or reported value. We assume companies with shrinking free cash flow will slow their rate of shrinkage, and that companies with growing free cash flow will see their growth rate slow, over this period. We do this to reflect that growth tends to slow more in the early years than it does in later years.\n\nA DCF is all about the idea that a dollar in the future is less valuable than a dollar today, so we discount the value of these future cash flows to their estimated value in today's dollars:\n\n10-year free cash flow (FCF) forecast\n\n2025 2026 2027 2028 2029 2030 2031 2032 2033 2034 Levered FCF ($, Millions)  US$6.28b US$6.68b US$7.09b US$7.13b US$7.20b US$7.31b US$7.44b US$7.59b US$7.75b US$7.93b Growth Rate Estimate Source Analyst x10 Analyst x8 Analyst x2 Analyst x1 Est @ 1.06% Est @ 1.49% Est @ 1.80% Est @ 2.01% Est @ 2.15% Est @ 2.26% Present Value ($, Millions) Discounted @ 6.1%  US$5.9k US$5.9k US$5.9k US$5.6k US$5.4k US$5.1k US$4.9k US$4.7k US$4.6k US$4.4k\n\n(\"Est\" = FCF growth rate estimated by Simply Wall St)\r\nPresent Value of 10-year Cash Flow (PVCF) = US$53b\n\nWe now need to calculate the Terminal Value, which accounts for all the future cash flows after this ten year period. For a number of reasons a very conservative growth rate is used that cannot exceed that of a country's GDP growth. In this case we have used the 5-year average of the 10-year government bond yield (2.5%) to estimate future growth. In the same way as with the 10-year 'growth' period, we discount future cash flows to today's value, using a cost of equity of 6.1%.\n\nTerminal Value (TV)= FCF2034 × (1 + g) ÷ (r – g) = US$7.9b× (1 + 2.5%) ÷ (6.1%– 2.5%) = US$229b\n\nPresent Value of Terminal Value (PVTV)= TV / (1 + r)10= US$229b÷ ( 1 + 6.1%)10= US$127b\n\nThe total value is the sum of cash flows for the next ten years plus the discounted terminal value, which results in the Total Equity Value, which in this case is US$180b. In the final step we divide the equity value by the number of shares outstanding. Relative to the current share price of US$563, the company appears a touch undervalued at a 25% discount to where the stock price trades currently. Valuations are imprecise instruments though, rather like a telescope - move a few degrees and end up in a different galaxy. Do keep this in mind. dcf\n\nImportant Assumptions\n\nThe calculation above is very dependent on two assumptions. The first is the discount rate and the other is the cash flows. You don't have to agree with these inputs, I recommend redoing the calculations yourself and playing with them. The DCF also does not consider the possible cyclicality of an industry, or a company's future capital requirements, so it does not give a full picture of a company's potential performance. Given that we are looking at Lockheed Martin as potential shareholders, the cost of equity is used as the discount rate, rather than the cost of capital (or weighted average cost of capital, WACC) which accounts for debt. In this calculation we've used 6.1%, which is based on a levered beta of 0.862. Beta is a measure of a stock's volatility, compared to the market as a whole. We get our beta from the industry average beta of globally comparable companies, with an imposed limit between 0.8 and 2.0, which is a reasonable range for a stable business.\n\nSWOT Analysis for Lockheed Martin\n\nStrength\n\nDebt is well covered by earnings and cashflows.\n\nDividends are covered by earnings and cash flows.\n\nWeakness\n\nEarnings declined over the past year.\n\nDividend is low compared to the top 25% of dividend payers in the Aerospace & Defense market.\n\nOpportunity\n\nAnnual earnings are forecast to grow for the next 3 years.\n\nGood value based on P/E ratio and estimated fair value.\n\nThreat\n\nAnnual earnings are forecast to grow slower than the American market.\n\nNext Steps:\n\nWhilst important, the DCF calculation is only one of many factors that you need to assess for a company. The DCF model is not a perfect stock valuation tool. Instead the best use for a DCF model is to test certain assumptions and theories to see if they would lead to the company being undervalued or overvalued. For example, changes in the company's cost of equity or the risk free rate can significantly impact the valuation. Why is the intrinsic value higher than the current share price? For Lockheed Martin, there are three important items you should explore:\n\nRisks: Case in point, we've spotted  2 warning signs for Lockheed Martin you should be aware of. Future Earnings: How does LMT's growth rate compare to its peers and the wider market? Dig deeper into the analyst consensus number for the upcoming years by interacting with our free analyst growth expectation chart. Other Solid Businesses: Low debt, high returns on equity and good past performance are fundamental to a strong business. Why not explore our interactive list of stocks with solid business fundamentals to see if there are other companies you may not have considered!\n\nPS. Simply Wall St updates its DCF calculation for every American stock every day, so if you want to find the intrinsic value of any other stock just search here.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-corporations-nyse-lmt-120023695.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.034,
            "neu": 0.787,
            "pos": 0.179
        }
    }
]