[
    {
        "date": "2024-09-21T14:34:08+00:00",
        "title": "Lockheed Martin Corporation (LMT): Street Analysts Are Bearish On This Aviation Stock",
        "content": "We recently compiled a list of the 11 Worst Aviation Stocks to Buy According to Analysts.In this article, we are going to take a look at where Lockheed Martin Corporation (NYSE:LMT) stands against the other aviation stocks.\n\nThe aviation industry has been one of the most important segments of the market in the 20th and 21st centuries. The future of aviation is closely tied to the broader landscape of mobility, which is important for economic growth, social connectivity, and access to services like trade, healthcare, and education.\n\nAccording to the International Air Transport Association (IATA), the airline industry has made a strong recovery from the COVID-19 crisis, with global traffic surpassing pre-pandemic levels by February 2024. Domestic travel rebounded first,  which reached pre-Covid levels by spring 2023, while international travel followed more recently.\n\nHowever, the global network has shifted since 2019. China’s international travel recovered slowly due to the delayed easing of restrictions, economic uncertainties, and geopolitical issues. On the other hand, domestic travel in China hit record highs, driven by internal tourism. Routes between Asia and Europe continue to be affected by the war in Ukraine.\n\nMost regions are expected to exceed 2019 traffic levels in 2024, with global passenger numbers forecasted to grow 10.4% year-over-year.\n\nThe report states that Asia Pacific is the fastest-growing region, which is projected to contribute over half of global passenger growth by 2043 and it is led by India and China. Despite risks like geopolitical conflicts and climate policies, improved economic conditions may boost demand.\n\nAir connectivity, a main driver of global economic growth, is set to hit a record in 2024 with over 22,000 unique city pairs, aided by declining ticket fares. Meanwhile, air cargo demand has rebounded, driven by e-commerce and shipping disruptions. The global capacity is expected to increase further, though the cargo load factor will likely decrease as capacity exceeds demand.\n\nUse of AI in the Industry\n\nLike most industries of today, airlines are also implementing AI to improve the efficiency of their operations. According to an August report by CNBC, these companies are using AI for tasks like ground control, customer service, and optimizing flight routes.\n\nAmerican Airlines introduced its AI-powered \"smart gating\" system at its Dallas-Fort Worth control center. The tool automatically assigns gates to incoming flights, which cut runway taxi time by around 20%, or two minutes per flight, across five airports. The system also helps passengers, baggage, and crews make quicker connections, which improves overall efficiency.\n\nStory continues\n\nAlaska is using AI to streamline flight paths and optimize aircraft turnaround times at gates. Its tool is described as \"Waze for the skies,\" and it uses AI to plan faster routes, which saves fuel and reduces delays. Additionally, the system monitors ground operations as it tracks when fuel, catering, and baggage trucks arrive and depart, which allows agents to address delays immediately.\n\nUnited has implemented generative AI for customer service, especially during flight disruptions. The AI generates detailed, empathetic messages explaining delays, which has increased customer satisfaction by 4% since its rollout on 6,000 flights.\n\nDespite these advancements, the airlines said that AI is not replacing jobs but is improving operational efficiency. AI tools allow airlines to improve areas where humans may struggle to handle complex tasks as efficiently. These things, like reducing flight delays or cutting minutes off turnaround times, aim to improve overall service without completely automating operations.\n\nOur Methodology\n\nFor this article, we used stock screeners and ETFs to identify 65 companies above $50 million market cap that have significant operations in the aviation industry. We narrowed our list to 11 companies where less than 50% of the analysts that have covered the stock have Buy-equivalent ratings. In addition, we skipped stocks with an average analyst price target upside above 15%. The stocks are listed in descending order of their average analyst price target upside.\n\nWe also added the hedge fund sentiment around each stock which was taken from our database of over 900 elite hedge funds. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here). 5 Countries with the Most Special-Mission Aircraft in the World\n\nA military aircraft in flight, showing the strength of the company's combat & air mobility capability.\n\nLockheed Martin Corporation (NYSE:LMT)\n\nAverage Analyst Price Target Upside as of September 16: -2.26%\n\nNumber of Hedge Fund Holders: 56\n\nLockheed Martin Corporation (NYSE:LMT) operates as a global leader in security and aerospace, specializing in the development and integration of advanced technology systems and services. The company operates through four main segments, Aeronautics, Missiles and Fire Control, Rotary and Mission Systems, and Space.\n\nThe segments include a wide range of products and services, including combat and air mobility aircraft, unmanned air vehicles, air and missile defense systems, tactical missiles, helicopters, satellites, and space transportation systems.\n\nThe company's notable offerings include the F-35 and F-22 fighter jets, which represent some of the most advanced aircraft in the U.S. military's arsenal. The company’s Sikorsky unit also plays an important role in providing both military and commercial helicopters. According to Bloomberg Government, Lockheed Martin (NYSE:LMT) holds the position of the largest defense contractor in the U.S., with $46 billion in contract obligations.\n\nHowever, the company has encountered several challenges recently. The company, like many other defense contractors, has faced supply chain disruptions and increased raw materials costs. Profit margins have been under pressure, and there was a temporary halt in the delivery of F-35 jets due to issues with the aircraft’s latest software. The pause lasted nearly a year and was only resolved through a compromise that involved accepting a downgraded version of the software rather than waiting for a fully tested version.\n\nOut of the 25 analysts that have covered the stock, 11 keep Hold ratings, 1 has an Underweight rating and 1 maintains a Sell rating on it. As of September 16, the average price target of $560.00 implies a downside of 2.26% to the stock’s current price.\n\nDespite these hurdles, Lockheed Martin’s (NYSE:LMT) prospects have shown improvement. The company recently reported strong results for the second quarter, and deliveries of the F-35 have resumed, which shows a positive turn in operations.\n\nAdditionally, it announced plans to acquire Terran Orbital in a deal valued at $450 million, which is lower than the initial $600 million offer. The acquisition is expected to significantly improve the company's supply chain and improve its access to satellite technology, which is crucial for fulfilling Pentagon contracts.\n\nThe company has raised its 2024 revenue forecast. The company now forecasts revenues between $70.5 billion and $71.5 billion, up from the previous estimate of $68.5 billion to $70 billion. The upward revision also includes an improved EPS outlook, now projected to be between $26.10 and $26.60, compared to the earlier range of $25.65 to $26.35.\n\nIn the second quarter, 56 hedge funds had investments in Lockheed Martin (NYSE:LMT), with positions worth $2.056 billion. Two Sigma Advisors is the biggest shareholder in the company as of Q2. In the quarter, the firm increased its stake by 7% to 855,600 shares worth $399.65 million.\n\nOverall LMT ranks 5th on our list of the worst aviation stocks to buy. While we acknowledge the potential of LMT as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than LMT but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nRead Next: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-corporation-lmt-street-143408396.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.042,
            "neu": 0.827,
            "pos": 0.131
        }
    },
    {
        "date": "2024-09-21T11:00:22+00:00",
        "title": "Investing in Lockheed Martin (NYSE:LMT) three years ago would have delivered you a 77% gain",
        "content": "By buying an index fund, investors can approximate the average market return. But if you pick the right individual stocks, you could make more than that. For example, the Lockheed Martin Corporation (NYSE:LMT) share price is up 64% in the last three years, clearly besting the market return of around 16% (not including dividends). On the other hand, the returns haven't been quite so good recently, with shareholders up just 42%, including dividends.\n\nWith that in mind, it's worth seeing if the company's underlying fundamentals have been the driver of long term performance, or if there are some discrepancies.\n\nCheck out our latest analysis for Lockheed Martin\n\nTo paraphrase Benjamin Graham: Over the short term the market is a voting machine, but over the long term it's a weighing machine. One imperfect but simple way to consider how the market perception of a company has shifted is to compare the change in the earnings per share (EPS) with the share price movement.\n\nLockheed Martin was able to grow its EPS at 3.1% per year over three years, sending the share price higher. In comparison, the 18% per year gain in the share price outpaces the EPS growth. So it's fair to assume the market has a higher opinion of the business than it did three years ago. That's not necessarily surprising considering the three-year track record of earnings growth.\n\nThe graphic below depicts how EPS has changed over time (unveil the exact values by clicking on the image). earnings-per-share-growth\n\nThis free interactive report on Lockheed Martin's earnings, revenue and cash flow is a great place to start, if you want to investigate the stock further.\n\nWhat About Dividends?\n\nWhen looking at investment returns, it is important to consider the difference between total shareholder return (TSR) and share price return. Whereas the share price return only reflects the change in the share price, the TSR includes the value of dividends (assuming they were reinvested) and the benefit of any discounted capital raising or spin-off. It's fair to say that the TSR gives a more complete picture for stocks that pay a dividend. In the case of Lockheed Martin, it has a TSR of 77% for the last 3 years. That exceeds its share price return that we previously mentioned. And there's no prize for guessing that the dividend payments largely explain the divergence!\n\nA Different Perspective\n\nIt's good to see that Lockheed Martin has rewarded shareholders with a total shareholder return of 42% in the last twelve months. That's including the dividend. That gain is better than the annual TSR over five years, which is 11%. Therefore it seems like sentiment around the company has been positive lately. Given the share price momentum remains strong, it might be worth taking a closer look at the stock, lest you miss an opportunity. It's always interesting to track share price performance over the longer term. But to understand Lockheed Martin better, we need to consider many other factors. To that end, you should be aware of the  2 warning signs  we've spotted with Lockheed Martin .\n\nStory continues\n\nOf course, you might find a fantastic investment by looking elsewhere. So take a peek at this freelist of companies we expect will grow earnings.\n\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/investing-lockheed-martin-nyse-lmt-110022995.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.023,
            "neu": 0.798,
            "pos": 0.179
        }
    }
]