[
    {
        "date": "2024-07-08T16:51:29+00:00",
        "title": "Is Trending Stock Lockheed Martin Corporation (LMT) a Buy Now?",
        "content": "Lockheed Martin (LMT) has recently been on Zacks.com's list of the most searched stocks. Therefore, you might want to consider some of the key factors that could influence the stock's performance in the near future.\n\nOver the past month, shares of this aerospace and defense company have returned -1.7%, compared to the Zacks S&P 500 composite's +4.1% change. During this period, the Zacks Aerospace - Defense industry, which Lockheed falls in, has lost 3.3%. The key question now is: What could be the stock's future direction?\n\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\n\nRevisions to Earnings Estimates\n\nHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\n\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nFor the current quarter, Lockheed is expected to post earnings of $6.45 per share, indicating a change of -4.2% from the year-ago quarter. The Zacks Consensus Estimate remained unchanged over the last 30 days.\n\nThe consensus earnings estimate of $26.26 for the current fiscal year indicates a year-over-year change of -5.6%. This estimate has remained unchanged over the last 30 days.\n\nFor the next fiscal year, the consensus earnings estimate of $28.37 indicates a change of +8% from what Lockheed is expected to report a year ago. Over the past month, the estimate has remained unchanged.\n\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Lockheed is rated Zacks Rank #3 (Hold).\n\nStory continues\n\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n\n12 Month EPS\n\nProjected Revenue Growth\n\nWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\n\nIn the case of Lockheed, the consensus sales estimate of $17.03 billion for the current quarter points to a year-over-year change of +2%. The $69.72 billion and $72.44 billion estimates for the current and next fiscal years indicate changes of +3.2% and +3.9%, respectively.\n\nLast Reported Results and Surprise History\n\nLockheed reported revenues of $17.2 billion in the last reported quarter, representing a year-over-year change of +13.7%. EPS of $6.33 for the same period compares with $6.43 a year ago.\n\nCompared to the Zacks Consensus Estimate of $16.19 billion, the reported revenues represent a surprise of +6.21%. The EPS surprise was +9.14%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\n\nValuation\n\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\n\nWhile comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S) and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.\n\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\n\nLockheed is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\n\nBottom Line\n\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Lockheed. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/trending-stock-lockheed-martin-corporation-165129879.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.01,
            "neu": 0.861,
            "pos": 0.129
        }
    },
    {
        "date": "2024-07-08T11:58:00+00:00",
        "title": "Lockheed (LMT) Wins $227M Deal for Army Tactical Missile System",
        "content": "Lockheed Martin Corp. LMT recently secured a contract to procure Army Tactical Missile System (“ATACMS”) guided missile and launching assembly. The Army Contracting Command, Redstone Arsenal, AL, has provided the award.\n\nValued at $226.9 million, the contract is expected to be completed by Dec 30, 2028. Work related to this deal will be executed in Grand Prairie, TX.\n\nThe contract will serve the governments of Estonia, Latvia, Lithuania, Morocco and Poland.\n\nRising Missile Demand & Lockheed\n\nRapidly increasing geopolitical tensions worldwide, along with heightened regional conflicts in different parts of the globe, like the Middle East, Eastern Europe and the South China Sea over the last decade, have prompted nations to bolster their defense capabilities.  Since missiles constitute a large share of a nation’s defense arsenals, countries are investing heftily these days in advanced missile systems for deterrence and defense. This, in turn, has been boosting the demand for technologically advanced missile systems.\n\nWhen it comes to purchase of missiles, Lockheed remains one of the top choices as a missile manufacturer. Notably, the company’s broad portfolio of missile products includes air-to-air missiles to give pilots air supremacy; helicopter-launched anti-armor missiles to destroy enemy tanks and other armored vehicles; man-portable short-range anti-armor and assault weapons; and kinetic energy hyper-velocity missiles.  These can defeat all current and future armored threats as well as hit-to-kill air defense systems that protect the troops from ballistic missiles, cruise missiles, enemy aircraft and weapons of mass destruction.\n\nIn particular, LMT’s ATACMS is a conventional surface-to-surface artillery weapon system capable of striking targets well beyond the range of existing Army cannons, rockets and other missiles. It comes with an improved guidance package with Global Positioning System (“GPS”) and offers a maximum range of 300 kilometers. These features must have been boosting the demand for ATACMS, the latest contract win being a bright example of that.\n\nGrowth Prospects\n\nWith the ongoing hostilities across the globe, the global peace index indicates an unstable environment. As a result, the demand for military weapons — especially missiles — has increased in the defense industry as nations attempt to defend their borders from previously unheard-of attacks.\n\nThis must have prompted the Mordor Intelligence firm to project that the global missiles and missiles defense system market will witness a CAGR of 5% over the 2024-2029 period. Such growth opportunities offered by the aforementioned market should bode well for Lockheed, which is a prominent missile manufacturer.\n\nStory continues\n\nIts major missile programs include the Patriot Advanced Capability-3 (PAC-3) and Terminal High Altitude Area Defense (“THAAD”) air and missile defense programs, Multiple Launch Rocket System (“MLRS”), Precision Strike Missile (PrSM), Joint Air-to-Surface Standoff Missile (“JASSM”), Long Range AntiShip Missile (“LRASM”), the Hellfire tactical and strike missile programs and the Javelin program, which is an anti-tank precision weapon system.\n\nLMT apart, defense contractors that are likely to benefit from the growth opportunities offered by the missiles and missile defense system market are as follows:\n\nNorthrop Grumman NOC: It creates and manufactures warheads, fuses, sophisticated high-speed propulsion systems and other missile components. The company is one of the top suppliers of solid rocket propulsion for air-launched missiles, interceptors, submarine-launched weapons and hypersonic missile systems.\n\nNorthrop has a long-term (three to five years) earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales suggests growth of 4.6% from the prior-year reported figure.\n\nRTX Corp RTX: It offers a variety of combat-proven missile defense systems, including the Patriot missile, Standard Missiles, Advanced Medium-Range Air-to-Air Missiles, Evolved Seasparrow Missiles, the Tomahawk cruise missile and a few more. To keep up with its growing demand for a wide variety of missiles, RTX broke ground with a $115 million worth, 26,000-square-foot expansion of its Redstone Raytheon Missile Integration Facility in April 2024.\n\nRTX boasts a long-term earnings growth rate of 10.6%. The Zacks Consensus Estimate for its 2024 sales implies an improvement of 6.2% from the 2023 reported figure.\n\nThe Boeing Company BA: For almost 25 years, Boeing has been providing the United States, its allies and international partners with air and missile defense systems. The Avenger Air Defense System, Ground-Based Midcourse Defense and a few additional missiles are among its product offerings.\n\nBA boasts a long-term earnings growth rate of 25.5%. The stock holds an average four-quarter earnings surprise of 17.83%.\n\nPrice Movement\n\nIn the past year, shares of Lockheed have risen 3.2% against the industry’s decline of 10%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLockheed currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-wins-227m-deal-115800825.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.071,
            "neu": 0.759,
            "pos": 0.171
        }
    }
]