[
    {
        "date": "2024-05-09T23:17:14+00:00",
        "title": "10 Weakest Militaries in Europe",
        "content": "In this article, we look at the 10 weakest militaries in Europe. You can skip our detailed analysis on defense spending patterns in the continent and head over directly to the 5 Weakest Militaries in Europe.\n\nGlobal military spending reached a record-high of $2.44 trillion in 2023, according to latest figures released by the Stockholm International Peace Research Institute (SIPRI), having grown 6.8% compared to 2022 – the steepest rise in defense expenditure since 2009. This is the ninth successive year in which global military spending has increased.\n\nIn Europe, military spending totaled $588 billion during the year, which represented nearly one-fourths (24%) of all global defense expenditure. The amount was 16% higher than in 2022, and 62% of the value a decade ago in 2014. Defense spending has surged in the continent after Russia’s invasion of Ukraine in February 2022, with both countries substantially increasing military expenditure, and others in the region also racking up their defenses with war returning to Europe after decades of peace.\n\nOf the total spent in Europe in 2023, $407 billion, or 69%, were incurred on defense expenditure in Central and Western Europe, with the United Kingdom being the largest spender in the subregion, followed by Germany. While, $181 billion were spent on military procurements in Eastern Europe, with Ukraine spending a whopping $64.8 billion on defense, which helped it climb from 11th spot in 2022 to become the eighth largest military spender in the world in 2023.\n\nAnother recent report by SIPRI highlighted a 94% increase in arms imported by European countries between 2019-2023 compared to 2014-18, with the United States being the origin of 55% of all of these imports in the last five years. The spike in defense spending over the last couple of years has created a boom in the aerospace and armaments manufacturing industry in the United States.\n\nLockheed Martin Corporation (NYSE:LMT) registered revenues of $67.6 billion last year, which was 2.4% higher than in 2022. The company’s net earnings also rose $5.7 billion compared to the previous year. Lockheed Martin Corporation (NYSE:LMT)’s stock price has risen 18.3% since the Russia-Ukraine war. On the other hand, RTX Corporation (NYSE:RTX) also posted a revenue of $68.9 billion, which was 3% higher year-on-year. Northrop Grumman Corporation (NYSE:NOC)’s sales also expanded 7% than figures in 2022, to total $39.3 billion last year.\n\nSeveral European countries that are part of NATO have actively been pursuing the procurement of advanced military equipment to further enhance national security, and also meet the treaty’s expectation of member states committing at least 2% of their GDP on defense. You can read more on this in NATO Spending by Country Per Capita: Top 15 Countries. Germany in December 2022 sealed a $8 billion agreement with the United States, under which it would procure 35 F-35 fifth-generation fighter jets from Lockheed Martin Corporation (NYSE:LMT). Moreover, in March this year, RTX Corporation (NYSE:RTX) won a $1.2 billion deal to build Patriot air and missile defense systems for Berlin, which would significantly boost the country’s air defense.\n\nStory continues\n\nLate last year in November, Hungary also received the delivery of two units of the NASAMS air defense system it had ordered from RTX Corporation (NYSE:RTX) and Kongsberg Defence & Aerospace. The American defense giant is also reportedly in negotiations with Safran, a French aerospace company, over the latter potentially purchasing flight control units from RTX Corporation (NYSE:RTX).\n\nMoreover, air defense capabilities of Latvia, Estonia, and Lithuania were bolstered last year with Northrop Grumman Corporation (NYSE:NOC) fielding Forward Area Air Defense Command and Control (FAAD C2) systems in these countries, under a $14.3 million fund provided by Washington. Seeing a sustained demand for its offerings, the company has projected a revenue of $41 billion in 2024 – 4.3% higher than 2023. Northrop Grumman Corporation (NYSE:NOC) has also teamed up with Danish company Terma on delivering electronic warfare training in Northern Europe.\n\nKathy Warden, CEO and Chairman of Northrop Grumman Corporation (NYSE:NOC) shared the following remarks in the company's Q1 2024 Earnings Call:\n\n\"Growing global demand for our capabilities led to an exceptional 9% year-over-year increase in Q1 sales, driven by growth in all four of our sectors. The productivity and cost efficiency measures we’ve been implementing are gaining traction, and our program performance in the quarter was strong resulting in segment operating margin dollars increasing by 10%. Operating profit expansion along with the lower share count helped to drive 15% EPS growth. Overall, our first quarter performance was in line with, or better than our expectations, and we are reaffirming our 2024 company level guidance. Global demand for our products continues to be robust, fueled by rising defense budgets and our market position. We’re pleased that an agreement was reached on the U.S. fiscal year 2024 defense budget, which includes support for our key programs, and represents a 6% growth in investment accounts over 2023. In March, the administration released the 2025 defense budget, and future year’s defense program, or FIDGET. And these also were consistent with our expectations. We continue to see robust support for our program portfolio in areas that include nuclear modernization, microelectronics, advanced weapons, and space.\"\n\nThat being said, despite the increase in demand for weapons in Europe, defense spending has not been even across the continent, with several countries being a weak link as Moscow continues to pile up the pressure. We now take a look at some of those countries, focusing on the 10 weakest militaries in Europe.\n\nIf interested, you can also take a look at the 10 Weakest Militaries in Africa. 10 Weakest Militaries in Europe\n\nDavid Acosta Allely / Shutterstock.com\n\nMethodology\n\nThree broad categories of weighted metrics have been considered to rank the weakest militaries in Europe. 50% weightage was assigned to the strength of ground troops, which consisted of analyzing their manpower, tank fleet, and armored fighting vehicles; 30% was allotted to aerial and naval capabilities, while the remaining 20% was represented by the size of their economy and defense spending in 2023. Weighted scores for each metric were then aggregated to get a final overall weighted ranking score. The 10 weakest militaries in Europe are listed in descending order of their overall scores. Please note that Iceland has been excluded from the list since it does not have a standing military.\n\nData related to military equipment has been sourced from the Global Firepower Index 2024, while International Monetary Fund (IMF) and Stockholm International Peace Research Institute (SIPRI) were consulted for fresh figures related to the sizes of countries’ economies and their defense spending in 2023.\n\nBy the way, Insider Monkey is an investing website that uses a consensus approach to identify the best stock picks of more than 900 hedge funds investing in US stocks. The website tracks the movement of corporate insiders and hedge funds. Our top 10 consensus stock picks of hedge funds outperformed the S&P 500 stock index by more than 140 percentage points over the last 10 years (see the details here). So, if you are looking for the best stock picks to buy, you can benefit from the wisdom of hedge funds and corporate insiders.\n\nLet’s now head over to the list of the weakest armed forces in Europe.\n\n10. Latvia\n\nGDP (2023): $46.67 billion\n\nDefense Spending (2023): $1.04 billion\n\nManpower: 17,250\n\nTanks: 0\n\nArmored Fighting Vehicles: 1,544\n\nMilitary Aircraft: 7\n\nNaval Assets: 18\n\nOverall Score: 7.80\n\nLatvia spent 2.27% of its GDP on defense last year, and is among only eleven NATO member countries to meet the organization’s 2% spending goal. Despite that, it is a weak link when it comes to military strength. The country has no battle tanks, and has an extremely small fleet of military aircraft and naval assets. When it comes to manpower, Latvia has a little over 17,000 active personnel.\n\n9. Slovenia\n\nGDP (2023): $68.39 billion\n\nDefense Spending (2023): $907.5 million\n\nManpower: 7,300\n\nTanks: 55\n\nArmored Fighting Vehicles: 1,502\n\nMilitary Aircraft: 38\n\nNaval Assets: 2\n\nOverall Score: 6.95\n\nSlovenia has one of the weakest militaries in Europe, with a manpower of only 7,300 active troops, while its navy has only two vessels – one being a patrol ship, and the other a patrol boat. The country has a sizable number of armored fighting vehicles, but that alone is not sufficient to meet Slovenia’s military requirements. It also has 55 battle tanks and 38 military aircraft.\n\n8. North Macedonia\n\nGDP (2023): $15.8 billion\n\nDefense Spending (2023): $266.6 million\n\nManpower: 9,000\n\nTanks: 23\n\nArmored Fighting Vehicles: 2,156\n\nMilitary Aircraft: 20\n\nNaval Assets: 0\n\nOverall Score: 6.00\n\nNext on our list of the weakest militaries in Europe is North Macedonia, which joined NATO in March 2020. The country spent a meager $266 million on defense expenditure last year, which represented about 1.7% of its GDP. North Macedonia has only 9,000 troops, 20 military aircraft, and no naval assets, according to the Global Firepower Index. The only area of recognizable military strength for the country is its large fleet of armored fighting vehicles.\n\n7. Bosnia and Herzegovina\n\nGDP (2023): $26.94 billion\n\nDefense Spending (2023): $216.7 million\n\nManpower: 12,770\n\nTanks: 91\n\nArmored Fighting Vehicles: 450\n\nMilitary Aircraft: 24\n\nNaval Assets: 0\n\nOverall Score: 5.85\n\nBosnia and Herzegovina’s armed forces are among the weakest in the world, especially when it comes to naval strength and active manpower. The country’s fleet of battle tanks and military aircraft also remain small. There is some hope, however, that stable economic growth over the last few years, coupled with military assistance from the United Arab Emirates, Saudi Arabia, and the United States may help the country shrug off its reputation of being a weak link militarily in Europe.\n\n6. Albania\n\nGDP (2023): $23.03 billion\n\nDefense Spending (2023): $397.6 million\n\nManpower: 6,600\n\nTanks: 40\n\nArmored Fighting Vehicles: 976\n\nMilitary Aircraft: 19\n\nNaval Assets: 19\n\nOverall Score: 5.60\n\nAlbania is in sixth spot in our list, with an extremely small military force of 6,600 active personnel. Moreover, all 19 of the country’s military aircraft comprise attack helicopters, whereas Albania’s naval assets are mostly patrol crafts. Albania faces persistent threats of domination from powerful countries in its neighborhood due to its small size and a weak military.\n\nClick to continue reading and see the 5 Weakest Militaries in Europe.\n\nSuggested Articles:\n\n15 Most Powerful Militaries in Latin America 15 Most Powerful Militaries in Africa 15 Most Powerful Militaries in Asia\n\nDisclosure: None. 10 Weakest Militaries in Europe is originally published on Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/10-weakest-militaries-europe-231714277.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.059,
            "neu": 0.829,
            "pos": 0.112
        }
    }
]