[
    {
        "date": "2024-08-13T19:05:47+00:00",
        "title": "7 Divine Dividend Stocks to Buy for Another Market Crash",
        "content": "Buying dividend stocks has proven to be a superior investing strategy. Because dividend payers tend to be large, successful businesses, they can better withstand the winds of market turmoil.\n\nAnalysts at the Hartford Funds found that going as far back as 1930, stocks that initiated and raised their dividends handily beat all other stocks. Moreover, there was never a time when dividend stocks on the benchmark index had a losing decade.\n\nIt just makes sense that being paid to own stocks and hold them for the long haul turns out to be a very rewarding and lucrative investment strategy. Because we don’t know which way the market will be heading, the following seven dividend stocks are ones to buy — just in case the market crashes. Or even if it doesn’t.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nPfizer (PFE) blue Pfizer logo on the windows of a corporate building PFR stock\n\nSource: photobyphm / Shutterstock.com\n\nPharmaceutical giant Pfizer (NYSE:PFE) is one of the world’s largest drugmakers, with over $58 billion in annual sales. It has a strong portfolio of drugs on the market and a robust pipeline in development that supports its long-term growth prospects. It also possesses the financial resources to continue funding future research and development while having fewer older drugs or those facing patent expiration.\n\nBecause a lot of attention is focused on the dramatic decline in sales of Cominarty, its COVID-19 therapeutic, Pfizer stock trades at a significant discount today. Shares go for just 11 times next year’s earnings estimates, with analysts forecasting earnings will grow at 17% annually for the next five years. At less than 3x sales, PFE stock trades well below its historical average. It was last at this level more than a decade ago.\n\nAnalysts are looking for $60.99 billion in sales this year, up 4% from last year. It generated $55.2 billion in revenue over the trailing 12 months. Analysts anticipate 2025 sales could reach $63.2 billion, a 4% rise. Earnings in 2025 could reach $2.86 per share, over 50% above last year, with a high forecast of $3.25 per share.\n\nPfizer stock is offered at just $28 a stub and pays a dividend that yields 5.9% annually. The pharma giant is a solid pick for long-term wealth creation.\n\nKimberly-Clark (KMB) Kimberly Clark (KMB) sign, positioned outside the world headquarters’ main entrance.\n\nSource: Trong Nguyen / Shutterstock.com\n\nFocused on consumer products that have customers returning again and again, Kimberly-Clark (NYSE:KMB) owns a stable of premium brands, including Huggies diapers, Kleenex tissue and Scott paper towels. They are dominant brands that hold top positions in their respective markets.\n\nKimberly-Clark, though, has been hurt by high inflation levels. Consumers feeling pinched by rising prices have turned to lower-priced or white-label brands, hurting sales. Management has wisely refused to chase discounting in pursuit of sales and market share, preferring to bide its time and keep margins intact.\n\nStory continues\n\nWhile not as deeply discounted as it was at the start of the year, KMB stock trades at 19x estimates and 15 times the free cash flow (FCF) it produces. At 2.3x sales, it is in line with its historical average.\n\nAnalysts forecast full-year sales of $20.3 billion, which is negligibly lower than last year, with revenue remaining essentially flat in 2025. However, a slowing economy or one that falls into recession could lead to lower inflation. Kimberly-Clark will likely maintain its cost-cutting initiatives to wring inefficiencies out of its operations until prices moderate further.\n\nKMB stock is up 14% this year and pays a dividend that yields 3.5%, giving investors a strong stream of income until the economy normalizes.\n\nColgate-Palmolive (CL) The logo for Colgate-Palmolive Company (CL) is displayed on a large office building front.\n\nSource: Shutterstock\n\nSimilarly situated Colgate-Palmolive (NYSE:CL) was also hurt by the high inflation and high interest rate environment but has turned itself around in 2024. Although it has spent more on marketing for its top-tier products like toothpaste and dishwashing liquid, Colgate also invested in innovation. It is able to push new products out to market more quickly than in the past based on changing consumer preferences.\n\nThe consumer products giant does go for a premium today, with shares trading hands at 28 times earnings estimates, 4x sales and 22x FCF. Yet, these valuations are not so far afield from its historical averages.\n\nAnalysts are looking for sales of $20.2 billion in 2024, a 4% increase over last year. It has produced $20 billion in revenue over the last four quarters and has beaten forecasts each time. Wall Street also estimates sales of $20.9 billion in 2025, a 3.8% rise.\n\nAnalysts have had to continuously raise their price target on the stock to keep up with CL shares, which are up almost 30% in 2024. In a market crash, this dividend stock, yielding 2% annually, will be a staple for your portfolio.\n\nHershey (HSY) Hershey's milk chocolate pieces on a white plate on top of a wooden table\n\nSource: shutterstock.com/VG Foto\n\nChocolate King Hershey (NYSE:HSY) is the next dividend stock to buy for the coming market crash. The confectionery giant has faced a trio of problems, including strapped consumers, cocoa shortages raising prices and a sudden interest in weight loss by the appearance of drugs like Ozempic, Wegovy and Zepbound. While it has previously chosen to sit back and allow its prestige brand to carry the load, Hershey is now investing more heavily in new products and marketing.\n\nThe chocolatier also looks like it trades at a premium. Yet, as with the other dividend stocks discussed, HSY stock is well within normal ranges or even below them. Hershey goes for 4x sales, which is low compared to the past five years. It last traded at that level in 2019, just before HSY stock went on an 80% run higher.\n\nAnalysts are looking for a 2% increase in sales this year to $11.4 billion. They see it growing by 3% the following year to $11.7 billion. They do see earnings sliding about 1% a year over the next two years but have long-term earnings growth pegged at 1.9% annually.\n\nWall Street has tightened its price target on the stock and views it as fairly valued. But, with inflation moderating and cocoa bean costs down 25% from their spring highs, Hershey’s business is stabilizing. Its dividend yields 2.76% and remains solid.\n\nCoca-Cola (KO) Can of Coca-Cola, a carbonated soft drink manufactured by The Coca-Cola Company headquartered in Atlanta, Georgia, USA\n\nSource: monticello / Shutterstock\n\nCoca-Cola (NYSE:KO) still derives most of its revenue from carbonated beverages. Yet, it has increasingly turned to non-carbonated drinks as soda consumption declines. Like Hershey, the beverage giant has had to confront the availability of weight-loss drugs, dramatically changing consumer perceptions of its drinks. That makes its investments in juices, water and energy drinks all the more prescient and valuable to its long-term health.\n\nAt 6.3x sales, Coke is well under its recent averages and trades on the low side of its valuation history. A price-to-earnings ratio of 27 is right in line with its long-term trend, so this is not a premium price.\n\nWall Street sees sales remaining flat this year, with full-year estimates at $46.08 billion. Analysts forecast sales jumping 5% in 2025 to $48.31 billion. Profits are on a better footing, with over 11% growth through 2025. Wall Street also keeps incrementally increasing its price target as Coca-Cola stock has risen 16% this year.\n\nCoca-Cola has been around for more than 130 years and has paid a dividend since the 1920s. It increased its payout, which yields 2.85%, every year for the last 63 years, making it a Dividend King.\n\nFastenal (FAST) Fastenal (FAST) logo displayed on a mobile phone\n\nSource: IgorGolovniov / Shutterstock.com\n\nToolmaker and industrial and commercial parts supplier Fastenal (NASDAQ:FAST) may be a surprising pick for this list. Yet, it is a growing, profitable business that proves remarkably resilient. Daily sales growth rates have trended lower for the past two years, but this manufacturing sector distributor proves it can still grow. That it is happening in a challenging environment is a testament to its durability.\n\nFastenal stock trades at a premium and is above its historical averages. FAST shares go for 33 times earnings, 5x sales and 29x FCF. With the stock up 14% over the last 12 months, Fastenal gives the appearance of being at the top. Yet, its business may have actually reached a bottom and is poised to rebound.\n\nAnalysts are looking for 3.4% sales growth this year to $7.6 billion. They then see it jumping 7% in 2025 to $8.1 billion. Earnings are similarly positioned for a return to growth with better than 9% gains forecast over the next two years.\n\nAn industrial distributor is not always seen as a dividend stalwart. Yet, Fastenal was added to the list of Dividend Aristocrats earlier this year after raising its payout for the 25th consecutive year. This year’s increase was more than 12%, and the dividend yields 2.37% annually.\n\nSchwab US Dividend Equity ETF (SCHD) charles schwab sign outside of a building. SCHD stock\n\nSource: Isabelle OHara / Shutterstock.com\n\nInstead of searching out individual dividend stocks to protect your portfolio in a crash, a basket of solid income payers may be a better option. The Schwab US Dividend Equity ETF (NYSEARCA:SCHD) is an exchange-traded fund (ETF) launched 13 years ago. It has become synonymous with steadily rising dividend payments.\n\nThe ETF owns approximately 100 dividend-paying stocks and yields a healthy 3.6% annually. Its goal is to track the total return of the Dow Jones U.S. Dividend 100 Index, which focuses on the quality and sustainability of dividend payments.\n\nThe three largest holdings in the portfolio are defense contractor Lockheed-Martin (NYSE:LMT), pharmaceutical AbbVie (NYSE:ABBV) and the aforementioned Coca-Cola. They represent about 13% of the portfolio’s total. Schwab US Dividend Equity ETF has steadily increased its dividend, sporting double-digit growth rates over the past five- and 10-year periods. The latest increase last month was a whopping 35%.\n\nYet, SCHD’s dividend fluctuates quarter-to-quarter and can occasionally fall. On an annual basis, however, the payout has never declined.\n\nOn the date of publication, Rich Duprey held a LONG position in KMB, CL, KO and ABBV stock. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nRich Duprey has written about stocks and investing for the past 20 years. His articles have appeared on Nasdaq.com, The Motley Fool, and Yahoo! Finance, and he has been referenced by U.S. and international publications, including MarketWatch, Financial Times, Forbes, Fast Company, USA Today, Milwaukee Journal Sentinel, Cheddar News, The Boston Globe, L’Express, and numerous other news outlets.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post 7 Divine Dividend Stocks to Buy for Another Market Crash appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/7-divine-dividend-stocks-buy-190547333.html",
        "symbols": [
            "0IKW.LSE",
            "0J4X.LSE",
            "0JQZ.LSE",
            "0P59.LSE",
            "4FX.F",
            "ABBV.US",
            "CCC3.BE",
            "CCC3.DU",
            "CCC3.F",
            "CCC3.HA",
            "CCC3.HM",
            "CCC3.MU",
            "CCC3.STU",
            "CCC3.XETRA",
            "CL.MX",
            "CL.US",
            "COCA34.SA",
            "COLA.NEO",
            "COLG34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.03,
            "neu": 0.862,
            "pos": 0.108
        }
    },
    {
        "date": "2024-08-13T16:16:44+00:00",
        "title": "Lockheed Martin, General Dynamics to build their own rocket motors",
        "content": "(Reuters) - Lockheed Martin and General Dynamics on Tuesday announced an agreement to build solid rocket motors amid an ongoing shortage that has capped production of missiles.\n\n(Reporting by Pratyush Thakur in Bengaluru; Editing by Shilpi Majumdar)\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-general-dynamics-announce-161644476.html",
        "symbols": [
            "0IUC.LSE",
            "0R3E.LSE",
            "GD.MX",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.599,
            "neg": 0.047,
            "neu": 0.793,
            "pos": 0.161
        }
    },
    {
        "date": "2024-08-13T14:30:00+00:00",
        "title": "7 Space Exploration Stocks That Could Pioneer New Frontiers",
        "content": "Ongoing developments in next generation launch vehicles, as well as lunar missions, together with the rising interest of the private sector in space exploration, make space explorations stocks potentially lucrative targets for investors. The rivalry between the two global superpowers is growing ever more heated, and both the United States and China are pouring money into space exploration and development, from satellites to moon landing missions. Space exploration stocks could then be potentially lucrative investments for investors who buy these stocks early.\n\nOne thing I appreciate the most about these space exploration stocks to buy is that many of them trade at very low valuation ratios. Most of the companies discussed in this list are penny stocks with market capitalizations that promise a hefty upside.\n\nThe risks of investing in space exploration stocks is significant. However, I feel that owning a small position in some of these stocks may improve risk-adjusted returns over the long run thanks to their promising prospects for growth.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nRocket Lab (RKLB) Homepage of Rocket lab (RKLB). Official website of company\n\nSource: OleksandrShnuryk / Shutterstock.com\n\nRocket Lab (NASDAQ:RKLB) is one of the best space exploration stocks to buy according to my estimates. The standout figure is Rocket Lab’s record quarterly revenue of $106 million, representing a massive 71% year-over-year increase. Unlike some other space exploration stocks that have encountered significant operational setbacks and tepid demand, RKLB stock demonstrated. CEO Peter Beck emphasized this point, stating that the results demonstrate “the strong and growing demand for our launch services and space systems products, and importantly, our team’s ability to execute against it.”\n\nFurthermore, I think that the best has yet to come for investors in RKLB stock, as the future looks accretive. Their Electron rocket remains the leading small launch vehicle globally, and it has attracted 17 new launch contracts year-to-date.\n\nAlthough RKLB stock is currently unprofitable, the firm’s gross margin stands at a healthy 30%, with the Neutron rocket being a major draw card for the firm to improve its profitability in the future.\n\nVirgin Galactic (SPCE) A photo of a futuristic-looking silver airplane.\n\nVirgin Galactic (NYSE:SPCE) also had many positive developments to report in its second-quarter earnings for this year. A key highlight is the successful completion of VSS Unity’s operational phase with the ‘Galactic 07’ mission. The VSS Unity was SPCE’s space plane that made its first successful commercial flight. It recorded a per-seat revenue of $900,000, which I feel is a great sign that there’s commercial interest in SPCE’s future Delta-class spaceship program that is due to commence commercialization in 2026.\n\nCEO Michael Colglazier’s statement that “Progress on our Delta Class spaceship program was substantial in Q2, with the pace of design completion accelerating and tool fabrication underway” is particularly encouraging to me, as operational milestones are apparently being completed on schedule.\n\nThe firm’s $821 million in cash also buys its substantial runway. In fact, judging by its adjusted amount of cash burn, this even allows SPCE to miss its 2026 target without needing to take on debt or issue shares, which preserves upside. It could then be one of those space exploration stocks for investors to consider.\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) Space Systems sign in Sunnyvale, California.\n\nSource: Ken Wolter / Shutterstock.com\n\nI like Lockheed Martin (NYSE:LMT) as one of those space stocks for investors who prefer owning less speculative investments. Although it is primarily known for its aircraft and is America’s largest defense contractor, it has a sizable and growing presence in the space industry. For instance, last quarter, space segment net sales increased by $310 million, or 10%, compared to Q1 2023. Not only did its top-line expand, but its operating profit did too, growing by $45 million, or 16%, compared to the same period last year.\n\nLMT stock saw the largest top-line growth in strategic and missile defense programs, which saw a $140 million increase compared with the same period last year. Meanwhile, National security space programs also saw a sizable boost, recording $115 million in additional revenue. This can be broken down into its Transport Layer and GPS III programs.\n\nAs the new space race has a fundamentally geopolitical aspect to it, I expect that demand for LMT’s revenues and profits to rise in its space segment as orders to the U.S. and NATO allies ramp up in response to heightened tensions.\n\nTerran Orbital (LLAP) An image of the view from a high-tech spaceship looking out at planets and asteroids. space stocks\n\nSource: sdecoret / Shutterstock\n\nTerran Orbital (NYSE:LLAP) is a small satellite manufacturer that I believe has great potential. Its recent quarterly results were impressive, with a great amount of demand for its services. Small satellites tend to be favored by defense contractors. This is evidenced by their sizable backlog, which stood at $312.7 million as of June 30th. A substantial portion of this backlog is tied to programs with Lockheed Martin.\n\nLLAP stock is a tiny business compared with the other space exploration stocks on this list, as it has a market cap of just $145 million. As such, it is going through teething issues, but it is also making promising progress. While revenues dipped slightly year-over-year, gross profit increased to $2.8 million in Q2 2024, up from just $0.8 million in Q2 2023. The company also reduced its net loss.\n\nThe market for small satellites is growing, and its relationship with LMT for much of its revenues is both a blessing and a curse, lest there be a downturn in defense spending. However, my view is that tensions will continue\n\nRedwire (RDW) Surface of Earth planet in deep space. Outer dark space wallpaper. Night on planet with cities lights. View from orbit. Elements of this image furnished by NASA. Space stocks\n\nSource: Dima Zel / Shutterstock.com\n\nRedwire (NYSE:RDW) is an American aerospace manufacturer. Like other space exploration stocks in this article, the company also reported promising results last quarter.\n\nThe most striking figure is the 30% year-over-year revenue growth to $78.1 million. I also think that RDW is potentially undervalued as one of those space stocks you could write home about – their contracted backlog increased by nearly 30% year-over-year to $354 million.\n\nOne of the hottest trends for space exploration stocks is the rise of Very Low Earth Orbit (VLEO) satellites and satellite constellations. The satellites orbit close to the Earth, which is welcomed by communities in remote areas and governments seeking reduced latency for internet and voice communications. RDW stock has its SabreSat VLEO, which it secured a key win for last quarter in the form of a flight contract. CEO Peter Cannito described RDW as having “strong strong financial and technical momentum” as it heads into Q3.\n\nIridium Communications (IRDM) the Iridium Satellite Communications logo seen displayed on a smartphone\n\nSource: rafapress / Shutterstock.com\n\nIridium Communications (NASDAQ:IRDM) is a global satellite communications company. It provides both data and voice connectivity worldwide. This year seems to have been especially accretive for space exploration stocks, as Iridium’s Q2 2024 results demonstrate solid growth.\n\nTheir total revenue increased by 4% year-over-year, driven by a 5% growth in service revenue, which now accounts for 76% of total revenue. Most notably, service revenue is recurring in nature, which provides the firm with a solid base for its future financial health.\n\nThere are two sterling examples from IRDM earnings that makes me think that it will continue to surprise the market. The firm has a solid relationship with the U.S government, and it has additional contract revenue from it starting in September this year. Another shining example is that it expects to see a continued expansion of its revenue growth and an indirect boost to its net income could be on the cards via its strong tax management strategies.\n\nSpire Global (SPIR) Person holding smartphone with logo of US data analytics company Spire Global Inc. (SPIR) on screen in front of website. Focus on phone display. Unmodified photo.\n\nSource: T. Schneider / Shutterstock.com\n\nSpire Global (NYSE:SPIR) provides space-based data and analytics. I like it for a few reasons, notably due to its recent results. Revenue burgeoned 6% year-over-year to $25.7 million in Q1 2024, while Annual Recurring Revenue (ARR) swelled 15% to $120.9 million.\n\nSPIR might also be suitable for green investors, per recent comments by SPIR Global’s CEO Peter Platzer. The CEO stated: “Climate change and global security challenges are drivers of demand for our business. They are becoming more frequent and costly.” For me, this dovetails seamlessly with Spire’s focus on providing critical data and insights in these domains.\n\nPeering into the future, Spire’s guidance for Q2 2024 and full-year 2024 gives me reason to give it a buy recommendation. The company has accounted for a 20% sequential revenue growth in Q2, with positive adjusted EBITDA of $3.5 million at the midpoint.\n\nOn the date of publication, Matthew Farley did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nMatthew started writing coverage of the financial markets during the crypto boom of 2017 and was also a team member of several fintech startups. He then started writing about Australian and U.S. equities for various publications. His work has appeared in MarketBeat, FXStreet, Cryptoslate, Seeking Alpha, and the New Scientist magazine, among others.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post 7 Space Exploration Stocks That Could Pioneer New Frontiers appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/7-space-exploration-stocks-could-143000129.html",
        "symbols": [
            "0R3E.LSE",
            "6IC.BE",
            "6IC.F",
            "6IC.STU",
            "IRDM.US",
            "LLAP.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RDW.US",
            "RKLB.US",
            "SPCE.US",
            "SPIR.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.026,
            "neu": 0.832,
            "pos": 0.142
        }
    },
    {
        "date": "2024-08-13T00:00:00+00:00",
        "title": "7 Space Exploration Stocks That Could Pioneer New Frontiers",
        "content": "Explore space exploration stocks with potential for significant growth as global competition in space technology increases.",
        "link": "https://investorplace.com/2024/08/7-space-exploration-stocks-that-could-pioneer-new-frontiers/",
        "symbols": [
            "IRDM.US",
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.649,
            "neg": 0,
            "neu": 0.674,
            "pos": 0.326
        }
    }
]