[
    {
        "date": "2024-07-10T18:24:58+00:00",
        "title": "3 Next-Gen Aviation Stocks With Stratospheric Potential",
        "content": "The revival of supersonic travel is on the horizon, with several companies developing aircraft capable of significantly reducing travel time across continents. This innovation could redefine long-haul travel, so investors should keep an eye on next-gen aviation stocks.\n\nThe global market for commercial aircraft next-gen avionics is expanding. These advanced systems include state-of-the-art flight management systems, synthetic vision and improved communication and navigation tools. The market, currently valued at $5.33 billion, is projected to grow at a compound annual growth rate (CAGR) of 6.84% over the next five years​.\n\nNow is a great time for investors to consider adding these next-gen aviation stocks to their portfolios. All of these companies have impressive growth trajectories and are backed by solid order books and cheap valuation ratios. But time may be of the essence for investors, as these next-gen aviation stocks may not stay cheap for long.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nArcher Aviation (ACHR) Person holding mobile phone with web page of US eVTOL aircraft company Archer Aviation Inc. (ACHR) on screen with logo. Focus on center of phone display. Unmodified photo. Archer Aviation Stock Analysis\n\nSource: T. Schneider / Shutterstock.com\n\nArcher Aviation (NYSE:ACHR) is developing electric vertical takeoff and landing (eVTOL) aircraft aimed at enhancing urban air mobility. The company has strong potential based on the progress it is making with its Midnight eVTOL aircraft program.\n\nThe company has also made significant strides in the development and testing of Midnight’s critical systems. Passing rigorous testing is crucial for safety of flight readiness and supports Archer’s ongoing Federal Aviation Administration (FAA) certification program.\n\nFinancially, Archer has maintained a strong liquidity position, with over $520 million on hand at the end of Q1 while continuing to invest heavily in the Midnight program. This cash runway gives Archer the resources to continue advancing towards commercialization.\n\nFor investors who want to invest in leading companies, ACHR is one of the next-gen aviation stocks that people should consider closely. It offers a great mix of strong growth potential as well as a cheap valuation at just $4.35 per share at the time of writing.\n\nLockheed Martin (LMT) Close top view of a Lockheed Martin (LMT) F-35C Lightning II with afterburner on\n\nSource: ranchorunner / Shutterstock.com\n\nLockheed Martin (NYSE:LMT) is heavily involved in developing hypersonic weapons and aircraft. The company recently unveiled the Mako Multi-Mission Hypersonic Missile that is designed for versatility and speed.\n\nLockheed Martin posted sales of $17.2 billion in the first quarter, up 14% compared to Q1 2023. Net earnings were $1.5 billion, or $6.39 per share, compared to $1.7 billion, or $6.61 per share, in the prior year’s quarter. Cash from operations was $1.6 billion and free cash flow was $1.3 billion in Q1 2024.\n\nStory continues\n\nOperationally, all four of Lockheed Martin’s business segments grew sales year-over-year (YOY). Aeronautics revenue increased 9% driven by higher F-35 and F-16 volume.\n\nFinancially, Lockheed Martin continued to generate strong cash flow while returning significant cash to shareholders. The company paid $780 million in dividends and repurchased $1 billion of stock in Q1. It also issued $2 billion in new debt and ended the quarter with $2.8 billion in cash on hand.\n\nLeidos Holdings (LDOS) Leidos (LDOS) logo on the side of an office building\n\nSource: Jer123 / Shutterstock.com\n\nLeidos Holdings (NYSE:LDOS) is involved in various hypersonic programs for the U.S. Department of Defense. The company recently completed key reviews for the Air Force Research Lab’s (AFRL) hypersonic projects.\n\nLeidos posted revenues of $3.98 billion for the first quarter, up a healthy 7% YOY. All customer segments saw increased demand, especially for managed health services. Profitability was a key highlight in Q1. Net income surged 73% to $283 million, or $2.07 per diluted share. Adjusted EBITDA jumped 42% to a record $490 million, with EBITDA margins expanding significantly from 9.4% to 12.3% YOY.\n\nGiven the strong start to the year, management raised its full-year 2024 guidance across all key metrics. Leidos now expects revenue of $16 billion to $16.4 billion, adjusted EBITDA margins in the mid-to-high 11% range, non-GAAP earnings per share (EPS) of $8.40 to $8.80 and operating cash flow of approximately $1.3 billion for the year. With all these factors considered, LDOS is one of the next-gen aviation stocks for investors to strongly consider right now.\n\nOn the date of publication, Matthew Farley did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not hold (either directly or indirectly) any positions in the securities mentioned in this article.\n\nMatthew started writing coverage of the financial markets during the crypto boom of 2017 and was also a team member of several fintech startups. He then started writing about Australian and U.S. equities for various publications. His work has appeared in MarketBeat, FXStreet, Cryptoslate, Seeking Alpha, and the New Scientist magazine, among others.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 3 Next-Gen Aviation Stocks With Stratospheric Potential appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-next-gen-aviation-stocks-182458971.html",
        "symbols": [
            "0R3E.LSE",
            "ACHR.US",
            "L1DO34.SA",
            "LDOS.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "S6IA.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.012,
            "neu": 0.863,
            "pos": 0.125
        }
    },
    {
        "date": "2024-07-10T17:17:07+00:00",
        "title": "The 3 Most Undervalued Defense Stocks to Buy in July 2024",
        "content": "It is not hyperbole to say we are closer to World War III than at any time since the Cuban Missile Crisis in 1962. With the U.S. and its western allies provoking Russia over its invasion of Ukraine by saying they will admit the country into NATO, hostilities could escalate.\n\nSimilarly, war in the Middle East could spread further throughout the region dragging the superpowers into a head-to-head conflict. Furthermore, tensions between the U.S. and China over Taiwan are also heightened.\n\nWith so many hotspots that have erupted around the world in the last four years, it is surprising defense contractors aren’t doing better. Most defense stocks badly lag the S&P 500.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nWhile this is possibly because the market feels this is a period of peak earnings that is keeping investors away or runaway government deficits making the $850 billion defense budget unsustainable, there are several undervalued defense stocks ripe for picking. Let’s look at three of the best options.\n\nBoeing (BA) BA stock: a blue and white Boeing 787 flying in the sky above the clouds\n\nSource: vaalaa / Shutterstock\n\nChoosing Boeing (NYSE:BA) as an undervalued defense stock may seem comical considering the woes the aircraft manufacturer has with its commercial aircraft business. Although Boeing’s commercial side is typically its biggest (it represented almost 44% of total revenue in 2023) the plane maker’s defense side accounted for 42% of first-quarter revenue and was up 6% year over year. Commercial operations accounted for just 28% as sales plummeted 31% year-over-year due to its well-publicized issues.\n\nBeyond Air Force One and Two for the U.S. president and vice president, Boeing military aircraft include the C-17 Globemaster III, the B-52 bomber and F/A-18 and F-22 fighter jets.\n\nBoeing stock has bounced 15% off its lows but remains 30% below its 52-week high. It also sits 58% below its all-time high set in 2019. The plane maker, though, recently accepted a $243 million fine for pleading guilty to fraud regarding several plane crashes several years ago. As the fine is de minimis relative to its revenue, if approved, the aircraft stock can move beyond this sorry chapter in its history.\n\nThe company also said it would reacquire its parts manufacturer Spirit AeroSystems (NYSE:SPR) for $4.7 billion in a bid to have greater control over its manufacturing.\n\nBut the fact is, Boeing is simply too big to fail. It is one of just two major commercial aircraft manufacturers along with the U.K.’s BAE Systems (OTCMKTS:BAESY). Because Boeing is so critical to U.S. civilian and military aviation, its low point now represents an opportunity to buy an undervalued defense contractor.\n\nStory continues\n\nLockheed-Martin (LMT) A Lockheed Martin (LMT) Space Systems sign in Sunnyvale, California.\n\nSource: Ken Wolter / Shutterstock.com\n\nLockheed-Martin (NYSE:LMT) is the largest U.S. defense contractor. It generates almost $68 billion annually from government contracts and is responsible for some of the most important military programs.\n\nAmong its priorities are F-16 and F-22 fighter jets, F-35 stealth fighters, the Patriot missile system, Javelin anti-tank weapons systems, Black Hawk helicopters, Trident ballistic missiles and NASA’s Orion spacecraft. Many of these weapons and defense systems are also sold to foreign governments.\n\nIf there is a war anywhere, it is likely you will find Lockheed-Martin aircraft and defense systems at play. First-quarter revenue grew 14% to $17.2 billion with F-35 revenue rising almost 10% to $6.9 billion. Missile system sales were up 25% from last year.\n\nAlthough earnings dropped as questions about its fighter jet contracts rose, Lockheed secured a contract extension last month for the F-35 that should boost operating results. It remains a very profitable company that will be integral to the U.S. military for years.\n\nThe defense contractor’s stock trades at 16 times next year’s earnings estimates and 17 times free cash flow. Lockheed pays a dividend yielding 2.8% annually and has raised the payout for 21 consecutive years making it an attractive undervalued defense stock to buy.\n\nNorthrop Grumman (NOC) Northrop Grumman (NOC) logo on a corporate building\n\nSource: Kristi Blokhin / Shutterstock.com\n\nNorthrop Grumman (NYSE:NOC) is one of the world’s largest weapons manufacturers and military technology providers. It is arguably best-known for its flying wing-shaped B-2 stealth bomber. Its B-21 Raider will eventually replace the B-2. Northrop was also the sole bidder for the government’s Ground Based Strategic Deterrent intercontinental ballistic missile system that will replace existing Minuteman missiles.\n\nThe defense contractor’s stock is down 8% over the past year, though first-quarter revenue rose 8% to $10 billion and earnings jumped 15% to $6.32 per share. Northrop also has a shareholder-friendly policy of returning to investors most of the free cash flow it produces through stock buybacks and dividends. That amounted to $1.5 billion in the first quarter.\n\nThe undervalued defense stock has paid a dividend every year since 1990 and has raised the payout consistently since 2004. The dividend currently yields 1.8% annually.\n\nBecause this solid defense player still has a long runway of growth ahead of it, the beaten down share price makes it a buy in July.\n\nOn the date of publication, Rich Duprey did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or\r\nindirectly) any positions in the securities mentioned in this article.\n\nRich Duprey has written about stocks and investing for the past 20 years. His articles have appeared on Nasdaq.com, The Motley Fool, and Yahoo! Finance, and he has been referenced by U.S. and international publications, including MarketWatch, Financial Times, Forbes, Fast Company, USA Today, Milwaukee Journal Sentinel, Cheddar News, The Boston Globe, L’Express, and numerous other news outlets.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post The 3 Most Undervalued Defense Stocks to Buy in July 2024 appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-most-undervalued-defense-stocks-171707834.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "BA.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.986,
            "neg": 0.063,
            "neu": 0.834,
            "pos": 0.103
        }
    },
    {
        "date": "2024-07-10T17:07:08+00:00",
        "title": "3 Defense Stocks With Strong Dividend Track Records",
        "content": "3 Defense Stocks With Strong Dividend Track Records\n\nBenzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\n\nMilitary spending is consistently a significant part of the United States budget, and there are no signs of that abating any time soon. In fact, for the 2025 fiscal year, the U.S. Department of Defense has requested $850 billion in defense spending, a number that represents approximately 3% of the U.S. GDP. The vast defense budget is deployed across a wide variety of contractors, many of which are publicly traded. There are a few standouts that have a solid dividend yield and a consistent growth story.\n\nDon’t Miss: Finance companies are leaving New York for this hot city. Investing in its booming real estate market has never been more accessible.\n\nAn Aristocrat In The Making\n\nLockheed Martin (NYSE:LMT) is primarily known as a defense technology company. Its wide portfolio of products features aircraft, including both helicopters and military planes; radar and electronic warfare; submersible vehicles; space technology; and missiles. It frequently receives key contracts from the U.S. Department of Defense, including an over $500 million contract update with the Air Force.\n\nIn its most recent quarter, it achieved net sales of over $17.2 billion. But what might most interest investors is the money it returns to investors. During the quarter, it announced $1.8 billion in share buybacks and dividends, returning $780 million to shareholders in dividends.\n\nLockheed Martin's forward dividend yield is 2.73%. While some companies decreased or paused their dividends during the pandemic, Lockheed continued to grow its dividend at $3.15 or $12.30 annualized. It is in its 24th year of increasing dividends, bringing it very close to dividend aristocrat status. While the stock price has fluctuated, it has risen by nearly 25% over the past five years. Lockheed Martin's $159 billion backlog should keep business steady for years.\n\nTrending: Mark Cuban believes “the next wave of revenue generation is around real estate and entertainment” — this new real estate fund allows you to get started with just $100.\n\nA Former Dividend Aristocrat Still Shines\n\nIn 2023, Raytheon rebranded to RTX, bringing together Collins Aerospace, Pratt & Whitney, and Raytheon under a single name. Raytheon saw defense sales rise by 7% during the first quarter. Like Lockheed Martin, RTX has a substantial backlog of business, over $202 billion, as demand grows for its technology-driven products. RTX is heavily tied to the U.S. military but receives key contracts from other nations, including a $1.2 billion contract from Germany for radar, launchers, and command and control stations.\n\nStory continues\n\nThe dividend story is more modest here. RTX delivers a 2.52% forward dividend yield, but the annual dividend is $2.36. However, it was a dividend aristocrat until it decreased its dividend during the 2020 pandemic. While it has yet to achieve the dividend it was delivering before the pandemic, it has raised its dividend consistently over the past four years, and the stock price is up over 20% during the last five years.\n\nBy Land, Sea, And More\n\nFounded in 1952, General Dynamics has multiple business units related to defense, including aerospace, combat systems, and marine systems. Like RTX, its strength expands far beyond the U.S. military. It has contracts with various nations, including Romania, Austria, and Canada, delivering combat vehicles, submarines, and more. Gulfstream Aerospace is also a wholly owned subsidiary of General Dynamics, giving it more than military strength.\n\nDuring its most recent quarter, General Dynamics paid $361 million in dividends. The forward dividend yield is 2.02% and the annual dividend is $5.36. It started paying a dividend in 2012 and has raised that dividend consistently over time. It has a $93.7 billion backlog of business, up 4.4% year over year. The stock price has risen approximately 50% over the past five years.\n\nDefense spending may fluctuate over time, but it is unlikely to disappear from national budgets anytime soon. That is a powerful incentive for companies that have a history of contracts with national militaries to keep innovating, capture more of that money over time, and potentially share profits with investors.\n\nCheck Out Some of Benzinga's Top Picks for Private Market Opportunities Available Now:\n\nIntegris Secured Credit Fund IV\n\nThe fund provides a fixed annual return of 12%, payable quarterly, over a 2-year period starting April 2024 and ending April 2026. The note is secured by collateral with an estimated value of $71M, with an anticipated loan-to-value ratio of 14%.\n\nMinimum investment: $100,000 Available to: Accredited investors View fund information\n\nAustin Cityfund\n\nInvest in the future growth of Austin's real estate market through an innovative home equity investment product. Austin Cityfund's assets have already appreciated 10.90% since July, delivering strong returns for investors.\n\nMinimum investment: $500 Available to: Accredited and non-accredited investors Invest in Austin\n\nView more private market offerings on Benzinga's Alternative Investment screener.\n\nThis article 3 Defense Stocks With Strong Dividend Track Records originally appeared on Benzinga.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-defense-stocks-strong-dividend-170708945.html",
        "symbols": [
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.016,
            "neu": 0.857,
            "pos": 0.126
        }
    },
    {
        "date": "2024-07-10T15:40:16+00:00",
        "title": "HII vs. LMT: Which Stock Is the Better Value Option?",
        "content": "Investors with an interest in Aerospace - Defense stocks have likely encountered both Huntington Ingalls (HII) and Lockheed Martin (LMT). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look.\n\nWe have found that the best way to discover great value opportunities is to pair a strong Zacks Rank with a great grade in the Value category of our Style Scores system. The Zacks Rank is a proven strategy that targets companies with positive earnings estimate revision trends, while our Style Scores work to grade companies based on specific traits.\n\nRight now, Huntington Ingalls is sporting a Zacks Rank of #2 (Buy), while Lockheed Martin has a Zacks Rank of #3 (Hold). This system places an emphasis on companies that have seen positive earnings estimate revisions, so investors should feel comfortable knowing that HII is likely seeing its earnings outlook improve to a greater extent. But this is just one factor that value investors are interested in.\n\nValue investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels.\n\nOur Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years.\n\nHII currently has a forward P/E ratio of 14.80, while LMT has a forward P/E of 17.53. We also note that HII has a PEG ratio of 2.07. This figure is similar to the commonly-used P/E ratio, with the PEG ratio also factoring in a company's expected earnings growth rate. LMT currently has a PEG ratio of 4.32.\n\nAnother notable valuation metric for HII is its P/B ratio of 2.31. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. For comparison, LMT has a P/B of 16.61.\n\nThese are just a few of the metrics contributing to HII's Value grade of A and LMT's Value grade of C.\n\nHII has seen stronger estimate revision activity and sports more attractive valuation metrics than LMT, so it seems like value investors will conclude that HII is the superior option right now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHuntington Ingalls Industries, Inc. (HII) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nStory continues\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/hii-vs-lmt-stock-better-154016243.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.004,
            "neu": 0.765,
            "pos": 0.231
        }
    },
    {
        "date": "2024-07-10T11:52:00+00:00",
        "title": "Lockheed (LMT) Wins $520M Deal to Aid F-16 Block 70/72 Jet",
        "content": "Lockheed Martin Corp.’s LMT business segment, Aeronautics, recently secured a modification contract involving its advanced F-16 Block 70/72 aircraft. The award has been offered by the Air Force Life Cycle Management Center, Wright-Patterson Air Force Base, OH.\n\nDetails of the Deal\n\nValued at $520.4 million, the contract is projected to be completed by Jun 30, 2028. The latest modification expands the current long lead materials contract to begin production tasks of the Viper Shield electronic warfare suite for the F-16 Block 70/72 aircraft.\n\nWork related to this deal will be executed in Fort Worth, TX. This contract will serve the Kingdom of Bahrain, the Republic of Bulgaria, the Kingdom of Morocco, the Slovak Republic and the Taiwan Air Force.\n\nThe latest modification brought the cumulative face value of the contract to $897.4 million.\n\nWhat’s Favoring Lockheed?\n\nAs countries around the world are investing more in modernizing their air combat fleets, the need for reliable, multi-role fighter aircraft has become paramount. With Lockheed enjoying a dominant position in the combat aircraft market, supported by its extensive product portfolio, including the F-35 Lightning II, C-130 Hercules and F-22 Raptor, apart from F-16 jets, it enjoys frequent order flows from the U.S. Air Force as well as other international partners. The latest contract win is a bright example of that.\n\nNotably, Lockheed’s F-16 Block 70/72 is the most advanced 4th generation fighter ever built, which comes with next-generation capabilities like high-resolution Center Pedestal Display (“CPD”) and Northrop Grumman’s NOC 5th generation APG-83 AESA radar. Moreover, L3Harris’ Viper Shield all-digital electronic warfare (EW) suite has been custom-designed to be integrated into the F-16 Block 70/72 aircraft. Impressively, the F-16 Viper modification offers a scalable, advanced avionics upgrade to F-16 jets.\n\nSuch state-of-the-art features of the F-16 Block 70/72 aircraft must have been boosting the demand for this jet, which, in turn, has been ushering in solid order flows for the company like the latest one. This product’s robust demand can be further gauged from the fact that the backlog of the F-16 Block 70 program, as of March 2024, consisted of 133 aircraft for six countries.\n\nWhat Lies Ahead for LMT?\n\nFactors like increased defense budgets and the need for technologically advanced, agile fighter jets to ensure a nation's air superiority and national security to tackle widespread cross-border conflicts are fueling the growth of the fighter aircraft market. In this regard, the Morder Intelligence firm projects the global fighter aircraft market to witness a CAGR of 3.7% during 2024-2029.\r\nSuch growth opportunities can be expected to translate into more contract wins for Lockheed, which is a renowned combat jet manufacturer. Its Aeronautics unit is engaged in the research, design, development, manufacture, integration, sustainment, support and upgrade of advanced military aircraft, including combat and air mobility aircraft, unmanned air vehicles and related technologies.\n\nStory continues\n\nMoreover, LMT’s Advanced Development Programs (“ADP”) organization, also known as Skunk Works, is focused on future systems, including unmanned and manned aerial systems and next-generation capabilities for air dominance, hypersonics, intelligence, surveillance, reconnaissance, situational awareness and air mobility.\n\nPeer Opportunities\n\nA few other defense players that are expected to gain from the expanding fighter aircraft market are mentioned below:\n\nTextron TXT: Its Textron Aviation unit is engaged in the production of fighter aircraft like the Beechcraft T-6 training aircraft and the Beechcraft AT-6 light-attack aircraft. The company also manufactures the Beechcraft Model 18 light bomber, the T-44 and T-34 training aircraft and the T-1A jet trainer.\n\nTXT boasts a long-term (three-to-five years) earnings growth rate of 10.1%. The Zacks Consensus Estimate for 2024 sales indicates an improvement of 5.7% from that reported in 2023.\n\nBoeing BA: Its Defense, Space & Security segment is engaged in the development, production and modification of a range of combat-proven aircraft like the F/A-18 Super Hornet, P-8, C-17 Globemaster III, EA-18G and a few more. In 2023, Boeing delivered 22 F/A-18s, nine F-15s, three T-7A Red Hawks and 11 P-8 models.\n\nBA boasts a long-term earnings growth rate of 25.5%. It has a trailing four-quarter average earnings surprise of 17.83%.\n\nNorthrop Grumman: It has built some of the world’s most advanced aircraft, ranging from the innovative B-2 Spirit stealth bomber to the game-changing E-2D Advanced Hawkeye. The significant awards won by NOC in 2023 included $2.1 billion for F-35 programs, $1.7 billion for E-2 and $1.5 billion for Triton.\n\nNOC boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for 2024 sales indicates an improvement of 4.6% from that reported in 2023.\n\nPrice Performance\n\nIn the past year, shares of LMT have risen 1.5% against the industry’s 11.5% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLockheed currently has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-wins-520m-deal-115200000.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0LF0.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.041,
            "neu": 0.76,
            "pos": 0.199
        }
    },
    {
        "date": "2024-07-10T00:00:00+00:00",
        "title": "The 3 Most Undervalued Defense Stocks to Buy in July 2024",
        "content": "Even as the world is enmeshed in a significant number of conflicts, there are a number of undervalued defense stocks available to buy.",
        "link": "https://investorplace.com/2024/07/the-3-most-undervalued-defense-stocks-to-buy-in-july-2024/",
        "symbols": [
            "BA.US",
            "LMT.US",
            "NOC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.077,
            "neg": 0.106,
            "neu": 0.653,
            "pos": 0.241
        }
    },
    {
        "date": "2024-07-10T00:00:00+00:00",
        "title": "3 Next-Gen Aviation Stocks With Stratospheric Potential",
        "content": "Explore next-gen aviation stocks with potential for substantial returns as the industry advances in supersonic travel and advanced avionics.",
        "link": "https://investorplace.com/2024/07/3-next-gen-aviation-stocks-with-stratospheric-potential/",
        "symbols": [
            "LDOS.US",
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.422,
            "neg": 0,
            "neu": 0.817,
            "pos": 0.183
        }
    }
]