[
    {
        "date": "2024-08-16T19:26:15+00:00",
        "title": "Exclusive-Boeing, Lockheed Martin in talks to sell rocket-launch firm ULA to Sierra Space",
        "content": "By Joey Roulette and Mike Stone\n\nWASHINGTON (Reuters) - Boeing and Lockheed Martin are in talks to sell their rocket-launching joint venture United Launch Alliance to Sierra Space, two people familiar with the discussions said.\n\nA deal to sell ULA, a major provider of launch services to the U.S. government and a top rival to Elon Musk's SpaceX, would mark a significant shift in the U.S. space launch industry as ULA separates from two of the largest defense contractors to a smaller, privately held firm.\n\nThe potential sale comes after years of speculation about ULA's future and failed attempts to divest the joint venture over the past decade. In 2019, Boeing and Lockheed Martin reportedly explored selling ULA but couldn't agree on terms with potential buyers.\n\nThe negotiations could end without a deal, the sources said.\n\nULA referred Reuters to Boeing and Lockheed for comment. The two companies said they do not comment on market speculation. Sierra did not immediately return a request for comment.\n\n(Reporting by Joey Roulette and Mike Stone in Washington; Editing by Rod Nickel)\n\nView comments",
        "link": "https://finance.yahoo.com/news/exclusive-boeing-lockheed-martin-talks-192615885.html",
        "symbols": [
            "0BOE.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.036,
            "neg": 0.022,
            "neu": 0.944,
            "pos": 0.034
        }
    },
    {
        "date": "2024-08-16T18:53:17+00:00",
        "title": "Defense tech startup Anduril aims to take a Tesla-like approach to weapons manufacturing",
        "content": "Modern warfare is evolving, and Anduril Industries has a plan to capitalize on this shift by reimagining the design and production of American military power.\n\nThe defense technology startup recently raised $1.5 billion in a new funding round to scale its weapons manufacturing. The deal, which was co-led by Peter Thiel’s Founders Fund and Sands Capital, values Anduril at $14 billion, nearly double the startup’s valuation after its previous funding round two years ago.\n\nAnduril’s strategy is to increase American weapons manufacturing by replicating the modern techniques and processes employed by commercial powerhouses such as Elon Musk’s Tesla (TSLA). In other words, it's using a software-first approach flexible enough to build weapons quickly and at scale.\n\n“What we are doing at Anduril is we are taking the risk up front to build the capabilities and to build the infrastructure that we need to deploy those capabilities very quickly,” Trae Stephens, co-founder and executive chairman of Anduril and partner at Founders Fund, told Yahoo Finance (video above).\n\n“Now is that a bet on ourselves that, once we produce these things, the customer will show up to buy it?” Stephens asked. “Absolutely, but I think that is the way it should work. There should be some risk taken from an industry perspective as well.” A Border Patrol agent walks by an Autonomous Surveillance Tower made by Anduril near Sunland Park, New Mexico, on Jan. 18, 2022. (Salwan Georges/The Washington Post via Getty Images) (The Washington Post via Getty Images)\n\nAnduril plans to use the majority of the funds to invest in a new software-defined manufacturing platform and build a new manufacturing facility called Arsenal-1.\n\nThe factory is expected to ultimately employ more than 1,500 people, encompass more than 5 million square feet of manufacturing capacity, and produce tens of thousands of weapons, such as counterstrike drones and autonomous submarines, per year.\n\nWhile the company has not yet determined where the Arsenal-1 facility will be located, it already has experience building out its manufacturing footprint.\n\nIn June, Anduril announced a $75 million investment to increase manufacturing and production capacity for solid rocket motors in Mississippi. That same month, the company also announced the opening of a facility in Rhode Island, enabling Anduril to increase production of underwater drones.\n\nStartups like Anduril, which aim to disrupt the American defense industry and take on the \"primes\" — giants like Boeing (BA), Lockheed Martin (LMT), General Dynamics (GD), RTX (RTX), and Northrop Grumman (NOC) — have attracted venture investors to the sector. StockStory aims to help individual investors beat the market.\n\nBetween 2021 and mid-June of this year, venture capitalists invested $130 billion in defense tech startups, according to PitchBook.\n\nStory continues\n\nNick Beim, a partner at venture firm Venrock, explained investors are eager to invest in the next Anduril, Palantir (PLTR), or SpaceX.\n\n“The character of warfare is changing significantly due to emerging technologies,” Beim recently told Yahoo Finance. “I think the future of warfare will be much more driven by AI software and autonomous systems at the edge than by the traditional military platforms that are used today.”\n\n“Venture-backed companies are now best positioned to provide these critical systems, better positioned than the traditional military suppliers,” Beim added.\n\nStephens declined to say when Anduril would IPO but told Yahoo Finance the company is considering such a move.\n\n“We are starting to think a lot more about that three- to five-year kind of timeline for being ready to go if the market conditions were right and the company continues to grow as well as we have been,” he said.\n\nClick here for the latest technology news that will impact the stock market\n\nRead the latest financial and business news from Yahoo Finance\n\nView comments",
        "link": "https://finance.yahoo.com/news/defense-tech-startup-anduril-aims-to-take-a-tesla-like-approach-to-weapons-manufacturing-185317884.html",
        "symbols": [
            "0BOE.LSE",
            "0IUC.LSE",
            "0K92.LSE",
            "0R2N.LSE",
            "0R3E.LSE",
            "1TSLA.MI",
            "5UR.F",
            "5UR.XETRA",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.98,
            "neg": 0.039,
            "neu": 0.88,
            "pos": 0.081
        }
    },
    {
        "date": "2024-08-16T17:27:00+00:00",
        "title": "Lockheed (LMT) Surges 24% YTD: Should You Buy Now or Later?",
        "content": "Lockheed Martin Corp.’s LMT shares surged an impressive 23.6% in the year-to-date period, outperforming the Zacks Aerospace-Defense industry, the broader Zacks Aerospace sector and the S&P 500. As the largest defense contractor in the United States, Lockheed rides on its solid presence in both domestic and international defense space, innovative products in the pipeline as well as a solid financial position.\n\nA similar stellar performance has been offered by other defense players, such as RTX Corp. RTX, Leidos Holdings LDOS and Embraer S.A. ERJ, whose shares have witnessed a surge of 40.7%, 36.7% and 76.9%, respectively, year to date.\n\nLockheed YTD Performance Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nWith Lockheed riding high, individuals may rush to add it to their portfolio. However, before making any hasty decision, it would be prudent to take a look at the reasons behind the surge, the stock’s growth prospects as well as risks (if any) to investing in the same. The idea is to help investors make a more insightful decision.\n\nWhat Led to Lockheed’s Surge?\n\nAs a prominent defense contractor in the global military space, Lockheed enjoys a continuous flow of orders for its varied defense products, which range from stealth fighter aircraft and combat ships to military radars and lethal missiles.  With the United States being the largest weapons exporter worldwide, Lockheed benefits immensely from its predominance in this nation’s defense market.\n\nOn Apr 20, 2024, the U.S. House of Representatives passed three bills, providing a total of $95 billion in additional supplemental funding for Ukraine, Israel and Taiwan, funding for the restocking of the U.S. munitions capacity. With LMT’s defense products constituting a major portion of U.S. munitions supplied to these nations in the form of military aid, such bills should boost the company’s future revenues.\n\nApart from its well-established position in the U.S. defense market, Lockheed witnesses a strong forte for its products in the international market. Evidently, in July 2024, the Netherlands government signed a formal agreement to purchase LMT’s Joint Air-to-Surface Standoff Missile Extended Range (JASSM-ER), thereby becoming the fifth international customer for JASSM-ER. In July, the Greek government signed a Letter of Offer and Acceptance (“LOA”) to procure 20 F-35 aircraft, with the LOA including the option to procure another 20 such jets.\n\nTo further enhance its market presence, the company is innovating multiple programs that are entering growth stages, including the F-35 sustainment activity, increased Patriot Advanced Capability-3 (PAC-3) production rate, the modernization and enhancements to the Trident II D5 Fleet Ballistic Missile, and development of multiple hypersonic programs.\n\nStory continues\n\nA solid financial position enables LMT to smoothly invest in such innovations and also reward its shareholders with notable dividend payments. As of Jun 30, 2024, Lockheed paid out dividends worth $1.53 billion to its shareholders.\n\nIs LMT’s Growth Sustainable?\n\nLooking ahead, growth prospects for the global defense industry remain bright, backed by emerging geopolitical tensions that have led to a massive spike in weapons stock depletion and increased defense spending from both developed and developing nations across the world. Hence, the stage is set for a stable growth trajectory for S&P 500 defense stocks like Lockheed.\n\nThe consensus estimate for LMT’s earnings is pegged at a solid 4.7%.\n\nA quick sneak peek at its near-term earnings and sales estimates mirrors a similar picture.\n\nUpbeat Estimates\n\nThe Zacks Consensus Estimate for LMT’s 2024 and 2025 sales reflects an improvement of 5% and 4.3%, respectively, year over year.\n\nThe Zacks Consensus Estimate for 2024 and 2025 earnings per share has moved north 0.8% and 1.7%, respectively, over the past 60 days. The upward revision in earnings estimates indicates analysts’ increasing confidence in the stock. Zacks Investment Research\n\nImage Source: Zacks Investment Research Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nRisks to Take Note of\n\nDespite the aforementioned growth opportunities, there are certain challenges in the industry that one should consider before investing in any defense stock. One notable headwind plaguing the industry is the shortage of skilled labor, which has been exacerbated by an aging workforce.\n\nPer a study by the Aerospace Industries Association (AIA), industry retirements are estimated to create a gap of 3.5 million workers by 2026. This poses a great risk for manufacturing companies like Lockheed, as such labor shortages can cause it to fail its due product delivery time.\n\nMoreover, the company has been experiencing performance issues for some of its programs, which, in turn, has been causing it to incur losses. Evidently, its CH-148 aircraft experienced performance issues, including delays in the final aircraft deliveries from the original contract requirement to the Royal Canadian Air Force. As of Jun 30, 2024, the company’s cumulative losses in relation to this program totaled approximately $100 million. Further delays and similar program issues may increase LMT’s losses, thereby adversely impacting its operating results.\n\nTrading at a Premium\n\nIn terms of valuation, LMT’s forward 12-month price-to-earnings (P/E) is 20.08X, a premium to its peer group’s average of 18.83X. This suggests that investors will be paying a higher price than the company's expected earnings growth compared to that of its peers. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nWhat Should an Investor Do?\n\nTo conclude, investors interested in Lockheed should wait for a better entry point, considering its premium valuation. LMT currently has a VGM Score of C, which is not a very favorable indicator of strong performance.\n\nHowever, those who already own this Zacks Rank #3 (Hold) stock may stay invested as the company's financial stability, upbeat estimates and solid presence in the global defense industry offer solid future prospects.\n\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nEmbraer-Empresa Brasileira de Aeronautica (ERJ) : Free Stock Analysis Report\n\nLeidos Holdings, Inc. (LDOS) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-surges-24-ytd-172700533.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.035,
            "neu": 0.804,
            "pos": 0.161
        }
    },
    {
        "date": "2024-08-16T12:30:10+00:00",
        "title": "Here's How Much You'd Have If You Invested $1000 in Lockheed Martin a Decade Ago",
        "content": "How much a stock's price changes over time is important for most investors, since price performance can both impact your investment portfolio and help you compare investment results across sectors and industries.\n\nAnother factor that can influence investors is FOMO, or the fear of missing out, especially with tech giants and popular consumer-facing stocks.\n\nWhat if you'd invested in Lockheed Martin (LMT) ten years ago? It may not have been easy to hold on to LMT for all that time, but if you did, how much would your investment be worth today?\n\nLockheed Martin's Business In-Depth\n\nWith that in mind, let's take a look at Lockheed Martin's main business drivers.\n\nLockheed Martin Corporation is the largest defense contractor in the world. Its main areas of focus are in defense, space, intelligence, homeland security and information technology including cyber security. In 2023, 73% of the company’s net sales were from the U.S. Government, including 64% from the Department of Defense (DoD), 26% from international customers, and 1% from U.S. commercial and other customers. Lockheed Martin currently operates through four businesses — Aeronautics, Missiles and Fire Control (MFC), Rotary and Missions Systems (RMS) and Space Systems.\r\n\r\nThe company's Aeronautics unit is engaged in the design, research and development, systems integration, production and support of advanced military aircraft and related technologies. This segment includes programs like F-35 Lightning II Joint Strike Fighter; C-130 Hercules; F-16 Fighting Falcon; F-22 Raptor; and C-5M Super Galaxy.  It generated sales of $27.47 billion in 2023, accounting for 40.7% of the total sales.\r\n\r\nIn Lockheed Martin's MFC business, headquartered in Dallas, some of its high-profile programs include the Terminal High Altitude Area Defense System, Joint Light Tactical Vehicle, PAC-3 Missiles, as well as logistics and other technical services from GTL.  It generated sales of $11.25 billion in 2023, constituting 16.7% of the total sales.\r\n\r\nIn its RMS business, headquartered in Washington, DC, some of its high-profile programs include the Aegis Combat System, Littoral Combat Ship, MH-60 helicopter avionics, as well as military and commercial orders. It generated sales of $16.24 billion in 2023, comprising 24% of the total sales.\r\n\r\nThe company's Space Systems unit is engaged in the design, development, engineering, and production of commercial and military space systems. It generated sales of $12.61 billion in 2023, accounting for 18.7% of the total sales.\r\n\r\nLockheed Martin ended 2023 (on Dec 31, 2023) with $160.6 billion in the backlog.\n\nStory continues\n\nBottom Line\n\nPutting together a successful investment portfolio takes a combination of research, patience, and a little bit of risk. For Lockheed Martin, if you bought shares a decade ago, you're likely feeling really good about your investment today.\n\nA $1000 investment made in August 2014 would be worth $3,312.19, or a gain of 231.22%, as of August 16, 2024, according to our calculations. This return excludes dividends but includes price appreciation.\n\nIn comparison, the S&P 500 gained 183.53% and the price of gold went up 80.83% over the same time frame.\n\nAnalysts are forecasting more upside for LMT too.\n\nLockheed ended second-quarter 2024 on a solid note, with both its earnings and revenues surpassing their respective Zacks Consensus Estimate. Its broad product offerings allow it to secure major defense contracts, which, in turn, boosts its backlog count. Lockheed remains the largest U.S. defense contractor with a steady order flow from its leveraged presence in the Army, Air Force, Navy and IT programs. The solid U.S. defense budgetary provisions should boost its business. Its products also witness a strong international demand. The stock has outperformed the industry in the past year. However, Lockheed is facing performance issues concerning some of its products that may affect its results. Shortage of skilled labor may adversely impact Lockheed’s operating results. The sanctions imposed by China on Lockheed might also affect its business.\n\nOver the past four weeks, shares have rallied 17.71%, and there have been 8 higher earnings estimate revisions in the past two months for fiscal 2024 compared to none lower. The consensus estimate has moved up as well.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/heres-much-youd-invested-1000-123010114.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.037,
            "neu": 0.801,
            "pos": 0.163
        }
    }
]