[
    {
        "date": "2024-07-28T11:39:00+00:00",
        "title": "5 Dividend Stocks to Buy Even if You Are Worried About a Stock Market Sell-Off",
        "content": "Buying stocks if you're worried about a stock market sell-off sounds counterintuitive. After all, why put your hard-earned money into something if it will lose value?\n\nHistorically, investing during corrections (drawdowns of at least 10%) and bear markets (drawdowns of at least 20%) has been a winning decision. Companies that pay dividends provide an added incentive to endure periods of heightened volatility.\n\nHere's why Coca-Cola(NYSE: KO), Lockheed Martin(NYSE: LMT), Waste Management(NYSE: WM), Union Pacific (NYSE: UNP), and United Parcel Service(NYSE: UPS) are five companies that are built to last and can reward investors with passive income no matter what the overall stock market is doing. Image source: Getty Images.\n\n1. Coca-Cola\n\nCoca-Cola is close to a flawless dividend stock. It has paid and raised its dividend for 62 consecutive years, making it a Dividend King. It also has a sizable yield at 3%, considerably higher than the S&P 500's yield of 1.3%, or 1.7% for the Dow Jones Industrial Average.\n\nMost importantly, it has a recession-resistant business model. Its portfolio comprises soft drinks, coffee, tea, juice, sparking water, and energy drinks -- all relatively low-cost staples. Consumer behavior varies, but in general these are the types of products that enjoy steady demand no matter what the economy is doing.\n\nCoke has been a market-underperforming stock for years, but there is reason to believe it is turning the corner and could accelerate its earnings growth. That turnaround could take time, although an attractive dividend adds a worthwhile incentive to be patient and let an investment thesis play out.\n\nIt's one of the reasons Warren Buffett-led Berkshire Hathaway(NYSE: BRK.A)(NYSE: BRK.B) has held the stock for over 30 years and why Coke remains a great buy now.\n\n2. Lockheed Martin\n\nLockheed Martin operates in a completely different industry than Coke, but the defense contractor has a similar investment proposition.\n\nIt does virtually all of its business with the U.S. government and, to a lesser extent, with approved U.S. allies. A reliable customer base and a massive backlog make Lockheed's cash flows predictable, which helps with budgeting expenses and dividend payments.\n\nThe following chart sums up the business well: steady sales growth, a range-bound operating margin in the low to mid double percentages, and annual dividend raises. It has increased its payout for 21 consecutive years and currently yields 2.5%. LMT Revenue (TTM) Chart\n\nThe stodgy nature of the defense industry typically results in discounted valuations, even for the top players. Sure enough, Lockheed's price-to-earnings (P/E) ratio is just 17.4, which is close to the 10-year median P/E of 17.8.\n\nStory continues\n\nAdd it all up, and Lockheed is an ultra-reliable dividend-paying value stock that can do perfectly fine no matter what the market is doing.\n\n3. Waste Management\n\nUnlike many dividend stacks that have lagged behind the growth-stock-fueled rally, WM (as Waste Management refers to itself) has been a strong performer and is hovering around an all-time high.\n\nThe company's business model is beautifully simple. WM collects, transports, and processes trash and recycling materials for residential, commercial, and industrial customers. It also invests in lower-carbon efforts, such as converting landfill gas that forms from the decomposition of organic matter in landfills into pipeline-quality natural gas.\n\nWM tends to do better in periods of expansion as industrial and commercial consumers produce more goods and, therefore, have more waste. But it should still be considered a recession-resistant business because cash flows are largely based on long-term contracts, and there's a need for its services regardless of the economy.\n\nFor example, WM has switched most of its recycling business to fee-for-service, which helps protect against changes in commodity prices.\n\nThe biggest downside is the stock's valuation. It has more than doubled over the last four years, while the dividend is up less than 40%. Anytime a stock's price outpaces the dividend growth, the yield will come down, which is why WM now yields just 1.4%.\n\nEven by estimated earnings, WM is a pricey stock, with a forward P/E of 30.5. However, it will likely be just fine if there is an economic slowdown and a stock market sell-off. It's a company you can count on to endure volatility, but only if you're OK with the premium valuation.\n\n4. Union Pacific\n\nUnion Pacific is one of the largest railroads in North America. Focusing on the western two-thirds of the U.S., the high-margin cash cow is instrumental in transporting goods at low cost.\n\nAlthough railroad stocks are considered cyclical, the industry is essentially an oligopoly, given its high barriers to entry and capital-intensive nature. But it's not an oligopoly in the same way that FedEx and UPS are, or Coke and PepsiCo, because there's no direct competition among all the railroads. For example, CSX and Norfolk Southern focus mainly on the eastern third of the U.S.\n\nThe closest competitor to Union Pacific is Berkshire Hathaway's BNSF, but even then, railroads operate different networks and don't serve the exact same regions.\n\nAnother advantage of railroads is that they own their infrastructure, so expenses are mainly going toward labor and upkeep rather than building entirely new routes.\n\nUnion Pacific might see a slowdown during an economic downturn, but you can rest easy knowing the business model is built for the long term. It has a reasonable 23.3 P/E and raised its quarterly dividend to $1.34 per share earlier this month, representing a forward yield of 2.2%.\n\n5. UPS\n\nUPS hit a new 52-week low after reporting disappointing results. Package delivery volumes are down, and costs are up. That has taken a sledgehammer to the company's growth trajectory and wiped away the momentum it enjoyed in the earlier part of the pandemic.\n\nUPS reset expectations during its 2024 Investor and Analyst Day, charting a path toward achievable three-year targets. The stock has gone essentially nowhere since that presentation in March, and it wouldn't be surprising if it continued to languish in the short term. But in the long term, the business is simply too good to ignore.\n\nManagement is investing heavily in improvements and innovations, including artificial intelligence, to help drive margin growth. It is boosting its healthcare services to target a specific customer base with time- and temperature-sensitive shipments.\n\nWith a mere 21 P/E and a whopping 5.1% yield, UPS stands out as a worthwhile buy-and-hold candidate for investors looking to jolt their passive income streams even if there's a stock market sell-off.\n\nRock-solid stocks to buy now\n\nWhen considering a stock market sell-off, investors might gravitate solely toward ultra-safe choices like Coke, Lockheed Martin, or WM. All three businesses are certainly worth investing in, but cyclical companies with inexpensive valuations and growing dividends -- like Union Pacific and UPS -- can also be good buys.\n\nThe most important quality to look for when investing is a company's ability to deliver on shareholder expectations well into the future. For dividend-paying companies, that means growing earnings to support higher dividend growth, maintaining a competitive edge, and cultivating a strong balance sheet. In sum, all five of these companies are industry-leading businesses that are well positioned to endure a downturn or even take market share and emerge stronger.\n\nShould you invest $1,000 in Coca-Cola right now?\n\nBefore you buy stock in Coca-Cola, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Coca-Cola wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $692,784!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of July 22, 2024\n\nDaniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway, FedEx, and Union Pacific. The Motley Fool recommends Lockheed Martin, United Parcel Service, and Waste Management. The Motley Fool has a disclosure policy.\n\n5 Dividend Stocks to Buy Even if You Are Worried About a Stock Market Sell-Off was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/5-dividend-stocks-buy-even-113900191.html",
        "symbols": [
            "BRK-A.US",
            "BRK-B.US",
            "KO.US",
            "LMT.US",
            "UNP.US",
            "UPS.US",
            "WM.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.054,
            "neu": 0.796,
            "pos": 0.151
        }
    },
    {
        "date": "2024-07-28T11:00:00+00:00",
        "title": "Why Britain’s F-35s could be consigned to the scrap heap",
        "content": "Work on the F-35 fighter jet has morphed into the most expensive weapons programme in history - SAC Tim Laurence/MoD\n\nAs the British aircraft carrier HMS Prince of Wales sailed for the biggest Nato exercise since the Cold War, strapped to its flight deck were a clutch of the West’s most advanced fighter jets.\n\nThe American-made F-35 Lightning planes deployed that March are among the newest additions to UK air power at a time when global tensions are rising.\n\nDescribed as “flying computers”, they are packed with sensors and masked by cutting-edge stealth technology to help pilots penetrate deep into hostile territory for devastating strikes and intelligence gathering.\n\nYet the F-35’s journey to deployment has been far from straightforward.\n\nADVERTISEMENT\n\nThe jets, assembled in the US by Lockheed Martin, have been plagued by repeated delays and cost overruns, while the Ministry of Defence (MoD) has long been evasive about how many Britain will ultimately buy – and which service will own them.\n\nNow, as the new Labour Government carries out a sweeping defence review, critics have suggested that the UK could seek to halt its purchases to save money.\n\nIt comes amid a separate row over the homegrown next-generation stealth-fighter programme, Tempest, of which Sir Keir Starmer has refused to guarantee the future.\n\nBut extricating the Government from the Tempest programme, which is underpinned by a treaty with partner nations Japan and Italy, will be far trickier politically than cutting F-35s, critics argue.\n\nFrancis Tusa, an independent defence analyst, says the fact the F-35 programme is not under the direct control of the UK will also count against it.\n\nCompared to Tempest, “the F-35 is very much a less capable, flawed platform, with a quite stormy future, full of uncertainty”, he says.\n\n“Sure, there isn’t yet a flying Tempest. But the three partners are in control of their destinies with it – which is not the case with F-35.”\n\nWork on the F-35, a “fifth-generation” fighter, first began in the 1980s and has since morphed into the most expensive weapons programme in history, with an estimated lifetime costs of $2 trillion (£1.6 trillion) in the US through to 2088, according to the Pentagon.\n\nStory continues\n\nThe UK first joined in 1995, contributing some money to development costs and in the process ensuring that hundreds of British companies became suppliers.\n\nThere are three variants of the jet (A, B and C), all of which use advanced technology to identify threats and link up with other platforms digitally – including, in future, unmanned drones.\n\nThe MoD opted for the short take-off and vertical landing-capable F-35B, due to a lack of arresting wires – which catch jets as they land – on the Royal Navy’s Queen Elizabeth-class aircraft carriers.\n\nHowever, this capability also makes the F-35B the most expensive version of the plane and gives it a more limited maximum range and payload than others.\n\nAccording to the Government, each one costs about £90m. However, defence analyst Tusa says this does not include the engine or other costs, with the real total pitching closer to £150m per plane.\n\nIn 2015, the MoD suggested it would seek to buy 138 F-35B jets over the programme’s lifespan. But it has been reluctant to recommit to that number ever since and has only placed a firm order for 48 planes for delivery by 2025, with 34 received so far.\n\nThe previous Conservative government confirmed this year that it was in negotiations to buy another 27 for delivery by 2033, which Tusa expects to cost around £5bn. Those negotiations remain ongoing.\n\nA spokesman for the MoD said: “Whether operating from land or onboard our aircraft carriers as a central component of the UK’s Carrier strike capability, the F-35B delivers a cutting-edge capability for the UK.\n\n“We are committed to the F-35 programme, and the UK builds approximately 15pc of each aircraft, securing highly skilled jobs and significant economic growth within the UK.”\n\nThe spokesman added that the Government “didn’t recognise” the £5bn estimated cost for buying further jets.\n\nAdvocates, including military chiefs in the Royal Navy and the Royal Air Force, have argued that acquiring more F-35Bs is essential to bringing Britain’s aircraft carriers up to full strength, with the ability of the jets to operate from land and sea providing added flexibility.\n\nBut the programme has been beset by delays over the years, with the UK bringing them into service four years late in 2018 – and even then not at full capability.\n\nMPs have also criticised the MoD for failing to set out exactly how many of the jets are set aside for use with the aircraft carriers, versus other uses, raising the risk of double-counting in force estimates.\n\nIn the US, the F-35 has also become something of a poster-boy for overwrought, expensive defence fiascos in some quarters.\n\nMeanwhile, Lockheed was forced to halt deliveries globally last July, and only resumed them this month, after the US Air Force refused to accept more jets until hardware issues were fixed. The Pentagon's control of the F-35 programme has become a source of concern - AS1 Amber Mayall RAF\n\nThe F-35 has come under fire for being costly to operate as well. Sir Ben Wallace, a former defence secretary, previously raised concerns about this, with MPs on the defence select committee last year describing them as “unacceptably high”.\n\nThey also criticised the slow growth of the F-35B fleet and suggested exploring the possibility of bulking up Britain’s air force with unmanned drones instead.\n\n“At present there are too many unresolved questions about the development and operational deployment of the [F-35] fleet,” the MPs said.\n\n“The MoD must be transparent and realistic about the eventual size of the F-35 fleet ... and should also make clear whether it is attributed to the Royal Navy or the RAF.”\n\nAnother criticism levelled at the F-35 is also the UK’s lack of sovereignty over the platform and its technologies, which are effectively under the control of the Pentagon.\n\nThis is one argument industry supporters of the Tempest programme deployed at Farnborough International Airshow this week, after doubts about that scheme’s future were stoked by noncommittal statements by Sir Keir and other ministers.\n\nAccording to BAE Systems, Tempest will support 16,000 jobs in Britain and add £37bn to the economy, excluding potential exports.\n\nYet defenders of the F-35 say it is a highly capable aircraft that is proving doubters wrong, with orders flooding in from Nato countries such as Germany, Canada, Finland, Switzerland, the Czech Republic and Greece in recent years.\n\nDeployments of F-35s in Syria against Islamic State and on Eastern Europe’s frontier with Russia were particularly effective.\n\nRetired general Jeffrey Harrigian, the former commander of the US Air Force in Europe who is now a vice-president at Lockheed Martin, said the stealth capabilities of the jets meant those deployed to the Middle East war zone could operate with impressive freedom.\n\n“We found ourselves in very good positions relative to the Russian airplanes that were flying around, such that if something would have come up, we were fully prepared to take care of business – and the Russians knew that,” he told reporters at the Farnborough airshow on Tuesday.\n\nIn the buildup to the Ukraine war, the US and Nato allies including the UK and the Netherlands also stationed F-35s in the Baltics to deter Russian aggression.\n\n“We knew the Russians would know where they were. And we also knew they didn’t want to have any part of dealing with F-35s,” Harrigian said.\n\nProfessor Justin Bronk, a senior research fellow for air power and technology at the Royal United Services Institute (RUSI), says the F-35 is essential to maintaining British airpower through to the 2030s, when Tempest is expected to come online.\n\n“I think the UK should definitely proceed with the follow-on order of 27, to take the fleet to 74,” he says. “That’s more or less the functional minimum for the fleet to meet its obligations.\n\n“Beyond that, I don’t see much fiscal room for additional orders in the foreseeable future and, in any case, if there was additional money ... I would put it into weapons and maintenance and spares, to improve the combat capability and availability.”\n\nHe is sceptical about grumbling on sovereignty with the F-35, pointing out that Britain already works with international partners on the existing Eurofighter Typhoon programme and will do so for Tempest as well.\n\n“There are certainly some trade-offs, but I think the sovereignty issue is significantly overblown,” he adds.\n\n“The UK doesn’t have sovereign control over the Typhoon or Tempest either, because it’s beholden to the requirements and needs of the other partner [countries] – so the idea there’s some sort of mystical sovereignty involved in any of these is fairly obviously not true.”\n\nMeanwhile, the F-35’s contribution to the British economy should not be underestimated, either.\n\nMore than 800 domestic companies work on the programme including ejector seat maker Martin Baker and Rolls-Royce, which makes the F-35B’s vertical lift system.\n\nAccording to Lockheed, it has generated an estimated £45bn of exports so far for the UK and is expected to support up to 20,000 British jobs over its lifetime.\n\nJames Cartlidge, a former Conservative defence procurement minister and now shadow defence secretary, believes seeing Tempest and the F-35 as opposing choices is a false dichotomy.\n\nHe says Labour should announce a timeline for reaching 2.5pc of GDP in defence spending by 2030, as the Conservatives did during the election, and shut down doubts about funding.\n\n“If Labour commits to that, you can order the F-35s and invest in [Tempest], which gives you the best of both worlds,” he says.\n\nLockheed Martin adds that the F-35 is “currently the fighter of choice for Nato and its allies and will be a cornerstone of the defence and security in Europe for decades to come”.\n\nBut defence analyst Tusa believes Labour’s review may yet throw out some bombshell recommendations.\n\nLord Robertson, the former Nato secretary general who is leading the exercise and who as Labour defence secretary oversaw a similar one in the 1990s, is “no patsy”, Tusa says.\n\nFor example, depending on whether he recommends focusing more exclusively on Europe and Britain’s Nato commitments – ditching Boris Johnson’s Indo-Pacific “tilt” – even HMS Prince of Wales and her sister carrier, HMS Queen Elizabeth, could be at risk.\n\nThat may ultimately mean fewer F-35s as well.\n\n“There have to be cuts somewhere because the current system is unaffordable,” Tusa adds.\n\n“And there will be squeals of outrage. But what can you say? There’s no choice.”",
        "link": "https://uk.finance.yahoo.com/news/why-britain-f-35s-could-110000455.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.901,
            "neg": 0.049,
            "neu": 0.889,
            "pos": 0.062
        }
    },
    {
        "date": "2024-07-28T03:25:02+00:00",
        "title": "Street calls of the week: Upgrades for Skechers and Lockheed Martin",
        "content": "Investing.com -- Here is your Pro Recap of the top takeaways from Wall Street analysts for the past week.\n\nInvestingPro subscribers always get first dibs on market-moving AI analyst comments. Upgrade today!\n\nTexas Capital Bancshares\n\nWhat happened? On Monday, Citi downgraded Texas Capital Bancshares Inc (NASDAQ:TCBI) to Sell with a $60 price target.\n\n*TLDR: *2025 goals appear unachievable in a lower rate environment. *Citi remains cautious.\n\nWhat’s the full story? Citi maintains a cautious stance on TCBI, despite the soft share price reaction following the company’s second-quarter results. The analysts continue to see downside from current levels, as the earnings outlook over the next 12 months appears rather uninspiring.\n\nWhile the core franchise has undergone significant changes since 2020, Citi believes that the 2025 Goal metrics are unachievable in a lower interest rate environment. Despite the already below peer Price-to-Tangible Book Value valuation, Citi continues to foresee further downside.\n\nSell at Citi means “Buy (1) ETR of 15% or more or 25% or more for High risk stocks; and Sell (3) for negative ETR. “\n\nHow did the stock react? Texas Capital Banc shares opened the regular session at $64.69 and closed at $66.70, a gain of 1.06% from the prior day’s regular close.\n\nSkechers\n\nWhat happened? On Tuesday, Morgan Stanley upgraded Skechers (NYSE:SKX) to Overweight with a $80 price target.\n\n*TLDR: *Set-up for positive consensus revisions. *Management improves Skecher financial metrics.* Morgan Stanley sees possible +26% share price appreciation inside 12-18 months.\n\nWhat’s the full story? Morgan Stanley’s updated price target reflects a modestly improved operating model and updated DCF assumptions. For FY24, the bank’s estimates remain largely unchanged, continuing to see upside to Street EPS forecasts across sales, GM, and SG&A. As a result, the bank analysts are modeling $4.20 EPS versus the consensus of $4.10.\n\nLooking at the future, the bank is now more constructive on SKX’s mid-term margin profile, driven primarily by an improved GM outlook. Early signs indicate that GM is holding at structurally higher levels of 53%+. This view is taken because survey results and channel checks suggest that consumers continue to view SKX as a value-oriented brand, brand momentum remains strong despite price-taking activities over the last few years, and innovation capabilities are being increasingly recognized. These factors together increase Morgan Stanley’s comfort with SKX’s ability to maintain or expand GM from here.\n\nAs such, Morgan Stanley now models a 12% average operating margin for '24-'28e versus 11% prior, driven primarily by a more optimistic GM outlook. The mid-term sales growth expectations remain largely unchanged at ~10% average '24-'28e growth. Combined with updated WACC inputs (4.3% risk-free rate & 4.1% equity risk premium versus 4.1% & 4.6% prior, respectively) that result in a 9.4% WACC (versus 10% prior), this yields an $80 DCF-derived price target compared to $60 prior, representing a 26% upside from current levels.\n\nStory continues\n\nOverweight at Morgan Stanley means “The stock's total return is expected to exceed the total return of the relevant country MSCI Index or the average total return of the analyst's industry (or industry team's) coverage universe, on a risk-adjusted basis over the next 12-18 months .”\n\nHow did the stock react? Skechers opened the regular session at $66.24 and closed at $65.10, a gain of 1.39% from the prior day’s regular close.\n\nLockheed Martin\n\nWhat happened? On Wednesday, TD Cowen upgraded Lockheed Martin (NYSE:LMT) to Buy with a $560 price target.\n\n*TLDR: *Strong Q2 for Lockheed Martin (LMT): Driven by F-35 delivery restart and leading FMS/munitions market position, projecting ~5% sales gains, 10-20bps margin lift, and rising cash flow for 2024-2026. *Despite positives, stock lags with a 20% net buy rating\n\nWhat’s the full story? TD Cowen analysts highlight a strong Q2 performance for Lockheed Martin, driven by the restart of F-35 deliveries and its leading position in the Foreign Military Sales (FMS) and munitions market. This has provided LMT with enhanced visibility of approximately 5% sales gains, a 10-20 basis points annual margin lift, and rising cash flow projections for 2024-2026. Despite these positive indicators, the stock has lagged year-to-date, with a peer-low 20% net buy rating.\n\nThe analysts note that with the resumption of F-35 deliveries, LMT has reached an agreement with the Department of Defense (DoD) on a schedule for completing TR3 updates and is negotiating the timing for final delivery payments of around $7 million per aircraft, totaling approximately $1 billion. Given that LMT has delivered only 1,300 of the planned 3,400+ F-35 fighters, it is unlikely that the DoD will cut production even if software issues remain unresolved. Additionally, LMT’s ownership of the intellectual property gives it leverage in these negotiations. The analysts foresee low to mid-single-digit F-35 sales growth from 2025-2027 as sustainment grows with the fleet and delivery payments catch up. Furthermore, the F-16 program, with a backlog of 125 planes, is ramping up production from two to four planes per month by the second half of 2026. Both programs are expected to see increasing profitability, contributing to 28% of LMT’s sales.\n\nBuy at TD Cowen means “The stock is expected to achieve a total return of +15% or more over the next 12 months.“\n\nHow did the stock react? Lockheed Martin opened the regular session at $504.21 and closed at $515.20, a gain of 2.77% from the prior day’s regular close.\n\nOmega Healthcare Investors\n\nWhat happened? On Mizuho, downgraded Omega Healthcare Investors Inc (NYSE:OHI) to Neutral with a $35 price target\n\n*TLDR: *Valuation is key driver of downgrade following outperformance against peers. *Mizuho sees nothing wrong with the OHI as a business.\n\nWhat’s the full story? Mizuho has downgraded Omega Healthcare Investors to Neutral from Outperform, stating that the current valuation largely reflects the three pillars of its previous top pick stance. The brokerage clarified that this downgrade is not a call into earnings.\n\nPreviously, Mizuho had highlighted several reasons for favoring skilled nursing facilities and particularly Omega: higher than anticipated cash collections from tenants in restructuring, an increase in external growth through acquisitions, and a more benign regulatory environment.\n\nWhile Mizuho continues to see a high single-digit cash flow trajectory into FY 2025, the stock has outperformed REITs by 18bps year-to-date and is trading close to 13x adjusted funds from operations, which is near historical highs. As a result, the brokerage believes the positives are largely reflected in the current valuation\n\nNeutral at Mizuho means “The stock’s total return is expected to perform in line with the unweighted, expected total return of the analyst’s industry coverage universe over the next 12 months.”\n\nHow did the stock react? Omega Healthcare Investors opened the regular session at $35.97 and closed at $35.73, a decline of 1.81% from the prior day’s regular close.\n\nLockheed Martin\n\nWhat happened? On Friday, Deutsche Bank upgraded Lockheed Martin to Buy with a $600 price target. This is the second upgrade of the week for the defense company.\n\n*TLDR:* Strong Q2 report showing gains on repricing of backlog should continue momentum through 2025 and 2026 as data surprises consensus.\n\nWhat’s the full story? This upgrade is driven by strong second-quarter results, which, after further analysis, indicate a promising beat/raise opportunity in the second half of 2024. The bank believes this momentum could extend into 2025 and 2026, with potential upside to 2026 EBIT approaching the high single-digit range. If the outlook on revisions for LMT is positive relative to Deutsche Bank’s and the Street’s printed numbers, the stock could rerate to reflect this opportunity, supporting a 5.0% target free cash flow yield on 2026, driving the updated target price of $600, representing a 15% upside potential.\n\nFor the second half of 2024, Deutsche Bank anticipates improved operational performance and a significant spread between trailing three-year backlog growth (+17%) and trailing three-year revenue growth (+7%), suggesting additional revenue upside. Recently improved cost and EAC trends, along with the benefit of an increasingly repriced backlog, point to continued positive margin surprises. This could drive approximately 4% EBIT upside to second-half 2024 Street EBIT forecasts. Looking ahead to 2025 and 2026, Deutsche Bank expects revenue growth to approach 6%+ versus the Street’s 3.9%/3.6%, with additional margin normalization across the business, making it feasible to achieve high single-digit EBIT upside to Street estimates for 2026. While Deutsche Bank has raised its estimates conservatively, it is modeling EBIT growth at a 7% CAGR over the next two years, viewing LMT as a high-quality way to participate in a global defense upcycle.\n\nBuy at Deutsche Bank means “Based on a current 12-month view of TSR, we recommend that investors buy the stock.”\n\nHow did the stock react? Lockheed Martin opened the regular session at $522.89 and closed at $524.80, a gain of 0.63% from the prior day’s regular close.\n\nRelated Articles\n\nStreet calls of the week: Upgrades for Skechers and Lockheed Martin\n\nWould the US outperform if Trump wins a clean sweep?\n\nMitsubishi Motors to join Honda-Nissan alliance, Nikkei reports\n\nView comments",
        "link": "https://finance.yahoo.com/news/street-calls-week-upgrades-skechers-032502779.html",
        "symbols": [
            "0KBL.LSE",
            "0L73.LSE",
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "OHI.US",
            "SKAA.BE",
            "SKAA.F",
            "SKAA.STU",
            "SKX.US",
            "TCBI.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.024,
            "neu": 0.862,
            "pos": 0.114
        }
    }
]