[
    {
        "date": "2024-05-31T14:27:34+00:00",
        "title": "Lockheed Martin Opens 122,000-Square-Foot Engineering Facility In North Alabama",
        "content": "Lockheed Martin along with the U.S. Department of Defense and Alabama state and local officials unveiled the company’s new $18 million engineering facility, labs and demonstration center in Huntsville.\n\nThe company said the 122,000-square foot facility can accommodate up to 500 employees who will focus their work on national security capabilities across domains including air, space, land, sea and cyber. After the opening of its newest facility, Lockheed Martin said its footprint in Alabama now includes 30 work sites employing more than 3,300 people.\n\nMost Read on IEN:\n\nHershey Sued Over Deceptive Carvings on Reese's Products F-35 Crashes After Leaving Lockheed Martin Factory Air Force Awards $13B for New Fleet of 'Doomsday Planes' Hot Sauce Maker Halts Production Due to Chili Pepper Color\n\nTeams in this new facility will advance Lockheed Martin’s 21st Century Security efforts including:\n\nReadiness and sustainment for the U.S. Army Black Hawk helicopter, including the current Multi-Year X contract with production, Foreign Military Sales and all upgrades to the aircraft.\n\nThe team is working toward a Multi-Year XI contract opportunity that will result in a modernized Black Hawk featuring more range, payload and networked connectivity to ensure the Black Hawk of tomorrow stays ahead of the threat. Missile Defense Agency Command and Control, Battle Management and Communications (C2BMC) system. C2BMC is a layered missile defense system providing commanders the ability to make synchronized decisions about threats at any range, in any phase of flight, from any location in the world. Modeling and Simulation Contract – Framework and Tools program, supporting the modeling and simulation framework for the Ballistic Missile Defense System.\n\nThis site will further enhance the company’s 1LMX digital transformation that drives efficiencies, connecting and optimizing engineering tools to enable Lockheed Martin's workforce to deliver critical capabilities with more agility.\n\nA new Lockheed Martin Rotary Wing Innovation Center, equipped with a modernized Sikorsky Black Hawk mission simulator and next-generation capability simulation tools, will offer the Army an interactive view into the future of the Black Hawk and capabilities for the enduring fleet. The center will be a meeting place for key stakeholders across the military, government, and industry to chart a path forward for Army aviation. Ribbon Cutting 01 Lowres\n\nLockheed Martin\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-opens-122-000-142734361.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.927,
            "neg": 0.042,
            "neu": 0.865,
            "pos": 0.093
        }
    },
    {
        "date": "2024-05-31T13:48:00+00:00",
        "title": "RTX Secures a $302M Contract to Support F135 Propulsion Systems",
        "content": "RTX Corp. RTX recently secured a modification contract involving the F135 propulsion system. The award has been provided by the Naval Air Systems Command (NAVAIR), Patuxent River, MD.\n\nDetails of the Deal\n\nValued at $301.8 million, the contract is expected to be completed by June 2027. Per the terms of the deal, RTX will procure long-lead time materials as well as the manufacture, assembly, inspection, acceptance and delivery of 108 conventional takeoff and landing F135 propulsion systems. It will also procure 27 short takeoff and vertical landing F135 propulsion systems, and 13 Carrier Variant F135 propulsion systems.\n\nRTX will also help meet the global requirement for spare engines, power modules and other hardware. The contract will serve the U.S. Navy, Air Force, Marine Corp, non-U.S. Department of Defense (DOD) participants and Foreign Military Sales (FMS) customers.\n\nWork related to this deal will be carried out in various locations across the United States as well as outside the continental U.S.\n\nWhat’s Favoring RTX?\n\nAmid the geopolitical tensions prevalent across the globe, nations are rapidly augmenting defense purchases to strengthen their warfare capabilities. This has led to an increased demand for fighter jets, which form an integral part of a country’s defense products.\r\n\r\nIn this context, it is imperative to mention that F-35 jets, built by America’s largest defense contractor, Lockheed Martin LMT, enjoy a lucrative position in the combat aircraft arena.\n\nThe soaring demand for Lockheed’s F-35 aircraft can be gauged from the fact that the Czech Republic became the 18th nation to join the F-35 global team during the first quarter of 2024, making its intent to procure 24 F-35s quite obvious. In addition, the U.S. State Department approved a potential foreign military sale to Greece for up to 40 F-35 jets. Moreover, Singapore announced its intent to purchase eight F-35A jets.\r\n\r\nConsequently, RTX, being the manufacturer of the F-35 jets’ engine, F135, witnesses a steady flow of orders from the U.S. Army, along with a handful of international partner countries as well as FMS customers. The latest contract win is a bright example of that.\r\n\r\nLooking ahead, the production of F-35 jets is expected to continue for several years, given the U.S. government's current inventory target of 2,456 aircraft for the Air Force, Marine Corps and Navy.\n\nConsequently, we may expect Pratt & Whitney, which builds F-135, to witness more order inflows for the F-35 engine and its propulsion system in the coming days, like the latest one. This should significantly bolster RTX’s top line.\n\nStory continues\n\nPeer Growth\n\nApart from Lockheed and RTX, defense majors that stand to benefit from the expanding production rates of F-35 have been discussed below.\r\n\r\nNorthrop Grumman NOC: The company renders its expertise in carrier aircraft and low-observable stealth technology for the F-35 program. Northrop is part of the international partnership involved in building three variants of the F-35 jet. It is engaged in the design and production of the AN/ASQ-242 Communications, Navigation and Identification avionics suite, which can be dynamically programmed to arm the F-35 pilot with multiple-mission capabilities, engineered for seamless transition from one mission phase to the next.\r\n\r\nNorthrop boasts a (three-to-five years) long-term earnings growth rate of 8.7%. The consensus estimate for NOC’s 2024 sales implies an improvement of 4.6% from the 2023 reported figure.\r\n\r\nBAE Systems BAESY: This defense major’s short takeoff and vertical landing experience, along with air systems sustainment, supports F-35’s combat capabilities. The company provides an electronic warfare suite for F-35 that includes fully integrated radar warning (targeting support and self-protection) to detect and defeat surface and airborne threats.\r\n\r\nBAE Systems boasts a long-term earnings growth rate of 12.2%. The Zacks Consensus Estimate for BAESY’s 2024 sales implies an improvement of 34.1% from the 2023 reported figure.\n\nPrice Performance\n\nIn the past year, shares of RTX have rallied 15.4% against the industry’s 8.5% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nRTX currently has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nBae Systems PLC (BAESY) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-secures-302m-contract-support-134800328.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "BA.LSE",
            "BAESF.US",
            "BAESY.US",
            "BSP.BE",
            "BSP.DU",
            "BSP.F",
            "BSP.STU",
            "BSP.XETRA",
            "BSPA.F",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NTH.BE"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.03,
            "neu": 0.835,
            "pos": 0.135
        }
    }
]