[
    {
        "date": "2024-08-18T19:42:14+00:00",
        "title": "Rocket Lab CEO: 'We have the right combination' to break SpaceX’s monopoly",
        "content": "Rocket Lab (RKLB) CEO Peter Beck has positioned himself as an outsider since the company’s inception in 2006. A New Zealand native with no college degree, Beck has long been seen as the anti-Elon Musk.\n\nHe often reminds employees: “We have no money, so we have to think.”\n\nNow, with its Neutron rocket, a fully reusable medium-lift launch vehicle set to take off in mid-2025, Beck says he is poised to pose the most formidable threat to what he describes as a “technical monopoly” held by Elon Musk and SpaceX.\n\n\"50% [of Neutron] is to break the monopoly that’s in medium launch right now,\" Beck told Yahoo Finance. \"50% is to be able to launch our own stuff into orbit. I think we have the right combination of expertise and execution to be a real competitor.\" Rocket Lab CEO Peter Beck sits alongside a Rutherford rocket engine in Auckland, New Zealand, on Oct. 20, 2015. (REUTERS/Nigel Marple) (REUTERS / Reuters)\n\nBeck sees Neutron as “the last piece of the puzzle” in an ongoing quest to build out an end-to-end space company. Rocket Lab already delivers launch services through its Electron rocket, builds spacecraft and satellite components, and offers on-orbit management.\n\nYet, despite those successes, Neutron presents the biggest opportunity to exert influence in the industry. If Rocket Lab successfully carries out the launch according to its timeline, it would mark the fastest time to market for a commercially developed medium-class launch vehicle.\n\nMore importantly for Beck, it would inject new competition into a part of the industry SpaceX has largely had to itself.\n\n“Nobody can compete with Elon putting internet into space unless you have your own rocket and you have the ability to build whatever spacecraft you want,” Beck said. He added that the company feels “very good” about the launch date, following a successful “hot fire” test of its new Archimedes engine. A SpaceX Falcon 9 rocket is launched, carrying 23 Starlink satellites into low Earth orbit in Cape Canaveral, Florida, on May 6, 2024. (REUTERS/Joe Skipper) (REUTERS / Reuters)\n\nCompeting against the SpaceX 'workhorse'\n\nUntil recently, launch vehicles have concentrated on small satellite launches, with more than 200 companies currently competing for business.\n\nRocket Lab’s Electron has been a major player with nearly 200 satellites launched so far, but SpaceX has maintained its lead through its SmallSat rideshare program, which utilizes larger payloads on its medium-heavy Falcon 9 rocket, coupled with aggressive pricing.\n\nA regular Falcon 9 launch carries a price tag of $3,000 per kilogram, while Rocket Lab offers launches at $22,000 per kilogram, according to Forbes.\n\nClayton Swope, deputy director for the Aerospace Security Project at the Center for Strategic and International Studies, said medium-size vehicles are more efficient, enabling rocket makers to address a larger need in the market.\n\nStory continues\n\n“You could launch a 1,000-kilogram satellite via a small vehicle, or you could launch a few of those, or 10 of those, or 15 of those via Falcon 9, depending on the orbit,” Swope said. “It's just kind of a multipurpose workhorse-type size of vehicle that's very flexible and can do a lot of different types of missions. So it makes sense that [Rocket Lab] is diversifying in the different business lines to support commercial space.” Rocket Lab's Archimedes engine for the Neutron launch vehicle is shown on a test stand at NASA's Stennis Space Center in Mississippi. (Rocket Lab) (Murielle Baker/Rocket Lab)\n\nRocket Lab has already pushed back its timeline for launch, which was originally scheduled for the end of 2024. But the company has taken aim at SpaceX even before takeoff.\n\nIn an interview last year, Rocket Lab CFO Adam Spice said the company would be aiming to match SpaceX on a cost-per-kilogram basis for satellite customers, adding that Neutron would target a “$50 million to $55 million launch service cost” compared with Falcon 9’s $67 million price tag.\n\nThe pipeline for medium-to-heavy-lift rockets is growing. United Launch Alliance (ULA), a joint venture between Lockheed Martin (LMT) and Boeing (BA), completed the inaugural flight for its heavy-lift Vulcan rocket in January, while the Ariane 6, backed by the European Space Agency, completed its first launch last month after years of delays. And Blue Origin’s reusable New Glenn rocket is preparing for a September launch.\n\nThe increased competition is coming amid growing unease about SpaceX’s dominance and influence over the industry, particularly among lawmakers. Earlier this year, a bipartisan group of 36 lawmakers sent a letter to Air Force Secretary Frank Kendall, calling on the Air Force to consider “increased competition among launch providers.” SpaceX founder Elon Musk after a T-Mobile and SpaceX joint event on Aug. 25, 2022, in Boca Chica Beach, Texas. (Michael Gonzalez/Getty Images) (Michael Gonzalez via Getty Images)\n\nA New York Times analysis estimated that SpaceX has cumulatively been awarded $14.7 billion in federal launch prime contracts over the last decade.\n\n“SpaceX has been wildly successful with the Falcon 9,” Beck said. “The challenge with that is if you have a competing constellation that you want to launch to [rival] Starlink, some folks get a little bit uncomfortable with that. Of course, the government doesn't want all its eggs in one basket either. So it's really important we bring some balance to the market with Neutron.”\n\nCompetition is also heating up outside of the US. Earlier this month, China launched its first satellite constellation into orbit, an initial step in a stated goal to challenge Starlink’s hold on the market.\n\nBeck is quick to point out that two-thirds of Rocket Lab’s business is in space systems, building satellites, and supplying components to customers. The proof, he said, is in the fact that 38% of everything that went into orbit last year had a Rocket Lab logo on it somewhere. On Friday, the company announced the shipment of two Mars-bound spacecraft set for launch in Cape Canaveral, Fla.\n\nA successful Neutron launch would pose the most direct challenge to Musk and SpaceX.\n\nIn the meantime, Beck says the industry is still in its infancy, with plenty of market share up for grabs, and maintains that companies who can’t own the full stack won’t survive.\n\n“The launch demand is coming from all directions, not just one or the other,” he said. “The transformation or democratization of space that everybody has been talking about, we are truly into the thick of it.” StockStory aims to help individual investors beat the market.\n\nClick here for the latest technology news that will impact the stock market\n\nRead the latest financial and business news from Yahoo Finance\n\nView comments",
        "link": "https://finance.yahoo.com/news/rocket-lab-ceo-we-have-the-right-combination-to-break-spacexs-monopoly-194214038.html",
        "symbols": [
            "0BOE.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.018,
            "neu": 0.914,
            "pos": 0.069
        }
    }
]