[
    {
        "date": "2024-05-30T15:38:00+00:00",
        "title": "RTX Secures a $381M Contract to Support F135 Engine Program",
        "content": "RTX Corp.’s RTX business unit, Pratt and Whitney, recently secured a modification contract involving the F135 propulsion system. The award has been offered by the Naval Air Systems Command, Patuxent River, MD.\n\nDetails of the Deal\n\nValued at $380.6 million, the contract is expected to be completed by August 2024. The latest modification enables RTX to provide F135 propulsion system annual sustainment. These sustainment efforts include program management, financial and administrative activities, propulsion integration, replenishment spare part buys, engineering support, material management, configuration management, product management support, software sustainment, security management, Joint Technical Data updates and support equipment management.\n\nPer the terms of the deal, RTX will also offer depot-level maintenance and repair for all fielded propulsion systems at the production sites and operational locations of the F-35 fighter jets.\n\nThe contract will serve the U.S. Air Force, Marine Corps, Navy, non-U.S. Department of Defense participants, and Foreign Military Sales (FMS) customers. A major portion of the work related to this deal will be executed in Hartford, CT.\n\nWhat’s Favoring RTX?\n\nAmid the geopolitical tensions prevalent across the globe, nations are rapidly augmenting defense purchases to strengthen their warfare capabilities. This has led to an increased demand for fighter jets, which form an integral part of a country’s defense products.\r\n\r\nIn this context, it is imperative to mention that F-35 jets, built by America’s largest defense contractor, Lockheed Martin LMT, enjoy a lucrative position in the combat aircraft arena. RTX, as the manufacturer of the F-35 jets’ engine, F135, witnesses a steady flow of orders from the U.S. Army, along with a handful of international partner countries as well as FMS customers. The latest contract win is a bright example of that.\n\nThe soaring demand for Lockheed’s F-35 aircraft can be gauged from the fact that the Czech Republic became the 18th nation to join the F-35 global team during the first quarter of 2024, making its intent to procure 24 F-35s quite obvious. In addition, the U.S. State Department approved a potential foreign military sale to Greece for up to 40 F-35 jets. Moreover, Singapore announced its intent to purchase eight F-35A jets.\r\n\r\nLooking ahead, the production of F-35 jets is expected to continue for several years, given the U.S. government's current inventory target of 2,456 aircraft for the Air Force, Marine Corps and Navy.\n\nConsequently, we may expect Pratt & Whitney, which builds F-135, to witness more order inflows for the F-35 engine and its propulsion system in the coming days, like the latest one. This should significantly bolster RTX’s top line.\n\nStory continues\n\nPeer Growth\n\nApart from Lockheed and RTX, defense majors that stand to benefit from the expanding production rates of F-35 have been discussed below.\r\n\r\nNorthrop Grumman NOC: The company renders its expertise in carrier aircraft and low-observable stealth technology for the F-35 program. Northrop Grumman is part of the international partnership involved in building three variants of the F-35 jet.\n\nIt is engaged in the design and production of the AN/ASQ-242 Communications, Navigation and Identification avionics suite, which can be dynamically programmed to arm the F-35 pilot with multiple-mission capabilities, engineered for seamless transition from one mission phase to the next.\r\n\r\nBAE Systems BAESY: This defense major’s short takeoff and vertical landing experience, along with air systems sustainment, supports F-35’s combat capabilities. The company provides an electronic warfare suite for F-35 that includes fully integrated radar warning (targeting support and self-protection) to detect and defeat surface and airborne threats.\n\nIn 2023, BAE Systems celebrated the delivery of its 1000th rear fuselage to Lockheed from its facilities in the North West of the United Kingdom. In the United States, BAE Systems’ test pilots and engineers are working to get the aircraft ready to meet the needs of its customers.\n\nPrice Performance\n\nIn the past year, shares of RTX have rallied 13.5% against the industry’s 7.5% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nRTX currently has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nBae Systems PLC (BAESY) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-secures-381m-contract-support-153800654.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "BA.LSE",
            "BAESF.US",
            "BAESY.US",
            "BSP.BE",
            "BSP.DU",
            "BSP.F",
            "BSP.STU",
            "BSP.XETRA",
            "BSPA.F",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NTH.BE"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.03,
            "neu": 0.835,
            "pos": 0.135
        }
    },
    {
        "date": "2024-05-30T15:26:29+00:00",
        "title": "F-35 Crashes After Leaving Lockheed Martin Factory",
        "content": "A $90 million F-35 fighter jet is a total loss after a catastrophic accident this week.\n\nAccording to reports, the plane had left an assembly plant in Texas, en route to a California Air Force base, when it crashed into a hillside.\n\nThe pilot of the craft was able to eject before the impact, which sent up a huge plume of black smoke. Still, the unnamed pilot was taken to the hospital with serious injuries and two people on the ground were reportedly evaluated and released.\n\nMost Read on IEN:\n\nHershey Sued Over Deceptive Carvings on Reese's Products Kennametal Factory Damaged in Arkansas Tornado Air Force Awards $13B for New Fleet of 'Doomsday Planes' Heineken Uproots Huge Apple Orchard as Cider Sales Slip\n\nLockheed Martin, the producer of the plane, confirmed to the AP that the crash occurred when the pilot stopped to refuel at Kirtland Air Force Base near Albuquerque. This individual has been identified as a pilot for the Defense Contract Management Agency, an agency of the Department of Defense and is said to be in stable condition.\n\nLockheed Martin released a statement saying that \"safety is our priority, and we will follow appropriate investigation protocol.\"\n\nThe aircraft is being described as a test jet that was in the process of transferring to Edwards AFB for additional updates. The F-35 Joint Program Office, in a statement, clarified that the jet had been accepted by the government in September, but it was “recently undergoing modification.”\n\nThe F-35 program will carry an estimated cost, over its lifespan, of more than $2 trillion.\n\nClick here to subscribe to our daily newsletter featuring breaking manufacturing industry news.\n\nView comments",
        "link": "https://finance.yahoo.com/news/f-35-crashes-leaving-lockheed-152629597.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.351,
            "neg": 0.052,
            "neu": 0.897,
            "pos": 0.051
        }
    }
]