[
    {
        "date": "2024-06-07T17:00:00+00:00",
        "title": "Cash Flow Kings: 7 Stocks Set to Deliver Massive Value to Shareholders",
        "content": "A commonly used method to value stocks is discounted cash flow analysis. The basic idea is to estimate the present value of future cash flow from the business. While revenue growth is important, the bottom line is the cash flow potential that the business holds. Investors should look for cash-flow stocks that represent companies with robust free cash flow and the ability to increase cash flow on a sustained basis.\n\nAn important point to note is that blue-chip companies generally have robust cash flow. On the other hand, growth companies are focused on aggressive investments and cash flow is relatively low. However, if an investor can correctly identify a future cash-flow machine, returns from the stock can be multi-fold.\n\nI have discussed a mix of blue-chip and emerging ideas from the perspective of cash flow potential from the business. I must add that healthy cash flow would also imply robust dividends and sustained value creation through share repurchase.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nThese are seven cash-flow stocks worth your attention now.\n\nApple (AAPL) Apple logo on a pink and purple background. AAPL stock.\n\nSource: Moab Republic / Shutterstock\n\nThat Apple (NASDAQ:AAPL) trades at a valuation of almost $3 trillion is not a euphoria or a bubble. The valuation is a function of innovation and the cash flow potential. AAPL stock has a low dividend yield of 0.5%. However, I expect robust dividend growth in the next five years.\n\nApple reported operating cash flow of $62.5 billion for the first half of 2024, implying an annualized operating cash flow potential of $125 billion. Further, the technology company has a cash buffer of $160 billion.\n\nTherefore, there is ample flexibility for dividends, share repurchases, and investment in innovation-driven growth. For the first half of 2024, the products business witnessed some contraction. However, the services segment, which includes the App Store, offset that weakness.\n\nEven in the product segment, the wearable, home, and accessories businesses are likely to gain growth traction in global markets. Recently, the company unveiled a new AI-focused chip in its iPad Pro. With AI-powered enhancement in devices, I expect the products segment to deliver healthy growth in the coming quarters. Therefore, as the business grows, cash flows will continue to swell.\n\nAlphabet (GOOG) Closeup logo of Google.com website on an iPhone on wooden table. GOOG stock and Google layoffs\n\nSource: Koshiro K / Shutterstock.com\n\nAlphabet (NASDAQ:GOOG)(NASDAQ:GOOGL) is another technology stock that looks attractively valued, and the business is a cash flow machine. GOOG stock trades at a forward price-to-earnings ratio of 23.5x, which is attractive considering the impending growth backed by AI.\n\nStory continues\n\nFor Q1 2024, Alphabet reported revenue growth of 15% on a year-on-year basis to $80.5 billion. It’s worth noting that the Google Cloud business growth was 28% to $9.6 billion. Further, the technology giant reported operating cash flow of $23.5 billion for the quarter. The annualized operating cash flow potential is almost $100 billion.\n\nThis provides Alphabet with the flexibility to invest in AI-driven growth. At the same time, I expect a robust upside in dividends in the coming years. Coming back to AI, Alphabet is just getting started on that front. Last month, the company launched a beefed-up AI search and chatbot. Alphabet believes that it’s well-positioned for the “next wave of AI innovation.” I, therefore, expect healthy growth to be sustained coupled with a cash flow upside.\n\nLockheed Martin (LMT) Lockheed Martin (LMT) M142 High Mobility Artillery Rocket System (HIMARS).3D illustration.\n\nSource: Mike Mareen / Shutterstock.com\n\nGlobal defense expenditures surged to $2.44 trillion in 2023 and there is no doubt that spending will continue to swell. Defense stocks are likely to benefit on the back of a robust order intake. Lockheed Martin (NYSE:LMT) is among the undervalued defense stocks to buy at a forward P/E of 17.9x. The defense stock also offers a healthy dividend yield of 2.7%.\n\nAs of the first quarter, Lockheed Martin reported an order backlog of $159 billion. This provides clear revenue and cash flow visibility. For 2024, the company guided for free cash flow of $6.2 billion (mid-range). This provides ample flexibility for dividend growth and continued share repurchases.\n\nIt’s also likely that sales growth will accelerate in the coming years and will have a positive impact on cash flows. There are two reasons to expect healthy sales growth. First, Lockheed increasingly pursued deals outside the U.S. with its allies. The geographic expansion will benefit the defense major.\n\nFurther, Lockheed is focused on next-generation defense technology, including hypersonic and next-generation interceptors. Its aggressive investment in research and development is likely to be a growth catalyst.\n\nChevron (CVX)\n\nSource: JL IMAGES / Shutterstock.com\n\nChevron (NYSE:CVX) is an undervalued blue-chip stock from the oil and gas industry. In the last 12 months, CVX stock remained sideways with oil struggling to trend higher on the back of macroeconomic headwinds. I see the sideways move as a good opportunity to accumulate.\n\nWith multiple interest rate cuts likely in the next 12 to 18 months, I am bullish on oil. Chevron has an investment-grade balance sheet and high-quality assets with an attractive break-even point.\n\nChevron reported operating cash flow of $35.6 billion for 2023 and $6.8 billion in the first quarter of 2024. If oil trends higher, it’s likely that cash flow will be in the range of $35 billion to $40 billion for the year.\n\nCash flows will swell further with the likely completion of the acquisition of Hess (NYSE:HES). Therefore, even with aggressive capital investment plans, there will be ample flexibility for dividend growth and share repurchase.\n\nCostco Wholesale (COST) A Costco Wholesale (COST) warehouse in Auburn Hills, Michigan.\n\nSource: ilzesgimene / Shutterstock.com\n\nCostco Wholesale (NASDAQ:COST) is possibly the best pick among retail stocks considering the company’s growth trajectory. While a forward P/E of 51x looks slightly stretched, COST stock has always commanded a valuation premium as compared to peers. I would look at corrections to accumulate this retail behemoth.\n\nFor the third quarter of fiscal year 2024, Costco reported sales growth of 9.1% on a year-on-year basis to $57.39 billion. Comparable store sales growth was also healthy at 6.6%. With rate cuts impending, I expect consumption expenditures to accelerate, and Costco will benefit.\n\nFor the first nine months of fiscal 2024, the company reported operating cash flow of $8.3 billion. Cash flows have continued to swell, and I remain bullish, considering the top-line growth and continued upside in membership revenue.\n\nAs of Q1 2023, Costco had two warehouses in China. In the last quarter, the number of warehouses increased to seven. International expansion is likely to be another catalyst for growth and cash flow upside.\n\nCrowdStrike Holdings (CRWD) A sign with the Crowdstrike (CRWD) company logo\n\nSource: VDB Photos / Shutterstock.com\n\nCybersecurity stocks have been in the limelight considering the big addressable market. CrowdStrike Holdings (NASDAQ:CRWD) is an emerging cash-flow business that deserves a place in the portfolio. CRWD stock surged by 122% in the last 12 months. There was an intermediate correction, but the reversal was swift on the back of strong Q1 results.\n\nFor the first quarter, CrowdStrike reported stellar revenue growth of 33% on a year-on-year basis to $921 million. For the same period, CrowdStrike generated operating cash flow of $383 million and ended the quarter with a cash buffer of $3.7 billion. With annual operating cash flow visibility of almost $1.6 billion, CrowdStrike is an emerging cash-flow star.\n\nThe cybersecurity company reported annual recurring revenue of $3.65 billion as of April. Over the next five to seven years, CrowdStrike is targeting an annual recurring revenue of $10 billion. This provides an indication of the headroom for upside in revenue and cash flows. It’s, therefore, not surprising that CRWD stock has remained in a sharp uptrend.\n\nNewmont Corporation (NEM) Newmont logo on a mobile phone screen\n\nSource: Piotr Swat/Shutterstock\n\nMultiple factors globally are likely to ensure that gold remains in an uptrend. Some important reasons include geopolitical tensions, inflation, and the prospects of expansionary policies. Newmont Corporation (NYSE:NEM) is a blue-chip gold mining company worth holding for healthy dividends and capital gains.\n\nAs of 2023, Newmont reported 128 million ounces of gold reserves and 155 million ounces in resources. The gold miner has a leading portfolio of 10 Tier 1 assets. A strong asset base ensures a steady production upside beyond the current decade.\n\nIt’s also worth noting that Newmont has an investment-grade balance sheet. As of Q1 2024, the company reported a liquidity buffer of $7 billion. Last year, Newmont reported operating cash flow of $2.7 billion. With gold trending higher, it’s likely that operating cash flow will be more than $3.5 billion. This provides ample flexibility for dividend growth. At the same time, capital investments will remain aggressive backed by a strong balance sheet.\n\nOn the date of publication, Faisal Humayun did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nFaisal Humayun is a senior research analyst with 12 years of industry experience in the field of credit research, equity research and financial modeling. Faisal has authored over 1,500 stock specific articles with focus on the technology, energy and commodities sector.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post Cash Flow Kings: 7 Stocks Set to Deliver Massive Value to Shareholders appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/cash-flow-kings-7-stocks-170000742.html",
        "symbols": [
            "0R3E.LSE",
            "AAPL.US",
            "CHEV.NEO",
            "CHV.BE",
            "CHV.DU",
            "CHV.F",
            "CHV.HM",
            "CHV.MU",
            "CHV.STU",
            "CHV.XETRA",
            "CHVX34.SA",
            "COST.US",
            "CRWD.US",
            "CVX.BA",
            "CVX.MX",
            "CVX.US",
            "GOOG.US",
            "GOOGL.US",
            "HES.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.016,
            "neu": 0.86,
            "pos": 0.125
        }
    },
    {
        "date": "2024-06-07T13:02:00+00:00",
        "title": "RTX Secures a Contract to Support Standard Missile Program",
        "content": "RTX Corp. RTX recently clinched a modification contract involving its Standard Missile program. The award has been offered by the Naval Sea Systems Command, Washington, D.C.\n\nDetails of the Deal\n\nValued at $27 million, the contract is expected to be completed by September 2025. The latest modification enables RTX to exercise options to provide depot as well as intermediate-level repair and maintenance support for Standard Missile (“SM”).\n\nA major portion of the work associated with this contract will be carried out in Tucson, AZ.\n\nWhat’s Favoring RTX?\n\nNations are reinforcing their military capabilities to strengthen their defense structure in the growing threat environment. In this context, increased spending has been witnessed on missile capabilities, resulting in a significant order inflow for companies like RTX, which is a prominent missile maker in the United States with a strong international presence.\r\n\r\nTo this end, it is imperative to mention that RTX’s SM comes in two variants — SM-2 and SM-6. While the SM-2 missile is the world’s premier surface-to-air defense weapon that defends the U.S. Navy against anti-ship missiles and aircraft, SM-6 can perform anti-air warfare, anti-surface warfare and ballistic missile defense.\n\nNotably, so far, more than 12,000 SM-2 missiles have been delivered to the U.S. and allied customers, and over 500 SM-6 missiles to the U.S. Navy. This statistic surely reflects the solid demand that these two missiles enjoy in the missile market. The latest contract win is a further testament to that. Such contract wins are expected to boost RTX’s top line in the coming quarters.\n\nRTX’s Growth Prospects\n\nThe global peace index reflects an unstable environment worldwide, with the Russia-Ukraine war continuing for more than two years now, in addition to the ongoing hostility in different parts of the Middle East. This has set the stage for the defense sector to witness rising demand for military products, particularly missiles, as nations worldwide strive to protect their borders from unprecedented attacks.\n\nTherefore, the growth prospect for the missile and missile defense systems market remains solid. To this end, the Mordor Intelligence firm projects the market to witness a CAGR of 5% over the 2024-2029 period.\n\nSuch a solid market growth projection stands to benefit RTX, which enjoys an extensive missile portfolio, including AIM-9X Sidewinder missile, TOW missiles and many more such weapons, apart from the Standard Missile.\n\nOpportunities for Peers\n\nOther defense contractors that are likely to benefit from the growth opportunities offered by the missile and missile defense market are as follows:\n\nStory continues\n\nNorthrop Grumman NOC: Northrop is a prominent developer of missile systems and counter systems, including strategic deterrents, as well as subsystems and components. Its product portfolio includes the Integrated Air and Missile Defense Battle Command System, the Guided Multiple Launch Rocket System propulsion and warhead subsystems, the Hypersonic Attack Cruise Missile, the Advanced Anti-Radiation Guided Missile and a few other combat-proven products that support missile defense systems.\n\nNOC boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for Northrop’s 2024 sales indicates an improvement of 4.6% from the 2023 reported figure.\r\n\r\nLockheed Martin LMT: Lockheed’s Missiles and Fire Control business unit develops, manufactures and supports advanced combat missiles and rockets for military customers, including the U.S. Army, Navy, Air Force, Marine Corps, NASA and dozens of foreign allies. Some of its prominent products are the PAC-3 missile and the Terminal High Altitude Area Defense missile.\n\nLMT boasts a long-term earnings growth rate of 4.1%. The Zacks Consensus Estimate for Lockheed’s 2024 sales indicates an improvement of 3.2% from the 2023 reported figure.\n\nGeneral Dynamics GD: General Dynamics’ Ordnance and Tactical Systems unit is the system integrator of the 2.75-inch Hydra-70 family of rockets. It also produces composite rocket motor cases and launch tubes for tactical and strategic missiles.\n\nGD boasts a long-term earnings growth rate of 12%. The Zacks Consensus Estimate for General Dynamics’ 2024 sales indicates growth of 10.5% from the 2023 reported figure.\n\nPrice Movement\n\nIn the past year, shares of RTX have risen 12.1% against the industry’s decline of 9.2%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nRTX currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-secures-contract-support-standard-130200713.html",
        "symbols": [
            "0IUC.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "GD.MX",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.045,
            "neu": 0.768,
            "pos": 0.187
        }
    },
    {
        "date": "2024-06-07T05:57:38+00:00",
        "title": "Exclusive-Germany looking into buying eight additional F-35 jets, source says",
        "content": "By Sabine Siebold\n\nBERLIN (Reuters) - Germany is looking into buying eight additional F-35 fighter jets made U.S. defence giant Lockheed Martin, a military source told Reuters on Friday, on top of the 35 jets it has ordered.\n\nBerlin is looking at the costs of such a purchase, the source said, with the stealthy aircraft seen as the most advanced fighter jet.\n\nIn 2022, Germany decided to order 35 F-35s including missiles and other weapons for around €10 billion ($10.89 billion).\n\nThe jets are equipped with advanced sensors and other gear, and Lockheed says it is nearly impossible to track them with radar.\n\nThe aircraft will replace the aging Tornado, the only German jet capable of carrying U.S. nuclear bombs stored in Germany.\n\nThe German air force has been flying the Tornado since the 1980s, and Berlin has plans to phase it out between 2025 and 2030.\n\nThe F-35 will be stationed at an air base near the western German town of Buechel from 2027 and could also carry U.S. nuclear weapons.\n\nThe first eight F-35s are scheduled for delivery in 2026 and will be based in the U.S. for pilot training.\n\n($1 = 0.9185 euros)\n\n(Reporting by Sabine Siebold, editing by Sabine Wollrab, Andrey Sychev and Thomas Seythal)\n\nView comments",
        "link": "https://finance.yahoo.com/news/exclusive-germany-looking-buying-eight-055738192.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.564,
            "neg": 0.032,
            "neu": 0.906,
            "pos": 0.062
        }
    },
    {
        "date": "2024-06-07T00:00:00+00:00",
        "title": "Cash Flow Kings: 7 Stocks Set to Deliver Massive Value to Shareholders",
        "content": "These cash-flow stocks to buy represent some outstanding companies with strong fundamentals and robust cash flow upside potential.",
        "link": "https://investorplace.com/2024/06/cash-flow-kings-7-stocks-set-to-deliver-massive-value-to-shareholders/",
        "symbols": [
            "AAPL.US",
            "COST.US",
            "CRWD.US",
            "CVX.US",
            "GOOG.US",
            "GOOGL.US",
            "LMT.US",
            "NEM.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.866,
            "neg": 0,
            "neu": 0.607,
            "pos": 0.393
        }
    }
]