[
    {
        "date": "2024-07-17T22:00:19+00:00",
        "title": "Why the Market Dipped But Lockheed Martin (LMT) Gained Today",
        "content": "The latest trading session saw Lockheed Martin (LMT) ending at $476.07, denoting a +1.6% adjustment from its last day's close. The stock outpaced the S&P 500's daily loss of 1.39%. On the other hand, the Dow registered a gain of 0.6%, and the technology-centric Nasdaq decreased by 2.77%.\n\nPrior to today's trading, shares of the aerospace and defense company had gained 1.87% over the past month. This has outpaced the Aerospace sector's gain of 1.64% and lagged the S&P 500's gain of 4.43% in that time.\n\nThe investment community will be closely monitoring the performance of Lockheed Martin in its forthcoming earnings report. The company is scheduled to release its earnings on July 23, 2024. It is anticipated that the company will report an EPS of $6.44, marking a 4.31% fall compared to the same quarter of the previous year. Meanwhile, our latest consensus estimate is calling for revenue of $17.06 billion, up 2.19% from the prior-year quarter.\n\nFor the full year, the Zacks Consensus Estimates are projecting earnings of $26.27 per share and revenue of $69.76 billion, which would represent changes of -5.57% and +3.24%, respectively, from the prior year.\n\nInvestors should also pay attention to any latest changes in analyst estimates for Lockheed Martin. Such recent modifications usually signify the changing landscape of near-term business trends. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.\n\nResearch indicates that these estimate revisions are directly correlated with near-term share price momentum. To exploit this, we've formed the Zacks Rank, a quantitative model that includes these estimate changes and presents a viable rating system.\n\nThe Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed a 0.05% increase. Lockheed Martin is currently a Zacks Rank #3 (Hold).\n\nDigging into valuation, Lockheed Martin currently has a Forward P/E ratio of 17.84. This indicates a discount in contrast to its industry's Forward P/E of 18.56.\n\nWe can also see that LMT currently has a PEG ratio of 4.39. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The average PEG ratio for the Aerospace - Defense industry stood at 1.78 at the close of the market yesterday.\n\nStory continues\n\nThe Aerospace - Defense industry is part of the Aerospace sector. With its current Zacks Industry Rank of 102, this industry ranks in the top 41% of all industries, numbering over 250.\n\nThe Zacks Industry Rank assesses the strength of our separate industry groups by calculating the average Zacks Rank of the individual stocks contained within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nYou can find more information on all of these metrics, and much more, on Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/why-market-dipped-lockheed-martin-220019000.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.992,
            "neg": 0.01,
            "neu": 0.895,
            "pos": 0.095
        }
    },
    {
        "date": "2024-07-17T14:20:00+00:00",
        "title": "Boeing (BA) Wins Order to Supply 5 777 Freighters to Emirates",
        "content": "The Boeing Company BA recently secured an order from Emirates SkyCargo, the cargo unit of Emirates Airlines, to supply five 777 Freighters. This contract win should significantly boost Boeing’s commercial airplane business segment.\r\n\r\nWith the latest purchase, Emirates’ order for Boeing’s wide-body aircraft includes 10 777 Freighters.\n\nAbout 777 Freighters\n\nThe Boeing 777 Freighter is a very competent, wide-body twin-engine freighter that can carry more cargo than any other twin-engine cargo aircraft, with a maximum payload capacity of 112 tons (102 metric tons) and a range of 4,970 nautical miles (9,200 km).\r\n\r\nOwing to these capabilities, 20% of all air freight worldwide is transported by this Boeing freighter as of March 2024.\n\nBoeing’s Growth Prospects\n\nWith the rise of e-commerce, the revival of international trade and fleet modernization, the worldwide freighter aircraft market has been expanding significantly. This trend is further supported by the growing need for technologically advanced freight transport and increased demand for freight charter services.\r\n\r\nTo this end, Boeing forecasts the air cargo traffic, measured in revenue ton kilometers, to grow an average of 4.1% annually from 2022 to 2041. With freighters constituting approximately 70% of all air cargo traffic as of 2021, the aforementioned projection offers ample growth opportunities to Boeing, which enjoys an already established position in the freighter market. Impressively, BA provides more than 90% of the worldwide dedicated freighter capacity.\r\n\r\nOnce the 777-8 Freighter starts getting delivered in 2027, as expected, which comes with 30% lower fuel usage and emissions from similar kinds of freighters, Boeing will be able to grab an increased share of the air cargo traffic growth.\n\nOpportunities for Peers\n\nApart from Boeing, other prominent aerospace players that have a strong presence in the freighter market and thus are also expected to gain from the growing air cargo traffic are mentioned below:\r\n\r\nAirbus Group EADSY: The company provides a range of freighters with different capacities and capabilities. Its A330-200F is a new-generation cargo aircraft, while A330P2F, A320P2F and A321P2F are passenger aircraft that have been converted to a freighter.\r\n\r\nAirbus has a long-term (three to five years) earnings growth rate of 13.9%. The Zacks Consensus Estimate for EADSY’s 2024 sales calls for an improvement of 6.9% from the prior-year reported figure.\r\n\r\nTextron Inc. TXT: Its Cessna SkyCourier freighter is a multi-purpose twin-engine aircraft built for cargo transport. It transports diverse things efficiently because of its large cabin volume and high payload capacity. Its durable build, short takeoff capabilities and superior avionics make it an excellent choice for regional freight services.\r\n\r\nTextron boasts a long-term earnings growth rate of 10.1%. The Zacks Consensus Estimate for TXT’s 2024 sales implies an improvement of 5.7% from the prior-year reported figure.\r\n\r\nLockheed Martin Corp. LMT: Its LM-100J performs as a civil multi-purpose air freighter capable of rapid and efficient transport of cargo. Its superior avionics and durable build make it suitable for a variety of tasks, including humanitarian aid, disaster relief and logistics support.\r\n\r\nLockheed Martin boasts a long-term earnings growth rate of 4.1%. The Zacks Consensus Estimate for LMT’s 2024 sales suggests an improvement of 3.2% from the prior-year reported figure.\n\nStory continues\n\nPrice Movement\n\nIn the past three months, shares of Boeing have risen 9.3% compared with the industry’s growth of 2.3%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nBoeing currently carries a Zacks Rank #4 (Sell).\r\n\r\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/boeing-ba-wins-order-supply-142000512.html",
        "symbols": [
            "0BOE.LSE",
            "0KVV.IL",
            "0LF0.LSE",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.011,
            "neu": 0.814,
            "pos": 0.175
        }
    },
    {
        "date": "2024-07-17T14:00:56+00:00",
        "title": "General Dynamics (GD) Earnings Expected to Grow: What to Know Ahead of Next Week's Release",
        "content": "General Dynamics (GD) is expected to deliver a year-over-year increase in earnings on higher revenues when it reports results for the quarter ended June 2024. This widely-known consensus outlook gives a good sense of the company's earnings picture, but how the actual results compare to these estimates is a powerful factor that could impact its near-term stock price.\n\nThe earnings report, which is expected to be released on July 24, 2024, might help the stock move higher if these key numbers are better than expectations. On the other hand, if they miss, the stock may move lower.\n\nWhile management's discussion of business conditions on the earnings call will mostly determine the sustainability of the immediate price change and future earnings expectations, it's worth having a handicapping insight into the odds of a positive EPS surprise.\n\nZacks Consensus Estimate\n\nThis defense contractor is expected to post quarterly earnings of $3.31 per share in its upcoming report, which represents a year-over-year change of +22.6%.\n\nRevenues are expected to be $11.48 billion, up 13.1% from the year-ago quarter.\n\nEstimate Revisions Trend\n\nThe consensus EPS estimate for the quarter has been revised 0.14% lower over the last 30 days to the current level. This is essentially a reflection of how the covering analysts have collectively reassessed their initial estimates over this period.\n\nInvestors should keep in mind that the direction of estimate revisions by each of the covering analysts may not always get reflected in the aggregate change.\n\nEarnings Whisper\n\nEstimate revisions ahead of a company's earnings release offer clues to the business conditions for the period whose results are coming out. Our proprietary surprise prediction model -- the Zacks Earnings ESP (Expected Surprise Prediction) -- has this insight at its core.\n\nThe Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a more recent version of the Zacks Consensus EPS estimate. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.\n\nThus, a positive or negative Earnings ESP reading theoretically indicates the likely deviation of the actual earnings from the consensus estimate. However, the model's predictive power is significant for positive ESP readings only.\n\nA positive Earnings ESP is a strong predictor of an earnings beat, particularly when combined with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold). Our research shows that stocks with this combination produce a positive surprise nearly 70% of the time, and a solid Zacks Rank actually increases the predictive power of Earnings ESP.\n\nStory continues\n\nPlease note that a negative Earnings ESP reading is not indicative of an earnings miss. Our research shows that it is difficult to predict an earnings beat with any degree of confidence for stocks with negative Earnings ESP readings and/or Zacks Rank of 4 (Sell) or 5 (Strong Sell).\n\nHow Have the Numbers Shaped Up for General Dynamics?\n\nFor General Dynamics, the Most Accurate Estimate is lower than the Zacks Consensus Estimate, suggesting that analysts have recently become bearish on the company's earnings prospects. This has resulted in an Earnings ESP of -0.54%.\n\nOn the other hand, the stock currently carries a Zacks Rank of #3.\n\nSo, this combination makes it difficult to conclusively predict that General Dynamics will beat the consensus EPS estimate.\n\nDoes Earnings Surprise History Hold Any Clue?\n\nAnalysts often consider to what extent a company has been able to match consensus estimates in the past while calculating their estimates for its future earnings. So, it's worth taking a look at the surprise history for gauging its influence on the upcoming number.\n\nFor the last reported quarter, it was expected that General Dynamics would post earnings of $2.89 per share when it actually produced earnings of $2.88, delivering a surprise of -0.35%.\n\nOver the last four quarters, the company has beaten consensus EPS estimates two times.\n\nBottom Line\n\nAn earnings beat or miss may not be the sole basis for a stock moving higher or lower. Many stocks end up losing ground despite an earnings beat due to other factors that disappoint investors. Similarly, unforeseen catalysts help a number of stocks gain despite an earnings miss.\n\nThat said, betting on stocks that are expected to beat earnings expectations does increase the odds of success. This is why it's worth checking a company's Earnings ESP and Zacks Rank ahead of its quarterly release. Make sure to utilize our Earnings ESP Filter to uncover the best stocks to buy or sell before they've reported.\n\nGeneral Dynamics doesn't appear a compelling earnings-beat candidate. However, investors should pay attention to other factors too for betting on this stock or staying away from it ahead of its earnings release.\n\nExpected Results of an Industry Player\n\nAmong the stocks in the Zacks Aerospace - Defense industry, Lockheed Martin (LMT) is soon expected to post earnings of $6.44 per share for the quarter ended June 2024. This estimate indicates a year-over-year change of -4.3%. This quarter's revenue is expected to be $17.06 billion, up 2.2% from the year-ago quarter.\n\nThe consensus EPS estimate for Lockheed has been revised 1.2% lower over the last 30 days to the current level. However, a higher Most Accurate Estimate has resulted in an Earnings ESP of 0.85%.\n\nThis Earnings ESP, combined with its Zacks Rank #3 (Hold), suggests that Lockheed will most likely beat the consensus EPS estimate. The company beat consensus EPS estimates in each of the trailing four quarters.\n\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/general-dynamics-gd-earnings-expected-140056933.html",
        "symbols": [
            "0IUC.LSE",
            "0R3E.LSE",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.049,
            "neu": 0.799,
            "pos": 0.152
        }
    },
    {
        "date": "2024-07-17T13:30:00+00:00",
        "title": "Lockheed Martin Delivers First C-130J-30 Super Hercules to Ohio Youngstown Air Reserve Station",
        "content": "910th Airlift Wing to receive a total of eight Super Hercules tactical airlifters\n\nMARIETTA, Ga., July 17, 2024 /PRNewswire/ -- Lockheed Martin (NYSE: LMT) delivered the first of eight C-130J-30 Super Hercules tactical airlifters assigned to the Ohio Youngstown Air Reserve Station, marking the addition of a new mission capability for the Super Hercules ― the aerial spray mission. Lockheed Martin delivered the first of eight C-130J-30 tactical airlifters to the U.S. Air Force Reserve’s 910th Airlift Wing assigned to the Ohio Youngstown Air Reserve Station on July 16, 2024. (Photo by Thinh D. Nguyen)\n\nThe 910th Airlift Wing has the distinction of maintaining the Department of Defense's only large area, fixed-wing aerial spray capability to eliminate disease-carrying insects and pest insects and to disperse oil spills in large bodies of water. Defined by its versatility, the C-130J Super Hercules now supports 19 unique mission capabilities, including the aerial spray mission.\n\n\"Lockheed Martin is honored to deliver the most advanced Super Hercules ever built to the 910th Airlift Wing, providing cutting-edge technology and enabling a critical mission for the U.S. Air Force Reserve,\" said Rod McLean, vice president and general manager of Lockheed Martin's Air Mobility & Maritime Missions line of business. \"The C-130J is constantly evolving, as reflected with this 19th mission capability, ensuring the Super Hercules remains ready for what's next through unmatched versatility and tactical airlift power.\"\n\nA longtime C-130 Hercules operator, the 910th Airlift Wing received its first C-130 in 1981 and has operated different variants for more than 40 years. This new fleet of C-130Js will preserve the unit's tactical airlift and aerial spray mission, while providing more space, speed, range, and versatility for decades to come.\n\n\"As we welcome the first C-130J aircraft to Youngstown Air Reserve Station, we mark a pivotal moment in our mission readiness. The C-130J Super Hercules stands as a symbol of our Air Force's enduring strength and versatility, ensuring we continue to meet our nation's needs with excellence,\" said Maj. Gen. Melissa Coburn, 22nd Air Force commander.\n\nThe U.S. Air Force Reserve operates a mixed fleet of C-130Js and legacy aircraft. The addition of the C-130J Super Hercules ensures the fleet is mission-ready at any given time, delivering unprecedented reach and interoperability.\n\n\"The 910th Airlift Wing's tactical airlift and aerial spray missions require a capable, reliable and adaptable airframe. Our C-130H Hercules aircraft have provided that for decades. As we retire them from service at Youngstown Air Reserve Station, we look forward to continuing their track record of success with a fleet of new C-130J Super Hercules aircraft,\" said Col. Mike Maloney, 910th Airlift Wing commander.\n\nStory continues\n\nAlways evolving, continually innovating and ready for what's next, the Super Hercules leads the charge by setting standards and shaping the future of tactical airlift missions. The global C-130J fleet spans 26 operators in 22 nations with 20+ air worthiness certifications. With nearly 3 million flight hours logged across the global fleet of 545+ C-130Js, invaluable insights gained from missions in every scenario equip the C-130J for what's next.\n\nFor more information, visit www.lockheedmartin.com/c130.\n\nAbout Lockheed Martin \r\nLockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at lockheedmartin.com. (PRNewsfoto/Lockheed Martin Aeronautics) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/lockheed-martin-delivers-first-c-130j-30-super-hercules-to-ohio-youngstown-air-reserve-station-302198776.html\n\nSOURCE Lockheed Martin Aeronautics\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-delivers-first-c-133000769.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.006,
            "neu": 0.845,
            "pos": 0.149
        }
    },
    {
        "date": "2024-07-17T12:54:00+00:00",
        "title": "Lockheed (LMT) Wins $500M Deal From Croatia: Time to Buy?",
        "content": "Lockheed Martin Corp. LMT recently secured a contract worth $500 million from the Government of Croatia to supply eight UH-60M Black Hawk helicopters, along with their associated spare parts and services. This award win boosts Lockheed’s revenue generation prospects from its Sikorsky business unit, which has been one of the topmost pioneers in building military rotorcrafts.\n\nNow, before asserting whether it will be profitable to buy LMT’s shares at present, let’s delve into its year-to-date performance, growth prospects as well as risks (if any) to make an insightful decision.\n\nLMT Outperforms Industry & Sector\n\nShares of Lockheed have risen 3.3% in the year-to-date period, outperforming the Zacks aerospace-defense industry’s decline of 12.1%. It has also outpaced the broader Zacks Aerospace sector’s decline of 6.2% in the same time frame.\n\nA similar trend can be seen in the performance of LMT’s competitors, RTX Corp. RTX, General Dynamics GD and L3Harris Technologies LHX, which have witnessed a surge of 23.2%, 12.3% and 14.1%, respectively, year to date.\n\nLMT’s YTD Performance Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nKey Catalysts Benefiting Lockheed\n\nValuable Order Growth: Solid order growth, like the latest one from Croatia, has always been playing the role of a crucial growth catalyst for the United States’ largest defense contractor. While a steady order flow reflects the notable demand that Lockheed’s varied products enjoy in the global defense space, cumulative backlog arising out of those order flows strengthens the company’s revenue generation prospects. Notably, Lockheed’s total backlog came in at a record $159.4 billion as of Mar 31, 2024.\n\nImpressive Defense Budget: With the United States being the most prominent weapon exporter in the world, the nation’s defense budget plays a vital role in bolstering the growth of U.S. defense contractors. It does so by offering notable funding support for research, innovation and development of more advanced arms and ammunitions.\n\nNotably, the fiscal 2025 U.S. defense budget, which includes funding of $850 billion for the U.S. Department of Defense, constitutes continuous funding support for many of Lockheed’s significant programs, including the F-35, CH-53K, UH-60M as well as an enhanced emphasis on its advanced munitions programs, such as LRASM, Javelin and PAC-3, as well as the long-range hypersonic weapon.\n\nStable Financials Boosting Shareholder Value: Lockheed’s cash and cash equivalents at the end of the first quarter of 2024 totaled $2.79 billion, while its current debt was $0.17 billion.  So, it would be safe to conclude that the stock holds a strong solvency position, at least in the near term.\n\nStory continues\n\nThis solid financial position must have been encouraging Lockheed to reward its shareholders with solid dividend payouts. As of Mar 31, 2024, Lockheed paid out dividends worth $780 million to its shareholders.\n\nHeadwinds to Keep an Eye on\n\nDespite being a prominent defense contractor, Lockheed faces some notable industry challenges, like a shortage of skilled labor, with an aging workforce (particularly) being a major cause of concern. Per a study by the Aerospace Industries Association, 29% of the aerospace-defense industry’s employees are above the age of 55, creating waves of retirement impact that are estimated to create a projected gap of 3.5 million workers by 2026. So, as aircraft manufacturers have started to ramp up their production rates, such labor shortages might affect aerospace stocks like Lockheed Martin.\n\nMoreover, in 2023, China’s Ministry of Commerce announced that it has added Lockheed to its “unreliable entities list” in connection with certain foreign military sales by the U.S. government to Taiwan, which involves Lockheed’s products and services. China declared that it would impose certain sanctions against Lockheed, including a fine equal to twice the value of the arms that Lockheed had sold to Taiwan since September 2020.\n\nThe nation also implemented broad-based export restrictions on certain minerals used in the production, among other things, of semiconductors and missile systems. If China further restricts the export of these materials or imposes additional sanctions, Lockheed’s business could be adversely impacted.\n\nWill LMT Continue to Grow?\n\nDespite the challenges mentioned above, one may remain optimistic about the company’s near-term growth prospects. A quick sneak peek at its earnings and sales estimates reflects the same.\n\nUpbeat Estimates\n\nThe Zacks Consensus Estimate for 2024 and 2025 sales reflects an improvement of 3.2% and 3.9%, respectively, year over year.\n\nThe Zacks Consensus Estimate for 2024 and 2025 earnings per share reflects an upward movement of 0.7% and 0.6%, respectively, over the past 90 days. The upward revision in earnings estimates indicates analysts’ increasing confidence in the stock. Zacks Investment Research\n\nImage Source: Zacks Investment Research Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nTrading at a Discount\n\nIn terms of valuation, LMT’s forward 12-month price-to-earnings (P/E) is 17.09X, a discount to the industry’s average of 18.36X. This suggests that investors will be paying a lower price than the company's expected earnings growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nWhat Should You Do?\n\nTo sum up, despite the challenges Lockheed is facing at present, this might be a favorable entry point for investors interested in this stock, considering the upward revisions in its earnings estimates, solid backlog count boosting its revenue prospects and its discounted valuation. LMT currently has a VGM Score of A, which indicates a strong performance.\n\nThose who already own this stock may continue to do so. This can be justified by the fact that LMT has a Zacks Rank #3 (Hold) at present. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nL3Harris Technologies Inc (LHX) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-wins-500m-deal-125400100.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.026,
            "neu": 0.776,
            "pos": 0.197
        }
    },
    {
        "date": "2024-07-17T06:43:08+00:00",
        "title": "Lockheed Martin Corporation (LMT): Is It a Good Aerospace and Defense Stock to Buy According to Analysts?",
        "content": "We recently compiled a list of the 10 Best Aerospace and Defense Stocks to Buy Now. In this article, we are going to take a look at where Howmet Aerospace Inc. (NYSE:HWM) stands against the other aerospace and defense stocks.\n\nThe world has been rocked with conflict over the last few years. The war between Russia and Ukraine has gone beyond 860 days, with no immediate end in sight. Azerbaijan and Armenia continue to engage in a regular exchange of fire after the latter lost control of the Nagorno-Karabakh region to the Azeris in 2020. The Middle East is up in flames, with defense experts describing the ongoing Israel-Hamas conflict as the worst crisis in the region since the Arab-Israeli War in 1973.\n\nWhile the human impacts of war are undeniably tragic, it is also a time when defense companies make money and lure investors into loading up on their stocks. According to a report on CNN earlier this year, defense companies in the United States and Europe have thrived since Russia invaded Ukraine in February 2022. German automotive and arms manufacturer Rheinmetall’s share price had surged by a staggering 315% in two years following the start of the conflict, while BAE Systems posted a 105% gain. Northrop Grumman and Lockheed Martin also witnessed an increase in their share prices by 18% and 10%, respectively.\n\nWhen the war broke out, industry analysts expected the aerospace sector to be affected by western sanctions placed on Russia. According to KPMG, the country is the source of 30% of the titanium used by Boeing and other large engine producers that power fighter jets and commercial aviation. Titanium is a key material that goes into the development of jet fan blades and landing gears. However, the supply of titanium from Russia to these companies has largely remained unaffected despite sanctions.\n\nWhile sharing his insights on commercial aviation at the Morningstar Investment Conference in Chicago on June 26, Tony Bancroft from Gabelli Funds said that he had noticed a significant growth in aircraft orders lately, with both Airbus and Boeing having a 12-year backlog of orders. He believes there are three reasons driving it. The first catalyst, according to him, is China which accounts for 20% of the growth in orders to cater to the growing middle class in both China and India who want to travel more. Another critical factor he cited during his talk was that business travel has finally returned to the 2019 pre-pandemic level. Lastly, Tony highlighted the the rising middle class in the United States, and the world, which is increasing air travel and contributing to the economic growth in the industry.\n\nStory continues\n\nFurthermore, Bancroft identified Textron as his hot stock pick in the aerospace and defense industry. He believes the stock is undervalued at its current share price of $85, and anticipates its value to hover around the $125 range in the future. Last year in March, the US Department of Defense (DoD) awarded a $1.3 billion contract to the company to develop helicopters to replace the aging Blackhawk fleet.\n\nAnother top stock that hedge funds are talking about is Carpenter Technology Corporation, a leading supplier of specialty alloys that holds a market share of roughly 40% in the aerospace industry. It was among the top picks during the Sohn Investment Conference in New York back in April. Mohammed Anjarwala, the managing director of Advent Global Opportunities, shared the following remarks about the company during the conference:\n\nWe think Carpenter is one of the best ways to play the growing backlog of planes at Boeing and Airbus, as they ramp up their billing rates.\n\nAt the time of the conference, the stock was trading at around $70 per share. Anjarwala forecasted that the value could go up to around $200 per share or 20 times forward P/E. It is currently valued at $107 per share.\n\nMethodology\n\nInsider Monkey’s database of 920 hedge funds was assessed, as of the first quarter of 2024. We have chosen the 10 best aerospace and defense stocks to buy now based on the hedge fund sentiment towards each stock. The stocks are ranked in ascending order of hedge fund holders in each company.\n\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here). 5 Countries with the Most Special-Mission Aircraft in the World\n\nA military aircraft in flight, showing the strength of the company's combat & air mobility capability.\n\nLockheed Martin Corporation (NYSE:LMT)\n\nNumber of Hedge Fund Holders: 47\n\nLockheed Martin Corporation (NYSE:LMT) is the largest defense contractor in the world, with over $67 billion in revenue in 2023, of which defense-related sales contributed 96%. The company was formed in 1995 after the merger between Lockheed Corporation and Martin Marietta and is famed for manufacturing several notable aircraft over the past decades, including the F-35 fifth-generation fighter jet. The corporation has worldwide interests and is the biggest recipient of DoD contracts in the United States.\n\nSince the start of Russia's invasion of Ukraine in February 2022, Lockheed Martin Corporation (NYSE:LMT)'s share price has soared 29%. The stock is set for further gain with no end to the conflict in sight coupled with the aggravating situation in the Middle East. Earlier this year in April, the US government announced $61 billion in fresh aid for Ukraine and $26 billion for Israel. Most of the funds are likely to go into the procurement of pricey military equipment from companies such as Lockheed Martin Corporation (NYSE:LMT). During the first quarter of 2024, the defense contractor posted an EPS of $6.39 per share, beating analyst estimates of $5.8, driven by strong demand for its weapons, especially HIMARS, GMLRS, and the F-35.\n\nAnalyst ratings for the stock fluctuate between Hold and Strong Buy, with an average share price target of $502, which is 9% higher than its current level of $460 per share. On the other hand, 47 hedge funds are bullish on the stock, according to Insider Monkey, making it one of the best aerospace and defense stocks to buy now. Maria Ricciardone, Vice President, Treasurer, and Investor Relations shared confidence about Lockheed Martin Corporation (NYSE:LMT) being on track to meet full-year targets in the company’s Q1 2024 Earnings Call:\n\nHighlights include robust funding for munitions multi-year procurement, continued investment in hypersonics and classified activities, and ongoing support for programs such as Black Hawk, CH-53K heavy lift helicopter, the fleet ballistic missile, C-130, and F-35. There were also additions to the original budget submission, including F-35 aircraft, C-130, and combat rescue helicopters. The initial budget request for FY2025, while still very early in the process, continues support of many of these same major programs, including the F-35, CH-53K, UH-60M, and others. In addition to emphasis on advanced munitions programs such as JASSM, LRASM, PrSM, Javelin, Daimler, and PAC-3, as well as hypersonic conventional prompt strike and the long-range hypersonic weapon.\n\nOverall LMT ranks 6th on our list of the best aerospace and defense stocks to buy. You can visit 10 Best Aerospace and Defense Stocks to Buy Nowto see the other aerospace and defense stocks that are on hedge funds’ radar. While we acknowledge the potential of LMT as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than LMT but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nREAD NEXT:Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and Jim Cramer is Recommending These 10 Stocks in June.\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-corporation-lmt-good-064308855.html",
        "symbols": [
            "0R3E.LSE",
            "HWM.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.038,
            "neu": 0.865,
            "pos": 0.097
        }
    }
]