[
    {
        "date": "2024-07-29T20:29:00+00:00",
        "title": "These 3 Companies Posted Robust Quarterly Results",
        "content": "Earnings season continues to chug along, with this week’s reporting docket notably busy. So far, the period has been solid, with overall earnings growth for the S&P 500 on track to be positive for another period.\n\nSo far, there have been several notable reports, including those from Lockheed Martin LMT, Deckers Outdoor DECK, and 3M MMM. Shares of each popped following their quarterly results, with each posting strong results.\n\nFor those interested in post-earnings momentum, let’s take a closer look at each.\n\nDeckers Outdoor Raises Outlook\n\nDeckers Outdoor, a current Zacks Rank #2 (Buy), is a leading designer, producer, and brand manager of innovative, niche footwear and accessories developed for outdoor sports, and other lifestyle-related activities.\n\nThe company posted a double beat, with earnings and revenue growing 87% and 22%, respectively. Continued brand momentum among UGG and Hoka shoes aided the robust results, leading the company to up its current fiscal year outlook.\n\nAnalysts have updated their outlook for the company’s current fiscal year accordingly following the print, with the $31.33 Zacks Consensus EPS estimate suggesting 8% growth year-over-year. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nThe company has also been enjoying margin expansion, aiding its profitability picture nicely. And it enjoyed the same throughout its latest release, with its gross margin expanding to 56.9% vs 51.3% in the year-ago period.\n\nPlease note that the chart below is on a trailing twelve-month basis. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLockheed Martin Posts Robust Cash Flow\n\nLockheed Martin is the largest defense contractor in the world, operating in defense, space, intelligence, homeland security, and information technology. The company’s steady growth continued throughout its latest period, with EPS and revenue growing 6% and 9%, respectively.\n\nBelow is a chart illustrating the company’s sales on a quarterly basis. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nCEO Jim Taiclet was pleased with the results, stating, ‘First quarter sales increased significantly year-over-year and we generated robust free cash flow of nearly $1.3 billion, while taking assertive actions to further strengthen production capacity. In addition, we continued our disciplined and dynamic capital deployment by investing over $700 million into R&D and capital projects and returned significant capital to shareholders through dividends and share repurchases as we remain committed to delivering meaningful free cash flow per share growth over the long-term.’\n\nStory continues\n\nThe company has been a long-time favorite among income-focused investors, upping its payout consistently over its history. LMT’s cash-generating abilities have aided the dividend growth, providing it with its shareholder-friendly nature. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\n3M Enjoys Profitability Boost\n\n3M operates as a diversified technology firm with four reportable segments: Safety and Industrial, Transportation and Electronics, Health Care, and Consumer. Share got a boost following its quarterly release, with the company posting 40% Y/Y EPS growth.\n\nPerhaps to the surprise of some, shares are up a staggering 60% over the last six months, with both of its recent prints providing post-earnings positivity. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nThe company adjusted its current year outlook thanks to the results, now expecting adjusted EPS in a band of $7.00 - $7.30 per share ($6.80 - $7.30 per share previously). Like LMT, the company’s long been shareholder-friendly, returning $786 million to shareholders through dividends and buybacks throughout the period.\n\nMargin pressures have weighed heavily on shares but have recently shown signs of stabilization, as we can see below. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nBottom Line\n\nEarnings season continues to chug along, with a stacked reporting docket for this week specifically. We’ve seen many positive surprises so far, including those from Lockheed Martin LMT, Deckers Outdoor DECK, and 3M MMM.\n\nMore surprises are sure to come.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nDeckers Outdoor Corporation (DECK) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-companies-posted-robust-quarterly-202900464.html",
        "symbols": [
            "0R3E.LSE",
            "DECK.US",
            "DO2.BE",
            "DO2.F",
            "DO2.STU",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.005,
            "neu": 0.816,
            "pos": 0.179
        }
    },
    {
        "date": "2024-07-29T15:40:09+00:00",
        "title": "HII or LMT: Which Is the Better Value Stock Right Now?",
        "content": "Investors interested in Aerospace - Defense stocks are likely familiar with Huntington Ingalls (HII) and Lockheed Martin (LMT). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look.\n\nThere are plenty of strategies for discovering value stocks, but we have found that pairing a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system produces the best returns. The Zacks Rank is a proven strategy that targets companies with positive earnings estimate revision trends, while our Style Scores work to grade companies based on specific traits.\n\nRight now, Huntington Ingalls is sporting a Zacks Rank of #2 (Buy), while Lockheed Martin has a Zacks Rank of #3 (Hold). This means that HII's earnings estimate revision activity has been more impressive, so investors should feel comfortable with its improving analyst outlook. But this is only part of the picture for value investors.\n\nValue investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels.\n\nThe Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors.\n\nHII currently has a forward P/E ratio of 16.89, while LMT has a forward P/E of 19.94. We also note that HII has a PEG ratio of 2.36. This figure is similar to the commonly-used P/E ratio, with the PEG ratio also factoring in a company's expected earnings growth rate. LMT currently has a PEG ratio of 4.70.\n\nAnother notable valuation metric for HII is its P/B ratio of 2.64. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, LMT has a P/B of 20.26.\n\nThese metrics, and several others, help HII earn a Value grade of B, while LMT has been given a Value grade of C.\n\nHII sticks out from LMT in both our Zacks Rank and Style Scores models, so value investors will likely feel that HII is the better option right now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHuntington Ingalls Industries, Inc. (HII) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/hii-lmt-better-value-stock-154009588.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.004,
            "neu": 0.766,
            "pos": 0.23
        }
    },
    {
        "date": "2024-07-29T01:46:28+00:00",
        "title": "The Country with the Best Military in the World",
        "content": "This article looks at the country that has the best military in the world. To see the full free list, you can head over to the 15 Countries That Have the Best Military in the World.\n\nGlobal Defense Spending\n\nFigures released this April by the Stockholm International Peace Research Institute (SIPRI) estimated global defense spending for 2023 at a record high of $2.44 trillion, having risen 6.8% compared to the previous year. This is the biggest spike in military expenditure since 2009 and the ninth successive year defense spending had increased.\n\nWith defense bills worth a whopping $916 billion during the year, the United States accounted for 37.5% of the world’s total military spending in 2023. The figure was 2.3% higher than last year and represented more than two-thirds (68%) of NATO’s overall defense expenditure in 2023. $588 billion was spent in Europe, which was 16% higher than in 2022, and made up 24% of the global spending. The spike was triggered by a substantial increase in defense spending by both Russia and Ukraine, while several other countries in the region also bolstered their defenses with war returning to the continent after decades of peace.\n\nAsia incurred $560 billion on defense in 2023. The figure was 40% more than what it was a decade ago in 2014. A major chunk of this expenditure came from East Asia and South Asia, while oil-rich monarchies in the Middle East also spent hefty amounts on strengthening their national security.\n\nThe surge in defense spending over the last two years, specifically after Russia’s invasion of Ukraine in February 2022 has created a boom in the global defense industry. The ongoing conflict in the Middle East involving Israel and Hamas has further bolstered their finances. Lockheed Martin Corporation (NYSE:LMT) posted a revenue of $67.6 billion in 2023, representing a 2.4% increase year-over-year. The company’s earnings also grew $1.2 billion compared to 2023.\n\nSince the beginning of the Russia-Ukraine conflict, Lockheed Martin Corporation (NYSE:LMT)’s share price has gained 29%, due to strong demand for its weapons, especially HIMARS, GMLRS, and the F-35 fifth-generation fighter jet. The stock is projected for further growth with no end in sight to the war in Europe and the aggravating situation in the Middle East. In April, this year, the United States announced $95 billion in fresh military aid for Ukraine, Israel, and Taiwan. Experts believe a major chunk of this amount is going to go into the procurement of advanced weapons from companies such as Lockheed Martin Corporation (NYSE:LMT). It is one of the best aerospace and defense stocks to buy now, with 47 hedge funds bullish about the company’s prospects in Q1 2024, according to Insider Monkey.\n\nStory continues\n\nRTX Corporation (NYSE:RTX) is another stock that is flying high amid strong financial results. After a solid 2023, during which it posted nearly $69 billion in revenue, the company had a robust first quarter of 2024 as well, with sales totaling $19.3 billion and registering a 12% YoY growth. Its earnings per share of $1.34 was also 10% higher than in the first quarter of last year. RTX Corporation (NYSE:RTX)’s share price has spiked 15% since the start of the Ukraine war in early 2022.\n\nAnticipating a sustained demand for its weapons, RTX Corporation (NYSE:RTX) expects a total revenue between $78-99 billion for FY2024 and an EPS in the range of $5.25 – $5.40. According to Insider Monkey’s hedge funds database, 62 hedge funds are bullish on the company. Their optimism stems from RTX Corporation (NYSE:RTX)’s impressive backlog of $196 billion, of which $78 billion is related to defense orders, including a $2.8 billion guided-missile order by NATO.\n\nYou can read about other best-performing stocks in the industry by heading over to our recent article on the 10 Best Aerospace and Defense Stocks to Buy Now. The Country with the Best Military in the World\n\nPhoto by Joel Rivera-Camacho on Unsplash\n\nMethodology\n\nWe considered 14 weighted metrics to rank 15 countries that have the best military in the world. These include GDP and defense spending (20%), technological capabilities (15%), manpower and special forces strength (15%), nuclear weapons (10%), aircraft including fighter jets (10%), aircraft carriers and submarines (10%), tanks and artillery (5%), military satellites in orbit (5%), overseas military bases (5%), and cybersecurity capabilities (5%).\n\nIt was seen where each country ranked on a given metric and then was assigned a weighted score accordingly. Finally, all weighted scores were aggregated to get an overall score. Countries with the best military in the world are ranked in ascending order of their overall weighted scores.\n\nData on GDP was sourced from the IMF, while SIPRI was consulted for numbers related to defense spending. For other military-related metrics, we referred to our recent articles such as 20 Largest Air Forces in the World Heading into 2024, 15 Countries with the Most Battle Tanks in the World, Artillery Strength by Country: Top 20 Militaries, 15 Navies with the Most Submarines in the World, amongst others, the Global Firepower Index 2024; and Power Atlas. For technological advancement levels, we referenced the Global Innovation Index 2023.\n\nThe country with the best military in the world is the United States.\n\n1. United States\n\nGDP (2023): $26.95 trillion\n\nDefense Expenditure (2023): $916 billion\n\nTechnological Capabilities Rank: 3\n\nNuclear Weapons: 5,550\n\nManpower: 1,328,000\n\nSpecial Forces Rank: 1\n\nTanks: 4,657\n\nArtillery: 3,556\n\nAircraft/Fighter Jets: 5,209\n\nAircraft Carriers: 11\n\nSubmarines: 64\n\nMilitary Satellites: 218\n\nOverseas Military Bases: 759\n\nCyber capabilities Rank: 1\n\nWeighted Score: 1.65\n\nThe United States has the best military in the world. The country outranks all counterparts in ground forces, aerial, and naval strength. In 2023, Washington spent a staggering $916 billion on defense expenditure, which represented close to two-fifths of the world’s military spending and 68% of NATO’s defense expenditure during the year. The United States has the largest fleet of fighter jets and aircraft carriers in the world, which alone is a testament to its military power. Moreover, the country enjoys a distinct geographic advantage through its 759 overseas military bases across 80 countries, which allow it to strike enemy targets anywhere in the world at will. The United States is also the third most technologically advanced country in the world and ranks first in the globe for cybersecurity capabilities.\n\nTo learn about other strong militaries, you can check out our detailed report 15 Countries That Have the Best Military in the World.\n\nAt Insider Monkey, we delve into a variety of topics, ranging from best militaries to other business aspects in the industry; however, our expertise lies in identifying the top-performing stocks. Currently, Artificial Intelligence (AI) technology stands out as one of the most promising fields. If you are looking for an AI stock that is more promising than NVDA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nREAD NEXT: Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and Jim Cramer is Recommending These 10 Stocks in June.\n\nDisclosure: None. This article is originally published on Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/country-best-military-world-014906523.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.029,
            "neu": 0.852,
            "pos": 0.119
        }
    }
]