[
    {
        "date": "2024-07-04T10:00:00+00:00",
        "title": "Beat the CPI: 7 Blue-Chip Stocks Growing Faster Than Inflation",
        "content": "An investor is unlikely to beat inflation by simply holding funds in a bank account. In such a scenario, there will be continued loss of purchasing power due to inflation increasing faster than average interest rates. Therefore, there needs to be diversification across asset classes. Within equities, quality growth stocks can provide robust returns. However, investors need to balance between growth and blue-chip stocks to lower the portfolio beta.\n\nBlue-chip stocks might not deliver 10x or 20x returns in five years like some growth stocks. However, there are blue-chip ideas that can generate returns that consistently beats the rate of inflation. I am talking about total returns that includes the dividend yield and capital gains.\n\nThe focus of this column is on seven fundamentally strong blue-chip names with high cash flow potential. Further, these stocks seem attractively valued and the upside potential is meaningful from current levels.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nLet’s discuss the reasons to be bullish on these blue-chip stocks to buy.\n\nLockheed Martin (LMT) Close top view of a Lockheed Martin (LMT) F-35C Lightning II with afterburner on\n\nSource: ranchorunner / Shutterstock.com\n\nGlobal defense sector spending has been inching higher as geopolitical tensions rise. However, Lockheed Martin (NYSE:LMT) stock has remained subdued amidst positive industry tailwinds. LMT stock is attractive at a forward P/E of 17.8x and offers a dividend yield of 2.7%. I expect a breakout on the upside as the company’s backlog swells and translates into accelerated growth.\n\nAs of March, Lockheed reported an order backlog of $159 billion. This provides clear revenue and cash flow visibility. For 2024, the defense major has guided for free cash flow of $6.2 billion. Healthy cash flows will ensure value creation through dividends and share repurchase.\n\nI further believe that the order intake will remain robust in the coming years. One reason is that Lockheed is investing in next-generation defense technology. This includes next-generation interceptor, hypersonic and advanced microelectronics, among others.\n\nAnother potential growth driver for the company is expanding international collaborations. Lockheed is working with 50 countries globally. I expect international revenue to increase as a percent of total revenue in the coming years.\n\nChevron Corporation (CVX) CVX stock\n\nSource: tishomir / Shutterstock.com\n\nCrude oil is gradually trending higher on expectations of expansionary monetary policies. It’s therefore a good time to consider oil & gas exploration blue-chip stocks. Chevron Corporation (NYSE:CVX) has remained sideways in the last 12 months and looks attractively valued. Besides the potential for capital gains, CVX stock offers a healthy dividend yield of 4.17%.\n\nStory continues\n\nThe first reason to be bullish on Chevron is an investment grade balance sheet. This provides the oil & gas major with ample flexibility to make aggressive investments.\n\nThe second reason to be bullish is low break-even oil assets. This translates into robust operating and free cash flows even if oil is around $80 per barrel. To put things into perspective, Chevron reported operating cash flow of $35.6 billion in 2023.\n\nWith a potential upside in oil, acquisition of Hess Corporation, and organic production growth, it’s likely that OCF will swell significantly. This will provide ample flexibility for dividend growth and share repurchase. At the same time, organic capex is expected to sustain above $15 billion annually.\n\nNewmont Corporation (NEM) Newmont logo on a mobile phone screen\n\nSource: Piotr Swat/Shutterstock\n\nGold is another asset class that’s likely to witness a sustained bull-run. The precious metal seems to be in a zone of consolidation above $2,300 an ounce. With potential rate cuts, it’s likely that gold will zoom past $2,500 an ounce. This will translate into a meaningful rally for gold mining stocks.\n\nNewmont Corporation (NYSE:NEM) is among the best miners to consider and looks undervalued at a forward P/E of 15.3x. Further, NEM stock offers a dividend yield of 2.4% and I expect healthy dividend growth if gold remains in an uptrend.\n\nAn obvious reason to like Newmont is high-quality assets. The gold miner has a portfolio of ten tier one assets. As of 2023, the total gold reserves and resources were 128 and 155 million ounces respectively. This provides profitable growth visibility beyond the current decade considering an attractive all-in-sustaining cost.\n\nIt’s worth noting that Newmont reported adjusted EBITDA of $4.2 billion in 2023. With higher realized gold price and the impact of the acquisition of Newcrest Mining, it’s likely that the EBITDA will be more than $5 billion. As cash flows swell, NEM stock is likely to surge.\n\nStarbucks (SBUX) Learnin' From Luckin, Starbucks Stock Heats Up a Strategy\n\nSource: monticello / Shutterstock.com\n\nIt’s not often that blue-chip stocks trade at a valuation gap. However, when sentiments are overly bearish, it’s the best time to buy. This holds true for Starbucks (NASDAQ:SBUX). After a correction of 23% in the last 12 months, the consumer discretionary stock seems to have bottomed out.\n\nThe downside is capped and the upside potential is significant. To put things into perspective, the most bearish analyst price target for the next 12 months is $77. SBUX stock currently trades marginally below these levels. On the optimistic side, the price target is $112, which would imply an upside potential of 46%. I must add that the stock offers a healthy dividend yield of 2.96%.\n\nOf course, Starbucks reported global comparable store sales decline of 4% for Q2 2024. Revenue also declined by 2% on a year-on-year basis to $8.6 billion. However, the negatives are discounted in the price and the business continues to deliver robust cash flows. Further, the management remains optimistic on the long-term outlook and with ample scope for growth in new markets, the correction is a buying opportunity.\n\nAltria (MO) a sign with the Altria (MO) logo\n\nSource: Kristi Blokhin / Shutterstock.com\n\nAltria (NYSE:MO) stock is among the most depressed blue-chip names. The stock has witnessed time correction in the last five years. However, it’s worth noting that MO stock offers a robust dividend yield of 8.52%. Further, I believe that the next five years are likely to be different and the undervalued tobacco company will deliver healthy returns.\n\nAn important point to note is that as the company undertakes business transformation, growth has been subdued. However, the smokable business segment remains the cash cow and will ensure steady dividends. At the same time, the smokable business provides cash flows for aggressive investment in the non-smokable category.\n\nIn an important business development, NJOY received the U.S. Food and Drug Administration authorization for its menthol e-vapor products. NJOY already has a distribution network of over 80,000 stores. With the only menthol e-vapor product authorized by the FDA, the growth potential is significant. It’s also worth noting that Altria has been gaining market share in the oral tobacco category. With these positives, I expect MO stock to trend higher from undervalued levels.\n\nMerck (MRK) A photo of a large concrete Merck & Co Inc (MRK) sign outside a building.\n\nSource: JHVEPhoto / Shutterstock.com\n\nAmong pharmaceutical blue-chip stocks, Merck (NYSE:MRK) looks attractive at a forward P/E of 14.9x. The pharma company also offers an attractive dividend yield of 2.41%. Considering the growth outlook, I believe that MRK stock will be a long-term value creator.\n\nThe first point to note is that Merck has an attractive late-stage clinical development program. Currently, 80 programs are in the second phase and 30 in the third phase.\n\nA deep pipeline provides revenue growth visibility with the prospects of multiple new drugs being commercialized. To put things into perspective, Merck expects an oncology pipeline opportunity of $20 billion in sales by mid-2035. The vaccine and infectious disease segment will add to the growth momentum.\n\nFor Q1 2024, Merck reported healthy sales growth of 9% on a year-on-year basis to $15.8 billion. Further, non-GAAP EPS increased by 48% on a year-on-year basis. Considering the annual guidance, healthy earnings growth will sustain and MRK stock is likely to remain in an uptrend.\n\nRio Tinto (RIO) the rio tinto (RIO) logo on a building during daylight\n\nSource: Rob Bayer / Shutterstock.com\n\nRio Tinto (NYSE:RIO) is an undervalued commodity company with the stock trading at a forward P/E of 9x. RIO stock also offers an attractive dividend yield of 7.77%. Considering the cash flow potential, dividends are sustainable.\n\nIt’s worth noting that RIO stock traded sideways in the last 12 months. However, that’s likely to change with potential expansionary policies supporting global GDP growth. It’s therefore a good time to accumulate this industrial commodity blue-chip.\n\nOne concern related to commodity stocks is the cyclical nature of the business. However, it’s worth noting that Rio Tinto has delivered an average annual free cash flow of $10.6 billion in the last five years. The company therefore has strong fundamentals and aggressive investment plans.\n\nOf course, the iron ore business remains the cash flow driver. However, Rio Tinto is increasingly investing in metals that will support global energy transition. This includes copper, aluminium, and lithium, among others. Portfolio diversification is likely to yield positive results in the coming years.\n\nOn the date of publication, Faisal Humayun did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor held a LONG position in SBUX.\n\nFaisal Humayun is a senior research analyst with 12 years of industry experience in the field of credit research, equity research and financial modeling. Faisal has authored over 1,500 stock specific articles with focus on the technology, energy and commodities sector.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post Beat the CPI: 7 Blue-Chip Stocks Growing Faster Than Inflation appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/beat-cpi-7-blue-chip-100000472.html",
        "symbols": [
            "0QAH.IL",
            "0R3E.LSE",
            "6MK.BE",
            "6MK.DU",
            "6MK.F",
            "6MK.HM",
            "6MK.STU",
            "6MK.XETRA",
            "CHV.BE",
            "CHV.DU",
            "CHV.HM",
            "CHV.MU",
            "CHV.STU",
            "CRA1.F",
            "CVX.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.016,
            "neu": 0.826,
            "pos": 0.157
        }
    },
    {
        "date": "2024-07-04T00:00:00+00:00",
        "title": "Beat the CPI: 7 Blue-Chip Stocks Growing Faster Than Inflation",
        "content": "These are the blue-chip stocks to buy as they represent fundamentally strong companies with robust free cash flow visibility",
        "link": "https://investorplace.com/2024/07/beat-the-cpi-7-blue-chip-stocks-growing-faster-than-inflation/",
        "symbols": [
            "CVX.US",
            "LMT.US",
            "MO.US",
            "MRK.US",
            "NEM.US",
            "RIO.US",
            "SBUX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.84,
            "neg": 0,
            "neu": 0.64,
            "pos": 0.36
        }
    }
]