[
    {
        "date": "2024-07-24T13:44:07+00:00",
        "title": "Tesla downgraded, Spotify upgraded: Wall Street's top analyst calls",
        "content": "Tesla downgraded, Spotify upgraded: Wall Street's top analyst calls\n\nThe most talked about and market moving research calls around Wall Street are now in one place. Here are today's research calls that investors need to know, as compiled by The Fly.\n\nTop 5 Upgrades:\n\nGoldman Sachs upgraded Spotify (SPOT) to Buy from Neutral with a price target of $425, up from $320, after the company reported \"overall solid\" Q2 results. The firm said that Spotify is the clear global audio platform leader, which it expects to translate into compounded user growth, rising engagement, and pricing power, and the company is continuing to show gross and operating margin momentum. RBC Capital upgraded Estee Lauder(EL) to Outperform from Sector Perform with a $131 price target. The firm believes the company's earnings and investor sentiment have troughed and that the stock's risk-to-reward profile skews favorable. TD Cowen upgraded Lockheed Martin(LMT) to Buy from Hold with a price target of $560, up from $480. The company's strong Q2 and F-35 delivery restart give Lockheed enhanced visibility of 5% sales gains, 10-20 points of margin lift, and rising cash flow through 2026, the firm tells investors in a research note Leerink upgraded Ionis Pharmaceuticals(IONS) to Outperform from Market Perform with a price target of $62, up from $53, following the Angelman syndrome update. As the company transitions to its wholly owned assets, investor focus has shifted toward olezarsen and donidalorsen as a series of assets reach commercialization, the firm says. Deutsche Bank upgraded Invitation Homes(INVH) to Buy from Hold with a price target of $41, up from $35. The firm believes single family for rent companies could generate better earnings growth in 2024 and 2025, especially given that there is no supply overhang which is an issue on the multifamily side.\n\nTop 5 Downgrades:\n\nNew Street downgraded Tesla (TSLA) to Neutral from Buy with a $225 price target following the Q2 report. The company's deliveries recovered \"at a cost,\" increasing by 15% quarter-over-quarter, but with gross margins, excluding credits and leasing, down 1.7 points. Cantor Fitzgerald also downgraded Tesla to Neutral from Overweight with a price target of $245, up from $230. Morgan Stanley downgraded General Motors(GM) to Equal Weight from Overweight with a price target of $47, up from $46. The firm cites industry price pressure, EV and China risks as well as what it sees as a balanced risk/reward for its downgrade. Gordon Haskett downgraded Five Below(FIVE) to Hold from Accumulate with an $85 price target after the company last week \"surprisingly pre-announced disappointing\" Q2 to-date sales in conjunction with the resignation of long-time CEO Joel Anderson. Piper Sandler downgraded Ulta Beauty(ULTA) to Neutral from Overweight with a price target of $404, down from $494. Despite efforts to improve efficiencies in the supply chain, it is not enough to offset the several sources of margin dilution, the firm tells investors in a research note. Barclays downgraded BWX Technologies(BWXT) to Underweight from Equal Weight with a price target of $90, up from $75. The firm sees risk to BWX's medium term mid-to-high-single digit EBITDA target, even with accelerating growth from medical/power.\n\nStory continues\n\nTop 5 Initiations:\n\nSeaport Research initiated coverage of Imax (IMAX) with a Buy rating and $23 price target. The firm sees \"a distinct near-term opportunity\" for Imax shares to start to recognize that the film industry's theatrical release schedule will start heading toward normalcy and calls the stock \"a small-cap way to leverage this trend.\" TD Cowen initiated coverage of JFrog (FROG) with a Buy rating and $50 price target. The firm says the company's cloud story is attractive and argues that its seasonally weaker Q1 offers a buying opportunity. Morgan Stanley initiated coverage of Biohaven (BHVN) with an Overweight rating and $58 price target. The firm sees several drivers of value creation from the company's \"broad\" pipeline across multiple disease areas, which it believes is unique among smid-cap biotech. Leerink initiated coverage of Tectonic Therapeutic(TECX) with an Outperform rating and $49 price target. The firm says the major stock value drivers over the next two years are TX45 developments, TX45 competitive news flow, and GPCR3 antagonist candidate progress. Baird initiated coverage of Aaon (AAON) with a Neutral rating and $100 price target. The firm is bullish on the company's long-term fundamentals and market positioning, but says the recent rally and 2025 estimates that embed meaningful growth and margin reacceleration balance the stock's near-term risk/reward.\n\nView comments()",
        "link": "https://finance.yahoo.com/news/tesla-downgraded-spotify-upgraded-wall-134407651.html",
        "symbols": [
            "0R3E.LSE",
            "639.F",
            "639.STU",
            "639.XETRA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "S1PO34.SA",
            "SPOT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.954,
            "neg": 0.062,
            "neu": 0.841,
            "pos": 0.097
        }
    },
    {
        "date": "2024-07-24T04:59:44+00:00",
        "title": "Why Lockheed Martin (NYSE:LMT) Could Win Under a Trump Administration",
        "content": "On the surface level, a second round of the Trump administration might not appear to bode well for aerospace and defense giant Lockheed Martin (LMT). The former president and current Republican candidate for the White House made some comments that implied the U.S. would enter an isolationist stance (focusing on U.S. interests and reducing international involvement). However, this could actually lead America’s worried allies to increase their military budgets to compensate. Otherwise, the consequences could be devastating. Thus, I am ultimately bullish on LMT stock.\n\nShifting Geopolitical Grounds May Boost LMT Stock Financials\n\nRecently, Trump told Bloomberg Businessweek that Taiwan should pay the U.S. for its defense. Some of the friction appears to be centered on the island’s economic success, particularly in the semiconductor realm. Indeed, the former real estate mogul and reality television star declared that it took “about 100%” of the U.S. semiconductor business.\n\nTo be fair, Trump has made some outlandish remarks in the past. Therefore, it’s difficult to know when the jesting ends and the truth begins. However, what is known is that the former president prefers a generally isolationist policy, even if it means sacrificing accountability. For example, Trump has made friendly overtures to North Korea’s Kim Jong Un. He’s done the same for Russia and China.\n\nThis sets the stage for an unusual backdrop for LMT stock. Right now, shares trade hands at 1.79x trailing-year sales. Currently, the price-to-sales ratio of the aerospace and defense industry comes in at 1.8x. Therefore, Lockheed is slightly undervalued.\n\nAs for trailing earnings, the market prices LMT stock at 18.36x. This metric sits much lower than the industry average 29.13x. However, there’s a caveat to this particular figure.\n\nBy the end of the current fiscal year, analysts believe that earnings per share may land at $26.26. That would come out to a decline of 5.71% from last year’s print of $27.85. Further, investors may have to wait until the end of Fiscal 2025 for the consensus EPS to improve to $27.96. That’s not exactly encouraging.\n\nThe top line presents a better-looking profile. Covering experts are hoping for revenue to hit $69.82 billion, up 3.3% from 2023’s haul of $67.57 billion. By the following year, sales may improve to $72.4 billion, up 3.7% from projected 2024 revenue.\n\nAssuming that the share count of 237.94 million remains the same, LMT stock would be trading at 1.62x projected 2024 sales and 1.56x projected 2025 sales. Moreover, Lockheed just posted second-quarter earnings that significantly exceeded Wall Street estimates. So, it’s possible that analysts need to rethink their projections in favor of the bulls.\n\nStory continues\n\nNevertheless, even without the blowout earnings, if Trump wins a second term and takes an isolationist stance, this framework will likely favor Lockheed Martin. In other words, Lockheed is winning in a pre-Trump paradigm. A post-Trump victory may benefit LMT stock all the more.\n\nEssentially, America’s European and Asian partners would have every reason to assume the worst; that is, the U.S. would turn a blind eye to Russian, Chinese, or perhaps even North Korean aggression. Almost certainly, that’s a terrible outlook for geopolitical stability. However, it may be a massive win for LMT stock.\n\nLockheed Martin Benefits from a Sense of Urgency\n\nOf course, the acute nature of the proposed bullish case for LMT stock depends on a Trump victory. However, if the Democratic candidate wins (following President Biden’s stepping down), Lockheed would still be relevant. Neither Democrats nor Republicans have indicated any serious interest in cutting U.S. defense spending.\n\nHowever, America’s international partners would be able to breathe a sigh of relief if the left wins. The pressing urgency to rearm based on the world’s lone superpower adopting an incoherent foreign policy would simply not exist.\n\nSo, how likely is it that former President Trump will win his second term? To be fair, polls need to be taken with a grain of salt, especially those conducted before September. For example, two years ago, pollsters predicted that a red wave would overwhelm the midterm elections. Experts anticipated a roaring lion; the American people received a screeching house cat.\n\nStill, it’s more than fair to say that Trump and the Republicans have momentum on their side. President Biden simply did not perform well during the first debate. Naturally, the poor showing led many prominent Democrats to urge the president to step aside. And that has happened. However, now the left has an even more difficult task — finding an adequate ticket in a very limited time period.\n\nTrump only has to focus on winning over the American electorate, which makes his job objectively easier at this point. So, the money is on “The Donald” to win a second term. In so doing, the world may see the U.S. shirk its traditional counterweight responsibility amid the rise of the new axis powers: China, Russia, Iran, and North Korea.\n\nSure enough, the prospect of a second Trump term has sparked discourse about the pressing geopolitical situation. In Taiwan, concerns have been heightened about Trump’s impact on the world stage, with many calling for increased defense spending. Broadly speaking, that should help LMT stock or, at the very least, put Lockheed in the discussion of an apparent global renaissance of security-focused expenditures.\n\nSimilar to the Democrats and their need for internal organization along with competing for the electorate, America’s global partners face a two-front battle: the new axis powers rising in conjunction with an isolationist U.S. policy. Again, that’s bad for geopolitical stability but great news for LMT stock as the urgency to arm up will skyrocket.\n\nAs recent news out of Taiwan demonstrates, U.S. partners are reading between the lines.\n\nIs Lockheed Martin Stock a Buy, According to Analysts?\n\nTurning to Wall Street, LMT stock has a Hold consensus rating based on one Buy, six Holds, and zero Sell ratings. The average LMT stock price target is $497.00, implying 0.86% downside risk.\n\nSee more LMT analyst ratings\n\nThe Takeaway: Shifting Geopolitical Tides Bode Well for LMT Stock\n\nAmerica and its allies are entering a dangerous and unprecedented time. Ahead of the rise of the new axis powers, the traditional approach would have seen the U.S. rise to meet the challenge. Instead, a second Trump administration may see the U.S. avoiding conflict, even at the expense of acquiescence. Naturally, this framework has many nations worried, which might serve Lockheed Martin well. After all, a sense of urgency has entered the geopolitical arena, which may boost LMT stock.\n\nDisclosure\n\nView comments()",
        "link": "https://finance.yahoo.com/news/why-lockheed-martin-nyse-lmt-045944399.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.985,
            "neg": 0.046,
            "neu": 0.863,
            "pos": 0.091
        }
    }
]