[
    {
        "date": "2024-07-27T10:57:00+00:00",
        "title": "7 Must-Sell Stocks Before the Mother of All Bear Markets",
        "content": "The Nasdaq and S&P 500 had their worst days since 2022, driven by disappointing earnings from mega-cap names. Recession indicators are flashing yellow, with the “Sahm Rule” unemployment metric edging dangerously close to signaling a downturn.\n\nYes, the inverted yield curve has been wrong so far this time around, but that doesn’t mean we should ignore other warning signs. Corporate bond spreads are whispering “economic slowdown,” and consumer debt delinquencies are ticking up. While I still believe there are big pockets of opportunity in this market, the seven stocks I’m discussing today are not among them.\n\nThese companies’ unsustainable financials make them toxic to your portfolio, regardless of where we are in the economic cycle. Let’s take a look!\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nGoPro (GPRO) An image of the logo for GoPro Inc (GPRO).\n\nSource: GoPro\n\nGoPro (NASDAQ:GPRO) is a dying company. The age of handheld cameras and vlogs is over. Many people still use them, but I don’t see growth here anymore. Smartphones now have powerful cameras that are much more convenient for modern content creators. Vlogging has also declined in relevance, and serious vloggers use higher-end equipment. GoPro’s default aspect ratio makes the content feel dated. You can change that, but a default 4:3 ratio makes GoPro videos feel ancient in 2024.\n\nI believe GoPro’s decline will continue as smartphone cameras improve their durability. I expect very little revenue growth in the coming years, and annual sales will likely dip below $900 million within three to four years. At this rate, debt should also surpass cash by a big margin. Stocks to Sell: GPRO cash\n\nClick to Enlarge\n\nSource: Chart courtesy of GuruFocus.com\n\nRecent financials paint a bleak picture. GoPro’s revenue fell 8% to $1 billion in 2023, and sales dropped another 11% year-over-year to $155 million in the first quarter of 2024.\n\nThe company is banking on new products and subscription growth to turn things around. However, I’m skeptical that these will offset the decline in the action camera market. I’d avoid the stock.\n\nChargePoint (CHPT) Selective focus. Detail of ChargePoint commercial EV electric vehicle charging station on uncovered parking lot. CHPT stock\n\nSource: Michael Vi / Shutterstock.com\n\nChargePoint (NYSE:CHPT)operates the largest electric vehicle charging network in the U.S., but the company has been struggling lately. Shares have plummeted over 70% in the past year as revenue growth has stalled and losses continue to mount.\n\nIn its most recent quarter, ChargePoint reported an 18% year-over-year decline in revenue to $107 million. The company also posted a staggering $71.8 million net loss.\n\nWhile some analysts still see big upside potential in the stock, I remain deeply skeptical. ChargePoint is burning through cash at an alarming rate and faces intensifying competition in the EV charging space. The company’s plan to focus more on its software subscription business seems like too little, too late.\n\nStory continues CHPT financial estimates\n\nClick to Enlarge\n\nSource: Chart courtesy of GuruFocus.com\n\nThose estimates don’t scream a “Buy.”\n\nChargePoint is destined for bankruptcy in the coming years, barring a miraculous turnaround. The company has simply overextended itself and doesn’t have the financial wherewithal to survive the slower-than-expected rollout of EVs. Most EV startups are hemorrhaging money and won’t be viable unless we enter some fantasy world of negative interest rates.\n\nNikola (NKLA) Nikola (NKLA) company logo on a website with blurry stock market developments in the background, seen on a computer screen through a magnifying glass.\n\nSource: Dennis Diatel / Shutterstock.com\n\nNikola (NASDAQ:NKLA) has entered the typical EV startup death cycle of reverse splits and dilution. Last month, the company executed a 1-for-30 reverse stock split to avoid delisting from the Nasdaq. Despite this, the stock languishes around $9, a far cry from its split-adjusted highs of nearly $2,000.\n\nFinancially, the picture looks bleak. Nikola’s net loss in Q1 2024 stood at  $147.7 million, and its annual loss ballooned to $966 million in 2023. Cash is dwindling, with just $345 million on hand at the end of Q1, hardly enough to sustain the company’s ambitious plans. Expect more dilutive offerings on the horizon as Nikola scrambles to stay afloat.\n\nI believe investors should steer clear of most, if not all, EV startups right now, Nikola included. These companies are unlikely to turn a profit anytime soon, and with the political winds shifting, the generous subsidies they rely on may evaporate under a potential Trump administration. The risks far outweigh any potential rewards. Nikola looks to me like Fisker 2.0, which management is dragging out.\n\nTerran Orbital (LLAP) sell button on the background of exchange charts of currencies, crypto exchange, growth stocks to sell\n\nSource: silicaetran / Shutterstock.com\n\nTerran Orbital (NYSE:LLAP) is a struggling satellite manufacturer that, unless drastic changes occur, is on the brink of bankruptcy. The company has signed a massive but precarious $2.4 billion deal with startup Rivada Space Networks.\n\nRivada has grand ambitions but is far from an established player in the space industry. Rich Smith from The Motley Foolsaid: “… Rivada is an alleged space company that no one seems to have heard of, and that according to data from S&P Global Market Intelligence, may have annual revenues of less than $5 million… but is somehow promising to pay Terran Orbital $2.4 billion to build it 300 satellites.”\n\nThere are serious doubts about whether Rivada can secure the funding to implement its constellation plans, which would leave Terran holding the bag.\n\nMeanwhile, Terran is hemorrhaging cash as it scrambles to fulfill Rivada’s orders. The company reported a net loss of $53.2 million in Q1 on revenue of $27.2 million. Terran simply doesn’t have the financial runway to keep this up for long.\n\nA recent $500 million acquisition offer from Lockheed Martin (NYSE:LMT) could have thrown Terran a lifeline, but Lockheed abruptly withdrew the bid in May, likely spooked by the Rivada situation. While Lockheed threw Terran an 18-satellite contract, that won’t help much.\r\n\r\nIts Altman-Z score is below the 1.8 “high risk for bankruptcy” zone. LLAP Altman-Z Score\n\nClick to Enlarge\n\nSource: Chart courtesy of GuruFocus.com\n\nUnless Terran can diversify its business quickly, shareholders will likely be left holding a bunch of space junk.\n\nLanzatech (LNZA) Crypto Currency market panic sell concept. Double exposure of digital coins price drop and technical chart. Both are in red color theme to indicate the bearish stage. Cryptos to sell. cryptocurrencies to sell\n\nSource: kkssr / Shutterstock.com\n\nLanzaTech (NASDAQ:LNZA) is a carbon recycling company that transforms waste carbon into sustainable raw materials. The company recently reported disappointing Q1 2024 earnings, missing the top and bottom lines.\n\nI want to believe in LanzaTech’s vision of a circular carbon economy, but I have severe doubts about its path to profitability. The company is hemorrhaging cash at an alarming rate, with a cash burn of $106 million over the past year. Analysts project LanzaTech won’t break even until 2026 at the earliest. Assuming everything goes perfectly according to plan is a big if.\n\nMany of LanzaTech’s projects are located in countries with lax environmental regulations. Will these international partners follow through on their sustainability commitments? Color me skeptical. Even in the U.S. and Europe, I struggle to see how LanzaTech will turn a profit anytime soon. Analysts expect strong revenue growth in the near term but predict a sharp 26% decline in 2026. Ouch. Oh, and that loss profile isn’t expected to improve much. LNZA financial estimates\n\nClick to Enlarge\n\nSource: Chart courtesy of GuruFocus.com\n\nThe elephant in the room is the 2024 U.S. presidential election. A change in administration could spell disaster for green tech firms.\n\nGameSquare Holdings (GAME) image of someone playing video games to represent gaming stocks\n\nSource: korobskyph / Shutterstock.com\n\nI didn’t have much of an opinion about GameSquareHoldings (NASDAQ:GAME) one way or the other — until their recent acquisition of FaZe Clan. I’m questioning whether management understands how to navigate the gaming space. FaZe Clan may have been a big name a decade ago, but their relevance and influence have waned significantly in recent years. GameSquare is trying to buy buzz instead of building something sustainable.\n\nThe reality is that the gaming space outside of gambling is notoriously unprofitable, with only a few standout successes. And I just don’t see GameSquare being one of those rare winners. They seem to be chasing the “influencer” trend and esports hype but without a clear path to monetization. Selling off part of their stake in FaZe Media shortly after acquiring it is not exactly a vote of confidence, either.\n\nQ1 2024 revenue came in at $23.5 million, down slightly from $24.1 million a year ago. Gross margins also slipped to 15.7% from 16.5%. The company is touting $18 million in expected cost synergies from the FaZe deal, but I’ll believe it when I see it. The bottom line is that I think GameSquare bit off more than they can chew with FaZe Clan. They’d be wise to cut their losses, sell the rest of that stake and refocus on something more relevant in 2024.\n\nBeyond Meat (BYND) Editorial photo on Beyond Meat (BYND) theme. Illustrative photo for news about Beyond Meat - a producer of plant-based meat substitutes. BYND stock\n\nSource: photo_gonzo / Shutterstock.com\n\nI love the idea behind Beyond Meat (NASDAQ:BYND) — providing tasty meat alternatives that are better for animals and the environment. If plant-based meats can eventually match the taste and price of real meat, I think they have immense potential to transform the food industry for the better.\n\nHowever, the unfortunate reality is that Beyond Meat looks nowhere close to achieving profitability anytime soon. The company reported a net loss of $54.4 million in Q1 2024 as revenue declined 18% year-over-year. Gross margins remain abysmal at under 5%. Analysts have turned extremely bearish, with firms like Goldman Sachs and TD Cowen reiterating their sell ratings and slashing price targets. Recent EBIT misses are also very concerning, so take any estimates here with a spoonful of salt. BYND EBIT misses\n\nClick to Enlarge\n\nSource: Chart courtesy of GuruFocus.com\n\nBeyond Meat is even struggling in its backyard of California, a state you’d think would be very receptive to plant-based meats. But if they can’t make the economics work there, I’m skeptical the business model is viable on a broader scale nationally, at least not yet.\n\nI believe plant-based meats will gain traction in the long term as companies improve taste and drive down costs. But we appear to be many years away from that inflection point. For now, I love the company but not the stock.\n\nOn the date of publication, Omor Ibne Ehsan did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nOmor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals, value, and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post 7 Must-Sell Stocks Before the Mother of All Bear Markets appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/7-must-sell-stocks-mother-105700822.html",
        "symbols": [
            "0Q3.STU",
            "5G5.STU",
            "BYND.US",
            "CHPT.US",
            "GAME.US",
            "GPRO.US",
            "LLAP.US",
            "LMT.US",
            "LNZA.US",
            "NKLA.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.085,
            "neu": 0.811,
            "pos": 0.104
        }
    },
    {
        "date": "2024-07-27T08:42:00+00:00",
        "title": "Is It Too Late to Buy Lockheed Martin Stock Now?",
        "content": "In light of conflicts in the Middle East and Ukraine, one might assume that aerospace/defense giant Lockheed Martin(NYSE: LMT) would be a darling on Wall Street. Yet, Lockheed Martin stock gained little ground in 2024's first half.\n\nThen July came around, and suddenly Lockheed Martin stock's trajectory went from horizontal to vertical. This raises the question of \"Is it too late to invest?\" and, just as importantly, \"What sent the stock soaring?\" As it turns out, Lockheed Martin's Street-beating results and optimistic outlook suggest that a sustained share-price rally may be in store.\n\nThe jets that didn't fly (yet)\n\nIt's not difficult to figure out why Lockheed Martin stock flew in July. The primary catalyst was the company's second-quarter report, which certainly had some positive highlights.\n\nLockheed Martin's deliveries of a well-known aircraft wasn't one of those highlights, though. The company delivered no F-35 combat jets in Q2 and, due to required fixes of technical issues, Lockheed Martin has had $10 billion worth of those jets sitting outside of a factory, yet to be delivered.\n\nOf course, this doesn't mean the F-35s won't be delivered, and Lockheed Martin delivered other aircraft types during the second quarter. Rather than focus on recently delivered F-35s (or the lack thereof), forward-looking investors might take note of Lockheed Martin's Q2 order backlog of $158.34 billion, which isn't very different from the company's $160.57 billion backlog from the year-earlier quarter.\n\nIn any case, Lockheed Martin already started delivering updated TR-3 F-35 combat jets to the U.S. military and anticipates delivering 75 to 110 F-35 jets during 2024's second half. So, upcoming quarterly reports shouldn't have a goose egg in the column for F-35 deliveries.\n\nA sunny outlook for dark times\n\nDespite the lack of F-35 deliveries, international conflicts ensured that Lockheed Martin would still fare well in the second quarter of 2024. Large-scale Pentagon contracts for missiles to be sent to Ukraine helped Lockheed Martin grow its revenue by 9% year over year to $18.1 billion, beating Wall Street's call for $17 billion. Turning to the bottom-line results, Lockheed Martin earned $6.84 per share, thereby beating the analysts' consensus estimate of $6.46 per share and showing improvement over the $6.73 per share earned in the year-earlier quarter.\n\nPerhaps most encouraging, Lockheed Martin raised its full-year 2024 financial guidance. Specifically, the company lifted its net sales outlook range from $68.5 billion to $70 billion previously to $70.5 billion to $71.5 billion currently. Additionally, Lockheed Martin hiked its 2024 earnings per share (EPS) guidance range from $25.65 to $26.35 previously to a currently expected range of $26.10 to $26.60.\n\nStory continues\n\nWith that, Lockheed Martin CEO Jim Taiclet maintained an optimistic tone and made sure to remind investors of Lockheed's \"backlog of nearly $160 billion, greater than two times annual revenue.\" The subtext, no doubt, is that the fiscal figures should only get better for Lockheed Martin.\n\nWhether Lockheed Martin actually meets its hiked full-year guidance remains to be seen. The winds of war can shift at any given moment, and so can Lockheed Martin's outlook for the back half of 2024.\n\nStill, until proven otherwise, it looks like Lockheed Martin's future prospects are bright, or at least brighter than they were before. Therefore, it's not too late to pick up a few shares of Lockheed Martin stock with hopes of peace but expectations that nations won't resolve their disagreements anytime soon.\n\nShould you invest $1,000 in Lockheed Martin right now?\n\nBefore you buy stock in Lockheed Martin, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Lockheed Martin wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $688,005!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of July 22, 2024\n\nDavid Moadel has no position in any of the stocks mentioned. The Motley Fool recommends Lockheed Martin. The Motley Fool has a disclosure policy.\n\nIs It Too Late to Buy Lockheed Martin Stock Now? was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/too-buy-lockheed-martin-stock-084200346.html",
        "symbols": [
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.919,
            "neg": 0.054,
            "neu": 0.864,
            "pos": 0.083
        }
    }
]