[
    {
        "date": "2024-08-20T11:00:18+00:00",
        "title": "NextEra CEO Talks Up Florida Property Market: A Sunshine State Ray Of Hope?",
        "content": "NextEra CEO Talks Up Florida Property Market: A Sunshine State Ray Of Hope?\n\nBenzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\n\nThe housing market is in flux, with home prices at record highs amid a demand and supply imbalance. Elevated mortgage rates – seen as a function of interest rates at a 22-year high and inflation, which is eating away into disposable income – are constraining purchases. In the wake of all this, NextEra Energy, Inc. (NYSE:NEE) CEO John Ketchum recently lauded Florida as a thriving market for housing as well as commercial and industrial construction.\n\nRead More:\n\nDon’t miss out on the next NVIDIA – you can invest in the future of AI for only $10. **This is a paid advertisement. Carefully consider the investment objectives, risks, charges and expenses of the Fundrise Innovation Fund before investing. This and other information can be found in the Fund's prospectus. Read them carefully before investing. Miami is expected to take New York's place as the U.S. Financial Capital. Invest now and earn returns.\n\nThe Florida Housing Market\n\nThe Sunshine State has the distinction of being the biggest housing market in the country. Despite California having the twice as many residents, Florida has nearly double the number of home listings, said Realtor.com in a recent report. It is a bellwether state \"consistently attracting people from around the globe due to its significant tax advantages, perfect weather, and booming economy,\"  Jenny Lenz, the managing director of Dolly Lenz Real Estate, told the website.\n\nThe report characterized the housing market in the state as split, with condominium prices on the coasts falling due to high insurance costs and assessment fees, while single-family home cost remained steady inland.\n\nRecent data from Redfin showed that the median sale price of a home in Florida rose 2.3% year-over-year to $419,200, lower than the nationwide median price of $426,900. Although marking a decline from the April 2024 peak, home prices are still near the record levels, the real-estate company said. That said, the number of homes sold fell 14.1%, while inventory rose 16%.\n\nWhile all roads led to Florida following the pandemic due to the state's pulling points, things are changing now, a U.S. News report said. The deterrents are the expensive homeowner's insurance due to hurricane threat in the state, higher home prices and the increase in property taxes.\n\nCommercial Real Estate – Risks & Opportunities\n\nAfter a tough year in 2023, the commercial real estate market nationwide is expected to bounce back this year as the Fed is widely expected to cut rates this year.\n\nStory continues\n\nA report from the National Association of Realtors noted a troubled office sector, with falling lending activity and rising office availability and delinquencies. The office vacancy rate nationwide rose to a new record of 13.8% in February, it said. Leasing activity, a proxy for demand and interest, has dropped about 50 percentage points below pre-pandemic levels. Among other commercial real estate segments, multi-family was recovering from lows, retail spaces continued to slowdown and the industrial segment is showing signs of a slowdown.\n\nNAR's report flagged a sharp increase in rent for industrial spaces in Florida cities such as Orlando, Jacksonville and Tampa, with the spike attributed to strong demand for warehouse properties. The increases are in the magnitude of 10% from last year, it said.\n\nThat said, there is a looming risk. The low financing costs buyers are availing now could soon become a thing of the past, said Godfrey Legal. It reasoned that many loans on commercial properties will mature later this year and in the upcoming year, with about $1.5 trillion in commercial real estate debt maturing. The terms of fresh loans or refinancing will likely be tougher.\n\nRead More:\n\nWhen today’s AI startups go public, most of the rapid growth will be behind them — here’s how not to get left out. This is a paid advertisement. Carefully consider the investment objectives, risks, charges and expenses of the Fundrise Innovation Fund before investing. This and other information can be found in the Fund's prospectus. Read them carefully before investing. This city is the clear winner of Zillow's 2024 Home Value Forecast — No surprise as the number of millionaires there grew by 75% in the last decade.\n\nCorporates Make Beeline To Florida\n\nCompanies, especially big techs, which typically are based out of either the Silicon Valley or New York, are looking toward Florida, with many already having made the move. Ken Griffin’s Citadel and Citadel Securities have permanently moved their headquarters to Miami. Amazon founder Jeff Bezos has shifted base out of Seattle to Florida, citing the need to be near his space venture Blue Origin.\n\nDefense contractor Lockheed Martin (NYSE:LMT)  has relocated its Space division headquarters to Titusville, Florida. JPMorgan has doubled down its presence in the state. The big bank said in June that its downtown Miami office will double in size from 80,000 square feet to 160,000 square feet in part to accommodate 400 additional employees. \"Miami and South Florida are home to an increasing number of our clients, customers, community partners and employees, and a strategic location for our operations in Latin America as well,\" said Jonathan Bello, head of Chase for Business Miami.\n\nFlorida is the fourth biggest state in terms of GDP, according to Bureau of Economic Analysis. The state also boasts of the highest population growth and it attracts remote workers due to the low cost of living, especially in northeast Florida, said Forbes contributor Gilda D'Incerti.\n\nPotential Beneficiaries: With industry players and watchers betting on Florida's housing and commercial real estate markets, real estate and utility companies operating in the state stand to gain big. Commercial real estate services and investment company, CBRE Group, Inc. (NYSE:CBRE), Jones Lang LaSalle Incorporated (NYSE:JLL) and Cushman & Wakefield plc (NYSE:CWK), homebuilder Lennar Corp. (NYSE:LEN) and M/I Homes, Inc. (NYSE:MHO), LGI Homes, Inc. (NASDAQ:LGIH) and Meritage Homes Corporation (NYSE:MTH) have big presence in the state.\n\nAmong utility companies operating in Florida are NextEra and Duke Energy Corporation (NYSE:DUK).\n\nYou Can Profit From Real Estate Without Owning Property\n\nThe current high-interest-rate environment has created an incredible opportunity for income-seeking investors to earn massive yields and you don't have to own property to do it...\n\nThe Arrived Homes investment platform has created a Private Credit Fund, which provides access to a pool of short-term loans backed by residential real estate with a target 7% to 9% net annual yield paid to investors monthly. The best part? Unlike other private credit funds, this one has a minimum investment of only $100.\n\nDon't miss out on this opportunity to take advantage of high-yield investments while rates are high. Check out Benzinga's favorite high-yield offerings.\n\nThis article NextEra CEO Talks Up Florida Property Market: A Sunshine State Ray Of Hope? originally appeared on Benzinga.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/nextera-ceo-talks-florida-property-110018297.html",
        "symbols": [
            "0K80.LSE",
            "CBRE.US",
            "CWK.US",
            "DUK.US",
            "FP3.BE",
            "FP3.DU",
            "FP3.F",
            "FP3.MU",
            "FP3.STU",
            "JLL.US",
            "LEN.US",
            "LGIH.US",
            "LMT.US",
            "MHO.US",
            "MTH.US",
            "NEE.US",
            "NEP.US",
            "NEXT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.038,
            "neu": 0.856,
            "pos": 0.106
        }
    }
]