[
    {
        "date": "2024-06-17T21:50:18+00:00",
        "title": "Lockheed Martin (LMT) Advances But Underperforms Market: Key Facts",
        "content": "The most recent trading session ended with Lockheed Martin (LMT) standing at $459.01, reflecting a +0.15% shift from the previouse trading day's closing. This move lagged the S&P 500's daily gain of 0.77%. Elsewhere, the Dow saw an upswing of 0.49%, while the tech-heavy Nasdaq appreciated by 0.95%.\n\nPrior to today's trading, shares of the aerospace and defense company had lost 1.69% over the past month. This has was narrower than the Aerospace sector's loss of 1.9% and lagged the S&P 500's gain of 3.71% in that time.\n\nThe investment community will be closely monitoring the performance of Lockheed Martin in its forthcoming earnings report. The company is expected to report EPS of $6.45, down 4.16% from the prior-year quarter. Our most recent consensus estimate is calling for quarterly revenue of $17.03 billion, up 2.04% from the year-ago period.\n\nIn terms of the entire fiscal year, the Zacks Consensus Estimates predict earnings of $26.26 per share and a revenue of $69.72 billion, indicating changes of -5.61% and +3.18%, respectively, from the former year.\n\nIt's also important for investors to be aware of any recent modifications to analyst estimates for Lockheed Martin. These revisions help to show the ever-changing nature of near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.\n\nOur research shows that these estimate changes are directly correlated with near-term stock prices. To exploit this, we've formed the Zacks Rank, a quantitative model that includes these estimate changes and presents a viable rating system.\n\nThe Zacks Rank system, which varies between #1 (Strong Buy) and #5 (Strong Sell), carries an impressive track record of exceeding expectations, confirmed by external audits, with stocks at #1 delivering an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has remained unchanged. As of now, Lockheed Martin holds a Zacks Rank of #3 (Hold).\n\nFrom a valuation perspective, Lockheed Martin is currently exchanging hands at a Forward P/E ratio of 17.46. This signifies a discount in comparison to the average Forward P/E of 17.58 for its industry.\n\nInvestors should also note that LMT has a PEG ratio of 4.3 right now. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. As of the close of trade yesterday, the Aerospace - Defense industry held an average PEG ratio of 1.75.\n\nStory continues\n\nThe Aerospace - Defense industry is part of the Aerospace sector. This industry, currently bearing a Zacks Industry Rank of 97, finds itself in the top 39% echelons of all 250+ industries.\n\nThe Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nBe sure to follow all of these stock-moving metrics, and many more, on Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-advances-underperforms-215018281.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.992,
            "neg": 0.018,
            "neu": 0.882,
            "pos": 0.1
        }
    },
    {
        "date": "2024-06-17T11:01:51+00:00",
        "title": "With EPS Growth And More, Lockheed Martin (NYSE:LMT) Makes An Interesting Case",
        "content": "Investors are often guided by the idea of discovering 'the next big thing', even if that means buying 'story stocks' without any revenue, let alone profit. But the reality is that when a company loses money each year, for long enough, its investors will usually take their share of those losses. Loss-making companies are always racing against time to reach financial sustainability, so investors in these companies may be taking on more risk than they should.\n\nIn contrast to all that, many investors prefer to focus on companies like Lockheed Martin (NYSE:LMT), which has not only revenues, but also profits. Now this is not to say that the company presents the best investment opportunity around, but profitability is a key component to success in business.\n\nCheck out our latest analysis for Lockheed Martin\n\nHow Fast Is Lockheed Martin Growing?\n\nIf you believe that markets are even vaguely efficient, then over the long term you'd expect a company's share price to follow its earnings per share (EPS) outcomes. Therefore, there are plenty of investors who like to buy shares in companies that are growing EPS. Lockheed Martin managed to grow EPS by 4.0% per year, over three years. That might not be particularly high growth, but it does show that per-share earnings are moving steadily in the right direction.\n\nCareful consideration of revenue growth and earnings before interest and taxation (EBIT) margins can help inform a view on the sustainability of the recent profit growth. While we note Lockheed Martin achieved similar EBIT margins to last year, revenue grew by a solid 5.2% to US$70b. That's a real positive.\n\nYou can take a look at the company's revenue and earnings growth trend, in the chart below. Click on the chart to see the exact numbers. earnings-and-revenue-history\n\nThe trick, as an investor, is to find companies that are going to perform well in the future, not just in the past. While crystal balls don't exist, you can check our visualization of consensus analyst forecasts for Lockheed Martin's future EPS 100% free.\n\nAre Lockheed Martin Insiders Aligned With All Shareholders?\n\nSince Lockheed Martin has a market capitalisation of US$110b, we wouldn't expect insiders to hold a large percentage of shares. But thanks to their investment in the company, it's pleasing to see that there are still incentives to align their actions with the shareholders. Given insiders own a significant chunk of shares, currently valued at US$63m, they have plenty of motivation to push the business to succeed. That's certainly enough to let shareholders know that management will be very focussed on long term growth.\n\nStory continues\n\nShould You Add Lockheed Martin To Your Watchlist?\n\nAs previously touched on, Lockheed Martin is a growing business, which is encouraging. For those who are looking for a little more than this, the high level of insider ownership enhances our enthusiasm for this growth. That combination is very appealing. So yes, we do think the stock is worth keeping an eye on. We don't want to rain on the parade too much, but we did also find 1 warning sign for Lockheed Martin that you need to be mindful of.\n\nThere's always the possibility of doing well buying stocks that are not growing earnings and do not have insiders buying shares. But for those who consider these important metrics, we encourage you to check out companies that do have those features. You can access a tailored list of companies which have demonstrated growth backed by significant insider holdings.\n\nPlease note the insider transactions discussed in this article refer to reportable transactions in the relevant jurisdiction.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/eps-growth-more-lockheed-martin-110151388.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.021,
            "neu": 0.779,
            "pos": 0.2
        }
    },
    {
        "date": "2024-06-17T08:06:00+00:00",
        "title": "Lockheed Martin Gives Thumbs Up to 1 Tiny Space Stock",
        "content": "Valued at $110 billion and doing nearly $70 billion in annual business, Lockheed Martin(NYSE: LMT) is the world's biggest defense company. It's also a major player in space.\n\nLockheed Martin builds the Orion spacecraft that will one day carry NASA astronauts (back) to the moon, making it an integral part of NASA's Project Artemis. Lockheed owns half of United Launch Alliance, still the preferred provider of satellite launches to the U.S. government (despite SpaceX's best efforts). In addition to its own efforts in space, Lockheed is also a sort of incubator for the businesses of other, smaller space companies.\n\nLockheed was one of the early investors in Rocket Lab USA, for example, a space start-up I own a piece of. Through its Lockheed Martin Ventures arm, Lockheed has a stake in small rocket company ABL Space Systems, satellite company Hawkeye 360, and satellite manufacturer Terran Orbital, according to data from S&P Global Market Intelligence. It's also a customer of some of these companies. Last month, for example, Terran Orbital stated that it has contracts to build more than 100 satellites for Lockheed Martin.\n\nAnd I have a strong hunch we just figured out who's going to help launch those satellites.\n\nOne space company that Lockheed Martin doesn't own (yet)\n\nEarlier this month, we learned that Lockheed Martin has signed space start-up Firefly Aerospace to a contract to launch at least 15, and perhaps as many as 25, Alpha rockets carrying payloads for the space giant.\n\nAlpha is Firefly's first successful commercial rocket, having conducted four orbital launches already, with four more scheduled to take place later this year. As Firefly announced on June 5, the 15 firm and 10 optional launches it will conduct for Lockheed will take place between now and 2029, meaning Firefly could potentially be conducting more launches per year for this one single customer than it's ever launched before, in its history.\n\nAt one metric ton in payload capacity, Firefly's Alpha classes as a small rocket. Although three times larger than Rocket Lab's Electron, Alpha has only 4% the payload capacity of ULA's heavy lift Vulcan Centaur (half-owned by Lockheed). That makes it less than useful for launching giant payloads such as space telescopes, for example -- but perhaps perfectly sized to launch smaller satellites such as the ones Terran Orbital is producing for Lockheed.\n\nWhat it means for space investors\n\nNeither Lockheed nor Firefly have confirmed precisely that Firefly will be launching Terran Orbital satellites for Lockheed -- or indeed, said anything yet about the payloads. However, an earlier launch (FLTA004, which suffered an anomaly) attempted to place a Terran Orbital satellite into orbit for Lockheed in December 2023 -- which does seem to suggest that these rockets would be the right size and type for Lockheed to use when attempting to place future Terran Orbital satellites in orbit.\n\nStory continues\n\nAssuming I'm correct on these surmises, this means that Lockheed is serving as a sort of intermediary between Terran Orbital and Firefly, matching up subcontracted satellites with subcontracted rockets to launch them. With Lockheed Martin as the indispensable party to both subcontractors, an investor can probably safely assume that it will be earning respectable profit margins on this business. And seeing as Lockheed Martin's space division profit margins have sunk from about 10.5% to less than 9% over the past five years, that would be a positive development.\n\nAt the same time, Lockheed's patronage is obviously good news for Terran Orbital, helping keep the company afloat even as it continues losing money. (Terran reported more than $150 million in losses last year, a sum nearly equal to the company's entire market capitalization.)\n\nFor Firefly, the news is even better. Media reports indicate that Lockheed may be paying Firefly as much as $15 million per launch. At a cadence of five launches per year, that implies something on the order of $75 million in annual revenue that Firefly might get out of this contract -- nearly half its annual revenues, according to data from S&P Global. And over the course of the five-year, 25-rockets contract, Firefly could end up booking sales of $375 million.\n\nFor a young space start-up still raising cash to finance an ambitious slate of projects, from orbital space tugs to lunar landers to two brand new rocket designs, that sweet, sweet Lockheed Martin cash should come in handy -- and help tide Firefly over until it can IPO.\n\nShould you invest $1,000 in Lockheed Martin right now?\n\nBefore you buy stock in Lockheed Martin, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Lockheed Martin wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $808,105!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of June 10, 2024\n\nRich Smith has positions in Rocket Lab USA. The Motley Fool recommends Lockheed Martin and Rocket Lab USA. The Motley Fool has a disclosure policy.\n\nLockheed Martin Gives Thumbs Up to 1 Tiny Space Stock was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-gives-thumbs-1-080600455.html",
        "symbols": [
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.03,
            "neu": 0.875,
            "pos": 0.095
        }
    }
]