[
    {
        "date": "2024-06-13T16:00:00+00:00",
        "title": "The 3 Best Aviation Stocks to Buy (Sorry, Boeing.)",
        "content": "Fortune discussed the best aviation stocks in early June, suggesting that even though they’re a bargain, they might not be worth the turbulence.\n\nI don’t think there’s any question Boeing (NYSE:BA) stock has taken it on the chin in 2024. It’s down more than 27% with a half-year left to plummet some more. Is it a bargain?\n\n“Nicolas Owens, an industrials equities analyst at Morningstar, notes that the spectacular nature of aviation mishaps can produce overreaction on the part of investors,” Fortune contributor Jeff John Roberts wrote on June 3.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nThe iShares U.S. Aerospace & Defense ETF (BATS:ITA), which has Boeing as its second-highest weighted stock holding at 14.14%, is actually up more than 7% in 2024, which suggests you might be better off buying ITA to capture the undervaluation in aviation stocks.\n\nHowever, this is an article about stocks, so stocks it will be.\n\nThe ITA’s average price-to-book and price-to-earnings ratios are 3.85x and 31.61x, respectively. I will look for names held by ITA that have a product of less than 122.\n\nTextron (TXT) Bell Boeing V-22 Osprey shown during a flight demo.\n\nSource: Angel DiBilio / Shutterstock.com\n\nAccording to Morningstar.com, Textron (NYSE:TXT) has a P/E and P/S of 14.86x and 1.23x, respectively. It is the eighth-largest holding of ITA with a 4.03% weighting. Its shares are up over 6% year-to-date.\n\nTextron isn’t a direct competitor to Boeing like GE Aerospace (NYSE:GE) but it does have several aviation-based businesses including Bell Helicopters and business jets under the Citation, Cessna, and Beechcraft brands.\n\nAs a golfer, I’ve always followed it because of its E-Z-Go, Cushman, and Arctic Cat brands. They’re more consumer focused businesses with solid commercial revenue as well. However, it is the aviation business that drives the company’s share price, accounting for more than 62% of its 2023 revenue.\n\nIn Q1 2024, its segment profit was $290 million, 12% higher than Q1 2023. Its aviation-related segment profit contributed all of the growth, offset by lower Industrial segment profits and losses from Textron eAviation, the company’s electrification unit.\n\nOut of the 18 analysts that cover its stock, 11 rate it a Buy, with a $100 target, 17% higher than its current share price.\n\nLockheed Martin (LMT) Close top view of a Lockheed Martin (LMT) F-35C Lightning II with afterburner on\n\nSource: ranchorunner / Shutterstock.com\n\nLockheed Martin (NYSE:LMT) has a P/E and P/S of 16.69x and 1.65x, respectively. It is the third-largest holding of ITA with a 12.83% weighting. Its shares are up about 1% year-to-date.\n\nLockheed Martin’s products keep America’s military prepared to defend the country. Products from the Maryland-based defense contractor include the F-35 joint strike jet fighters, Blackhawk combat helicopters, Hellfire missiles and more.\n\nStory continues\n\nBarron’s reported comments from Seaport Research Partners analyst Richard Safran from earlier in June that its supply chain issues are going away, providing a higher multiple for the company’s shares.\n\nFurther, while its earnings per share have tripled in the past 10 years compared to a two-fold increase for the S&P 500, its shares have traded at a discount to the index’s 12-month forward earnings.\n\nThe biggest risk for Lockheed is that it generates 75% of its revenue from the U.S. government. Should Congress take a hatchet to defense budgets post-election, that would hurt future revenue.\n\nAs of March 31, it had a backlog of $159 billion, or about 2.3x its 2023 revenue, which means it’s got plenty to keep it busy well beyond November.\n\nRTX (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nRTX (NYSE:RTX) has a P/E and P/S of 20.68x and 2.11x, respectively. It is the largest holding of ITA with an 18.85% weighting. Its shares are up more than 25% year-to-date, nearly double the index.\n\nInvestorPlace contributor Rich DuPrey recently included RTX in a group of three stocks to buy over $100. RTX just makes the cut at $106.64 as I write this. DuPrey’s rationale for buying shares of the company best-known for its Patriot missile system and Stinger and Javelin missles, is that it’s operating in the best business environment in its history with record backlog of $202 billion.\n\nYou know what they say, “You have to make hay while the sun shines.” RTX is doing that.\n\nThe company has three operating segments: Collins Aerospace, Raytheon, and Pratt & Whitney. The latter’s Q1 2024 sales were 23% higher year-0ver-year to $6.46 billion, generating $430 million in operating profits. Of the three segments that generated nearly the same revenue in the first quarter, Pratt & Whitney has the lowest operating margin of 6.7%.\n\nLike Lockheed Martin, analysts are on the fence about RTX stock. Of the 25 that cover it, only nine rate it a Buy, with a $109.50 target price, 3% higher than its current share price.\n\nOf the three, Textron is my favorite.\n\nOn the date of publication, Will Ashworth did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nWill Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post The 3 Best Aviation Stocks to Buy (Sorry, Boeing.) appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-best-aviation-stocks-buy-160000290.html",
        "symbols": [
            "0LF0.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "BA.US",
            "GE.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "TXT.BE",
            "TXT.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.031,
            "neu": 0.848,
            "pos": 0.121
        }
    },
    {
        "date": "2024-06-13T11:41:00+00:00",
        "title": "RTX Wins Contract to Support Rolling Airframe Missile Program",
        "content": "RTX Corp. RTX recently clinched a modification contract involving the supply of spare parts for its Rolling Airframe Missile (RAM). The award has been provided by the Naval Sea Systems Command, Washington, D.C.\n\nDetails of the Deal\n\nValued at $33.8 million, the contract is expected to be completed by February 2027. Per the terms of the deal, RTX is going to provide Mod 5 Guided Missile Launching System (GMLS) requirements and spares for its RAM program.\n\nA major portion of the work related to this deal will be carried out in Ottobrunn, Germany. The contract will serve the U.S. Navy and German government.\n\nWhat’s Favoring RTX?\n\nIncreasing geopolitical tensions worldwide have prompted nations to strengthen their defense systems manifold. With rapid technological upgrades, missile defense has steadily become pivotal in a nation’s defense strategy. With the United States being the world’s largest weapon supplier and RTX a prominent U.S. missile maker, the increased missile defense adoption by nations provides the company with solid order flows. The latest contract win is a bright example of that.\r\n\r\nNotably, RTX’s RAM-guided missile weapon system is the world's most modern ship self-defense weapon, designed to provide exceptional protection for ships of all sizes.  RAM missiles are deployed via the MK49 RAM GMLS and the MK15 Mod 32 SeaRAM Close-In Weapon System on more than 100 ships, ranging from fast patrol boats to aircraft carriers.\r\n\r\nRAM is currently deployed on more than 165 ships in 11 countries, ranging from 500-ton fast-attack crafts to 95,000-ton aircraft carriers. Moreover, the RAM weapon system is a cooperative program between the U.S. and German governments with industry support from RTX and RAMSYS of Germany.\n\nThe aforementioned discussion reflects the solid demand that RTX’s RAM enjoys in the missile defense space, both in the United States and abroad. Considering this, we may expect RTX to win more contracts involving its RAM, like the latest one. This, in turn, is expected to bolster RTX’s revenues in the coming quarters.\n\nGrowth Prospects\n\nThe global peace index reflects an unstable environment worldwide, with the Russia-Ukraine war continuing for more than two years now, in addition to the ongoing hostility in different parts of the Middle East. This has set the stage for the defense sector to witness rising demand for military products, particularly missiles, as nations worldwide strive to protect their borders from unprecedented attacks.\n\nTherefore, the growth prospect for the global missile and missile defense systems market remains solid. To this end, the Mordor Intelligence firm projects the market to witness a CAGR of 5% over the 2024-2029 period.\n\nStory continues\n\nSuch growth projections should bode well for RTX, which is one of the primary missile makers across the globe. Its varied missile portfolio includes Standard Missile (SM)-2, SM-6, Tomahawk Missile, AMRAAM Missile and a few more missiles. To keep up with its growing demand for a wide variety of missiles, RTX broke ground on a $115 million, 26,000-square-foot expansion of its Redstone Raytheon Missile Integration Facility in April 2024. This expansion should increase the factory's space for integrating and delivering on critical defense programs by more than 50%.\n\nThis facility expansion can be expected to enable RTX to expand its footprint further in the missile and missile defense systems market through an increased missile production rate.\n\nOpportunities for Peers\n\nRTX apart, other defense contractors that are expected to benefit from the missile and missile defense systems market’s growth are discussed below:\n\nNorthrop Grumman NOC: Northrop is a prominent developer of missile systems and counter systems, including strategic deterrents, as well as subsystems and components. Its product portfolio includes the Integrated Air and Missile Defense Battle Command System, the Guided Multiple Launch Rocket System propulsion and warhead subsystems, the Hypersonic Attack Cruise Missile, the Advanced Anti-Radiation Guided Missile and a few other combat-proven products that support missile defense systems.\n\nNOC boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for Northrop’s 2024 sales indicates an improvement of 4.6% from the 2023 reported figure.\n\nLockheed Martin LMT: Lockheed’s Missiles and Fire Control business unit develops, manufactures and supports advanced combat missiles and rockets for military customers, including the U.S. Army, Navy, Air Force, Marine Corps, NASA and dozens of foreign allies. Some of its prominent products are the PAC-3 missile and the Terminal High Altitude Area Defense missile.\n\nLMT boasts a long-term earnings growth rate of 4.1%. The Zacks Consensus Estimate for Lockheed’s 2024 sales indicates an improvement of 3.2% from the 2023 reported figure.\n\nGeneral Dynamics GD: General Dynamics’ Ordnance and Tactical Systems unit is the system integrator of the 2.75-inch Hydra-70 family of rockets. It also produces composite rocket motor cases and launch tubes for tactical and strategic missiles.\n\nGD boasts a long-term earnings growth rate of 12%. The Zacks Consensus Estimate for General Dynamics’ 2024 sales indicates growth of 10.5% from the 2023 reported figure.\n\nPrice Performance\n\nIn the past year, RTX’s shares have rallied 13.2% against the industry’s 9.8% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nRTX currently carries a Zacks Rank #3 (Hold).  You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-wins-contract-support-rolling-114100315.html",
        "symbols": [
            "0IUC.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "GD.MX",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.045,
            "neu": 0.796,
            "pos": 0.159
        }
    },
    {
        "date": "2024-06-13T00:00:00+00:00",
        "title": "The 3 Best Aviation Stocks to Buy (Sorry, Boeing.)",
        "content": "The best aviation stocks are these three companies in the iShares U.S. Aerospace &amp; Defense ETF top 20 holdings.",
        "link": "https://investorplace.com/2024/06/the-3-best-aviation-stocks-to-buy-sorry-boeing/",
        "symbols": [
            "LMT.US",
            "RTX.US",
            "TXT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.758,
            "neg": 0,
            "neu": 0.681,
            "pos": 0.319
        }
    }
]