[
    {
        "date": "2024-07-02T21:39:41+00:00",
        "title": "3 Incredibly Profitable Defense Stocks to Buy Now",
        "content": "Amidst ongoing conflicts, the choice of defense stocks for investors might seem crucial yet unpredictable due to varying government spending priorities. Though economic upheaval isn’t my primary prediction, several scenarios could disrupt the U.S. economy.\n\nFor example, one concern is the unsustainable national debt, which experts like BlueBay’s Mark Dowling warn could lead to significant financial instability. Additionally, a major conflict in the Middle East could spike oil prices, potentially triggering a recession. There’s also the persistent threat of terrorism, particularly with ongoing global tensions.\n\nDespite economic uncertainties, defense stocks could remain resilient due to consistent demand for U.S. weaponry amid geopolitical challenges. If chosen wisely, these profitable defense stocks can offer defensive stability based on critical product demand rather than heavy government funding reliance.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nNorthrop Grumman (NOC) Northrop Grumman (NOC) logo on a corporate building\n\nSource: Kristi Blokhin / Shutterstock.com\n\nNorthrop Grumman (NYSE:NOC), a key player in aerospace and defense, excelled in Q1 2024 with $10.1B in sales, a 9% year-over-year (YOY) increase. The company leads in satellite manufacturing and space technology, contributing to missions like NASA’s Artemis program.\n\nDespite recent declines, NOC is positioned for growth with new contracts and partnerships, including NATO’s interest in expanding maritime surveillance with Triton aircraft. Analysts foresee potential gains, with NOC trading at 17.7x forward earnings and 1.6x sales, suggesting a 14% upside next year.\n\nIn other NOC news, Northrop Grumman’s XRQ-73, designated for DARPA’s Shepard program, is led by its Aeronautics Systems division in Redondo Beach, CA. Collaborating with Scaled Composites, known for its expertise in aircraft design, the program builds on technology from the earlier Great Horned Owl project. Great Horned Owl, initiated in 2011 by IARPA with support from AFRL, focused on developing a stealthy surveillance drone with advanced series hybrid electric architecture.\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) Space Systems sign in Sunnyvale, California.\n\nSource: Ken Wolter / Shutterstock.com\n\nSimilar to Northrop, Lockheed Martin (NYSE:LMT) offers stable investment potential in space stocks, focusing on satellite technology amid rising geopolitical tensions. Despite a nearly flat performance in 2024, analysts rate it a Hold with a modest upside.\n\nFinancially, Lockheed reported $6.78 billion in net income over the past year, with revenue reaching $69.64 billion. Expectations for fiscal 2024 foresee earnings at $26.27 per share and revenue climbing to $72.36 billion in 2025, complemented by a 2.7% forward dividend yield, emphasizing stability.\n\nStory continues\n\nLockheed Martin’s advanced weather satellite, built for NOAA, successfully launched from NASA’s Kennedy Space Center via a SpaceX Falcon Heavy rocket. Named GOES-U, it deployed its solar array and established communication with operators. GOES-U is the final satellite in NOAA’s GOES-R series, set to be renamed GOES-19 after reaching geostationary orbit. It will serve as GOES East, offering weather imagery, atmospheric data, lightning mapping and space weather observations over North America’s East Coast.\n\nGeneral Dynamics (GD) image of General Dynamics (GD) website, representing dividend stocks\n\nSource: Casimiro PT / Shutterstock.com\n\nGeneral Dynamics (NYSE:GD), known for its diverse operations in aerospace, marine systems, combat systems and technologies, saw a robust financial performance. Revenue climbed to $10.7 billion, up 8.6% YOY, with net earnings reaching $799 million, a 9.5% increase. Diluted EPS grew by 9.1% to $2.88, showcasing strong profitability with gross and operating margins exceeding 15% and 9%, respectively.\n\nIn late March, Gulfstream Aerospace, a division of General Dynamics, achieved FAA-type certification for its new Gulfstream G700, with initial deliveries already underway. Increased demand in Combat Systems and growth in Marine Systems, driven by U.S. Navy contracts, are key drivers.\n\nThe company boasts a 1.97% dividend yield, consistently increased for 33 years. With a low beta of 0.64, indicating less market risk, GD stock shows resilience despite recent peaks. Its robust combat and marine systems sectors and solid order backlog position it well for continued growth, potentially bolstered by margin improvements and Gulfstream business jet sales.\n\nOn the date of publication, Chris MacDonald did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nChris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 3 Incredibly Profitable Defense Stocks to Buy Now appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-incredibly-profitable-defense-stocks-213941903.html",
        "symbols": [
            "0IUC.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.056,
            "neu": 0.803,
            "pos": 0.141
        }
    },
    {
        "date": "2024-07-02T00:00:00+00:00",
        "title": "3 Incredibly Profitable Defense Stocks to Buy Now",
        "content": "Here are three highly-profitable defense stocks long-term investors may want to consider, now that geopolitical tensions are heating up.\n",
        "link": "https://investorplace.com/2024/07/3-incredibly-profitable-defense-stocks-to-buy-now/",
        "symbols": [
            "GD.US",
            "LMT.US",
            "NOC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.226,
            "neg": 0.126,
            "neu": 0.744,
            "pos": 0.13
        }
    }
]