[
    {
        "date": "2024-06-12T18:28:19+00:00",
        "title": "3 Space Tech Stocks that are Almost Cleared to Blast Off",
        "content": "Stocks in the space sector offer exciting diversity. Tech is one of the most essential parts of the space industry, and the drive to explore the cosmos and discover pushes innovation in tech to new heights. As our technology develops, we will unlock the full potential of space little by little, and it could eventually grow into one of the largest markets ever.\n\nThose looking to get into space stocks have to be able to stomach some risk. There is little room for error in the development of tech in space and lots of room for expensive research and development. However, if you can tolerate the risk, these three stocks are perfect options for investors, given their incredible potential and lucrative positions within the space market.\n\nLet’s learn more about what each company offers and why it is in an exciting position to take off in the coming years.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) Space Systems sign in Sunnyvale, California.\n\nSource: Ken Wolter / Shutterstock.com\n\nLockheed Martin (NYSE:LMT) is the largest defense tech company worldwide. Its main customers include the Pentagon and other government agencies. However, Lockheed also has a significant position in the space market, supplying satellite, missile and launch tech to customers like NASA.\n\nLockheed’s launch business is fueled by a massive partnership with Boeing (NYSE:BA) that started in 2006. The duo is seeing an enormous surge in demand from its government benefactors like the Air Force to launch more satellites to keep up with major competitor SpaceX and allow the government to test its latest defense tech accurately.\n\nDemand is not limited to the company’s launch tech, though. The company has a long history of developing state-of-the-art missile technology. The U.S. Army is also throwing money at Lockheed to acquire its most advanced missile system, the Hypersonic Weapon System. This tech landed Lockheed a contract for $756 Million just last month.\n\nLockheed has continuously worked to expand these successful segments, as space tech accounted for 19% of net sales and missiles around 17% in Q1. With more investments from government agencies and continued success from its commercial customers, Lockheed is set to do great things. It is an excellent investment for those looking to enter space this year.\n\nLeidos Holdings (LDOS) Leidos (LDOS) logo on the side of an office building\n\nSource: Jer123 / Shutterstock.com\n\nLeidos Holdings (NYSE:LDOS) is unique in the space market because, in addition to tech, it provides an extensive list of consulting services. Its main customers are NASA and other government agencies heavily involved in space.\n\nStory continues\n\nLeidos’s offerings span a wide range of markets, but its space services include tech; education; and accompaniment for cargo, human exploration, and payload transportation missions. The company has a long history of working with NASA and is the leading tech services provider on their countless continued missions.\n\nThe company has also made intelligent investments to expand its space capabilities, including acquiring Dynetics, a leading research and security solutions company, in 2020. Dynetics now operates as a subsidiary of Leidos and continues to provide the most cutting-edge technology to the government.\n\nLeidos is a relatively stable stock within the space sector. It has already shown extensive growth this year, reaching an all-time high in price. Investors should keep an eye on Leidos as it continues to prove its undeniable worth and return potential.\n\nRocket Lab USA (RKLB) Person holding smartphone with logo of aerospace company Rocket Lab USA Inc. (RKLB) on screen in front of website. Focus on phone display. Unmodified photo.\n\nSource: T. Schneider / Shutterstock.com\n\nRocket Lab USA (NASDAQ:RKLB) is not as established as the other companies on this list as it is much newer to the space tech market. While the market already involves high risk, Rocket Lab offers the risk of being a newer company without as many established customers as well.\n\nHowever, much is to be said about this launch and rocket tech specialist. The company already has a solid base in small-scale launches and is looking to expand its offerings to larger-scale rockets and satellites.\n\nIt is important to note that a small scale does not mean a small profit. In April, the U.S. space force offered Rocket Lab a $14.49 million task order to launch a small-scale electron mission. Rocket Lab does not stop at launch technology, either.\n\nOn June 11th, Rocket Lab announced that it was on its way to completing a non-binding agreement to receive $23.9M in direct funding to increase the production of its semiconductors, which are used on satellites and other spacecraft.\n\nThe funding is under the CHIPS and Science Act, and Rocket Lab was selected for the grant thanks to its acquisition of semiconductor manufacturer SolAero Technologies Inc. in 2022. This young space stock is nowhere near its peak but is primed with the potential to have a massive imprint on the space industry.\n\nOn the date of publication, Joel Lim did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nJoel Lim is a contributor at InvestorPlace.com and a finance content contractor who creates content for several companies like LTSE and Realtor, along with financial publications, including Business Insider, Yahoo Finance, Mises Institution and Foundation for Economic Education.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 3 Space Tech Stocks that are Almost Cleared to Blast Off appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-space-tech-stocks-almost-182819446.html",
        "symbols": [
            "0R3E.LSE",
            "BA.US",
            "L1DO34.SA",
            "LDOS.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RKLB.US",
            "S6IA.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.016,
            "neu": 0.893,
            "pos": 0.091
        }
    },
    {
        "date": "2024-06-12T12:00:12+00:00",
        "title": "Is Lockheed Martin Corporation (NYSE:LMT) Trading At A 28% Discount?",
        "content": "Key Insights\n\nUsing the 2 Stage Free Cash Flow to Equity, Lockheed Martin fair value estimate is US$647 Lockheed Martin's US$463 share price signals that it might be 28% undervalued Analyst price target for LMT is US$489 which is 24% below our fair value estimate\n\nDoes the June share price for Lockheed Martin Corporation (NYSE:LMT) reflect what it's really worth? Today, we will estimate the stock's intrinsic value by taking the forecast future cash flows of the company and discounting them back to today's value. We will use the Discounted Cash Flow (DCF) model on this occasion. It may sound complicated, but actually it is quite simple!\n\nRemember though, that there are many ways to estimate a company's value, and a DCF is just one method. If you still have some burning questions about this type of valuation, take a look at the Simply Wall St analysis model.\n\nView our latest analysis for Lockheed Martin\n\nThe Method\n\nWe use what is known as a 2-stage model, which simply means we have two different periods of growth rates for the company's cash flows. Generally the first stage is higher growth, and the second stage is a lower growth phase. To begin with, we have to get estimates of the next ten years of cash flows. Where possible we use analyst estimates, but when these aren't available we extrapolate the previous free cash flow (FCF) from the last estimate or reported value. We assume companies with shrinking free cash flow will slow their rate of shrinkage, and that companies with growing free cash flow will see their growth rate slow, over this period. We do this to reflect that growth tends to slow more in the early years than it does in later years.\n\nA DCF is all about the idea that a dollar in the future is less valuable than a dollar today, so we need to discount the sum of these future cash flows to arrive at a present value estimate:\n\n10-year free cash flow (FCF) estimate\n\n2024 2025 2026 2027 2028 2029 2030 2031 2032 2033 Levered FCF ($, Millions)  US$6.21b US$6.13b US$6.38b US$7.06b US$7.16b US$7.27b US$7.40b US$7.54b US$7.70b US$7.87b Growth Rate Estimate Source Analyst x9 Analyst x9 Analyst x5 Analyst x2 Analyst x1 Est @ 1.55% Est @ 1.80% Est @ 1.97% Est @ 2.09% Est @ 2.18% Present Value ($, Millions) Discounted @ 6.5%  US$5.8k US$5.4k US$5.3k US$5.5k US$5.2k US$5.0k US$4.8k US$4.6k US$4.4k US$4.2k\n\n(\"Est\" = FCF growth rate estimated by Simply Wall St)\r\nPresent Value of 10-year Cash Flow (PVCF) = US$50b\n\nAfter calculating the present value of future cash flows in the initial 10-year period, we need to calculate the Terminal Value, which accounts for all future cash flows beyond the first stage. For a number of reasons a very conservative growth rate is used that cannot exceed that of a country's GDP growth. In this case we have used the 5-year average of the 10-year government bond yield (2.4%) to estimate future growth. In the same way as with the 10-year 'growth' period, we discount future cash flows to today's value, using a cost of equity of 6.5%.\n\nStory continues\n\nTerminal Value (TV)= FCF2033 × (1 + g) ÷ (r – g) = US$7.9b× (1 + 2.4%) ÷ (6.5%– 2.4%) = US$197b\n\nPresent Value of Terminal Value (PVTV)= TV / (1 + r)10= US$197b÷ ( 1 + 6.5%)10= US$105b\n\nThe total value, or equity value, is then the sum of the present value of the future cash flows, which in this case is US$155b. To get the intrinsic value per share, we divide this by the total number of shares outstanding. Relative to the current share price of US$463, the company appears a touch undervalued at a 28% discount to where the stock price trades currently. The assumptions in any calculation have a big impact on the valuation, so it is better to view this as a rough estimate, not precise down to the last cent. dcf\n\nImportant Assumptions\n\nWe would point out that the most important inputs to a discounted cash flow are the discount rate and of course the actual cash flows. You don't have to agree with these inputs, I recommend redoing the calculations yourself and playing with them. The DCF also does not consider the possible cyclicality of an industry, or a company's future capital requirements, so it does not give a full picture of a company's potential performance. Given that we are looking at Lockheed Martin as potential shareholders, the cost of equity is used as the discount rate, rather than the cost of capital (or weighted average cost of capital, WACC) which accounts for debt. In this calculation we've used 6.5%, which is based on a levered beta of 0.890. Beta is a measure of a stock's volatility, compared to the market as a whole. We get our beta from the industry average beta of globally comparable companies, with an imposed limit between 0.8 and 2.0, which is a reasonable range for a stable business.\n\nSWOT Analysis for Lockheed Martin\n\nStrength\n\nEarnings growth over the past year exceeded the industry.\n\nDebt is well covered by earnings and cashflows.\n\nDividends are covered by earnings and cash flows.\n\nWeakness\n\nDividend is low compared to the top 25% of dividend payers in the Aerospace & Defense market.\n\nOpportunity\n\nAnnual earnings are forecast to grow for the next 3 years.\n\nGood value based on P/E ratio and estimated fair value.\n\nThreat\n\nAnnual earnings are forecast to grow slower than the American market.\n\nMoving On:\n\nAlthough the valuation of a company is important, it ideally won't be the sole piece of analysis you scrutinize for a company. The DCF model is not a perfect stock valuation tool. Instead the best use for a DCF model is to test certain assumptions and theories to see if they would lead to the company being undervalued or overvalued. If a company grows at a different rate, or if its cost of equity or risk free rate changes sharply, the output can look very different. Can we work out why the company is trading at a discount to intrinsic value? For Lockheed Martin, we've compiled three fundamental items you should further examine:\n\nRisks: To that end, you should be aware of the  1 warning sign  we've spotted with Lockheed Martin . Future Earnings: How does LMT's growth rate compare to its peers and the wider market? Dig deeper into the analyst consensus number for the upcoming years by interacting with our free analyst growth expectation chart. Other Solid Businesses: Low debt, high returns on equity and good past performance are fundamental to a strong business. Why not explore our interactive list of stocks with solid business fundamentals to see if there are other companies you may not have considered!\n\nPS. Simply Wall St updates its DCF calculation for every American stock every day, so if you want to find the intrinsic value of any other stock just search here.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-corporation-nyse-lmt-120012221.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.031,
            "neu": 0.794,
            "pos": 0.175
        }
    },
    {
        "date": "2024-06-12T10:50:00+00:00",
        "title": "The Zacks Analyst Blog Highlights The Procter &amp; Gamble, ServiceNow, Lockheed Martin and Steel  Partners",
        "content": "For Immediate Releases\n\nChicago, IL – June 12, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: The Procter & Gamble Co. PG, ServiceNow, Inc. NOW and Lockheed Martin Corp. LMT and Steel Partners Holdings L.P. SPLP.\n\nHere are highlights from Tuesday’s Analyst Blog:\n\nTop Stock Reports for Procter & Gamble, ServiceNow and Lockheed Martin\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including The Procter & Gamble Co., ServiceNow, Inc. and Lockheed Martin Corp., as well as a micro-cap stock Steel Partners Holdings L.P. The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\r\n\r\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\r\n\r\nYou can see all of today’s research reports here >>>\r\n\r\nToday's Research Daily also features the monthly Equity Strategy report from our Chief Equity Strategist where he discusses the outlook the outlook for the Tech sector in general and the 'Magnificent 7' stocks.\n\nYou can find full June Equity Strategy report here >>> Strong Mega-Cap Profit Center in the S&P\n\nProcter & Gamble shares have modestly outperformed the Zacks Soap and Cleaning Materials industry over the past year (+18.0% vs. +17.6%). The company has been gaining from robust pricing and a favorable mix, along with strength across segments. It has been focused on productivity and cost-saving plans to boost margins.\r\n\r\nThis led to bottom line beating the consensus mark for the seventh consecutive quarter in third-quarter fiscal 2024. Consequently, PG has provided an optimistic fiscal 2024 view.\r\n\r\nHowever, the company has been witnessing supply-chain issues, higher SG&A costs, higher transportation costs and rising inflation. Its significant international presence exposes it to foreign currency risks, which acts as a headwind.\r\n\r\n(You can read the full research report on Procter & Gamble here >>>)\r\n\r\nShares of ServiceNow have gained +0.4% over the year-to-date period against the Zacks Computers - IT Services industry’s gain of +5.1%. The company has been benefiting from the rising adoption of its workflows by enterprises undergoing digital transformation. ServiceNow had 1933 total customers with more than $1 million in annual contract value at the end of the first quarter.\r\n\r\nServiceNow had eight deals greater than $5 million in net new ACV, and four deals of more than $10 million. It closed 59 deals greater than $1 million net new ACV. Number of customers contributing more than $20 million or more grew 50% year over year.\r\n\r\nGenerative AI deals continued to gain traction with record-breaking net new ACV for Pro Plus, making it the fastest-selling product in ServiceNow’s history. Nevertheless, ServiceNow is suffering from high inflation, stiff competition, and a challenging macro-economic environment.\r\n\r\n(You can read the full research report on ServiceNow here >>>)\r\n\r\nLockheed Martin shares have outperformed the Zacks Aerospace - Defense industry over the past year (+4.5% vs. -10.1%). The company’s broad product offerings allow it to secure big defense contracts from the Pentagon and other U.S. allies, which in turn boosts its backlog count, which was a record $159.4 billion as of Mar 31, 2024.\r\n\r\nLockheed Martin remains the largest U.S. defense contractor with a steady order flow from its leveraged presence in the Army, Air Force, Navy and IT programs. The solid U.S. defense budgetary provisions should boost its business. The company’s products also witness a strong international demand.\r\n\r\nHowever, Lockheed is facing performance issues concerning some of its products that may affect its results. Shortage of skilled labor may adversely impact Lockheed’s operating results. China’s sanctions imposed on Lockheed might also affect its business.\r\n\r\n(You can read the full research report on Lockheed Martin here >>>)\r\n\r\nShares of Steel Partners have underperformed the Zacks Diversified Operations industry over the year-to-date period (-8.5% vs. +0.9%). This microcap company with market capitalization of $747.01 million has a diversified portfolio across various sectors and the inclusion of Steel Connect, SPLP mitigates risks and boosts growth. As of Mar 31, 2024, SPLP had $273.9 million in cash, with debt reduced to $92.8 million. SPLP also reduced interest expenses by 76.7% in the first quarter.\r\n\r\nYet, the adjusted EBITDA margin declined from 14.2% to 12.3% in the first quarter of 2024 due to an underperformance in the Energy and Diversified Industrial segments. Energy revenues fell 33.7% and Diversified Industrial sales decreased 3.9%, impacting profitability. Also, fluctuations due to geopolitical tensions impact operational costs and investor confidence.\r\n\r\n(You can read the full research report on Steel Partners here >>>)\n\nStory continues\n\nWhy Haven’t You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\n\nToday you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance  for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nProcter & Gamble Company (The) (PG) : Free Stock Analysis Report\n\nServiceNow, Inc. (NOW) : Free Stock Analysis Report\n\nSteel Partners Holdings LP (SPLP): Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-procter-105000789.html",
        "symbols": [
            "0NOF.IL",
            "0R3E.LSE",
            "4S0.F",
            "4S0.STU",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "N1OW34.SA",
            "NOW.US",
            "PG.BA",
            "PG.MX",
            "PG.NEO",
            "PG.US",
            "PGCO34.SA",
            "PRG.BE"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.026,
            "neu": 0.847,
            "pos": 0.127
        }
    },
    {
        "date": "2024-06-12T00:00:00+00:00",
        "title": "3 Space Tech Stocks that are Almost Cleared to Blast Off",
        "content": "These space stocks provide the tech and expertise necessary to support advanced space missions and have their sights on the stars this year.",
        "link": "https://investorplace.com/2024/06/3-space-tech-stocks-that-are-almost-cleared-to-blast-off/",
        "symbols": [
            "LDOS.US",
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.572,
            "neg": 0,
            "neu": 0.817,
            "pos": 0.183
        }
    }
]