[
    {
        "date": "2024-08-12T08:33:00+00:00",
        "title": "Prediction: This CEO of a Boeing and Lockheed Joint Venture Sees Billions of Dollars in His Future",
        "content": "In November 2024, Tory Bruno, CEO of space giant United Launch Alliance (ULA), had reason to be thankful.\n\nSeveral years prior, Bruno had promised investors he would lower the cost of rockets manufactured by ULA, a joint venture between Boeing(NYSE: BA) and Lockheed Martin(NYSE: LMT), and price ULA rocket launches competitively with rockets launched by SpaceX. In November, he delivered on that promise, winning 11 U.S. Space Force launch contracts for $118 million each. SpaceX, meanwhile, won 10 launch contracts at an average cost of $120 million.\n\nAdvantage: ULA.\n\nSpace math: What's $118 million times 23?\n\nIt's been a long time since ULA prices were anywhere near competitive with SpaceX prices, but now that they are, ULA is making the most of its opportunity. In a short boast posted on Twitter last month, Bruno revealed that ULA currently has 23 new Vulcan Centaur rockets under construction at its Alabama rocket factory.\n\nAnother #VulcanRocket departs Alabama and heads to Florida, making room in our crowded rocket factory. 23 Vulcans in production!!! pic.twitter.com/CIfBl8yKMS\n\n-- Tory Bruno (@torybruno) July 26, 2024\n\nAt $118 million per launch, that implies ULA is laying the groundwork to generate $2.7 billion in revenue with these rockets.\n\nThe question investors may ask is whether ULA can find enough customers for all these rockets. After all, so far this decade, ULA has launched only 20 rockets, including five launches in 2021, eight in 2022, but just three in 2023 (and four so far this year). What's more, almost all of these launches had just one customer: the U.S. government. So few launches, servicing such a small customer base, suggests ULA may be overproducing for a market that doesn't exist. But here's the thing: The market does exist.\n\nTwo years ago, Amazon.com(NASDAQ: AMZN) tapped ULA to support its effort to build a Kuiper satellite communications network around Earth. And the 23 rockets ULA is building today are only a part of that effort. In all, Amazon has hired ULA to launch 47 times for it as part of Project Kuiper, giving ULA its first real shot at becoming a commercial launch contractor, as opposed to just a launcher of government and military satellites.\n\nThanks largely to Amazon, therefore, Bruno now anticipates that ULA will launch as often in 2025 as it has launched in all of this decade so far -- 20 times -- and accelerate to \"25+\" launches per year after that.\n\nStory continues\n\nGiven on time spacecraft deliveries, 20 next year and 25+ the following\n\n-- Tory Bruno (@torybruno) July 26, 2024\n\nWhat it means for investors\n\nAnd so it turns out that this story is even bigger than just \"23 rockets\" generating $2.7 billion in revenue once. It's a story of ULA transforming itself to roughly quadruple its launch cadence so it can consistently generate annual revenues of between $2.5 billion and $3 billion from launch operations alone.\n\nAt the same time, ULA may have reached an inflection point in the profit margins it earns on those revenues. According to a February report by Payload Space, from 2016 to 2023, ULA profits collapsed 88% -- from $650 million to just $80 million. 75% of this decline was from a slowing in launch cadence (from 12 launches in 2016 to three in 2023). The rest came from lower profit margins -- but this may be changing.\n\nWhile ULA is privately owned and does not release detailed information about its financial performance, its 50% part-owner, Lockheed Martin, does. And according to data from S&P Global Market Intelligence, Lockheed Martin space division profit margins, which were 13.2% in 2016 and fell to 8.9% by 2023, rebounded to a solid 10% in the first six months of 2024. If we use Lockheed's performance as a proxy for ULA's, therefore, it would appear that at the same time that ULA's revenues are starting to improve, so too are its profits!\n\nSo what does this mean for investors in Boeing and Lockheed? One possibility is that more profit will soon be flowing from ULA onto the parent companies' income statements. Another possibility is that a more profitable ULA could fetch a higher purchase price if Boeing and Lockheed succeed in selling it.\n\nEither way, that should be a win for investors in Boeing and Lockheed.\n\nShould you invest $1,000 in Lockheed Martin right now?\n\nBefore you buy stock in Lockheed Martin, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Lockheed Martin wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $641,864!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of August 6, 2024\n\nJohn Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Rich Smith has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Amazon. The Motley Fool recommends Lockheed Martin. The Motley Fool has a disclosure policy.\n\nPrediction: This CEO of a Boeing and Lockheed Joint Venture Sees Billions of Dollars in His Future was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/prediction-ceo-boeing-lockheed-joint-083300429.html",
        "symbols": [
            "AMZN.US",
            "BA.US",
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.034,
            "neu": 0.853,
            "pos": 0.113
        }
    }
]