[
    {
        "date": "2024-09-30T14:30:00+00:00",
        "title": "RTX Wins a $526M Contract to Supply Missile Assemblies for ESSM",
        "content": "RTX Corporation RTX recently secured a $525.5 million contract for producing and delivering guided missile assemblies of Evolved Seasparrow Missile (ESSM). This contract includes future options that could bring the total value of the agreement to $2.19 billion.\n\nDetails of the Deal\n\nWork related to this contract will be spread across multiple locations globally, including the United States, Australia, Canada, Norway, the Netherlands and a few other nations. This contract is projected to be completed by September 2030.\r\n\r\nThe award has been provided by the Naval Sea Systems Command, Washington, D.C.\n\nWhat’s Favoring RTX?\n\nWith countries worldwide enhancing their defense capabilities, spending on advanced military arms and ammunition has been rapidly increasing. This includes growing investments in missiles and missile systems, which are essential for modern warfare. RTX, as a prominent manufacturer of missile systems, has been benefiting from a steady flow of orders from the Pentagon and other U.S. allies. The recent contract is an example of that.\r\n\r\nNotably, RTX’s ESSM Block II is a highly versatile naval defense system. Its enhanced capabilities provide superior performance in maritime warfare, offering nations the ability to defend their fleet more effectively.\r\n\r\nWith more than 330 live firings at sea, the ESSM weapon is a thoroughly tested ship self-defense missile against a stressing and wide-ranging set of air and surface targets.\r\nSuch notable features of the ESSM are likely to have been boosting its demand, which is further evident from the latest contract win.\n\nRTX’s Growth Prospects\n\nRising military conflicts, terrorism and border disputes have led nations to increase their focus on national security, particularly on missile defense systems in recent times, backed by the rapid development of advanced missile technologies over the last decade.\r\n \r\nThis is likely to have prompted Mordor Intelligence to forecast a compound annual growth rate of 5% for the global missiles and missile defense systems market during the 2024-2029 time period.\r\n\r\nSuch massive growth projections indicate solid opportunities for RTX, which has a handful of combat-proven missiles in its product portfolio, like the TOW missile, Guidance Enhanced Missile, Advanced Medium Range Air-to-Air Missile, Tomahawk, Standard Missile 2 and a few more, in addition to the ESSM.\n\nProspects of RTX’s Peers\n\nOther defense companies that are likely to enjoy the perks of the expanding missiles and missile system market have been discussed below.\r\n\r\nNorthrop Grumman Corporation NOC: Northrop Grumman provides high-speed, long-range strike weapons like the AARGM-ER, which is a supersonic, air-launched tactical missile system. It also develops and builds advanced missile defense technology, ranging from command systems to directed energy weapons, advanced munitions and powerful sensors.\r\n\r\nThe company’s long-term (three to five years) earnings growth rate is 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales indicates year-over-year growth of 5.4%.\r\n\r\nThe Boeing Company BA: It manufactures various missile defense systems, including the Ground-based Midcourse Defense, Aegis Ballistic Missile Defense and Avenger. Boeing-built and supported air and missile defense systems have been protecting its customers for nearly 25 years against threats ranging from intercontinental ballistic missiles to hostile aircraft.\r\n\r\nThe company has a long-term earnings growth rate of 21.3%.  The Zacks Consensus Estimate for BA’s 2025 sales indicates year-over-year growth of 20%.\r\n\r\nLockheed Martin Corporation LMT: Lockheed Martin’s missile defense program includes the Patriot Advanced Capability-3 and Terminal High-Altitude Area Defense air and missile defense programs. It also manufactures the Multiple Launch Rocket System, the Joint Air-to-Surface Standoff Missile and Javelin tactical missile programs alongside other tactical missiles.\r\n\r\nThe company has a long-term earnings growth rate of 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales indicates year-over-year growth of 5.3%.\n\nStory continues\n\nRTX Stock Price Movement\n\nShares of RTX have gained 21.6% in the past three months compared with the industry’s 11.1% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nRTX’s Zacks Rank\n\nRTX currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-wins-526m-contract-supply-143000877.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.044,
            "neu": 0.77,
            "pos": 0.186
        }
    },
    {
        "date": "2024-09-30T13:29:00+00:00",
        "title": "AAR Secures a $1.2B Deal for Its P-8A Poseidon Aircraft",
        "content": "AAR Corp. AIR recently secured a nearly $1.2 billion deal for five years of indefinite delivery/indefinite quantity with the U.S. Navy's Naval Air Systems Command (“NAVAIR”). Per the contract, AIR will look after the engine depot maintenance and repair of the P-8A Poseidon Aircraft fleet.\n\nA Brief Note on AAR’s Deal\n\nFor the Navy's expanding fleet, AIR and its strategic partner Delta TechOps will boost engine asset availability starting in October 2024 by offering program management, supply-chain management, technical support, and maintenance and repair services. Through this relationship with AAR, the U.S. Navy will be able to accomplish its essential national security mission and continue operating the P-8A due to its enhanced engine repair capabilities.\r\n\r\nThis deal represents a significant step forward in AAR's aim to expand and enhance its commercial derivative business through the supply of integrated solutions. It is also projected to boost the volume of engine parts sold in the company's Part Supply division.\n\nAAR’s Growth Prospects\n\nThe increasing defense budgets and advancements in aerospace technology must have increased the demand for maintenance and upgrade solutions. As nations are spending heftily these days to secure their borders, fighter jets are playing a key role in defending a country’s safety. This has been boosting the demand for fighter jets. As demand for new aircraft is rising, so is the need for maintenance, repair and overhaul (MRO) services.\r\n\r\nPer a report by Mordor Intelligence, the Military Aircraft MRO market is projected to reach nearly $47.48 billion by 2029, with a CAGR of 2.8% between 2024 and 2029. Such growth opportunities offered by the aforementioned market should bode well for AAR in the coming years.\r\n\r\nAAR is a renowned provider of aircraft MRO solutions to commercial and defense aircraft with operations in more than 20 nations. The company is currently the largest independent MRO service provider in North America, which operates six certified hangars in the United States and Canada with thousands of commercial and military aircraft under its care.\r\n\r\nAAR’s talented aircraft technicians and engineering experts carry out major maintenance services as well as airframe repair, modifications, inspections, upgrades, refurbishments and painting services for a variety of aircraft platforms, including Airbus, Boeing, Bombardier and Embraer.\n\nOpportunities for Other Aerospace Companies\n\nDefense contractors that are anticipated to benefit from the expanding Military Aircraft MRO market are as follows:\r\n\r\nRTX Corporation RTX: The company’s unit, Collins Aerospace, is known for its advanced avionics solutions. Its MRO services include the maintenance and repair of avionics systems, seat inspections, teardown and analysis, from minor repairs to major repairs.\r\n\r\nRTX has a long-term (three to five years) earnings growth rate of 10.4%. The Zacks Consensus Estimate for RTX’s 2024 sales suggests growth of 7% from the prior-year reported figure.\r\n\r\nLockheed Martin LMT: Its Sikorsky Military Aircraft’s Overhaul and Repair organization offers a diversified range of system services, repairing and overhauling dynamic systems, blades, avionics and numerous other components, from aircraft tip to tail.\r\n\r\nLockheed Martin has a long-term earnings growth rate of 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales implies growth of 5.3% from the prior-year reported figure.\r\n\r\nCurtiss-Wright Corporation CW: The company has more than 25 years of expertise in repairing and overhauling complex flight control actuators and structural components that support them. CW provides heavy maintenance support, modification programs and customized component repair solutions for these vital parts.\r\n\r\nCurtiss-Wright delivered an average earnings surprise of 11.52% in the last four quarters. The Zacks Consensus Estimate for the company’s 2024 sales indicates an improvement of 7.1% from the prior-year reported figure.\n\nStory continues\n\nAAR Stock Price Movement\n\nIn the past six months, AIR shares have risen 9.8% compared with the industry’s growth of 17.5%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nAAR’s Zacks Rank\n\nAAR currently carries a Zacks Rank #4 (Sell).\r\n\r\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nAAR Corp. (AIR) : Free Stock Analysis Report\n\nCurtiss-Wright Corporation (CW) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/aar-secures-1-2b-deal-132900402.html",
        "symbols": [
            "0R3E.LSE",
            "AIR.US",
            "ARZ.F",
            "CW.US",
            "CWT.F",
            "CWT.STU",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.006,
            "neu": 0.822,
            "pos": 0.173
        }
    }
]