[
    {
        "date": "2024-08-09T13:00:00+00:00",
        "title": "Global Super Hercules Fleet Grows with Delivery of First C-130J to New Zealand",
        "content": "The Royal New Zealand Air Force will operate a total of five C-130Js\n\nMARIETTA, Ga., Aug. 9, 2024 /PRNewswire/ -- A new era of tactical airlift capability for New Zealand has officially begun with Lockheed Martin (NYSE: LMT) delivering the first of five C-130J Super Hercules tactical airlifters to the New Zealand Ministry of Defence and New Zealand Defence Force during a ceremony at the Lockheed Martin's facility in Marietta, Georgia, on Aug. 8. Representatives from Lockheed Martin, the New Zealand Embassy to the United States, the New Zealand Ministry of Defence, the New Zealand Defence Force and the Royal New Zealand Air Force gathered at the Lockheed Martin Aeronautics site Marietta, Georgia, on Aug. 8, 2024, to celebrate the delivery of the RNZAF's first of five C-130J Super Hercules airlifters. Photo by Thinh D. Nguyen\n\nFor almost six decades, the Royal New Zealand Air Force's (RNZAF) C-130Hs have served as essential first-response resources for New Zealand and the entire Indo-Pacific region. Crews from 40 Squadron located at RNZAF Base Auckland, Whenuapai, will operate the new C-130Js, representing one of the most advanced configurations of the Super Hercules ever produced.\n\n\"From supporting humanitarian and disaster relief operations to partnering with allies in military operations, New Zealand's C-130s are truly a global force for good,\" said Rod McLean, vice president and general manager of Lockheed Martin's Air Mobility & Maritime Missions line of business. \"The RNZAF's new C-130J fleet will continue to support these critical missions while offering New Zealand increased allied alignment, greater reach, enhanced capabilities and proven performance for some of the most demanding tactical airlift operational requirements.\"\n\nNew Zealand officials announced the intent to modernize its existing fleet of five C-130Hs with five C-130J-30 variants in 2020 via a Foreign Military Sale with the U.S. Air Force. A joint project team with personnel from New Zealand's Ministry of Defence and the New Zealand Defence Force have worked alongside the U.S. Air Force and Lockheed Martin to manage the aircraft delivery and training programs.\n\nAlways evolving, continually innovating and ready for what's next, the Super Hercules leads the charge by setting standards and shaping the future of tactical airlift missions, offering a multitude of advantages found in no other medium-sized tactical airlifter in production or operation today.\n\nThese discriminators include proven operational readiness with the greatest ease of transition, increased reliability, superior tactical airlift and combat airdrop capabilities, certification by more than 20 airworthiness authorities, and enhanced survivability. The C-130J also delivers unmatched interoperability with NATO and global air forces, robust industrial partnerships and verified low life-cycle costs with significant fuel savings resulting in a reduced carbon footprint compared to other medium-sized jet airlifters.\n\nStory continues\n\nSee how and why the C-130J continues to be the worldwide choice in tactical airlift through the newest episode of \"Into the Cockpit\" on Lockheed Martin's YouTube channel, which offers exclusive behind-the-scenes access to the Super Hercules.\n\nFor more information, visit www.lockheedmartin.com/c130.\n\nAbout Lockheed Martin \r\nLockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at Lockheedmartin.com. (PRNewsfoto/Lockheed Martin Aeronautics) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/global-super-hercules-fleet-grows-with-delivery-of-first-c-130j-to-new-zealand-302218599.html\n\nSOURCE Lockheed Martin Aeronautics\n\nView comments",
        "link": "https://finance.yahoo.com/news/global-super-hercules-fleet-grows-130000584.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.027,
            "neu": 0.813,
            "pos": 0.16
        }
    }
]