[
    {
        "date": "2024-07-23T20:16:52+00:00",
        "title": "Lockheed Martin Rises Above Buy Zone On Beat-And-Raise Report, Kicking Off Defense Earnings",
        "content": "Defense earnings: Lockheed Martin beat views and hiked its outlook Tuesday. RTX, Northrop Grumman and General Dynamics are on tap this week.\n\nContinue reading",
        "link": "https://finance.yahoo.com/m/ad98eb86-9315-37b9-a6f1-aa293e39a79b/lockheed-martin-rises-above.html",
        "symbols": [
            "0R3E.LSE",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "LHX.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.382,
            "neg": 0,
            "neu": 0.859,
            "pos": 0.141
        }
    },
    {
        "date": "2024-07-23T17:53:22+00:00",
        "title": "Small-Cap Gains Resume Ahead Of Major Tech Earnings; UPS Faces Worst Day Ever, Bitcoin Dips Below $66,000: What's Driving Markets Tuesday?",
        "content": "Small-Cap Gains Resume Ahead Of Major Tech Earnings; UPS Faces Worst Day Ever, Bitcoin Dips Below $66,000: What's Driving Markets Tuesday?\n\nOn Tuesday, Wall Street saw a mixed session, with small-cap stocks outperforming large caps as investors anticipated key earnings reports from Alphabet Inc. (NASDAQ:GOOG) (NASDAQ:GOOGL) and Tesla Inc. (NASDAQ:TSLA), set to be released after the close.\n\nThe Russell 2000 index, as replicated by the iShares Russell 2000 ETF (NYSE:IWM), climbed 0.8%, while the tech-heavy Nasdaq 100 dipped 0.2%. This marked the ninth time in the last 10 sessions that small caps have outperformed tech stocks. The S&P 500 and the Dow Jones showed little movement.\n\nUnited Parcel Service Inc. (NYSE:UPS) stood out among the mega-cap stocks, plunging 14% after missing earnings and revenue estimates for the previous quarter. This decline is poised to be the worst one-day drop for the shipping company since it went public in 1999.\n\nBoth Treasury yields and the U.S. dollar remained stable ahead of a data-heavy week, featuring the Q2 GDP report on Thursday and the Fed’s favored inflation report on Friday.\n\nGold inched up 0.3%, reaching $2,400 per ounce, while Bitcoin dropped over 2% to $65,800, marking its second straight session of losses.\n\nTuesday’s Performance In Major US Indices, ETFs\n\nMajor Indices Price 1-day %chg Russell 2000 2,243.00 0.8% S&P 500 5,568.86 0.1% Dow Jones 40,386.54 -0.1% Nasdaq 100 19,778.53 -0.2%\n\nUpdated at 12:48 p.m. ET\n\nAccording to Benzinga Pro data:\n\nThe SPDR S&P 500 ETF Trust (NYSE:SPY) was flat at $554.92. The SPDR Dow Jones Industrial Average (NYSE:DIA) edged down 0.1% to $403.80. The tech-heavy Invesco QQQ Trust (ARCA: QQQ) fell 0.2% to $481.52. Sector-wise, the Financials Select Sector SPDR Fund (NYSE:XLF) outperformed, up by 0.4%, while the Energy Select Sector SPDR Fund (NYSE:XLE) lagged, down 1.4%.\n\nTuesday’s Stock Movers\n\nStocks reacting to company earnings were: Agilysys, Inc. (NASDAQ:AGYS), down over 5%, NXP Semiconductors N.V. (NASDAQ:NXPI) down over 9%, Medpace Holdings, Inc. (NASDAQ:MEDP) down over 17%, Coca-Cola Company (NYSE:KO), up 0.6%, Freeport-McMoRan Inc. (NYSE:FCX), down 2%, GE Aerospace (NYSE:GE), up over 7%, General Motors Company (NYSE:GM), down over 6%, Kimberly-Clark Corporation (NYSE:KMB), down over 4%, Comcast Corp. (NASDAQ:CMCSA), down over 2%, MSCI Inc. (NYSE:MSCI), up over 7%, Lockheed Martin Corporation (NYSE:LMT), up over 4%, Philip Morris International Inc. (NYSE:PM), up 2%, PulteGroup, Inc. (NYSE:PHM), down 0.5%, Quest Diagnostics Incorporated (NYSE:DGX), down over 4%, Spotify Technology S.A. (NYSE:SPOT), up over 10%, Polaris Inc. (NYSE:PII), down over 2%. Those reporting after the close include Alphabet, Capital One Financial Corporation (NYSE:COF), Chubb Limited (NYSE:CB), Mattel, Inc. (NASDAQ:MAT), Packaging Corporation of America (NYSE:PKG), Seagate Technology Holdings plc (NASDAQ:STX), Tesla, Texas Instruments, Inc. (NASDAQ:TXN) and Visa Inc. (NYSE:V).\n\nStory continues\n\nRead Next:\n\nTurn Trading Into The Ultimate Side Hustle Using Benzinga Tools In A Free Webinar\n\nImage created using artificial intelligence via Midjourney.\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nAPPLE (AAPL): Free Stock Analysis Report TESLA (TSLA): Free Stock Analysis Report\n\nThis article Small-Cap Gains Resume Ahead Of Major Tech Earnings; UPS Faces Worst Day Ever, Bitcoin Dips Below $66,000: What's Driving Markets Tuesday? originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.",
        "link": "https://finance.yahoo.com/news/small-cap-gains-resume-ahead-175332448.html",
        "symbols": [
            "0R08.LSE",
            "AGYS.US",
            "CB.US",
            "CMCSA.US",
            "COF.US",
            "DGX.US",
            "DIA.US",
            "DJI.INDX",
            "FCX.US",
            "GE.US",
            "GM.US",
            "GOOG.US",
            "GOOGL.US",
            "IWM.US",
            "KMB.US",
            "KO.US",
            "LMT.US",
            "MAT.US",
            "MEDP.US",
            "MSCI.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.955,
            "neg": 0.045,
            "neu": 0.874,
            "pos": 0.081
        }
    },
    {
        "date": "2024-07-23T17:18:00+00:00",
        "title": "Lockheed (LMT) Beats on Q2 Earnings, Ups '24 Sales View",
        "content": "Lockheed Martin Corporation LMT reported second-quarter 2024 adjusted earnings of $7.11 per share, which beat the Zacks Consensus Estimate of $6.45 by 10.2%. The bottom line also improved 5.6% from the year-ago quarter's recorded figure of $6.73.\n\nThe company reported GAAP earnings of $6.85 per share compared with $6.63 in the prior-year period.\n\nThe year-over-year bottom-line improvement can be attributed to solid sales growth and operating profit improvement from the second quarter of 2023.\n\nLockheed Martin Corporation Price, Consensus and EPS Surprise Lockheed Martin Corporation Price, Consensus and EPS Surprise\n\nLockheed Martin Corporation price-consensus-eps-surprise-chart | Lockheed Martin Corporation Quote\n\nOperational Highlights\n\nNet sales were $18.12 billion, which surpassed the Zacks Consensus Estimate of $17.10 billion by 6%. The top line also increased 8.6% from $16.69 billion reported in the year-ago quarter.\n\nThe year-over-year top-line improvement can be attributed to sales growth from each of the four company segments.\n\nBacklog\n\nLMT’s backlog as of Jun 30, 2024, was $158.34 billion compared with $159.37 billion at the end of first-quarter 2024.\n\nOur model projected a backlog worth $179.34 billion for the second quarter.\n\nThe Aeronautics segment accounted for $53.03 billion of the total backlog amount, while Rotary and Mission Systems contributed $37.36 billion. The Missiles and Fire Control segment contributed $34.83 billion, while the Space unit accounted for $33.11 billion.\n\nSegmental Performance\n\nAeronautics: Sales improved 5.8% year over year to $7.28 billion. This was driven by sales growth from a higher volume on sustainment, development and production contracts for F-35 program, and ramped-up production of the F-16 program.\n\nThe segment’s operating profit improved 4.6% year over year to $751 million. The operating margin, however, contracted 10 basis points (bps) to 10.3%.\n\nMissiles and Fire Control: Quarterly sales improved a solid 12.6% year over year to $3.10 billion. This was on account of higher sales from tactical and strike missile programs, driven by a production ramp-up of Guided Multiple Launch Rocket Systems (“GMLRS”) and Long Range Anti-Ship Missile (“LRASM”) programs.\n\nThe segment’s operating profit increased 21.3% year over year to $450 million. The operating margin of 14.5% expanded 100 bps from the year-ago quarter’s level.\n\nSpace: Sales rose 0.9% year over year to $3.20 billion due to higher sales from strategic and missile defense programs, driven by higher volume of the hypersonics and Fleet Ballistic Missile (“FBM”) programs.\n\nThe segment’s operating profit rose 10.9% to $346 million. The operating margin expanded 90 bps to 10.8%.\n\nStory continues\n\nRotary and Mission Systems: Quarterly revenues improved 16.7% to $4.55 billion on a year-over-year basis. This was primarily driven by higher net sales from integrated warfare systems and sensors programs. Higher net sales from Sikorsky helicopter programs also aided this segment’s top line.\n\nThe segment’s operating profit rose 9% to $495 million in the reported quarter. The operating margin, however, deteriorated 70 bps to 10.9% in the said time frame.\n\nFinancial Condition\n\nLockheed’s cash and cash equivalents totaled $2.52 billion at the end of second-quarter 2024 compared with $1.44 billion at the end of 2023.\n\nCash from operating activities amounted to $3.51 billion as of Jun 31, 2024, compared with $2.66 billion in the year-ago period.\n\nLong-term debt as of Jun 30, 2024, totaled $19.12 billion, up from $17.29 billion as of Dec 31, 2023.\n\n2024 Guidance\n\nLockheed has partially raised its financial guidance for 2024. The company now expects to generate revenues in the range of $70.50-$71.50 billion, up from the prior guidance of $68.50-$70.00 billion. The Zacks Consensus Estimate for revenues is pegged at $69.80 billion, which lies below the company’s updated guided range.\n\nLMT currently expects 2024 earnings per share (EPS) to be in the range of $26.10-$26.60, up from the earlier guidance of $25.65-$26.35. The Zacks Consensus Estimate for the company’s full-year EPS is pinned at $26.20, lower than the mid-point of the company’s updated guidance.\n\nLockheed still expects to generate free cash flow in the range of $6.00-$6.30 billion and incur capital expenditures of $1.75 billion during 2024.\n\nZacks Rank\n\nLMT currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nRecent Defense Releases\n\nHexcel Corporation HXL reported second-quarter 2024 earnings of 60 cents per share, which improved 20% from the year-ago quarter’s figure of 50 cents.\n\nThe company’s net sales totaled $500.4 million, which beat the Zacks Consensus Estimate of $482 million by 3.8%. The top line also witnessed an improvement of 10.1% from the year-ago quarter’s reported sales of $454.3 million.\n\nTextron Inc. TXT reported second-quarter 2024 adjusted earnings of $1.54 per share, which surpassed the Zacks Consensus Estimate of $1.49 by 3.4%. The bottom line also improved 5.5% from the year-ago quarter’s figure of $1.46.\n\nTXT reported total revenues of $3.53 billion, which missed the Zacks Consensus Estimate of $3.55 billion by 0.6%. However, the reported figure increased 3% from the year-ago quarter’s level of $3.42 billion.\r\n\r\nAAR Corp. AIR reported fourth-quarter fiscal 2024 adjusted earnings of 88 cents per share, which surpassed the Zacks Consensus Estimate of 86 cents by 2.3%. The bottom line improved 6% from the year-ago quarter’s level.\n\nIn the quarter under review, AAR generated net sales of $656.5 million. The reported figure missed the Zacks Consensus Estimate of $660 million by 0.6% but increased 18.7% from $553.3 million recorded in the year-ago quarter.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nAAR Corp. (AIR) : Free Stock Analysis Report\n\nHexcel Corporation (HXL) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-beats-q2-earnings-171800772.html",
        "symbols": [
            "0LF0.LSE",
            "0R3E.LSE",
            "AIR.US",
            "ARZ.F",
            "HXL.F",
            "HXL.STU",
            "HXL.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "TXT.BE",
            "TXT.DU",
            "TXT.F",
            "TXT.MU",
            "TXT.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.017,
            "neu": 0.887,
            "pos": 0.096
        }
    },
    {
        "date": "2024-07-23T13:30:22+00:00",
        "title": "Lockheed (LMT) Q2 Earnings: Taking a Look at Key Metrics Versus Estimates",
        "content": "Lockheed Martin (LMT) reported $18.12 billion in revenue for the quarter ended June 2024, representing a year-over-year increase of 8.6%. EPS of $7.11 for the same period compares to $6.73 a year ago.\n\nThe reported revenue represents a surprise of +5.88% over the Zacks Consensus Estimate of $17.12 billion. With the consensus EPS estimate being $6.45, the EPS surprise was +10.23%.\n\nWhile investors scrutinize revenue and earnings changes year-over-year and how they compare with Wall Street expectations to determine their next move, some key metrics always offer a more accurate picture of a company's financial health.\n\nAs these metrics influence top- and bottom-line performance, comparing them to the year-ago numbers and what analysts estimated helps investors project a stock's price performance more accurately.\n\nHere is how Lockheed performed in the just reported quarter in terms of the metrics most widely monitored and projected by Wall Street analysts:\n\nNet sales- Aeronautics: $7.28 billion compared to the $6.92 billion average estimate based on five analysts. The reported number represents a change of +5.9% year over year. Net sales- Rotary and Mission Systems: $4.55 billion versus the five-analyst average estimate of $4.01 billion. The reported number represents a year-over-year change of +16.7%. Net sales- Missiles and Fire Control: $3.10 billion versus the five-analyst average estimate of $2.91 billion. The reported number represents a year-over-year change of +12.6%. Net sales- Space: $3.20 billion compared to the $3.18 billion average estimate based on five analysts. The reported number represents a change of +0.9% year over year. Operating Profit- Aeronautics: $751 million versus $693.46 million estimated by five analysts on average. Operating Profit- Space: $346 million versus the five-analyst average estimate of $303.05 million. Operating Profit- Rotary and Mission Systems: $495 million versus $458.54 million estimated by five analysts on average. Operating Profit- Missiles and Fire Control: $450 million compared to the $370.33 million average estimate based on five analysts.\n\nView all Key Company Metrics for Lockheed here>>>\r\n\r\nShares of Lockheed have returned +0.7% over the past month versus the Zacks S&P 500 composite's +2% change. The stock currently has a Zacks Rank #3 (Hold), indicating that it could perform in line with the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nStory continues\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-q2-earnings-taking-133022314.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.98,
            "neg": 0.011,
            "neu": 0.897,
            "pos": 0.091
        }
    },
    {
        "date": "2024-07-23T12:40:05+00:00",
        "title": "Lockheed Martin (LMT) Surpasses Q2 Earnings and Revenue Estimates",
        "content": "Lockheed Martin (LMT) came out with quarterly earnings of $7.11 per share, beating the Zacks Consensus Estimate of $6.45 per share. This compares to earnings of $6.73 per share a year ago. These figures are adjusted for non-recurring items.\n\nThis quarterly report represents an earnings surprise of 10.23%. A quarter ago, it was expected that this aerospace and defense company would post earnings of $5.80 per share when it actually produced earnings of $6.33, delivering a surprise of 9.14%.\n\nOver the last four quarters, the company has surpassed consensus EPS estimates four times.\n\nLockheed , which belongs to the Zacks Aerospace - Defense industry, posted revenues of $18.12 billion for the quarter ended June 2024, surpassing the Zacks Consensus Estimate by 5.88%. This compares to year-ago revenues of $16.69 billion. The company has topped consensus revenue estimates four times over the last four quarters.\n\nThe sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the earnings call.\n\nLockheed shares have added about 4.7% since the beginning of the year versus the S&P 500's gain of 16.7%.\n\nWhat's Next for Lockheed?\n\nWhile Lockheed has underperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?\n\nThere are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.\n\nEmpirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power of earnings estimate revisions.\n\nAhead of this earnings release, the estimate revisions trend for Lockheed: mixed. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #3 (Hold) for the stock. So, the shares are expected to perform in line with the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\n\nIt will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is $6.43 on $17.37 billion in revenues for the coming quarter and $26.20 on $69.8 billion in revenues for the current fiscal year.\n\nStory continues\n\nInvestors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Aerospace - Defense is currently in the top 28% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.\n\nOne other stock from the same industry, RTX (RTX), is yet to report results for the quarter ended June 2024. The results are expected to be released on July 25.\n\nThis an aerospace and defense company is expected to post quarterly earnings of $1.29 per share in its upcoming report, which represents no change from the year-ago quarter. The consensus EPS estimate for the quarter has been revised 0.2% higher over the last 30 days to the current level.\n\nRTX's revenues are expected to be $19.31 billion, up 5.4% from the year-ago quarter.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-surpasses-q2-124005212.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.009,
            "neu": 0.888,
            "pos": 0.103
        }
    },
    {
        "date": "2024-07-23T12:17:00+00:00",
        "title": "Lockheed Martin Stock Jumps as Earnings Smash Expectations, Guidance Raised",
        "content": "The defense contractor’s second-quarter report smashed Wall Street forecasts. It also lifted earnings and revenue guidance.\n\nContinue reading",
        "link": "https://finance.yahoo.com/m/73817e48-42b0-3afd-99cf-27e2b54033c1/lockheed-martin-stock-jumps.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.128,
            "neg": 0,
            "neu": 0.919,
            "pos": 0.081
        }
    },
    {
        "date": "2024-07-23T11:48:41+00:00",
        "title": "Lockheed Martin (NYSE:LMT) Reports Bullish Q2, Full-Year Sales Guidance Is Optimistic",
        "content": "Lockheed Martin (NYSE:LMT) Reports Bullish Q2, Full-Year Sales Guidance Is Optimistic\n\nSecurity and Aerospace company Lockheed Martin (NYSE:LMT) reported Q2 CY2024 results exceeding Wall Street analysts' expectations , with revenue up 8.6% year on year to $18.12 billion. The company's full-year revenue guidance of $71 billion at the midpoint also came in 1.8% above analysts' estimates. It made a non-GAAP profit of $7.11 per share, improving from its profit of $6.73 per share in the same quarter last year.\n\nIs now the time to buy Lockheed Martin? Find out in our full research report.\n\nLockheed Martin (LMT) Q2 CY2024 Highlights:\n\nRevenue: $18.12 billion vs analyst estimates of $17.01 billion (6.5% beat) EPS (non-GAAP): $7.11 vs analyst estimates of $6.45 (10.3% beat) Gross Margin (GAAP): 11.8%, down from 12.5% in the same quarter last year Free Cash Flow of $1.51 billion, up 19.8% from the previous quarter Market Capitalization: $113.9 billion\n\n\"Over the past few months, Lockheed Martin's people, systems, and platforms have again demonstrated their ability to enhance security in Eastern Europe, the Red Sea, and the Middle East. From the PAC-3's critical role in air defense, to the Aegis Combat System with AI augmentation, to the F-35 with its advanced sensor and data management capabilities, our company has made major contributions to allied and partner defense. We continue to demonstrate the impact of our 21st Century Security® strategy by harnessing the latest digital technologies to continuously improve mission effectiveness, strengthening and scaling the defense production system, and expanding industrial cooperation among our allies and partners. Consequently, demand for our defense technology solutions remains robust, with a backlog of nearly $160 billion, greater than two times annual revenue,\" said Lockheed Martin Chairman, President and CEO Jim Taiclet.\n\nHeadquartered in Maryland, Famous for the F-35 aircraft, Lockheed Martin (NYSE:LMT) specializes in defense, space, homeland security, and information technology products.\n\nDefense Contractors\n\nDefense contractors typically require technical expertise and government clearance. Companies in this sector can also enjoy long-term contracts with government bodies, leading to more predictable revenues. Combined, these factors create high barriers to entry and can lead to limited competition. Lately, geopolitical tensions–whether it be Russia’s invasion of Ukraine or China’s aggression towards Taiwan–highlight the need for defense spending. On the other hand, demand for these products can ebb and flow with defense budgets and even who is president, as different administrations can have vastly different ideas of how to allocate federal funds.\n\nStory continues\n\nSales Growth\n\nExamining a company's long-term performance can provide clues about its business quality. Any business can put up a good quarter or two, but the best consistently grow over the long haul. Unfortunately, Lockheed Martin's 4.3% annualized revenue growth over the last five years was sluggish. This shows it failed to expand in any major way and is a rough starting point for our analysis. Lockheed Martin Total Revenue\n\nWe at StockStory place the most emphasis on long-term growth, but within industrials, a half-decade historical view may miss cycles, industry trends, or a company capitalizing on catalysts such as a new contract win or a successful product line. Lockheed Martin's annualized revenue growth of 5.2% over the last two years aligns with its five-year trend, suggesting its demand was consistently weak.\n\nThis quarter, Lockheed Martin reported solid year-on-year revenue growth of 8.6%, and its $18.12 billion of revenue outperformed Wall Street's estimates by 6.5%. Looking ahead, Wall Street expects revenue to remain flat over the next 12 months, a deceleration from this quarter.\n\nUnless you’ve been living under a rock, it should be obvious by now that generative AI is going to have a huge impact on how large corporations do business. While Nvidia and AMD are trading close to all-time highs, we prefer a lesser-known (but still profitable) semiconductor stock benefitting from the rise of AI. Click here to access our free report on our favorite semiconductor growth story.\n\nOperating Margin\n\nOperating margin is an important measure of profitability. It’s the portion of revenue left after accounting for all core expenses–everything from the cost of goods sold to advertising and wages. Operating margin is also useful for comparing profitability across companies with different levels of debt and tax rates because it excludes interest and taxes.\n\nLockheed Martin has been an optimally run company over the last five years. It was one of the more profitable businesses in the industrials sector, boasting an average operating margin of 13%.\n\nAnalyzing the trend in its profitability, Lockheed Martin's annual operating margin decreased by 1.5 percentage points over the last five years. Even though its margin is still high, shareholders will want to see Lockheed Martin become more profitable in the future. Lockheed Martin Operating Margin (GAAP)\n\nIn Q2, Lockheed Martin generated an operating profit margin of 11.9%, in line with the same quarter last year. This indicates the company's overall cost structure has been relatively stable.\n\nEPS\n\nAnalyzing long-term revenue trends tells us about a company's historical growth, but the long-term change in its earnings per share (EPS) points to the profitability of that growth–for example, a company could inflate its sales through excessive spending on advertising and promotions.\n\nLockheed Martin's EPS grew at an unimpressive 6.5% compounded annual growth rate over the last five years. This performance was better than its 4.3% annualized revenue growth but doesn't tell us much about its day-to-day operations because its operating margin didn't expand. Lockheed Martin EPS (Adjusted)\n\nDiving into the nuances of Lockheed Martin's earnings can give us a better understanding of its performance. A five-year view shows that Lockheed Martin has repurchased its stock, shrinking its share count by 15.6%. This tells us its EPS outperformed its revenue not because of increased operational efficiency but financial engineering, as buybacks boost per share earnings. Lockheed Martin Diluted Shares Outstanding\n\nLike with revenue, we also analyze EPS over a shorter period to see if we are missing a change in the business. For Lockheed Martin, its two-year annual EPS growth of 11.9% was higher than its five-year trend. This acceleration made it one of the faster-growing industrials companies in recent history.\n\nIn Q2, Lockheed Martin reported EPS at $7.11, up from $6.73 in the same quarter last year. This print easily cleared analysts' estimates, and shareholders should be content with the results. Over the next 12 months, Wall Street expects Lockheed Martin to perform poorly. Analysts are projecting its EPS of $28.11 in the last year to shrink by 5.3% to $26.61.\n\nKey Takeaways from Lockheed Martin's Q2 Results\n\nWe were impressed by how significantly Lockheed Martin blew past analysts' revenue and EPS expectations this quarter. We were also glad its full-year revenue guidance came in higher than Wall Street's estimates. Zooming out, we think this was a fantastic quarter that should have shareholders cheering. The stock remained flat at $478 immediately following the results.\n\nLockheed Martin may have had a good quarter, but does that mean you should invest right now? When making that decision, it's important to consider its valuation, business qualities, as well as what has happened in the latest quarter. We cover that in our actionable full research report which you can read here, it's free.",
        "link": "https://finance.yahoo.com/news/lockheed-martin-nyse-lmt-reports-114841127.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.031,
            "neu": 0.8,
            "pos": 0.169
        }
    },
    {
        "date": "2024-07-23T11:30:43+00:00",
        "title": "Lockheed Martin lifts 2024 sales target on fighter jet, missile demand",
        "content": "By Pratyush Thakur and Mike Stone\n\n(Reuters) - U.S. defense company Lockheed Martin raised its annual sales target for the first time this year on Tuesday, following the unexpected resumption of deliveries of its F-35 aircraft after Pentagon began accepting the jets last week.\n\nThe U.S. resumed taking F-35 deliveries after a months-long pause due to delays on its software upgrade. Lockheed has been upgrading the jets under Technology Refresh 3, or TR-3 program, that gives the F-35 better displays and processing power.\n\nThe delivery resumption includes incomplete software upgrade and Pentagon will withhold some payment, the details of which is unknown, until the remaining enhancements are finished.\n\nADVERTISEMENT\n\nLockheed's F-35 is the world's largest defense program and contributes around 30% of the company's revenue.\n\n\"The F-35 remains a top priority, and we recently delivered the first TR-3-configured aircraft to the customer and anticipate deliveries for 2024 to meet our expected range of 75-110 F-35s,\" said CEO Jim Taiclet.\n\nTR-3 involves both hardware and software improvements and is seen as a pillar of a wider upgrade to the stealth jet known as Block 4. The enhancements \"are critical steps in ensuring the F-35 remains the most advanced fighter aircraft in the world and the key air vehicle node in the DoD's joint all domain architecture\", Taiclet said.\n\nLockheed, however, does not expect the full tech refresh package to be ready for months.\n\nIt expects 2024 sales to be between $70.5 billion and $71.5 billion, compared with its previous forecast of $68.5 billion to $70 billion.\n\nThe company also benefited from a $95-billion additional funding, which includes aid for Ukraine and Israel, approved by Congress.\n\nCombat in Ukraine and Israel has consumed high volumes of munitions, including Lockheed-made Patriot air defense interceptors, used to shoot down incoming hostile missiles.\n\nLockheed posted net income of $6.85 per share for the second quarter, compared with $6.63 per share a year earlier.\n\nTotal quarterly sales rose 8.5% to $18.12 billion.\n\n(Reporting by Pratyush Thakur in Bengaluru; Editing by Shilpi Majumdar)",
        "link": "https://ca.finance.yahoo.com/news/lockheed-martin-lifts-2024-sales-113043955.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.F",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.903,
            "neg": 0.039,
            "neu": 0.875,
            "pos": 0.085
        }
    },
    {
        "date": "2024-07-23T11:30:00+00:00",
        "title": "Lockheed Boosts Forecast on Strong Fighter Jet, Radar Sales",
        "content": "(Bloomberg) -- Lockheed Martin Corp. raised its profit and revenue guidance as demand for its fighter jet and radar programs drove sales above expectations in the second quarter.\n\nMost Read from Bloomberg\n\nHarris Has Enough Delegates to Clinch Nomination for President Trump Risks Getting Tables Turned on Him With New 2024 Adversary Wiz Rejects Google’s $23 Billion Offer, Seeks IPO Instead Harris Wins Soros Backing While Other Billionaire Donors Want an Open Contest A Brief History of Kamala Harris and Her Politics\n\nThe defense company now expects revenue as high as $71.5 billion this year, up from as much as $70 billion and above the average analyst estimate of $69.8 billion, according to a statement Tuesday. Lockheed also raised its earnings per share view to as much as $26.60, up from $26.35.\n\nDemand for its key F-35 and F-16 jet programs as well as its helicopter and radar offerings saw Lockheed bring in second-quarter revenue of $18.1 billion, well above the average expectation of $17.1 billion.\n\n“Over the past few months, Lockheed Martin’s people, systems, and platforms have again demonstrated their ability to enhance security in Eastern Europe, the Red Sea, and the Middle East,” Chief Executive Officer Jim Taiclet said in the Tuesday statement.\n\nLockheed last week resumed US deliveries of the F-35, which is projected to cost more than $1.8 trillion over the course of its life cycle, after shipments were halted due to delayed upgrades. The jets were waiting on a Texas tarmac and at risk of weather damage.\n\nLockheed said Tuesday that the F-35 remains a top priority and it expects to deliver between 75 and 110 this year.\n\nWhile all four of Lockheed’s segments beat analyst expectations in the second quarter, Lockheed’s space revenue rose just 1% as demand for both government and civil space programs fell.\n\nMost Read from Bloomberg Businessweek\n\nThe $12,000 Harvard Class Celebrities Are Fighting to Get Into Airbnb Hosts Want Guests to Come to Them Directly The Zombie Mall King Doesn’t Want to Be a Bottom-Feeder Forever Why Is the US Deficit So Big? Depends on Who You Ask Five Questions With Apollo Global Co-Founder Josh Harris\n\n©2024 Bloomberg L.P.",
        "link": "https://finance.yahoo.com/news/lockheed-boosts-forecast-strong-fighter-113000593.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.153,
            "neg": 0.063,
            "neu": 0.865,
            "pos": 0.072
        }
    },
    {
        "date": "2024-07-23T11:29:00+00:00",
        "title": "Lockheed Martin Reports Second Quarter 2024 Financial Results",
        "content": "Net sales of $18.1 billion, an increase of 9% year over year Net earnings of $1.6 billion, or $6.85 per share, inclusive of net non-operational charges of $79 million ($63 million, or $0.26 per share, after-tax) Cash from operations of $1.9 billion and free cash flow of $1.5 billion $1.6 billion of cash returned to shareholders through dividends and share repurchases  2024 outlook increased for sales, segment operating profit and earnings per share\n\nBETHESDA, Md., July 23, 2024 /PRNewswire/ -- Lockheed Martin Corporation [NYSE: LMT] today reported second quarter 2024 net sales of $18.1 billion, compared to $16.7 billion in the second quarter of 2023. Net earnings in the second quarter of 2024 were $1.6 billion, or $6.85 per share, compared to $1.7 billion, or $6.63 per share, in the second quarter of 2023. Cash from operations was $1.9 billion in the second quarter of 2024, compared to $1.1 billion in the second quarter of 2023. Free cash flow was $1.5 billion in the second quarter of 2024, compared to $771 million in the second quarter of 2023. Lockheed Martin Logo. (PRNewsFoto/Lockheed Martin)\n\n\"Over the past few months, Lockheed Martin's people, systems, and platforms have again demonstrated their ability to enhance security in Eastern Europe, the Red Sea, and the Middle East. From the PAC-3's critical role in air defense, to the Aegis Combat System with AI augmentation, to the F-35 with its advanced sensor and data management capabilities, our company has made major contributions to allied and partner defense. We continue to demonstrate the impact of our 21st Century Security® strategy by harnessing the latest digital technologies to continuously improve mission effectiveness, strengthening and scaling the defense production system, and expanding industrial cooperation among our allies and partners. Consequently, demand for our defense technology solutions remains robust, with a backlog of nearly $160 billion, greater than two times annual revenue,\" said Lockheed Martin Chairman, President and CEO Jim Taiclet.\n\n\"We delivered strong second quarter financial results, with year-over-year growth of 9% in sales and 10% in segment operating profit, and free cash flow generation in excess of $1.5 billion. The year-to-date performance gives us confidence to raise our 2024 full-year outlook for sales, segment operating profit, and earnings per share. Operationally, the F-35 remains a top priority, and we recently delivered the first Technology Refresh 3-configured aircraft to the customer and anticipate deliveries for 2024 to meet our expected range of 75-110 F-35s. The TR-3 hardware and software update enables step function improvement in capability to our airmen, sailors, and marines, as well as to our partner and allied nations.  This foundational upgrade and the follow-on series of enhancements, known as Block 4, are critical steps in ensuring the F-35 remains the most advanced fighter aircraft in the world and the key air vehicle node in the DoD's joint all domain architecture.\"\n\nStory continues\n\nSummary Financial Results\n\nThe following table presents the company's summary financial results.\n\n(in millions, except per share data) Quarters Ended Six Months Ended June 30,\n\n2024 June 25,\n\n2023 June 30,\n\n2024 June 25,\n\n2023 Net sales $           18,122 $           16,693 $           35,317 $           31,819 Business segment operating profit1 $             2,042 $             1,855 $             3,787 $             3,537 Unallocated items FAS/CAS operating adjustment 406 416 812 831 Impairment and severance charges2 (87) — (87) — Intangible asset amortization expense (61) (62) (122) (124) Other, net (152) (74) (213) (72) Total unallocated items 106 280 390 635 Consolidated operating profit $             2,148 $             2,135 $             4,177 $             4,172 Net earnings3 $             1,641 $             1,681 $             3,186 $             3,370 Diluted earnings per share3 $               6.85 $               6.63 $             13.24 $             13.24 Cash from operations4 $             1,876 $             1,100 $             3,511 $             2,664 Capital expenditures (370) (329) (748) (623) Free cash flow1,4 $             1,506 $                771 $             2,763 $             2,041 1 Business segment operating profit and free cash flow are non-GAAP measures. See the \"Use of Non-GAAP Financial Measures\" section of this news release for more information. 2 Impairment and severance charges for the quarter ended June 30, 2024 include $87 million ($69 million, or $0.29 per share, after-tax) trademark and fixed asset impairments as well as severance costs at the company's RMS business segment. 3 Net earnings for the quarter ended June 30, 2024 include $79 million ($63 million, or $0.26 per share, after-tax) of net non-operational charges, including Impairment and severance charges described above. See \"Adjusted earnings before income taxes, net earnings and diluted EPS\" table for further details. 4 See the \"Cash Flows and Capital Deployment Activities\" section of this news release for more information.\n\n2024 Financial Outlook\n\nThe following table and other sections of this news release contain forward-looking statements, which are based on the company's current expectations. Actual results may differ materially from those projected. It is the company's practice not to incorporate adjustments into its financial outlook for proposed or potential acquisitions, divestitures, ventures, pension risk transfer transactions, financing transactions, changes in law, or new accounting standards until such items have been consummated, enacted or adopted. For additional factors that may impact the company's actual results, refer to the \"Forward-Looking Statements\" section in this news release.\n\n(in millions, except per share data) Current Update April 2024 Net sales $70,500 - $71,500 $68,500 - $70,000 Business segment operating profit1 $7,350 - $7,500 $7,175 - $7,375 Total FAS/CAS pension adjustment ~$1,685 ~$1,685 Diluted earnings per share2 $26.10 - $26.60 $25.65 - $26.35 Cash from operations $7,750 - $8,050 $7,750 - $8,050 Capital expenditures ~$1,750 ~$1,750 Free cash flow1 $6,000 - $6,300 $6,000 - $6,300 1 Business segment operating profit and free cash flow are non-GAAP measures. See the \"Use of Non-GAAP Financial Measures\" section of this news release for more information. 2 Although the company typically does not update its outlook for proposed changes in law, the above includes the effect of IRS Notice 2023-63 confirming that certain expenditures incurred in the performance of cost-type contracts are not subject to capitalization for tax purposes. The company believes incorporating the clarification from the Notice more accurately reflects its expectations because the Notice describes the tax treatment of certain expenditures in accordance with the company's analysis of the Internal Revenue Code.\n\nCash Flows and Capital Deployment Activities\n\nThe increase in operating and free cash flows in the second quarter of 2024 compared to the same period in 2023 was primarily due to improvements in working capital (defined as receivables, contract assets, and inventories less accounts payable and contract liabilities) and the timing of federal tax payments. Improvements in working capital were driven by volume and timing of milestone payments impacting both contract liabilities and contract assets on classified programs at the company's Space business segment, decreases in inventory due to deliveries of S-70 helicopters at Sikorsky at the company's RMS business segment, and production and billing cycle timing impacting receivables (primarily F-35 at Aeronautics and Integrated Air and Missile Defense at MFC, partially offset by Integrated warfare systems and sensors at RMS). These improvements were partially offset by the timing of cash payments related to accounts payable (primarily Aeronautics).\n\nThe company's cash activities in the second quarter of 2024, included the following:\n\npaying cash dividends of $752 million; paying $850 million to repurchase 1.9 million shares; and making a long-term debt scheduled repayment of $168 million.\n\nSegment Results\n\nThe company operates in four business segments organized based on the nature of products and services offered: Aeronautics, Missiles and Fire Control (MFC), Rotary and Mission Systems (RMS) and Space. The following table presents summary operating results of the company's business segments and reconciles these amounts to the company's consolidated financial results.\n\n(in millions) Quarters Ended Six Months Ended June 30,\n\n2024 June 25,\n\n2023 June 30,\n\n2024 June 25,\n\n2023 Net sales Aeronautics $            7,277 $            6,875 $          14,122 $          13,144 Missiles and Fire Control 3,102 2,755 6,095 5,143 Rotary and Mission Systems 4,548 3,897 8,636 7,407 Space  3,195 3,166 6,464 6,125 Total net sales $          18,122 $          16,693 $          35,317 $          31,819 Operating profit Aeronautics $              751 $              718 $            1,430 $            1,393 Missiles and Fire Control 450 371 761 748 Rotary and Mission Systems  495 454 925 804 Space  346 312 671 592 Total business segment operating\n\nprofit 2,042 1,855 3,787 3,537 Unallocated items FAS/CAS operating adjustment  406 416 812 831 Impairment and severance charges  (87) — (87) — Intangible asset amortization\n\nexpense (61) (62) (122) (124) Other, net (152) (74) (213) (72) Total unallocated items 106 280 390 635 Total consolidated operating profit $            2,148 $            2,135 $            4,177 $            4,172\n\nFor information on factors impacting comparability of the company's segment sales, operating profit and operating margins, see \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in the company's Annual Report on Form 10-K for the year ended Dec. 31, 2023.\n\nThe company's consolidated net favorable profit booking rate adjustments represented approximately 21% and 20% of total segment operating profit in the quarters ended June 30, 2024 and June 25, 2023. During the quarter ended June 25, 2023, we recognized a favorable profit adjustment of $65 million on an international surveillance and control program due to the positive resolution of a contractual matter, and an unfavorable profit adjustment of $100 million on the Canadian Maritime Helicopter Program (CMHP) as a result of increased costs and lower than planned revenues.\n\nAeronautics\n\n(in millions) Quarters Ended Six Months Ended June 30,\n\n2024 June 25,\n\n2023 June 30,\n\n2024 June 25,\n\n2023 Net sales $     7,277 $     6,875 $     14,122 $     13,144 Operating profit 751 718 1,430 1,393 Operating margin 10.3 % 10.4 % 10.1 % 10.6 %\n\nAeronautics' net sales in the second quarter of 2024 increased $402 million, or 6%, compared to the same period in 2023. The increase was primarily attributable to higher net sales of $335 million on the F-35 program due to higher volume on sustainment, development and production contracts; and $105 million on the F-16 program due to the ramp up on production.\n\nAeronautics' operating profit in the second quarter of 2024 increased $33 million, or 5%, compared to the same period in 2023. The increase in operating profit was attributable to $35 million from higher volume and program ramp up described above and $25 million from favorable contract mix across the portfolio, partially offset by $25 million of lower profit booking rate adjustments. The decrease in profit booking rate adjustments was due to a $45 million unfavorable profit adjustment on a classified program because of higher than anticipated costs to maintain program objectives, partially offset by higher net favorable profit adjustments across the portfolio.\n\nMissiles and Fire Control\n\n(in millions) Quarters Ended Six Months Ended June 30,\n\n2024 June 25,\n\n2023 June 30,\n\n2024 June 25,\n\n2023 Net sales $         3,102 $         2,755 $        6,095 $        5,143 Operating profit 450 371 761 748 Operating margin 14.5 % 13.5 % 12.5 % 14.5 %\n\nMFC's net sales in the second quarter of 2024 increased $347 million, or 13%, compared to the same period in 2023. The increase was primarily attributable to higher net sales of $320 million for tactical and strike missile programs due to production ramp up on Guided Multiple Launch Rocket Systems (GMLRS) and Long Range Anti-Ship Missile (LRASM) programs.\n\nMFC's operating profit in the second quarter of 2024 increased $79 million, or 21%, compared to the same period in 2023, due to $80 million of higher profit booking rate adjustments which primarily reflects higher favorable profit booking rate adjustments on PAC-3 and Apache due to better than anticipated cost performance. Additionally, operating profit increased $30 million from production ramp up described above, offset by $30 million decrease from contract mix.\n\nRotary and Mission Systems\n\n(in millions) Quarters Ended Six Months Ended June 30,\n\n2024 June 25,\n\n2023 June 30,\n\n2024 June 25,\n\n2023 Net sales $     4,548 $     3,897 $        8,636 $        7,407 Operating profit 495 454 925 804 Operating margin 10.9 % 11.6 % 10.7 % 10.9 %\n\nRMS' net sales in the second quarter of 2024 increased $651 million, or 17%, compared to the same period in 2023. The increase was primarily attributable to higher net sales of $420 million on integrated warfare systems and sensors (IWSS) programs due to higher volume on radar programs and the Canadian Surface Combatant (CSC) program, and new program ramp up within the laser systems portfolio; and $160 million for Sikorsky helicopter programs due to higher production volume on Black Hawk and CH-53K programs.\n\nRMS' operating profit in the second quarter of 2024 increased $41 million, or 9%, compared to the same period in 2023. The increase in operating profit was attributable to $70 million from higher volume described above, partially offset by $20 million of lower profit booking rate adjustments. The decrease in profit booking rate adjustments was due to unfavorable profit adjustments on Seahawk and Black Hawk production programs as a result of increased costs, partially offset by the net impact in the second quarter of 2023 of both a $65 million favorable profit adjustment on an international surveillance and control program and a $100 million unfavorable profit adjustment on the Canadian Maritime Helicopter Program (CMHP) that did not recur in the second quarter of 2024.\n\nSpace\n\n(in millions) Quarters Ended Six Months Ended June 30,\n\n2024 June 25,\n\n2023 June 30,\n\n2024 June 25,\n\n2023 Net sales $     3,195 $     3,166 $        6,464 $        6,125 Operating profit 346 312 671 592 Operating margin 10.8 % 9.9 % 10.4 % 9.7 %\n\nSpace's net sales in the second quarter of 2024 increased $29 million, or 1%, compared to the same period in 2023. The increase was primarily attributable to higher net sales of $110 million for strategic and missile defense programs due to higher volume on the hypersonics and Fleet Ballistic Missile (FBM) programs; partially offset by lower net sales of $50 million for national security space due to lower volume on classified programs and $45 million for commercial civil space due to lower volume on the Orion program.\n\nSpace's operating profit in the second quarter of 2024 increased $34 million, or 11%, compared to the same period in 2023. The increase in operating profit was attributable to $20 million from favorable contract mix across the portfolio and $20 million of higher profit booking rate adjustments. The increase in profit booking rate adjustments was due to higher favorable profit adjustments on the FBM program.\n\nTotal equity earnings/(losses) (primarily ULA) represented approximately $10 million, or 3% of Space's operating profit in the second quarter of 2024, compared to approximately $20 million, or 6% for the same period in 2023.\n\nIncome Taxes\n\nThe company's effective income tax rate was 15.8% and 16.2% for the quarters ended June 30, 2024 and June 25, 2023. The rates for both periods benefited from research and development tax credits, tax deductions for foreign derived intangible income and dividends paid to the company's defined contribution plans with an employee stock ownership plan feature.\n\nUse of Non-GAAP Financial Measures\n\nThis news release contains the following non-generally accepted accounting principles (non-GAAP) financial measures (as defined by U.S. Securities and Exchange Commission (SEC) Regulation G). While management believes that these non-GAAP financial measures may be useful in evaluating the financial performance of the company, this information should be considered supplemental to, and not a substitute for, financial information prepared in accordance with GAAP. In addition, the company's definitions for non-GAAP financial measures may differ from similarly titled measures used by other companies or analysts.\n\nBusiness segment operating profit\n\nBusiness segment operating profit represents operating profit from the company's business segments before unallocated income and expense. This measure is used by the company's senior management in evaluating the performance of its business segments and is a performance goal in the company's annual incentive plan. Business segment operating margin is calculated by dividing business segment operating profit by sales. The table below reconciles the non-GAAP measure business segment operating profit with the most directly comparable GAAP financial measure, consolidated operating profit.\n\n(in millions) Current Update April 2024 Business segment operating profit (non-GAAP) $7,350 - $7,500 $7,175 - $7,375 FAS/CAS operating adjustment1 ~1,625 ~1,625 Intangible asset amortization expense ~(245) ~(245) Other, net2 ~(530) ~(400) Consolidated operating profit (GAAP) ~$8,200 - 8,350 ~$8,155 - $8,355 1 Reflects the amount by which expected total CAS pension cost of $1.7 billion, exceeds the expected FAS pension service cost and excludes expected non-service FAS pension income. Refer to the supplemental table \"Selected Financial Data\" included in this news release for a detail of the FAS/CAS operating adjustment. 2 Includes impairment and severance charges of $87 million ($69 million, or $0.29 per share, after-tax) for trademark and fixed asset impairments as well as severance costs recorded during the quarter ended June 30, 2024.\n\nFree cash flow\n\nFree cash flow is cash from operations less capital expenditures. The company's capital expenditures are comprised of equipment and facilities infrastructure and information technology (inclusive of costs for the development or purchase of internal-use software that are capitalized). The company uses free cash flow to evaluate its business performance and overall liquidity and it is a performance goal in the company's annual and long-term incentive plans. The company believes free cash flow is a useful measure for investors because it represents the amount of cash generated from operations after reinvesting in the business and that may be available to return to stockholders and creditors (through dividends, stock repurchases and debt repayments) or available to fund acquisitions or other investments. The entire free cash flow amount is not necessarily available for discretionary expenditures, however, because it does not account for certain mandatory expenditures, such as the repayment of maturing debt and future pension contributions.\n\nAdjusted earnings before income taxes; adjusted net earnings and adjusted diluted EPS\n\nEarnings before income taxes, net earnings and diluted earnings per share (EPS) were impacted by certain non-operational items for all periods. Management believes the presentation of these measures adjusted for the impacts of these non-operational items is useful to investors in understanding the company's underlying business performance and comparing performance from period to period. The tax effects related to each adjustment that impacted earnings before income taxes are based on a blended tax rate that combines the federal statutory rate of 21% plus an estimated state tax rate.\n\nThe table below shows the impact to earnings before income taxes, net earnings and diluted EPS for certain non-operational items:\n\n(in millions, except per share data) Quarters Ended June 30,\n\n2024 June 25,\n\n2023 Earnings Before\r\nIncome Taxes Net Earnings Diluted EPS Earnings Before\r\nIncome Taxes Net Earnings Diluted EPS As Reported (GAAP) $     1,948 $     1,641 $       6.85 $     2,006 $     1,681 $       6.63 Impairment and severance charges 87 69 0.29 — — — Mark-to-market investment (gains) losses (8) (6) (0.03) 28 21 0.08 Debt transactions costs — — — 6 5 0.02 Total Adjustments 79 63 0.26 34 26 0.10 As Adjusted (Non-GAAP) $     2,027 $     1,704 $       7.11 $     2,040 $     1,707 $       6.73\n\nWebcast and Conference Call Information\n\nLockheed Martin Corporation will webcast live the earnings results conference call (listen-only mode) on Tuesday, July 23, 2024, at 11:00 a.m. ET on the Lockheed Martin Investor Relations website at www.lockheedmartin.com/investor. The accompanying presentation slides and relevant financial charts are also available at www.lockheedmartin.com/investor.\n\nFor additional information, visit the company's website: www.lockheedmartin.com.\n\nAbout Lockheed Martin\n\nLockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at www.lockheedmartin.com.\n\nForward-Looking Statements\n\nThis news release contains statements that, to the extent they are not recitations of historical fact, constitute forward-looking statements within the meaning of the federal securities laws, and are based on Lockheed Martin's current expectations and assumptions. The words \"believe,\" \"estimate,\" \"anticipate,\" \"project,\" \"intend,\" \"expect,\" \"plan,\" \"outlook,\" \"scheduled,\" \"forecast\" and similar expressions are intended to identify forward-looking statements. These statements are not guarantees of future performance and are subject to risks and uncertainties. Actual results may differ materially due to factors such as:\n\nthe company's reliance on contracts with the U.S. Government, which are dependent on U.S. Government funding and can be terminated for convenience, and the company's ability to negotiate favorable contract terms; budget uncertainty, the risk of future budget cuts, the impact of continuing resolution funding mechanisms and the debt ceiling and the potential for government shutdowns and changing funding and acquisition priorities; risks related to the development, production, sustainment, performance, schedule, cost and requirements of complex and technologically advanced programs, including the F-35 program; planned production rates and orders for significant programs, compliance with stringent performance and reliability standards, and materials availability, including government furnished equipment; the timing of contract awards or delays in contract definitization as well as the timing and customer acceptance of product deliveries and performance milestones; the company's ability to recover costs under U.S. Government contracts and the mix of fixed-price and cost-reimbursable contracts; customer procurement policies that shift risk to contractors, including competitively bid programs with fixed-price development work or follow-on production options or other financial risks; and the impact of investments, cost overruns or other cost pressures and performance issues on fixed price contracts; changes in procurement and other regulations and policies affecting the company's industry, export of its products, cost allowability or recovery, preferred contract type, and performance and progress payments policy; performance and financial viability of key suppliers, teammates, joint ventures (including United Launch Alliance), joint venture partners, subcontractors and customers; economic, industry, business and political conditions including their effects on governmental policy; the impact of inflation and other cost pressures; the impact of pandemics and epidemics on the company's business and financial results, including supply chain disruptions and delays, employee absences, and program delays; government actions that prevent the sale or delivery of the company's products (such as delays in approvals for exports requiring Congressional notification); trade policies or sanctions (including Chinese sanctions on the company or its suppliers, teammates or partners, U.S. Government sanctions on Türkish entities and persons, indirect effects of sanctions on Russia to the company's supply chain); the company's success expanding into and doing business in adjacent markets and internationally and the risks posed by international sales; changes in foreign national priorities and foreign government budgets and planned orders, including potential effects from fluctuations in currency exchange rates; the competitive environment for the company's products and services, including competition from startups and non-traditional defense contractors; the company's ability to develop and commercialize new technologies and products, including emerging digital and network technologies and capabilities; the company's ability to benefit fully from or adequately protect its intellectual property rights; the company's ability to attract and retain a highly skilled workforce, the impact of work stoppages or other labor disruptions; cyber or other security threats or other disruptions faced by the company or its suppliers; the company's ability to implement and continue, and the timing and impact of, capitalization changes such as share repurchases, dividend payments and financing transactions; the accuracy of the company's estimates and projections; changes in pension plan assumptions and actual returns on pension assets; cash funding requirements and pension risk transfers and associated settlement charges; realizing the anticipated benefits of acquisitions or divestitures, investments, joint ventures, teaming arrangements or internal reorganizations, and market volatility affecting the fair value of investments that are marked to market; the company's efforts to increase the efficiency of its operations and improve the affordability of its products and services, including through digital transformation and cost reduction initiatives; the risk of an impairment of the company's assets, including the potential impairment of goodwill and intangibles; the availability and adequacy of the company's insurance and indemnities; impacts of climate change and compliance with laws, regulations, policies, and customer requirements in response to climate change concerns; changes in accounting, U.S. or foreign tax, export or other laws, regulations, and policies and their interpretation or application, and changes in the amount or reevaluation of uncertain tax positions; and the outcome of legal proceedings, bid protests, environmental remediation efforts, audits, government investigations or government allegations that the company has failed to comply with law, other contingencies and U.S. Government identification of deficiencies in its business systems.\n\nThese are only some of the factors that may affect the forward-looking statements contained in this news release. For a discussion identifying additional important factors that could cause actual results to differ materially from those anticipated in the forward-looking statements, see the company's filings with the U.S. Securities and Exchange Commission including, but not limited to, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and \"Risk Factors\" in the company's most recent Annual Report on Form 10-K and subsequent quarterly reports on Form 10-Q. The company's filings may be accessed through the Investor Relations page of its website, www.lockheedmartin.com/investor, or through the website maintained by the SEC at www.sec.gov.\n\nThe company's actual financial results likely will be different from those projected due to the inherent nature of projections. Given these uncertainties, forward-looking statements should not be relied on in making investment decisions. The forward-looking statements contained in this news release speak only as of the date of its filing. Except where required by applicable law, the company expressly disclaims a duty to provide updates to forward-looking statements after the date of this news release to reflect subsequent events, changed circumstances, changes in expectations, or the estimates and assumptions associated with them. The forward-looking statements in this news release are intended to be subject to the safe harbor protection provided by the federal securities laws.\n\nLockheed Martin Corporation\n\nConsolidated Statements of Earnings1\n\n(unaudited; in millions, except per share data) Quarters Ended Six Months Ended June 30,\r\n2024 June 25,\r\n2023 June 30,\r\n2024 June 25,\r\n2023 Net sales $       18,122 $       16,693 $       35,317 $       31,819 Cost of sales 2 (15,992) (14,603) (31,194) (27,683) Gross profit 2,130 2,090 4,123 4,136 Other income, net 18 45 54 36 Operating profit 2,148 2,135 4,177 4,172 Interest expense (261) (223) (516) (425) Non-service FAS pension income 15 111 31 221 Other non-operating income (expense), net 46 (17) 91 32 Earnings before income taxes 1,948 2,006 3,783 4,000 Income tax expense (307) (325) (597) (630) ...\n\nNet earnings $         1,641 $         1,681 $         3,186 $         3,370 Effective tax rate 15.8 % 16.2 % 15.8 % 15.8 % Earnings per common share Basic $           6.87 $           6.65 $         13.29 $         13.28 Diluted $           6.85 $           6.63 $         13.24 $         13.24 Weighted average shares outstanding Basic 238.9 252.8 239.8 253.7 Diluted 239.6 253.6 240.6 254.6 Common shares reported in stockholders'\n\nequity at end of period 237 251 1 The company closes its books and records on the last Sunday of the calendar quarter to align its financial closing with its business processes, which was on June 30, for the second quarter of 2024 and June 25, for the second quarter of 2023. The consolidated financial statements and tables of financial information included herein are labeled based on that convention. This practice only affects interim periods, as the company's fiscal year ends on Dec. 31. 2 In the second quarter of 2024, the company recognized trademark and fixed asset impairments as well as severance costs.\n\nLockheed Martin Corporation\n\nBusiness Segment Summary Operating Results\n\n(unaudited; in millions) Quarters Ended Six Months Ended June 30,\r\n2024 June 25,\r\n2023 % Change June 30,\r\n2024 June 25,\r\n2023 % Change Net sales Aeronautics $            7,277 $       6,875 6 % $     14,122 $     13,144 7 % Missiles and Fire Control 3,102 2,755 13 % 6,095 5,143 19 % Rotary and Mission Systems 4,548 3,897 17 % 8,636 7,407 17 % Space  3,195 3,166 1 % 6,464 6,125 6 % Total net sales $          18,122 $     16,693 9 % $     35,317 $     31,819 11 % Operating profit Aeronautics $              751 $          718 5 % $       1,430 $       1,393 3 % Missiles and Fire Control 450 371 21 % 761 748 2 % Rotary and Mission Systems  495 454 9 % 925 804 15 % Space  346 312 11 % 671 592 13 % Total business segment operating\n\nprofit 2,042 1,855 10 % 3,787 3,537 7 % Unallocated items FAS/CAS operating adjustment  406 416 812 831 Impairment and severance charges  (87) — (87) — Intangible asset amortization expense (61) (62) (122) (124) Other, net (152) (74) (213) (72) Total unallocated items 106 280 (62 %) 390 635 (39 %) Total consolidated operating\n\nprofit $            2,148 $       2,135 1 % $       4,177 $       4,172 — % Operating margin Aeronautics 10.3 % 10.4 % 10.1 % 10.6 % Missiles and Fire Control 14.5 % 13.5 % 12.5 % 14.5 % Rotary and Mission Systems 10.9 % 11.6 % 10.7 % 10.9 % Space  10.8 % 9.9 % 10.4 % 9.7 % Total business segment operating\n\nmargin 11.3 % 11.1 % 10.7 % 11.1 % Total consolidated operating\n\nmargin 11.9 % 12.8 % 11.8 % 13.1 %\n\nLockheed Martin Corporation\n\nSelected Financial Data\n\n(unaudited; in millions)  2024\n\nOutlook 2023\n\nActual Total FAS income CAS cost FAS pension income $                — $              378 Less: CAS pension cost 1,685 1,725 Total FAS/CAS pension adjustment $           1,685 $           2,103 Service and non-service cost reconciliation FAS pension service cost $              (60) $              (65) Less: CAS pension cost 1,685 1,725 Total FAS/CAS pension operating adjustment 1,625 1,660 Non-service FAS pension income  60 443 Total FAS/CAS pension adjustment $           1,685 $           2,103\n\nLockheed Martin Corporation\n\nConsolidated Balance Sheets\n\n(unaudited, in millions, except par value) June 30,\r\n2024 Dec. 31,\n\n2023 Assets Current assets Cash and cash equivalents $            2,523 $            1,442 Receivables, net 2,930 2,132 Contract assets 13,907 13,183 Inventories 3,097 3,132 Other current assets 510 632 Total current assets 22,967 20,521 Property, plant and equipment, net 8,394 8,370 Goodwill 10,787 10,799 Intangible assets, net 2,040 2,212 Deferred income taxes 3,080 2,953 Other noncurrent assets 7,808 7,601 Total assets $          55,076 $          52,456 Liabilities and equity Current liabilities Accounts payable $            3,282 $            2,312 Salaries, benefits and payroll taxes 2,871 3,133 Contract liabilities 9,181 9,190 Current maturities of long-term debt 142 168 Other current liabilities 3,017 2,134 Total current liabilities 18,493 16,937 Long-term debt, net 19,115 17,291 Accrued pension liabilities 6,105 6,162 Other noncurrent liabilities 5,188 5,231 Total liabilities 48,901 45,621 Stockholders' equity Common stock, $1 par value per share 237 240 Additional paid-in capital — — Retained earnings 14,707 15,398 Accumulated other comprehensive loss (8,769) (8,803) Total stockholders' equity 6,175 6,835 Total liabilities and equity $          55,076 $          52,456\n\nLockheed Martin Corporation\n\nConsolidated Statements of Cash Flows\n\n(unaudited; in millions) Six Months Ended June 30,\r\n2024 June 25,\r\n2023 Operating activities Net earnings $             3,186 $           3,370 Adjustments to reconcile net earnings to net cash provided by operating activities Depreciation and amortization 710 659 Stock-based compensation 154 146 Deferred income taxes (145) (234) Impairment and severance charges  87 — Changes in assets and liabilities Receivables, net (798) (922) Contract assets (724) (690) Inventories 35 (410) Accounts payable 1,052 1,397 Contract liabilities (9) (304) Income taxes 21 (46) Qualified defined benefit pension plans (1) (189) Other, net (57) (113) Net cash provided by operating activities 3,511 2,664 Investing activities Capital expenditures (748) (623) Other, net 4 30 Net cash used for investing activities (744) (593) Financing activities Issuance of long-term debt, net of related costs 1,980 1,975 Repayments of long-term debt (168) — Repurchases of common stock (1,850) (1,250) Dividends paid (1,532) (1,542) Other, net (116) (128) Net cash used for financing activities (1,686) (945) Net change in cash and cash equivalents 1,081 1,126 Cash and cash equivalents at beginning of period 1,442 2,547 Cash and cash equivalents at end of period $             2,523 $           3,673\n\nLockheed Martin Corporation\n\nOther Financial and Operating Information\n\n(unaudited; in millions, except for aircraft deliveries and weeks) Backlog June 30,\n\n2024 Dec. 31,\n\n2023 Aeronautics $          53,032 $          60,156 Missiles and Fire Control 34,831 32,229 Rotary and Mission Systems 37,366 37,726 Space 33,113 30,456 Total backlog $        158,342 $        160,567\n\nQuarters Ended Six Months Ended Aircraft Deliveries June 30,\r\n2024 June 25,\r\n2023 June 30,\r\n2024 June 25,\r\n2023 F-35 — 45 — 50 F-16 4 — 7 1 C-130J 5 4 9 6 Government helicopter programs 10 11 23 21 Commercial helicopter programs — — — 1 International military helicopter programs 5 — 5 —\n\nNumber of Weeks in Reporting Period1 2024 2023 First quarter 13 12 Second quarter 13 13 Third quarter 13 13 Fourth quarter 13 14\n\n1 Calendar quarters are typically comprised of 13 weeks. However, the company closes its books and records on the last Sunday of each month, except for the month of Dec., as its fiscal year ends on Dec. 31. As a result, the number of weeks in a reporting quarter may vary slightly during the year and for comparable prior year periods. Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/lockheed-martin-reports-second-quarter-2024-financial-results-302203204.html\n\nSOURCE Lockheed Martin Corporation",
        "link": "https://finance.yahoo.com/news/lockheed-martin-reports-second-quarter-112900435.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.028,
            "neu": 0.888,
            "pos": 0.084
        }
    },
    {
        "date": "2024-07-23T08:00:00+00:00",
        "title": "Lockheed Martin’s Skunk Works® and KX Shaping the Future of Open Mission System Architectures",
        "content": "FARNBOROUGH, England, July 23, 2024--(BUSINESS WIRE)--Today, at the Farnborough Air Show, Skunk Works®, the renowned Advanced Development Programs division of Lockheed Martin (NYSE: LMT), and KX, a global leader in vector-based, time-series data management, announced a new collaboration focused on the evolution of Open Mission System architectures.\n\nKX has engaged with Skunk Works to combine kdb+, the world’s fastest analytical database for time-series data, with Lockheed Martin’s leading-edge and next-generation AI and data tooling technologies. KX has cornerstone locations in the United Kingdom and the formal collaboration will create a UK-sovereign, real-time situational awareness model that can be applied across the armed forces for combined joint all-domain command and control (CJADC2), which will allow for greater connectivity, coordination, and faster access to data for enhanced decision-making and operational agility.\n\nThe two organisations have been experimenting and showcasing innovation and competitive advantage in the provision of real-time, data-driven decision-making capabilities that allow operational users to respond more quickly to threats in theatre.\n\nThese collaborative efforts evidence Lockheed Martin’s commitment to partnering with UK industry, and all allies, to demonstrate interoperability with international sovereign systems.\n\n\"Skunk Works has a long history of innovation and incorporating cutting-edge technologies into our systems\", explained Atherton Carty, vice president of business development at Skunk Works. \"Our work with KX is part of an initiative to add unique capabilities to our systems through expanded relationships with specialized industry suppliers. Skunk Works develops solutions that keep our customers ahead of ready, leveraging the expertise of in-country companies to build stronger alliances is a key enabler for us to support our domestic and international customers’ mission needs.\"\n\n\"Today marks a major milestone for KX,\" said Gary Connolly, vice president aerospace, defence and space at KX. \"Skunk Works continuously pushes the technological boundaries of performance and innovation, while KX has a proven ability to deliver unmatched value to those who operate in the toughest data management environments. Together, we endeavour to make data more accessible, enhance operational decision-making at scale, and deliver information to the warfighter exactly when it’s needed.\"\n\nAbout Lockheed Martin\n\nLockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at Lockheedmartin.com.\n\nStory continues\n\nAbout KX\n\nProven in the most demanding data environments, KX enables the discovery of rich, actionable insights for faster decision making, transforming customers into real-time, intelligent organizations. Operating across the United Kingdom, Ireland, Europe, Asia Pacific and North America, KX is a division of Northern Ireland company, FD Technologies (LSE:FDP). For more information visit www.kx.com.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240723325081/en/\n\nContacts\n\nMedia Contacts: \r\nCandis S. Roussel\r\nSkunk Works® Integrated Communications\r\nLockheed Martin Aeronautics\r\ncandis.s.roussel@lmco.com \r\n661-264-8592\n\nSara Jacono\r\nLaunchTech Communications for KX\r\nsjacono@golaunchtech.com \r\n540-764-0043",
        "link": "https://finance.yahoo.com/news/lockheed-martin-skunk-works-kx-080000380.html",
        "symbols": [
            "0R3E.LSE",
            "FDP.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.015,
            "neu": 0.842,
            "pos": 0.142
        }
    },
    {
        "date": "2024-07-23T00:00:00+00:00",
        "title": "LMT Stock Earnings: Lockheed Martin Beats EPS, Beats Revenue for Q2 2024",
        "content": "LMT stock results show that Lockheed Martin beat analyst estimates for earnings per share and beat on revenue for the second quarter of 2024.",
        "link": "https://investorplace.com/earning-results/2024/07/lmt-stock-earnings-lockheed-martin-for-q2-of-2024/",
        "symbols": [
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.296,
            "neg": 0,
            "neu": 0.913,
            "pos": 0.087
        }
    }
]