[
    {
        "date": "2024-05-03T17:21:00+00:00",
        "title": "U.S. Air Force Secretary Kendall Flies in AI-piloted X-62A VISTA",
        "content": "Lockheed Martin's open systems architecture is advancing the future of AI-enabled autonomous flight with human oversight\n\nEDWARDS AIR FORCE BASE, Calif., May 3, 2024  /PRNewswire/ -- Lockheed Martin Skunk Works® (NYSE: LMT) joined the U.S. Air Force Test Pilot School and other government and industry partners in hosting U.S. Secretary of the Air Force Frank Kendall to fly in the X-62A Variable In-flight Simulation Test Aircraft (VISTA), a one-of-a-kind aircraft modified to test artificial intelligence (AI) and autonomy capabilities. Secretary of the Air Force Frank Kendall, onboard the X-62 VISTA, takes off from Edwards Air Force Base, California, May 2. (Air Force photo by Madeline Guadarrama)\n\nVISTA is an AI pathfinder that facilitates development and testing of cutting-edge AI techniques with new uncrewed vehicle designs. This work is essential to realizing distributed teaming. In less than a year, the teams installed initial live AI agents into the X-62A's systems, demonstrated the first AI versus human dogfight and completed over 100,000 lines of flight-critical software changes across 21 test flights.\n\n\"The need for innovation at speed and scale is greater than ever. The X-62A VISTA is a crucial platform in our efforts to develop, test and integrate AI, as well as to establish AI certification standards that will revolutionize the future of aerospace,\" said John Clark, vice president and general manager, Lockheed Martin Skunk Works. \"Our proven hardware and software architecture enable safe and controlled environments for AI agents and advanced algorithms to rapidly prototype and develop.\"\n\nLockheed Martin's open systems architecture, which leverages Skunk Works' Model Following Algorithm (MFA) and System for Autonomous Control of the Simulation (SACS), enables highly complex tests. These important updates enhance VISTA's capabilities while maintaining its rapid-prototyping advantage, allowing for quick changes to software and the ability to conduct flight tests with great frequency, accelerating the pace of AI and autonomy development to meet urgent national defense priorities.\n\nThis architecture has proven to be reliable and robust enough to transition into third-party distributed hardware to replicate safe and controlled flight test objectives as demonstrated by VISTA. Lockheed Martin is at the forefront of fusing AI-enabled platform autonomy with human oversight to accelerate operational speed, maximize agility and cut sustainment costs.\n\nThe achievements of and technologies developed through the Defense Advanced Research Projects Agency (DARPA) Air Combat Evolution (ACE) program will serve as a foundation for future advances in safer, more reliable, and more efficient aviation – both for military and commercial domains.\n\nStory continues\n\nSecretary Kendall's flight closely follows several major VISTA recognitions for work done as part of DARPA's ACE program, including being nominated as finalists for the 2023 Robert J. Collier Trophy and receiving the Society of Flight Test Engineers' James S. McDonnell Award and Aviation Week's 2024 Laureate Award for Defense.\n\nAbout Lockheed Martin Lockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at Lockheedmartin.com. (PRNewsfoto/Lockheed Martin Aeronautics) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/us-air-force-secretary-kendall-flies-in-ai-piloted-x-62a-vista-302135802.html\n\nSOURCE Lockheed Martin Aeronautics\n\nView comments",
        "link": "https://finance.yahoo.com/news/u-air-force-secretary-kendall-172100745.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.008,
            "neu": 0.868,
            "pos": 0.124
        }
    },
    {
        "date": "2024-05-03T11:35:34+00:00",
        "title": "Top 20 States Where the US Military Spends the Most Money",
        "content": "In this article, we look at the 20 states where the US military spends the most money. You can skip our detailed analysis on the breakdown of the Department of Defense (DoD)’s spending by state and head over directly to the Top 5 States Where the US Military Spends the Most Money.\n\nFigures released by the Stockholm International Peace Research Institute (SIPRI) last month revealed that global military spending reached an all-time high of $2.44 trillion in 2023, increasing 6.8% in real terms compared to 2022. This is the steepest year-on-year rise in defense expenditure since 2009. The report also highlighted that world military expenditure has now been increasing for the last consecutive nine years.\n\nDefense spending in the United States grew 2.3% to total $916 billion in 2023, which amounted to 37.5% of the global military expenditure, and represented 68% of all NATO military spending. On the other hand, Russia’s defense bills also witnessed a 24% increase in 2023 amid the war in Ukraine. Israel’s military expenditure rose 24% as well compared to 2022, driven by its large-scale offensive against Hamas in Gaza. India and Saudi Arabia also continued to spend heavily on defense during the year.\n\nThe surge in spending has a created a boom in the global defense industry, especially for aerospace and armaments manufacturers in the United States – a country that accounts for nearly two-fifths of all global military spending, and is home to several top defense contractors countries across the world looks toward to procure their military supplies from.\n\nLockheed Martin Corporation (NYSE:LMT) generated $67.6 billion in revenues in 2023, reporting an increase of 2.4% in comparison to 2022. The aerospace company’s net earnings were also $1.2 billion higher compared to last year. RTX Corporation (NYSE:RTX)’s numbers soared as well, with sales reaching a whopping $68.9 billion in 2023, having grown 3% year-on-year. On the other hand, General Dynamics Corporation (NYSE:GD) posted its highest revenue in history, totaling $42.3 billion last year – which was 7.3% higher than in 2022.\n\nAs a result, the United States continues to retain its military superiority over its rivals, and given the advanced research and development ongoing in the country’s defense industry, this trend is likely to stay for the foreseeable future. The country is already looking ahead to the future, and working on building weapons tailored to address the rapidly evolving dynamics of modern warfare.\n\nAn example of that is the Next Generation Air Dominance (NGAD) Program launched by the United States Air Force (USAF) in 2014 to develop the sixth-generation fighter jet to replace Lockheed Martin Corporation (NYSE:LMT)’s F-22 Raptor. The USAF requested $1.7 billion in its FY24 budget for the project which is likely to cost $16 billion between 2023 and 2028. Five companies – Lockheed Martin Corporation (NYSE:LMT), Northrop Grumman Corporation (NYSE:NOC), The Boeing Company (NYSE:BA), General Electric Company (NYSE:GE), and Pratt & Whitney, a subsidiary of RTX Corporation (NYSE:RTX) – are working on the NGAD Program, with each being awarded contracts worth $975 million in 2022 for a period of ten years.\n\nStory continues\n\nThe enormous sums of money that go into the American defense industry for the procurement of new military equipment by the US government and foreign buyers, and the research and development to develop improved weaponry, heavily influences the US economy in many ways. However, the spending is not evenly distributed across all states. Understandably so, states that are home to major defense companies and host a larger number of military installations receive a greater share of this money.\n\nThe Department of Defense (DoD) in September 2023 released a report on its contract obligations and spending across various states of the United States in 2022. Of the $558.7 billion spent that year, 70% went into contracts for products and services, while 28% were used to pay salaries of DoD’s personnel. 2% of the total amount was awarded as grants. Let’s now take a look at top states where the US military spends the most money. Top 20 States Where the US Military Spends the Most Money\n\nFrontpage/Shutterstock.com\n\nMethodology\n\nThe top 20 states where the US military spends the most money are ranked in ascending order of the DoD spending by state in billions of dollars. 2022 is the latest year for which data is available, and was released by the Department of Defense in September 2023. In cases where the estimated, rounded figure of defense spending was similar for two or more states, we outranked one over the other on the basis of defense spending per resident, with the state having the greater value ranking higher in the list.\n\nBy the way, Insider Monkey is an investing website that tracks the movements of corporate insiders and hedge funds. By using a similar consensus approach, we identify the best stock picks of more than 900 hedge funds investing in US stocks. The top 10 consensus stock picks of hedge funds outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). Whether you are a beginner investor or professional one looking for the best stocks to buy, you can benefit from the wisdom of hedge funds and corporate insiders.\n\nTop 20 States Where the US Military Spends the Most Money:\n\n20. Ohio\n\nTotal Defense Spending in State: $8.9 billion\n\nShare of Overall DoD Spending: 1.59%\n\nWe begin our list with Ohio, where $5.1 billion of the total $8.9 billion amount was spent on DoD contracts in the state, with the rest being divided between grants and payroll spending. The DoD defense spending per resident in Ohio is $759.\n\n19. Missouri\n\nTotal Defense Spending in State: $8.9 billion\n\nShare of Overall DoD Spending: 1.59%\n\nNext up is Missouri, which is home to 12 military installations, according to the Department of Defense. The DoD spent $8.9 billion on military expenditure in the state in 2022.\n\n18. New Jersey\n\nTotal Defense Spending in State: $9.4 billion\n\nShare of Overall DoD Spending: 1.68%\n\nIn 2022, the DoD spent $7 billion on contracts, $2 billion on payrolls, and a little over $400 million on grants in New Jersey. It is among states where the US military spends the most money.\n\n17. Illinois\n\nTotal Defense Spending in State: $10.2 billion\n\nShare of Overall DoD Spending: 1.83%\n\nMore than $10 billion was spent on defense in the state of Illinois in 2022. Nearly three-fourths of the amount was spent on DoD contracts. Defense spending per resident in Illinois is $811.\n\n16. Colorado\n\nTotal Defense Spending in State: $12.9 billion\n\nShare of Overall DoD Spending: 2.31%\n\nColorado has a high defense spending per resident of $2,215. The DoD spent $8.8 billion on defense contracts in the state in 2022, while $3.9 billion were incurred on payrolls, with the rest being accounted for by grants.\n\n15. Georgia\n\nTotal Defense Spending in State: $13.4 billion\n\nShare of Overall DoD Spending: 2.40%\n\nGeorgia represented 2.4% of the DoD’s overall defense spending in 2022. The state is home to Lockheed Martin Corporation (NYSE:LMT)’s site in Marietta that works on the engine modernization and avionics programs for the P-3 Orion program operations and C-5 Galaxy strategic transport.\n\n14. North Carolina\n\nTotal Defense Spending in State: $13.4 billion\n\nShare of Overall DoD Spending: 2.40%\n\nNorth Carolina is home to 15 military installations, including seven key military bases. The state also has numerous universities that have industrial partnerships with the DoD and intelligence agencies. With more than $13 billion spent on defense in the state in 2022, North Carolina is among the top 20 states where the US military spends the most money.\n\n13. Kentucky\n\nTotal Defense Spending in State: $13.9 billion\n\nShare of Overall DoD Spending: 2.49%\n\nNext on our list of states where the US military spends the most money is Kentucky, where the DoD incurred a whopping $13.9 billion in defense expenditure in 2022, of which $10.6 billion comprised contract spending. The military spending per resident in the state is $3,084.\n\n12. Alabama\n\nTotal Defense Spending in State: $14 billion\n\nShare of Overall DoD Spending: 2.51%\n\nThere are ten military installations in the state of Alabama, according to the DoD. In 2022, $14 billion were spent by the US military in the state of which $10.3 billion went into DoD contracts, while $3.5 billion was expensed on payroll.\n\n11. Washington\n\nTotal Defense Spending in State: $14.6 billion\n\nShare of Overall DoD Spending: 2.61%\n\nNext up is Washington, where the military spending per resident in 2022 was $1,874, with $14.6 billion spent across the state in defense expenditure during the year. About 51% of the amount was expensed on payrolls.\n\n10. Arizona\n\nTotal Defense Spending in State: $15 billion\n\nShare of Overall DoD Spending: 2.68%\n\nAccording to the DoD, 2.68% of their entire defense expenditure in 2022 was incurred in Arizona. The state is home to around 18 key military installations, and also hosts regional offices of several defense manufacturers, including RTX Corporation (NYSE:RTX) which employs over 12,000 workers in the city of Tucson.\n\n9. Massachusetts\n\nTotal Defense Spending in State: $15.2 billion\n\nShare of Overall DoD Spending: 2.72%\n\nMassachusetts is in ninth spot, with $15.2 billion spent on defense in the state during 2022, which represented 2.72% of DoD’s overall spending. There are 10 key military installations across the state.\n\n8. Pennsylvania\n\nTotal Defense Spending in State: $17.9 billion\n\nShare of Overall DoD Spending: 3.20%\n\nThere are 16 military installations in the state of Pennsylvania. The DoD in 2022 spent close to $18 billion in the state, of which $14.3 billion were accounted for contractual spending.\n\n7. Connecticut\n\nTotal Defense Spending in State: $22.3 billion\n\nShare of Overall DoD Spending: 3.99%\n\nWith $22.3 billion spent on defense in 2022, Connecticut is seventh on our list. The state hosts the General Dynamics Electric Boat (GDEB), a subsidiary of the General Dynamics Corporation (NYSE:GD) that has been the primary manufacturer of submarines for the US Navy for over a century.\n\n6. Maryland\n\nTotal Defense Spending in State: $26.4 billion\n\nShare of Overall DoD Spending: 4.73%\n\nThe state of Maryland is in sixth spot, with over $26 billion expensed on defense during 2022, with two-thirds of the amount being represented by the DoD contracts. An estimated $626 million went into grants, while $8.4 billion were incurred on payrolls.\n\nClick to continue reading and see the Top 5 States Where the US Military Spends the Most Money.\n\nSuggested Articles:\n\n20 Countries With Highest Military Spending In The World NATO Spending by Country Per Capita: Top 15 Countries 15 Countries that will have the Most Powerful Militaries by 2030\n\nDisclosure: None. Top 20 States Where the US Military Spends the Most Money is originally published on Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/top-20-states-where-us-113534370.html",
        "symbols": [
            "0IUC.LSE",
            "0R3E.LSE",
            "BA.US",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "GE.US",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.009,
            "neu": 0.872,
            "pos": 0.119
        }
    },
    {
        "date": "2024-05-03T11:26:17+00:00",
        "title": "15 Biggest Aircraft Carriers in the World",
        "content": "In this article, we look at the 15 biggest aircraft carriers in the world. You can skip our detailed analysis on trends in the naval industry and head over directly to the 5 Biggest Aircraft Carriers in the World, which includes a $13.3 billion warship!\n\nConflicts in different parts of the world have created a surge in the demand for aircraft carriers. The global industry for these giant war machines is projected to grow 2% between 2023 and 2028, with Asia-Pacific being the fastest growing market for aircraft carriers. These are among the most vital strategic military assets deployed by countries, that allow planes to land on and take off from the sea, that can prove critical during any armed conflict.\n\nThe history of aircraft carriers date back to 1910 when an American pilot, Eugene Ely, flew an aircraft from the deck of a cruiser in Virginia, and then in 1911 made a landing on a battleship in San Francisco Bay. These battleships attained great prominence with the British Navy’s HMS Argus, developed during World War I, and later the USS Langley becoming the first carrier to join the fleet of the US Navy in 1922. However, it was not until the Pearl Harbor attack in 1941 that marked the arrival of aircraft carriers in military conflicts. Since then, several naval powers have focused on developing aircraft carriers, which are now considered as the most potent platform for naval warfare.\n\nToday’s aircraft carriers are not only larger in size, but also come equipped with angled, armored fighting decks, latest electromagnetic and gear technology, steam-powered catapults, and landing signal systems to address complexities faced by older versions due to heavy weights and high landing speeds of aircraft. Moreover, there are also different variants of aircraft carriers in the market, such as nuclear-powered carriers, helicopter carriers, multipurpose carriers, and amphibious assault ships.\n\nHuntington Ingalls Industries, Inc. (NYSE:HII) is among the major players in the industry, and has provided the US Navy with several notable aircraft carriers over the years, including the next-generation Gerald R. Ford class of aircraft carriers, which would equip the American Navy to meet the operational needs of naval combat in the 21st century. These nuclear-powered carriers are being developed to replace the Nimitz class, and would be an improved version of the latter with features allowing greater aircraft deployments, fewer sailors, higher electrical power for ship systems, and a reduction in operating costs per ship by $4 billion.\n\nStory continues\n\nHuntington Ingalls Industries, Inc. (NYSE:HII) has been a significant contributor to the strength of the US Navy. Besides building critical warships, the company also provides service facilities for these aircraft carriers while they remain in operation. 2023 was a record-breaking year for Huntington Ingalls Industries, Inc. (NYSE:HII), with the company generating $11.5 billion in revenues – its highest in history, and 7.3% higher compared to 2022.\n\nLockheed Martin Corporation (NYSE:LMT) has also played its role in enhancing the naval strength of the United States by taking an active part in sea-based tests involving aircraft carriers. According to reports, the CVN-79 Gerald R. Ford class carrier, which is scheduled to enter service in July 2025, will be capable of deploying Lockheed Martin Corporation (NYSE:LMT)’s F-35 fighter jets by its next maintenance period.\n\nGeneral Dynamics Corporation (NYSE:GD)’s expertise in building warships for the US military, especially submarines, has also been widely acclaimed by defense experts for contributing towards America’s naval strength. The company has been lending support for the aircraft carrier programs as well. In April 2023, General Dynamics Corporation (NYSE:GD) was awarded a $847 million contract to repair, maintain, and modernize carriers operated by the US Navy. 15 Biggest Aircraft Carriers in the World\n\nPixabay/Public Domain\n\nMethodology\n\nThe 15 biggest aircraft carriers in the world are ranked in ascending order of their displacement in tonnes. Data has been sourced from Insider Monkey and Yahoo Finance’s article on the 12 Countries With Most Aircraft Carriers. In cases where two or more carriers had the same level of displacement, we outranked one over the other based on the technological capabilities of the warships.\n\nIf interested, you can also take a look at the 16 Strongest Navies in the World in 2024.\n\nBy the way, Insider Monkey is an investing website that tracks the movements of corporate insiders and hedge funds. By using a similar consensus approach, we identify the best stock picks of more than 900 hedge funds investing in US stocks. The top 10 consensus stock picks of hedge funds outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). Whether you are a beginner investor or professional one looking for the best stocks to buy, you can benefit from the wisdom of hedge funds and corporate insiders.\n\nLet’s now head over to the list of the biggest aircraft carriers in the world by displacement.\n\n15 Biggest Aircraft Carriers in the World:\n\n15. Atlantico\n\nCountry: Brazil\n\nDisplacement: 21,500 tonnes\n\nAtlantico is the only aircraft carrier in South America. The warship was originally built as HMS Ocean and was in use by the Royal Navy in the United Kingdom, before being acquired by Brazil recently in 2018. The country plans on using the aircraft carrier to operate military drones. Atlantico has a displacement of 21,500 tonnes.\n\n14. Juan Carlos I\n\nCountry: Spain\n\nDisplacement: 26,000 tonnes\n\nJuan Carlos I is the only aircraft carrier operated by the Spanish Navy, and is named after the country’s former king. It is the largest warship ever built in Spain's history. The aircraft carrier is powered by a diesel-electric propulsion system, is approximately 231 meters long, with a 32 meters beam, and has the capacity to travel at 21 knots.\n\n13. Izumo\n\nCountry: Japan\n\nDisplacement: 27,000\n\nJapan’s government in 2018 announced that it would convert Kaga and Izumo, its two helicopter carriers, into full-fledged aircraft carriers equipped to allow jets like Lockheed Martin Corporation (NYSE:LMT)’s F-35s to land on and take off from. In 2021, US Marine fighters landed on Izumo, signaling the carrier’s transformed capabilities. It has a displacement of an estimated 27,000 tonnes.\n\n12. TCG Anadolu\n\nCountry: Turkiye\n\nDisplacement: 27,000 tonnes\n\nNext on our list of the biggest aircraft carriers in the world is Turkiye’s TCG Anadolu, the country’s only carrier that is equipped with aviation capabilities. The warship was commissioned in April 2023 and is designed on the model of Spain’s Juan Carlos I. The carrier has a maximum speed of 21 knots and a range of 9,000 nautical miles.\n\n11. Cavour\n\nCountry: Italy\n\nDisplacement: 28,100 tonnes\n\nItaly is among the rare few countries to operate two aircraft carriers. One of them is Cavour, which has an estimated displacement of over 28,000 tonnes, and is equipped with guns, decoy launchers, and several short-range defense systems. The carrier is the only Italian warship that is capable of launching and recovering the F-35 fighter jets.\n\n10. INS Vikrant\n\nCountry: India\n\nDisplacement: 43,000 tonnes\n\nThe INS Vikrant is the first aircraft carrier to be ever built in India. The warship was constructed by Cochin Shipyard Limited for approximately $3.1 billion. It has an estimated displacement of 43,000 tonnes and is capable of carrying up to 40 military aircraft, including helicopters. According to defense experts, INS Vikrant is more technologically advanced than India’s other carrier, INS Vikramaditya.\n\n9. INS Vikramaditya\n\nCountry: India\n\nDisplacement: 44,500 tonnes\n\nIndia’s INS Vikramaditya is one of the biggest aircraft carriers in the world, with a tonnage of 44,500. The warship served both the Soviet and later Russian navies, before being decommissioned in 1996 and then entering the service of the Indian Navy in 2013. According to Marine Insight, the INS Vikramaditya is equipped to carry about 36 aircraft, and has a beam of 61 meters.\n\n8. FS Charles de Gaulle\n\nCountry: France\n\nDisplacement: 45,000 tonnes\n\nNext up is France’s only aircraft carrier, the nuclear-powered FS Charles de Gaulle, which is considered to be one of the most potent warships in modern naval warfare. The giant war machine deploys a mix of military purpose aircraft, ranging from Rafale fighter jets to E-2 Hawkeye aircrafts and assault helicopters. The carrier has a displacement of 45,000 tonnes. The government in Paris plans on replacing the FS Charles de Gaulle at some point in the 2030s with Porte-Avions Nouvelle Génération which is likely to have a tonnage of 70,000.\n\n7. Admiral Kuznetsov\n\nCountry: Russia\n\nDisplacement: 58,000 tonnes\n\nRussia’s Admiral Kuznetsov is one of the biggest aircraft carriers in the world with a displacement of 58,000 tonnes. However, the warship which was commissioned way back in 1991, has suffered numerous breakdowns in the sea in the last few years, and has been undergoing maintenance and repair for quite some time now. The carrier has a range of 8,500 nautical miles and can travel at a speed of 29 knots.\n\n6. Liaoning\n\nCountry: China\n\nDisplacement: 60,000 tonnes\n\nChinese aircraft carrier Liaoning is in the sixth spot in the list, with a displacement of 60,000 tonnes. The warship was initially planned to become the second Admiral Kuznetsov class of carrier for the Soviet Navy, but the warship was later acquired by China after the dissolution of the Soviet Union in 1991. Liaoning is capable of carrying around 50 military aircraft at a time. It has a length of 304.5 meters and a beam of 75 meters.\n\nClick to continue reading and see the 5 Biggest Aircraft Carriers in the World.\n\nSuggested Articles:\n\n12 Countries Have Aircraft Carriers But Only One Has A $13.3 Billion Warship 15 Navies with the Most Submarines in the World 15 Most Expensive Fighter Jets in the World\n\nDisclosure: None. 15 Biggest Aircraft Carriers in the World is originally published on Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/15-biggest-aircraft-carriers-world-112617755.html",
        "symbols": [
            "0IUC.LSE",
            "0J76.LSE",
            "0R3E.LSE",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "HI4.F",
            "HI4.STU",
            "HII.US",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.049,
            "neu": 0.871,
            "pos": 0.081
        }
    },
    {
        "date": "2024-05-03T00:00:00+00:00",
        "title": "Today’s Biggest Pre-Market Stock Movers: 10 Top Gainers and Losers on Friday",
        "content": "Pre-market stock movers are worth checking out this morning as we dive into all of the biggest news moving shares on Friday!",
        "link": "https://investorplace.com/2024/05/todays-biggest-pre-market-stock-movers-10-top-gainers-and-losers-on-friday-may-3rd/",
        "symbols": [
            "LMT.US",
            "NET.US",
            "SPT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.526,
            "neg": 0,
            "neu": 0.82,
            "pos": 0.18
        }
    }
]