[
    {
        "date": "2024-09-04T15:30:00+00:00",
        "title": "Curtiss-Wright Secures a $26M Deal From Belgian Air Force",
        "content": "Curtiss-Wright Corporation CW recently clinched a $26 million multi-year contract from the Belgian Air Force to modernize its aircraft arresting systems. The contract also offers a range of services, overhauls, repairs and replacement parts to support the military flying operations of the Belgian Air Force.\n\nAbout CW’s Contract\n\nPer the deal, Curtiss-Wright will supply three airbases with new cable systems and associated turnkey services to facilitate the impending F-35 delivery to Belgium and ensure the safety of its emergency takeoff and landing phases.\r\n\r\nCurtiss-Wright will gradually equip the parallel and main runways at Bevauchain, Kleine-Brogel and Florennes Air Bases to promote total uniformity of all air base layouts. The ESCO SmartArrest technology from Curtiss-Wright, a special computerized variant of the ESCO BAK-12 energy absorber, will automatically ensure the successive arrestment of multiple fighter jet platforms.\n\nCW’s Growth Prospects\n\nThe increasing defense budgets and advancements in aerospace technology must have increased the demand for maintenance and upgrade solutions. As nations are spending heftily these days to secure their borders, fighter jets are playing a key role in defending a country’s safety. This has been boosting the demand for fighter jets. As demand for new aircraft is rising, so is the need for maintenance, repair and overhaul (MRO) services.\r\n\r\nPer a report by Mordor Intelligence, the Military Aircraft MRO market is projected to reach nearly $47.48 billion by 2029, with a CAGR of 2.8% between 2024 and 2029. Such growth opportunities offered by the aforementioned market should bode well for Curtiss-Wright in the coming years.\r\n\r\nWith thousands of commercial and military aircraft under its care, Curtiss-Wright's Product Support group has more than 25 years of expertise in repairing and overhauling complex flight control actuators and the structural components that support them. The company provides heavy maintenance support, modification programs and customized component repair solutions for these vital parts.\n\nOpportunities for CW’s Peers\n\nApart from Curtiss-Wright, defense contractors that are anticipated to benefit from the expanding Military Aircraft MRO market are as follows:\r\n\r\nRTX Corporation RTX: The company’s unit, Collins Aerospace, is known for its advanced avionics solutions. Its MRO services include the maintenance and repair of avionics systems, seat inspections, teardown and analysis, from minor repairs to major repairs.\r\n\r\nRTX has a long-term (three to five years) earnings growth rate of 10.4%. The Zacks Consensus Estimate for RTX’s 2024 sales suggests growth of 7% from the prior-year reported figure.\r\n\r\nLockheed Martin LMT: Its Sikorsky Military Aircraft’s Overhaul and Repair organization offers a diversified range of system services, repairing and overhauling dynamic systems, blades, avionics and numerous other components, from aircraft tip to tail.\r\n\r\nLockheed Martin has a long-term earnings growth rate of 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales implies growth of 5.3% from the prior-year reported figure.\r\n\r\nAAR Corp. AIR: The company is the largest independent MRO provider in North America, serving a global customer base. AIR provides major maintenance inspections, modifications, upgrades, refurbishments and painting for a diverse range of aircraft OEM platforms.\r\n\r\nAAR Corp. delivered an average earnings surprise of 2.59% in the last four quarters. The Zacks Consensus Estimate for the company’s fiscal 2025 sales calls for growth of 16.1% from the fiscal 2024 estimated figure.\n\nStory continues\n\nCW Stock Price Movement\n\nIn the past six months, shares of Curtiss-Wright have rallied 26.8% compared with the industry’s rise of 14%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nCurtiss-Wright currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nAAR Corp. (AIR) : Free Stock Analysis Report\n\nCurtiss-Wright Corporation (CW) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/curtiss-wright-secures-26m-deal-153000424.html",
        "symbols": [
            "0R3E.LSE",
            "AIR.US",
            "ARZ.F",
            "CW.US",
            "CWT.F",
            "CWT.STU",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.01,
            "neu": 0.821,
            "pos": 0.169
        }
    },
    {
        "date": "2024-09-04T13:57:00+00:00",
        "title": "Lockheed Rides on Solid Order Growth Despite Labor Shortage",
        "content": "Lockheed Martin Corp.’s LMT steady inflow of orders for its diverse defense products is likely to boost its revenues. The company holds a strong solvency position as well as a solid presence in the international defense market.\r\n\r\nHowever, this Zacks Rank #3 (Hold) company faces risks like the shortage of skilled labor and sanctions imposed by China, which act as a headwind.\n\nTailwinds Favoring LMT\n\nIn the second quarter of 2024, Lockheed kept up with its tradition of securing several significant contracts from the Pentagon and other American allies. One of these contracts, worth $4.1 billion, requires Lockheed to design new capabilities for its command and control, battle management and communications system. Such contracts culminate into a solid backlog count, which boosts LMT’s revenue generation prospects.\r\n\r\nLockheed Martin's products not only have an impressive domestic market presence but also gain international recognition. International customers of the company have shown a great deal of interest in its THAAD system and PAC-3 missiles, with 15 countries having selected the PAC-3 Missile Segment Enhancement and PAC-3 Cost Reduction Initiative to improve their missile defense capabilities.\r\n\r\nAt the end of the second quarter of 2024, Lockheed had $2.52 billion in cash and cash equivalents. As of June 30, 2024, its current debt came in at $0.14 billion and was much less than its cash reserve. Thus, it is reasonable to say that the stock boasts a solid solvency position in the near term.\n\nHeadwinds Faced by LMT\n\nIndustry participants like Lockheed continue to be at risk from the labor crisis, particularly with regard to skilled workers. These labor shortages may make it difficult for manufacturing companies like Lockheed to deliver finished products on schedule, which might affect its operating performance going forward.\r\n\r\nIn 2023, the China Ministry of Commerce declared that Lockheed had been placed on its list of \"unreliable entities\" in relation to certain foreign military sales made by the U.S. government to Taiwan involving LMT’s products and services. In this regard, China declared that it would impose certain sanctions against Lockheed.  If China imposes further sanctions on LMT, the company's business may suffer.\n\nLMT Stock Price Movement\n\nIn the past three months, shares of LMT have risen 21.9% compared with the industry’s growth of 2.9%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nStocks to Consider\n\nSome better-ranked stocks from the same sector are Leidos Holdings, Inc. LDOS, Curtiss-Wright Corp. CW and Leonardo DRS, Inc. DRS, each carrying a Zacks Rank #2 (Buy) at present. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\r\n\r\nLeidos’ long-term (three to five years) earnings growth rate is 12.5%. The Zacks Consensus Estimate for LDOS’ 2024 sales suggests an improvement of 5.4% from the prior-year reported figure.\r\n\r\nCurtiss-Wright delivered an average earnings surprise of 11.52% in the last four quarters. The Zacks Consensus Estimate for its 2024 revenues suggests a rise of 7% from the 2023 reported sales figure.\r\n\r\nLeonardo DRS’ long-term earnings growth rate is 16.4%. The Zacks Consensus Estimate for DRS’ total revenues for 2024 indicates year-over-year growth of 11.4%.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nCurtiss-Wright Corporation (CW) : Free Stock Analysis Report\n\nLeidos Holdings, Inc. (LDOS) : Free Stock Analysis Report\n\nLeonardo DRS, Inc. (DRS) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-rides-solid-order-growth-135700820.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.048,
            "neu": 0.792,
            "pos": 0.16
        }
    },
    {
        "date": "2024-09-04T11:12:00+00:00",
        "title": "Zacks Investment Ideas feature highlights: Meta Platforms, Lockheed Martin and Eli Lilly",
        "content": "For Immediate Release\n\nChicago, IL – September 4, 2024 – Today, Zacks Investment Ideas feature highlights Meta Platforms META, Lockheed Martin LMT and Eli Lilly LLY.\n\n3 Big Winners from Q2 Earnings Season: META, LMT, LLY\n\nThe 2024 Q2 earnings season is slowly grinding to a halt, with the majority of S&P 500 companies already delivering quarterly results. Looking ahead, Q3 earnings for the S&P 500 index are expected to be up +3.8% from the same period last year on +4.6% higher revenues, chaining together consecutive periods of positivity.\n\nSeveral companies have stolen the spotlight throughout the period, including Meta Platforms, Lockheed Martin and Eli Lilly. All three posted robust results and upped guidance, with shares of each seeing bullish activity post earnings.\n\nLet's take a closer look at each.\n\nMETA Raises AI CapEx\n\nMega-cap giant Meta Platforms was one of the few Mag 7 members to see a positive reaction to its quarterly results, with the company again exceeding both earnings and revenue expectations. The company's earnings outlook reflects bullishness across all timeframes.\n\nThe company delivered a stunning statement in the release, with Mark Zuckerberg saying, 'We had a strong quarter, and Meta AI is on track to be the most used AI assistant in the world by the end of the year,\"\n\nHe continued, \"We've released the first frontier-level open source AI model, we continue to see good traction with our Ray-Ban Meta AI glasses, and we're driving good growth across our apps.\"\n\nMeta also raised its CapEx outlook into a band of $37 - $40 billion ($35 - $40 billion prior) to support its artificial intelligence roadmap.\n\nThe valuation picture for META remains attractive, with the current 22.4X forward 12-month earnings multiple in line with the five-year median and well beneath five-year highs of 31.5X. In addition, the current PEG ratio works out to 1.2X, reflecting that investors are paying a fair price for the forecasted growth.\n\nEli Lilly Sees Robust Demand\n\nEli Lilly shares have been red-hot in 2024 thanks to robust results stemming from unrelenting demand, up 65% and widely outperforming relative to the S&P 500. Shares popped following its latest release, with earnings and sales climbing 85% and 35%, respectively.\n\nThe company upgraded its current-year sales guidance by a sizable $3 billion. Analysts have adjusted their sales expectations accordingly, with the now $46.4 billion expected alluding to a 35% climb year-over-year.\n\nThe story behind Eli Lilly has been driven by its diabetes drug Mounjaro and its weight loss injection Zepbound, which have seen unrelenting demand among consumers. Mounjaro sales jumped 216% year-over-year, whereas Zepbound sales of $1.2 billion also reflected strong demand.\n\nStory continues\n\nEarnings expectations have shot higher across the board following the release, with LLY sporting a favorable Zacks Rank #2 (Buy).\n\nLMT Generates Significant Cash\n\nLockheed Martin is the largest defense contractor in the world, operating in defense, space, intelligence, homeland security, and information technology. The company's steady growth continued throughout its latest period, with EPS and revenue growing 6% and 9%, respectively.\n\nThe company has been a long-time favorite among income-focused investors, consistently upping its payout over the years. LMT's cash-generating abilities have aided its dividend growth, with the company posting nearly $1.3 billion in free cash flow throughout its latest period.\n\nFollowing the favorable quarter, LMT upped its EPS, segment profit, and sales guidance, causing shares to move bullishly following the release.\n\nBottom Line\n\nThe Q2 earnings season overall showed resiliency, with no major spooks hitting the tape. While we saw some mixed reads on the consumer, recent favorable economic data helps alleviate this issue.\n\nAnd concerning a few companies who stole the spotlight during the reporting period, these three stocks all did precisely that.\n\nWhy Haven't You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\n\nToday you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performancefor information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nEli Lilly and Company (LLY) : Free Stock Analysis Report\n\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-111200991.html",
        "symbols": [
            "0R3E.LSE",
            "1FB.MI",
            "FB20.F",
            "FB2A.F",
            "FB2A.HM",
            "FB2A.MU",
            "FB2A.XETRA",
            "GSPC.INDX",
            "LILY34.SA",
            "LLY.BE",
            "LLY.F",
            "LLY.MU",
            "LLY.MX",
            "LLY.STU",
            "LLY.US",
            "LLY.XETRA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.022,
            "neu": 0.828,
            "pos": 0.15
        }
    }
]