[
    {
        "date": "2024-10-21T21:08:00+00:00",
        "title": "Lockheed Martin Reports Earnings Tuesday. Investors Want to See These 2 Things.",
        "content": "Lockheed Martin reports third quarter earnings Tuesday morning. Wall Street is looking for earnings per share of about $6.50 from sales of $17.4 billion, according to FactSet.\n\nContinue reading\n\nView comments",
        "link": "https://finance.yahoo.com/m/358566e0-4c92-3286-8dae-d0dfb15b27dd/lockheed-martin-reports.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.296,
            "neg": 0,
            "neu": 0.932,
            "pos": 0.068
        }
    },
    {
        "date": "2024-10-21T17:40:16+00:00",
        "title": "Lockheed Martin Stock Hits Record Highs Before Earnings",
        "content": "Defense and aerospace firm Lockheed Martin Corp (NYSE:LMT) is scheduled to report earnings before the open on Tuesday, Oct. 22. Per Reuters, Wall Street expects the company's third-quarter adjusted earnings per share to come in at $6.50 on revenue of $17.28 billion, the latter of which is a 2.8% year-over-year increase. Ahead of the event, LMT is up 0.4% at $614.04, and earlier touched a record high of $618.95.\n\nOver the last two years, LMT finished post-earnings sessions higher five times, and averaged a 3.3% pop, regardless of direction. This time around, the options pits expect a next-day swing of 5.6%.\n\nSpeaking of the options pits, Lockheed Martin stock is seeing higher-than-usual intraday put volume before the earnings call. Around the session's halfway point, 6,156 calls and 4,545 puts have traded hands, with bearish bets running at double the amount usually seen at this point. New positions are opening at the most active, weekly 10/25 540-strike call.\n\nOver the last 12 months, the security cleared marked several significant achievements including conquering early 2024 resistance at the $460 level and a mid-summer post-earnings rally that set it on a path of higher highs. LMT now boasts a 35.4% year-to-date lead. LMT Chart October 212024\n\nDespite LMT's outperformance, analysts still aren't on board. Relative to its current perch, the stock's 12-month consensus target price of $588.77 is a 4.2% discount, and nine of 21 covering brokerages rate it a \"hold\" or worse. This negative sentiment could shift if Lockheed Martin stock grabs more record highs in the event of a quarterly beat.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-stock-hits-record-174016088.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.581,
            "neg": 0.026,
            "neu": 0.919,
            "pos": 0.055
        }
    },
    {
        "date": "2024-10-21T14:26:00+00:00",
        "title": "Key Earnings Reports Expected This Week: TSLA, BA, GE",
        "content": "Monday, October 21st, 2024\r\n\r\nWhat’s ahead of us is the busiest week of Q3 earnings season so far. A total of 761 companies are listed in our Zacks Earnings Calendar, which you can see here.\r\n\r\nAmong the biggest names reporting this week, we’ve got GM GM and GE Aerospace GE tomorrow, along with Lockheed Martin LMT, Boeing BA and Tesla TSLA Wednesday, and UPS UPS Thursday.\n\nStock Market Performance and What’s to Come\n\nThis morning’s pre-market activity is starting off slowly, with the Dow, S&P 500 and Nasdaq all riding 6-week winning streaks. The Dow and the Nasdaq are both -70 points at this hour, with the S&P -12 points. Only the small-cap Russell 2000, which has made strides to catch up to its larger-cap brethren, has seen patches of weekly performance inconsistently of late.\r\n\r\nThe month of October has been a good one after an iffy start — and this follows an uncharacteristically strong September. Over the past month of trading, only the Nasdaq, at +1.6%, is below +2% growth. All four major indexes are up double digits year to date, led by the Nasdaq +23%.\n\nEconomic Reports This Week\n\nCompared to next week, which brings us not only a new Personal Consumption Expenditure (PCE) report but also an earlier-than-normal print on the Employment Situation, this week will be relatively uneventful. Even last week, with Retail Sales and Housing Starts data, was more instructive to the markets than this week promises to be.\r\n\r\nAfter today’s open, we’ll see Leading Economic Indicators (LEI) for September, a conglomerate of data expected to tick down to -0.3% from -0.2% posted a month ago. There will also be a new Beige Book from the Fed out Wednesday, along with New and Existing Home Sales Wednesday and Thursday.\r\n\r\nNext week, however, with its more consequential economic prints, are ahead of the following week which promises to be even more consequential: the 2024 General Election Day is Tuesday of that week, November 5th, with the Fed meeting pushed out a day to Wednesday and Thursday of that week. That Fed meeting will decide whether a new 25 basis point (bps) interest rate cut is coming; the Election will decide how the country will ber run for the next four years.\r\n\r\nQuestions or comments about this article and/or author? Click here>>\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nStory continues\n\nGE Aerospace (GE) : Free Stock Analysis Report\n\nUnited Parcel Service, Inc. (UPS) : Free Stock Analysis Report\n\nGeneral Motors Company (GM) : Free Stock Analysis Report\n\nTesla, Inc. (TSLA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/key-earnings-reports-expected-week-142600894.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.005,
            "neu": 0.889,
            "pos": 0.106
        }
    },
    {
        "date": "2024-10-21T11:00:15+00:00",
        "title": "Lockheed Martin Corporation (NYSE:LMT) is favoured by institutional owners who hold 74% of the company",
        "content": "Key Insights\n\nGiven the large stake in the stock by institutions, Lockheed Martin's stock price might be vulnerable to their trading decisions 51% of the business is held by the top 8 shareholders Recent sales by insiders\n\nIf you want to know who really controls Lockheed Martin Corporation (NYSE:LMT), then you'll have to look at the makeup of its share registry. The group holding the most number of shares in the company, around 74% to be precise, is institutions. In other words, the group stands to gain the most (or lose the most) from their investment into the company.\n\nGiven the vast amount of money and research capacities at their disposal, institutional ownership tends to carry a lot of weight, especially with individual investors. Therefore, a good portion of institutional money invested in the company is usually a huge vote of confidence on its future.\n\nLet's delve deeper into each type of owner of Lockheed Martin, beginning with the chart below.\n\nSee our latest analysis for Lockheed Martin  ownership-breakdown\n\nWhat Does The Institutional Ownership Tell Us About Lockheed Martin?\n\nMany institutions measure their performance against an index that approximates the local market. So they usually pay more attention to companies that are included in major indices.\n\nLockheed Martin already has institutions on the share registry. Indeed, they own a respectable stake in the company. This can indicate that the company has a certain degree of credibility in the investment community. However, it is best to be wary of relying on the supposed validation that comes with institutional investors. They too, get it wrong sometimes. If multiple institutions change their view on a stock at the same time, you could see the share price drop fast. It's therefore worth looking at Lockheed Martin's earnings history below. Of course, the future is what really matters. earnings-and-revenue-growth\n\nInvestors should note that institutions actually own more than half the company, so they can collectively wield significant power. Lockheed Martin is not owned by hedge funds. The company's largest shareholder is State Street Global Advisors, Inc., with ownership of 15%. In comparison, the second and third largest shareholders hold about 11% and 9.0% of the stock.\n\nWe did some more digging and found that 8 of the top shareholders account for roughly 51% of the register, implying that along with larger shareholders, there are a few smaller shareholders, thereby balancing out each others interests somewhat.\n\nResearching institutional ownership is a good way to gauge and filter a stock's expected performance. The same can be achieved by studying analyst sentiments. There are a reasonable number of analysts covering the stock, so it might be useful to find out their aggregate view on the future.\n\nStory continues\n\nInsider Ownership Of Lockheed Martin\n\nThe definition of company insiders can be subjective and does vary between jurisdictions. Our data reflects individual insiders, capturing board members at the very least. The company management answer to the board and the latter should represent the interests of shareholders. Notably, sometimes top-level managers are on the board themselves.\n\nInsider ownership is positive when it signals leadership are thinking like the true owners of the company. However, high insider ownership can also give immense power to a small group within the company. This can be negative in some circumstances.\n\nOur data suggests that insiders own under 1% of Lockheed Martin Corporation in their own names. It is a very large company, so it would be surprising to see insiders own a large proportion of the company. Though their holding amounts to less than 1%, we can see that board members collectively own US$79m worth of shares (at current prices). In this sort of situation, it can be more interesting to  see if those insiders have been buying or selling.\n\nGeneral Public Ownership\n\nWith a 15% ownership, the general public, mostly comprising of individual investors, have some degree of sway over Lockheed Martin. While this group can't necessarily call the shots, it can certainly have a real influence on how the company is run.\n\nNext Steps:\n\nIt's always worth thinking about the different groups who own shares in a company. But to understand Lockheed Martin better, we need to consider many other factors. Consider for instance, the ever-present spectre of investment risk.  We've identified 2 warning signs  with Lockheed Martin , and understanding them should be part of your investment process.\n\nIf you are like me, you may want to think about whether this company will grow or shrink. Luckily, you can check this free report showing analyst forecasts for its future.\n\nNB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-corporation-nyse-lmt-110015222.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.024,
            "neu": 0.882,
            "pos": 0.094
        }
    },
    {
        "date": "2024-10-21T07:05:34+00:00",
        "title": "Lockheed Martin (LMT) To Report Earnings Tomorrow: Here Is What To Expect",
        "content": "Lockheed Martin (LMT) To Report Earnings Tomorrow: Here Is What To Expect\n\nSecurity and Aerospace company Lockheed Martin (NYSE:LMT) will be reporting results tomorrow morning. Here’s what to look for.\n\nLockheed Martin beat analysts’ revenue expectations by 6.5% last quarter, reporting revenues of $18.12 billion, up 8.6% year on year. It was an exceptional quarter for the company, with an impressive beat of analysts’ organic revenue and EPS estimates.\n\nIs Lockheed Martin a buy or sell going into earnings? Read our full analysis here, it’s free.\n\nThis quarter, analysts are expecting Lockheed Martin’s revenue to grow 2.9% year on year to $17.37 billion, improving from the 1.8% increase it recorded in the same quarter last year. Adjusted earnings are expected to come in at $6.44 per share. Lockheed Martin Total Revenue\n\nHeading into earnings, analysts covering the company have grown increasingly bearish with revenue estimates seeing 8 downward revisions over the last 30 days (we track 16 analysts). Lockheed Martin has only missed Wall Street’s revenue estimates once over the last two years, exceeding top-line expectations by 3.7% on average.\n\nLooking at Lockheed Martin’s peers in the aerospace and defense segment, only Byrna has reported results so far. It met analysts’ revenue estimates, delivering year-on-year sales growth of 194%. The stock was down 18.4% on the results.\n\nRead our full analysis of Byrna’s earnings results here.\n\nThere has been positive sentiment among investors in the aerospace and defense segment, with share prices up 3.3% on average over the last month. Lockheed Martin is up 5.6% during the same time and is heading into earnings with an average analyst price target of $598.56 (compared to the current share price of $612.99).\n\nToday’s young investors likely haven’t read the timeless lessons in Gorilla Game: Picking Winners In High Technology because it was written more than 20 years ago when Microsoft and Apple were first establishing their supremacy. But if we apply the same principles, then enterprise software stocks leveraging their own generative AI capabilities may well be the Gorillas of the future. So, in that spirit, we are excited to present our Special Free Report on a profitable, fast-growing enterprise software stock that is already riding the automation wave and looking to catch the generative AI next.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-report-earnings-070534184.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.991,
            "neg": 0.005,
            "neu": 0.872,
            "pos": 0.123
        }
    }
]