[
    {
        "date": "2024-06-25T16:48:00+00:00",
        "title": "Northrop (NOC) Wins Contract to Support E-2D Hawkeye Jets",
        "content": "Northrop Grumman Corp.’s NOC business unit, Northrop Grumman Systems, recently clinched a contract involving its E-2D Advanced Hawkeye jets. The award has been provided by the Naval Air Systems Command, Patuxent River, MD.\n\nDetails of the Deal\n\nValued at $13.9 million, the contract is expected to be completed by June 2026. Per the terms of the deal, Northrop will manufacture and supply 12 motor controllers, 13 n-voice and data recorders, and 12 standard automatic flight control systems. These equipment will be provided to aid production efforts for E-2D Advanced Hawkeye aircraft.\n\nWork related to this deal will be carried out in Grand Rapids, MI; Los Angeles, CA; and Endicott, NY.\n\nWhat’s Favoring Northrop?\n\nNations across the globe are reinforcing their military capabilities to strengthen their defense structure in the growing threat environment worldwide. In this context, military aircraft that play a critical role in military missions have also been witnessing a significant rise in demand. This, in turn, has been ushering in solid order flows for major combat aircraft manufacturers like Northrop.\n\nTo this end, it is imperative to mention that Northrop’s E-2D Hawkeye aircraft boasts battle management, theater air, missile defense and multiple sensor fusion capabilities in an airborne system. These provide the warfighter with expanded battlespace awareness, especially in the area of information operations.\n\nThrough its effective radar sensor and robust network-enabled capability, the Advanced Hawkeye aircraft provides critical, actionable data to joint forces and first responders.\n\nSuch features of the aircraft make it an attractive choice for the military, resulting in NOC winning multiple orders for the same, like the latest one. Such orders are likely to boost Northrop’s revenue generation prospects in the military aircraft business arena.\n\nNOC’s Growth Prospects\n\nFactors like increasing defense spending by developed nations, rising defense investment from emerging economies, rapidly rising geopolitical tensions worldwide like the ongoing hostility in the Middle East, and the rising incorporation of technology to elevate both the quality and efficiency of the new-age military jets have been bolstering the growth prospects of the combat jet market.\n\nThis must have prompted the Morder Intelligence firm to project a CAGR of 3.7% for the global fighter aircraft market in the 2024-2029 period. Such growth prospects should benefit Northrop as its product portfolio offers a wide range of manned and unmanned aircraft that already enjoys an established position in the military aviation market.\n\nStory continues\n\nSince the 1930s, the company has been offering varied manned aircraft solutions to global customers worldwide. These solutions range from fighter jets and stealth bombers to surveillance and electronic warfare. Notably, apart from E-2D, NOC builds the B-2 Spirit Stealth Bomber jet, which is the only long-range penetrating stealth bomber in the U.S. arsenal. Among unmanned air solutions, its MQ-4C Triton deserves a special mention because it provides real-time intelligence, surveillance, reconnaissance and targeting (ISR&T) over vast ocean and coastal regions.\n\nOpportunities for Peers\n\nThe abounding growth prospects of the military aviation market should also benefit other defense majors like Lockheed Martin LMT, Boeing BA and Textron TXT that manufacture combat jets.\r\n\r\nLockheed Martin’s Aeronautics segment is engaged in the research, design, development, manufacture, integration, sustainment, support and upgrade of advanced military aircraft, including combat and air mobility aircraft, unmanned air vehicles and related technologies. Its major programs include the F-35 Lightning II Joint Strike Fighter jet, the C-130 Hercules airlifter, the F-16 Fighting Falcon jet and the F-22 Raptor jet.\n\nLMT’s long-term earnings growth rate is 4.1%. Shares of LMT have returned 7% to its investors in the past year.\n\nBoeing’s Defense, Space & Security segment’s primary products include fixed-wing military aircraft, F/A-18E/F Super Hornet, F-15 programs, P-8 programs, KC-46A Tanker and T-7A Red Hawk. The segment also manufactures rotorcraft and rotary-wing programs, such as CH-47 Chinook, AH-64 Apache and V-22 Osprey.\n\nBoeing’s long-term earnings growth rate is 25.5%. The stock boasts a four-quarter average earnings surprise of 17.83%.\n\nTextron’s business unit, Textron Aviation Defense, designs, builds and supports versatile and globally known military aircraft preferred for training and attack missions. Some of Textron’s renowned products include the Beechcraft T-6C trainer and the AT-6 Wolverine.\n\nThe company boasts a long-term earnings growth rate of 10.1%. The Zacks Consensus Estimate for its 2024 sales indicates growth of 5.6% from the previous year’s reported number.\n\nPrice Movement\n\nIn the past year, shares of Northrop have lost 2.3% compared with the industry’s 7.8% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nNorthrop currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/northrop-noc-wins-contract-support-164800682.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0LF0.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.046,
            "neu": 0.769,
            "pos": 0.185
        }
    },
    {
        "date": "2024-06-25T13:00:10+00:00",
        "title": "Lockheed Martin Corporation (LMT) is Attracting Investor Attention: Here is What You Should Know",
        "content": "Lockheed Martin (LMT) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\n\nOver the past month, shares of this aerospace and defense company have returned +0.9%, compared to the Zacks S&P 500 composite's +2.8% change. During this period, the Zacks Aerospace - Defense industry, which Lockheed falls in, has lost 1.5%. The key question now is: What could be the stock's future direction?\n\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\n\nEarnings Estimate Revisions\n\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\n\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nFor the current quarter, Lockheed is expected to post earnings of $6.45 per share, indicating a change of -4.2% from the year-ago quarter. The Zacks Consensus Estimate remained unchanged over the last 30 days.\n\nThe consensus earnings estimate of $26.26 for the current fiscal year indicates a year-over-year change of -5.6%. This estimate has remained unchanged over the last 30 days.\n\nFor the next fiscal year, the consensus earnings estimate of $28.37 indicates a change of +8% from what Lockheed is expected to report a year ago. Over the past month, the estimate has remained unchanged.\n\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Lockheed.\n\nStory continues\n\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n\n12 Month EPS\n\nRevenue Growth Forecast\n\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\n\nFor Lockheed, the consensus sales estimate for the current quarter of $17.03 billion indicates a year-over-year change of +2%. For the current and next fiscal years, $69.72 billion and $72.44 billion estimates indicate +3.2% and +3.9% changes, respectively.\n\nLast Reported Results and Surprise History\n\nLockheed reported revenues of $17.2 billion in the last reported quarter, representing a year-over-year change of +13.7%. EPS of $6.33 for the same period compares with $6.43 a year ago.\n\nCompared to the Zacks Consensus Estimate of $16.19 billion, the reported revenues represent a surprise of +6.21%. The EPS surprise was +9.14%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\n\nValuation\n\nWithout considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\n\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\n\nThe Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\n\nLockheed is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\n\nConclusion\n\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Lockheed. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-corporation-lmt-attracting-130010009.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.011,
            "neu": 0.859,
            "pos": 0.129
        }
    }
]