[
    {
        "date": "2024-09-16T22:00:21+00:00",
        "title": "Lockheed Martin (LMT) Beats Stock Market Upswing: What Investors Need to Know",
        "content": "Lockheed Martin (LMT) ended the recent trading session at $572.92, demonstrating a +0.53% swing from the preceding day's closing price. The stock exceeded the S&P 500, which registered a gain of 0.13% for the day. Meanwhile, the Dow gained 0.55%, and the Nasdaq, a tech-heavy index, lost 0.52%.\n\nShares of the aerospace and defense company have appreciated by 1.75% over the course of the past month, underperforming the Aerospace sector's gain of 3.14% and the S&P 500's gain of 3.67%.\n\nThe upcoming earnings release of Lockheed Martin will be of great interest to investors. It is anticipated that the company will report an EPS of $6.40, marking a 5.47% fall compared to the same quarter of the previous year. Meanwhile, the latest consensus estimate predicts the revenue to be $17.45 billion, indicating a 3.37% increase compared to the same quarter of the previous year.\n\nFor the entire fiscal year, the Zacks Consensus Estimates are projecting earnings of $26.49 per share and a revenue of $71.14 billion, representing changes of -4.78% and +5.28%, respectively, from the prior year.\n\nInvestors should also note any recent changes to analyst estimates for Lockheed Martin. These latest adjustments often mirror the shifting dynamics of short-term business patterns. Consequently, upward revisions in estimates express analysts' positivity towards the company's business operations and its ability to generate profits.\n\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. To take advantage of this, we've established the Zacks Rank, an exclusive model that considers these estimated changes and delivers an operational rating system.\n\nThe Zacks Rank system, running from #1 (Strong Buy) to #5 (Strong Sell), holds an admirable track record of superior performance, independently audited, with #1 stocks contributing an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has remained steady. As of now, Lockheed Martin holds a Zacks Rank of #3 (Hold).\n\nDigging into valuation, Lockheed Martin currently has a Forward P/E ratio of 21.52. This expresses a premium compared to the average Forward P/E of 21 of its industry.\n\nOne should further note that LMT currently holds a PEG ratio of 4.6. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The average PEG ratio for the Aerospace - Defense industry stood at 1.88 at the close of the market yesterday.\n\nStory continues\n\nThe Aerospace - Defense industry is part of the Aerospace sector. This group has a Zacks Industry Rank of 39, putting it in the top 16% of all 250+ industries.\n\nThe Zacks Industry Rank assesses the strength of our separate industry groups by calculating the average Zacks Rank of the individual stocks contained within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nBe sure to follow all of these stock-moving metrics, and many more, on Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-beats-stock-220021266.html",
        "symbols": [
            "0R3E.LSE",
            "GSPC.INDX",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.003,
            "neu": 0.877,
            "pos": 0.121
        }
    },
    {
        "date": "2024-09-16T15:40:14+00:00",
        "title": "LDOS or LMT: Which Is the Better Value Stock Right Now?",
        "content": "Investors looking for stocks in the Aerospace - Defense sector might want to consider either Leidos (LDOS) or Lockheed Martin (LMT). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look.\n\nWe have found that the best way to discover great value opportunities is to pair a strong Zacks Rank with a great grade in the Value category of our Style Scores system. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits.\n\nCurrently, Leidos has a Zacks Rank of #2 (Buy), while Lockheed Martin has a Zacks Rank of #3 (Hold). The Zacks Rank favors stocks that have recently seen positive revisions to their earnings estimates, so investors should rest assured that LDOS has an improving earnings outlook. But this is only part of the picture for value investors.\n\nValue investors analyze a variety of traditional, tried-and-true metrics to help find companies that they believe are undervalued at their current share price levels.\n\nOur Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years.\n\nLDOS currently has a forward P/E ratio of 17.37, while LMT has a forward P/E of 21.52. We also note that LDOS has a PEG ratio of 1.39. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. LMT currently has a PEG ratio of 4.60.\n\nAnother notable valuation metric for LDOS is its P/B ratio of 4.64. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, LMT has a P/B of 22.\n\nThese are just a few of the metrics contributing to LDOS's Value grade of B and LMT's Value grade of C.\n\nLDOS has seen stronger estimate revision activity and sports more attractive valuation metrics than LMT, so it seems like value investors will conclude that LDOS is the superior option right now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLeidos Holdings, Inc. (LDOS) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/ldos-lmt-better-value-stock-154014473.html",
        "symbols": [
            "0R3E.LSE",
            "LDOS.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "S6IA.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.005,
            "neu": 0.775,
            "pos": 0.22
        }
    },
    {
        "date": "2024-09-16T12:45:00+00:00",
        "title": "NDMA to Acquire Lockheed Martin's Three More TPY-4 Radars",
        "content": "Lockheed Martin Corp. LMT recently secured a deal for three more TPY-4 radars from the Norwegian Defense Materiel Agency (“NDMA”), increasing the number of ground-based multi-mission radars for NDMA to 11.\r\n\r\nThe extra order and the completion of the Critical Design Review are key steps forward, validating the radar’s importance in Norway's security.\n\nLMT’s High-Quality Radars\n\nWith the fast growth of geopolitical tensions in recent years, governments throughout the world have significantly strengthened their military arsenal. As radars are such a crucial component of this arsenal, rising defense spending has resulted in a rise in radar investments.\r\n\r\nMilitary ground-based radars are crucial for observing, tracking, and recognizing surface and aerial threats. By providing real-time data, they enhance situational awareness, aid early warning systems and assist in defensive operations. This must have been ushering in a solid order flow for radar manufacturing companies like Lockheed Martin, whose radars are chosen by more than 45 countries across six continents. \r\n\r\nLMT's TPY-4 is a multi-mission, ground-based radar for air defense surveillance that can operate in disputed electromagnetic environments and allows the warfighter to detect and monitor existing and potential threats. It is also equipped with Gallium Nitride technology, which increases efficiency and reliability when compared to previous systems.\n\nLockheed’s Growth Opportunities\n\nThe need for military radars has skyrocketed in recent years due to causes such as rising defense spending in developing countries, increased geopolitical tensions and inter-country conflicts that have heightened threats from missiles and aircraft. This must have prompted the Markets and Markets firm to project a CAGR of 5.4% for the military radar market in the 2024-2029 period. Such growth projections bode well for prominent radar manufacturers like LMT.\r\n\r\nLMT’s product portfolio consists of more varied radars like missile defense radars, ballistic missile radars as well as surveillance radars. Apart from TPY-4, the AN/APY-9 Radar, the AN/TPQ-53 Radar System, SPY-7, TPS-77 and Sentinel A4 are some of the company’s combat-proven products that enjoy solid demand in the global military radar market.\n\nProspects of LMT’s Peers\n\nOther defense contractors that are major radar producers and are projected to gain from the growth potential provided by the global military radar industry are listed below:\r\n\r\nRTX Corporation RTX: The company’s product portfolio consists of varied radars like integrated air and missile defense radars, ballistic missile radars, surveillance radars and air dominance radars. Radars like SPY 6, APG-63(V)3, APG-79 and APG-82(V)1 and GhostEye are some of its combat-proven products that enjoy solid demand in the global military radar market.\r\n\r\nRTX has a long-term (three to five years) earnings growth rate of 10.4%. The Zacks Consensus Estimate for the company’s 2024 sales indicates year-over-year growth of 7%.\r\n\r\nNorthrop Grumman NOC: The company has been at the forefront of AESA innovations for more than 60 years. Its diverse product portfolio includes a handful of other radars like AN/ZPY-5 VADER, AN/TPS-80 G/ATOR, AN/TPS-78 and HAMMR.\r\n\r\nNorthrop has a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for the company’s 2024 sales indicates year-over-year growth of 5.4%.\r\n\r\nL3Harris Technologies LHX: The company manufactures combat-proven radars like SPS-48 land-based surveillance radar, AN/APY-11 Multimode radar, Tactical Air Surveillance radar, AN/SPS-48G Long range 3D surveillance radar and many more. \r\n\r\nL3Harris has a long-term earnings growth rate of 8.9%. The Zacks Consensus Estimate for LHX’s 2024 sales implies an improvement of 9.6% from the prior-year figure.\n\nStory continues\n\nLMT Stock’s Price Movement\n\nIn the past six months, shares of Lockheed Martin have risen 31.6% compared with the industry’s growth of 2.8%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLMT’s Zacks Rank\n\nLMT currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nL3Harris Technologies Inc (LHX) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/ndma-acquire-lockheed-martins-three-124500721.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.XETRA",
            "LHX.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.035,
            "neu": 0.8,
            "pos": 0.165
        }
    }
]