[
    {
        "date": "2024-05-08T12:20:00+00:00",
        "title": "Spirit AeroSystems (SPR) Q1 Loss Widens, Revenues Rise Y/Y",
        "content": "Spirit AeroSystems Holdings, Inc. SPR reported a first-quarter 2024 adjusted loss of $3.93 per share, which came in much wider than the Zacks Consensus Estimate of a loss of 44 cents per share. The loss also widened from the year-ago quarter’s reported loss of $1.69 per share.\r\n\r\nBarring one-time adjustments, Spirit AeroSystems recorded a GAAP loss of $5.31 per share compared with a loss of $2.68 in the prior-year period.\n\nHighlights of the Release\n\nTotal revenues of $1.70 billion lagged the Zacks Consensus Estimate of $1.73 billion by 1.7%. However, the top line rose 19% on a year-over-year basis, driven by higher production activities of the company’s commercial programs as well as higher Defense and Space revenues.\n\nSpirit Aerosystems Holdings, Inc. Price, Consensus and EPS Surprise Spirit Aerosystems Holdings, Inc. Price, Consensus and EPS Surprise\n\nSpirit Aerosystems Holdings, Inc. price-consensus-eps-surprise-chart | Spirit Aerosystems Holdings, Inc. Quote\n\nSpirit AeroSystems’ backlog at the end of the first quarter totaled $49 billion, up from the prior quarter’s $37 billion.\n\nSegmental Performance\n\nCommercial Segment: Revenues in the segment increased 18.1% year over year to $1.36 billion. The upside was driven by higher production across most of its programs.\r\n\r\nThe segment’s operating loss was $484.9 million compared with the operating loss of $45.5 million in the year-ago period. The deterioration can be attributed to higher changes in estimates as well as the results of the changes implemented in the product verification process in March 2024.\r\n\r\nDefense & Space: The segment recorded revenues of $250.8 million, up 33.1% year over year, driven by increased activity of development and classified programs as well as the Sikorsky CH-53K and FLRAA programs.\r\n\r\nThe unit’s operating income increased 67.7% to $32.2 million from $19.2 million in the prior-year quarter, driven by higher activities of classified programs.\r\n\r\nAftermarket: This segment’s top line improved 1.5% year over year to $95.9 million, driven by higher spare part sales.\r\n\r\nThe segment’s operating profit decreased 10.4% year over year to $17.2 million owing to lower maintenance, repair and overhaul activity.\n\nOperational Highlights\n\nTotal operating costs and expenses rose 46.1% year over year to $2.23 billion due to the higher cost of sales as well as selling, general and administrative expenses.\r\n\r\nSPR’s operating loss in the first quarter of 2024 totaled $527.6 million compared with the operating loss of $95.1 million in the prior-year quarter. This deterioration was mainly due to unfavorable changes in estimates.\n\nFinancial Position\n\nAs of Mar 28, 2024, Spirit AeroSystems had $352 million in cash and cash equivalents compared with $823.5 million as of Dec 31, 2023.\r\n\r\nThe long-term debt as of Mar 28, 2024 totaled $3.99 billion compared with $4.02 billion as of Dec 31, 2023.\r\n\r\nCash outflow from operating activities amounted to $415.6 million during the first quarter of 2024 compared with cash outflow of $46.2 million recorded a year ago.\n\nStory continues\n\nZacks Rank\n\nSpirit AeroSystems currently carries a Zacks Rank #5 (Strong Sell).\n\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nRecent Defense Releases\n\nRTX Corporation’s RTX first-quarter 2024 adjusted earnings per share of $1.34 beat the Zacks Consensus Estimate of $1.23 by 8.9%. The bottom line also improved 9.8% from the year-ago quarter’s level of $1.22.\r\n\r\nRTX’s first-quarter net sales were $19,305 million, which surpassed the Zacks Consensus Estimate of $18,412.6 million by 4.8%. The top line also improved 12% from $17,214 million recorded in the first quarter of 2023.\r\n\r\nLockheed Martin Corporation LMT reported first-quarter 2024 adjusted earnings of $6.33 per share, which beat the Zacks Consensus Estimate of $5.80 by 9.1%. However, the bottom line declined 1.6% from the year-ago quarter's recorded figure of $6.43.\r\n\r\nIts net sales were $17.20 billion, which surpassed the Zacks Consensus Estimate of $16.19 billion by 6.2%. The top line also increased 13.7% from $15.13 billion reported in the year-ago quarter.\r\n\r\nHexcel Corporation HXL reported first-quarter 2024 adjusted earnings of 44 cents per share, which came in line with the Zacks Consensus Estimate.\r\n\r\nIn the first quarter, the company’s net sales totaled $472.3 million, which missed the Zacks Consensus Estimate of $475 million by 0.6%. However, the top line witnessed an improvement of 3.2% from the year-ago quarter’s reported figure of $457.7 million.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nSpirit Aerosystems Holdings, Inc. (SPR) : Free Stock Analysis Report\n\nHexcel Corporation (HXL) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/spirit-aerosystems-spr-q1-loss-122000362.html",
        "symbols": [
            "0R3E.LSE",
            "HXL.F",
            "HXL.STU",
            "HXL.US",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "S9Q.BE",
            "S9Q.F",
            "S9Q.MU",
            "SPR.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.039,
            "neu": 0.84,
            "pos": 0.121
        }
    },
    {
        "date": "2024-05-08T11:00:15+00:00",
        "title": "If EPS Growth Is Important To You, Lockheed Martin (NYSE:LMT) Presents An Opportunity",
        "content": "The excitement of investing in a company that can reverse its fortunes is a big draw for some speculators, so even companies that have no revenue, no profit, and a record of falling short, can manage to find investors. But as Peter Lynch said in One Up On Wall Street, 'Long shots almost never pay off.' While a well funded company may sustain losses for years, it will need to generate a profit eventually, or else investors will move on and the company will wither away.\n\nIf this kind of company isn't your style, you like companies that generate revenue, and even earn profits, then you may well be interested in Lockheed Martin (NYSE:LMT). While profit isn't the sole metric that should be considered when investing, it's worth recognising businesses that can consistently produce it.\n\nCheck out our latest analysis for Lockheed Martin\n\nHow Quickly Is Lockheed Martin Increasing Earnings Per Share?\n\nGenerally, companies experiencing growth in earnings per share (EPS) should see similar trends in share price. That makes EPS growth an attractive quality for any company. Over the last three years, Lockheed Martin has grown EPS by 4.0% per year. That might not be particularly high growth, but it does show that per-share earnings are moving steadily in the right direction.\n\nTop-line growth is a great indicator that growth is sustainable, and combined with a high earnings before interest and taxation (EBIT) margin, it's a great way for a company to maintain a competitive advantage in the market. While we note Lockheed Martin achieved similar EBIT margins to last year, revenue grew by a solid 5.2% to US$70b. That's encouraging news for the company!\n\nIn the chart below, you can see how the company has grown earnings and revenue, over time. Click on the chart to see the exact numbers. earnings-and-revenue-history\n\nThe trick, as an investor, is to find companies that are going to perform well in the future, not just in the past. While crystal balls don't exist, you can check our visualization of consensus analyst forecasts for Lockheed Martin's future EPS 100% free.\n\nAre Lockheed Martin Insiders Aligned With All Shareholders?\n\nSince Lockheed Martin has a market capitalisation of US$112b, we wouldn't expect insiders to hold a large percentage of shares. But thanks to their investment in the company, it's pleasing to see that there are still incentives to align their actions with the shareholders. Holding US$64m worth of stock in the company is no laughing matter and insiders will be committed in delivering the best outcomes for shareholders. This would indicate that the goals of shareholders and management are one and the same.\n\nStory continues\n\nIs Lockheed Martin Worth Keeping An Eye On?\n\nOne important encouraging feature of Lockheed Martin is that it is growing profits. For those who are looking for a little more than this, the high level of insider ownership enhances our enthusiasm for this growth. That combination is very appealing. So yes, we do think the stock is worth keeping an eye on. It's still necessary to consider the ever-present spectre of investment risk.  We've identified 2 warning signs  with Lockheed Martin , and understanding these should be part of your investment process.\n\nThere's always the possibility of doing well buying stocks that are not growing earnings and do not have insiders buying shares. But for those who consider these important metrics, we encourage you to check out companies that do have those features. You can access a tailored list of companies which have demonstrated growth backed by recent insider purchases.\n\nPlease note the insider transactions discussed in this article refer to reportable transactions in the relevant jurisdiction.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/eps-growth-important-lockheed-martin-110015056.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.026,
            "neu": 0.787,
            "pos": 0.186
        }
    },
    {
        "date": "2024-05-08T01:48:21+00:00",
        "title": "10 Weakest Militaries in Africa",
        "content": "In this article, we look at the 10 weakest militaries in Africa. You can skip our detailed analysis on defense spending patters in the continent and head over directly to the 5 Weakest Militaries in Africa.\n\nGlobal military spending increased 6.8% from 2022 – the steepest rise since 2009 – to reach a record-high of $2.44 trillion in 2023, according to latest figures released by the Stockholm International Peace Research Institute (SIPRI). This is the ninth successive year of growth in defense expenditure, with spending increasing across all regions of the world.\n\nThe United States continued to remain the largest military spender in the world, having spent a whopping $916 billion on defense in 2023, representing 37% of the world’s total defense expenditure. China, Russia, India, and Saudi Arabia retained their positions in the top five, while Ukraine climbed from 11th spot in 2022 to become the eighth largest spender on defense, having spent $64.8 billion in 2023. Combined, the top ten countries accounted for 74% of the world’s total defense expenditure during the year.\n\nIn Africa, the military spending totaled $51.6 billion in 2023, which was 22% higher than in 2022, and represented 2.1% of the global defense expenditure. Of this, $28.5 billion was spent in North Africa, with Algeria and Morocco together accounting for 82% of the military spending in the region. This spike was driven by Algiers’ defense bills soaring 76% compared to 2022 to reach $18.3 billion, made possible by an increase in demand for Algerian gas exports amid sanctions against Russia. On the other hand, $23.1 billion was incurred on defense by states in Sub-Saharan Africa, with 20% of the amount attributed to Nigeria. As is evident from these numbers, while defense spending continues to rise each year, the increase is not even. Neither across continents, nor within.\n\nArms Procurement in Africa\n\nRussia is Africa’s largest arms trade partner, especially in Sub-Saharan Africa, with the country’s exports to the continent increasing 23% between 2016 and 2020, compared to 2011 and 2015. This is seen by analysts as a strategic move by Moscow to facilitate trade and soft power in Africa, which would enable Russia to build a presence at NATO’s southern flank. That being said, sanctions against Moscow in recent years have created an opening for Chinese armament manufacturers as well, with the Asian giant exporting over $2 billion worth of military supplies to Sub-Saharan Africa between 2010 and 2021. Arms sales of the United States to the subregion during this period were estimated to be $473 million, according to the Atlantic Council.\n\nStory continues\n\nThe situation is strikingly different in North Africa, where American defense companies play a much more active role, driven by the decades-long arms race between Algeria and Morocco, coupled with President Sisi's quest for Egypt to become a major regional power. Washington in April last year, approved the potential sale of HIMARS and related equipment to Rabat under a $524 million deal, with Lockheed Martin Corporation (NYSE:LMT), L3Harris Technologies, Inc. (NYSE:LHX), and RTX Corporation (NYSE:RTX) being among the major contractors of the deal. The Pentagon also approved selling Joint Stand Off Weapons to Morocco for a cost of $250 million, with RTX Corporation (NYSE:RTX) being the primary contractor of the project.\n\nOn the other hand, Cairo has also been looking to upgrade its defense systems with advanced American air radars. In January 2022, the US approved the sale of three L3Harris Technologies, Inc. (NYSE:LHX) SPS-48 land-based radars for $355 million to Egypt, which would offer the African nation jamming capabilities and help it detect even extremely small targets. A year prior to this in February 2021, it was reported that Egypt also received the Rolling Airframe Missiles manufactured by RTX Corporation (NYSE:RTX) under a $197 million agreement.\n\nMoreover, elsewhere in the African continent, the United States has actively begun donating military equipment to several countries in the region to aid them in combating terrorism and crime. In 2014, the United States gave away two Cessna 208 Caravan aircraft to Mauritania to help the country in its fight against maritime time and terrorist groups. Both the aircraft were manufactured by Cessna, owned by Textron Inc. (NYSE:TXT), and were valued at $21 million each at the time.\n\nMore recently in 2021, the American government donated a Lockheed Martin Corporation (NYSE:LMT) C-130 aircraft to Niger to use in operations related to humanitarian assistance and mobility of UN peacekeeping missions. The C-130 is one of the top-selling tactical aircraft in the world, and has been continuously manufactured by Lockheed Martin Corporation (NYSE:LMT) since its first flight in 1954.\n\nLast year, the United States announced an $80 million grant to donate four Bell 412EP helicopters built by Bell Helicopters, a subsidiary of Textron Inc. (NYSE:TXT), to the Zambian Air Force. Under the grant, the US was also to provide three years of service and training for the helicopter. The Zambian government thanked Washington for the donation, and stated that the helicopters would assist the country in enhancing regional security, and in supporting UN peacekeeping missions in the continent.\n\nAlso see 15 Most Powerful Militaries in Africa. 10 Weakest Militaries in Africa\n\nMethodology\n\nSeveral weighted metrics have been considered to rank the weakest militaries in Africa. These include capabilities of ground forces (40%) determined by manpower, tanks, and armored fighting vehicles; naval and aerial strength (30%), and economic potential and defense spending (30%). Weighted scores for each metric were aggregated to get an overall weighted score. The 10 weakest militaries in Africa are listed in this article in descending order of their weighted scores.\n\nMilitary-related data has been sourced from our recent article, 15 Weakest Militaries in the World, while the International Monetary Fund (IMF) was consulted for figures related to GDP in 2023.\n\nBy the way, Insider Monkey is an investing website that uses a consensus approach to identify the best stock picks of more than 900 hedge funds investing in US stocks. The website tracks the movement of corporate insiders and hedge funds. Our top 10 consensus stock picks of hedge funds outperformed the S&P 500 stock index by more than 140 percentage points over the last 10 years (see the details here). So, if you are looking for the best stock picks to buy, you can benefit from the wisdom of hedge funds and corporate insiders.\n\nLet’s now head over to the list of the weakest militaries in Africa.\n\n10. Senegal\n\nGDP (2023): $31.14 billion\n\nDefense Spending (2023): $345 million\n\nManpower: 17,000\n\nTanks: 0\n\nArmored Fighting Vehicles: 1,104\n\nMilitary Aircraft: 27\n\nNaval Assets: 4\n\nOverall Score: 12\n\nSenegal has one of the weakest militaries in Africa, with only 17,000 active military personnel. The country’s armed forces have no battle tanks, and only four naval assets. Its fleet of 27 military aircraft comprises four special mission aircraft and 13 combat helicopters, among others, with Textron Inc. (NYSE:TXT)’s Bell 206 being one of the main choppers operated by the country. The only area of strength for Senegal’s military is its large fleet of armored fighting vehicles. That being said, the size of the country’s economy was measured at over $31 billion in 2023, with a GDP growth of 5.3% during the year. If this positive economic trend continues, Senegal can certainly look to increase defense spending to upgrade its military.\n\n9. Burkina Faso\n\nGDP (2023): $20.78 billion\n\nDefense Spending (2023): $434 million\n\nManpower: 12,000\n\nTanks: 0\n\nArmored Fighting Vehicles: 1,112\n\nMilitary Aircraft: 21\n\nNaval Assets: 0\n\nOverall Score: 10.9\n\nBurkina Faso’s military is in the news currently for the alleged massacre of over 200 civilians in two villages in February this year, as part of an ongoing campaign against civilians suspected of abetting Islamist militant groups. The country has been under military rule since 2022, and has one of the weakest armed forces in the world with no battle tanks and naval assets, and a manpower of a mere 12,000 troops. Despite that, the military holds firm control over national politics.\n\n8. Mauritania\n\nGDP (2023): $10.36 billion\n\nDefense Spending (2023): $194 million\n\nManpower: 31,500\n\nTanks: 0\n\nArmored Fighting Vehicles: 1,000\n\nMilitary Aircraft: 23\n\nNaval Assets: 5\n\nOverall Score: 10.6\n\nMauritania is next on our list of the weakest militaries in Africa, with manpower being its only recognizable area of strength. Much of the country’s military equipment is old and outdated, and of French and Soviet origin. The country has no battle tanks, and possesses only five naval assets. Mauritania has 23 military aircraft, of which four are Embraer EMB 314 Super Tucano light attack aircraft. The Air Force also has two Cessna 208 special mission aircraft it received from the United States in 2014.\n\n7. Gabon\n\nGDP (2023): $19.32 billion\n\nDefense Spending (2023): $280 million\n\nManpower: 6,500\n\nTanks: 0\n\nArmored Fighting Vehicles: 848\n\nMilitary Aircraft: 23\n\nNaval Assets: 10\n\nOverall Score: 10.2\n\nA military coup in Gabon last year ended the 56-year rule of the Bongo family over the former French colony, in a fresh blow to Paris’ interests in the region. The country relies heavily on French military assistance, which has since then been put to a halt following the collapse of Bongo’s government. This series of events is likely to further weaken Gabon’s military, which is already one of the weakest militaries in Africa, with an active manpower of only 6,500 troops. The country has no tanks, and a mere ten naval assets. Its 23 military aircraft include 6 Mirage F1 combat jets, 1 Lockheed Martin Corporation (NYSE:LMT) C-130H, and 2 C-295 transport aircraft, among other aircraft.\n\n6. Madagascar\n\nGDP (2023): $15.76 billion\n\nDefense Spending (2023): $110 million\n\nManpower: 13,000\n\nTanks: 386\n\nArmored Fighting Vehicles: 430\n\nMilitary Aircraft: 4\n\nNaval Assets: 8\n\nOverall Score: 9.4\n\nMadagascar is in sixth spot in our list of the weakest militaries in Africa. The country spent only $110 million on defense expenditure in 2023, and has a manpower of 13,000 active troops. One area of comparative strength for the military on paper appears to be a sizable fleet of battle tanks, but in reality, most of the equipment is long outdated. Working conditions for soldiers in Madagascar’s military also remain poor, with personnel reporting demotivation due to lower wages.\n\nClick to continue reading and see the 5 Weakest Militaries in Africa.\n\nSuggested Articles:\n\n15 Countries that will have the Most Powerful Militaries by 2030 15 Most Powerful Militaries in Latin America 24 Most Powerful Militaries in the World in 2024\n\nDisclosure: None. 10 Weakest Militaries in Africa is originally published on Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/10-weakest-militaries-africa-014821809.html",
        "symbols": [
            "0LF0.LSE",
            "0R3E.LSE",
            "LHX.US",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US",
            "TXT.BE",
            "TXT.DU",
            "TXT.F",
            "TXT.MU",
            "TXT.STU",
            "TXT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.988,
            "neg": 0.048,
            "neu": 0.862,
            "pos": 0.09
        }
    }
]