[
    {
        "date": "2024-09-25T22:00:21+00:00",
        "title": "Lockheed Martin (LMT) Stock Moves -0.12%: What You Should Know",
        "content": "In the latest trading session, Lockheed Martin (LMT) closed at $577.94, marking a -0.12% move from the previous day. The stock's performance was ahead of the S&P 500's daily loss of 0.19%. Elsewhere, the Dow saw a downswing of 0.7%, while the tech-heavy Nasdaq appreciated by 0.04%.\n\nHeading into today, shares of the aerospace and defense company had gained 3.25% over the past month, outpacing the Aerospace sector's gain of 1.86% and the S&P 500's gain of 1.95% in that time.\n\nInvestors will be eagerly watching for the performance of Lockheed Martin in its upcoming earnings disclosure. The company's earnings per share (EPS) are projected to be $6.40, reflecting a 5.47% decrease from the same quarter last year. Alongside, our most recent consensus estimate is anticipating revenue of $17.45 billion, indicating a 3.37% upward movement from the same quarter last year.\n\nFor the full year, the Zacks Consensus Estimates are projecting earnings of $26.49 per share and revenue of $71.14 billion, which would represent changes of -4.78% and +5.28%, respectively, from the prior year.\n\nAdditionally, investors should keep an eye on any recent revisions to analyst forecasts for Lockheed Martin. Such recent modifications usually signify the changing landscape of near-term business trends. As a result, upbeat changes in estimates indicate analysts' favorable outlook on the company's business health and profitability.\n\nOur research reveals that these estimate alterations are directly linked with the stock price performance in the near future. To utilize this, we have created the Zacks Rank, a proprietary model that integrates these estimate changes and provides a functional rating system.\n\nThe Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate remained stagnant. Lockheed Martin presently features a Zacks Rank of #2 (Buy).\n\nWith respect to valuation, Lockheed Martin is currently being traded at a Forward P/E ratio of 21.85. This valuation marks a premium compared to its industry's average Forward P/E of 21.08.\n\nOne should further note that LMT currently holds a PEG ratio of 4.67. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. As the market closed yesterday, the Aerospace - Defense industry was having an average PEG ratio of 2.07.\n\nStory continues\n\nThe Aerospace - Defense industry is part of the Aerospace sector. This industry, currently bearing a Zacks Industry Rank of 27, finds itself in the top 11% echelons of all 250+ industries.\n\nThe Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nDon't forget to use Zacks.com to keep track of all these stock-moving metrics, and others, in the upcoming trading sessions.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-stock-moves-220021529.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.003,
            "neu": 0.893,
            "pos": 0.104
        }
    },
    {
        "date": "2024-09-25T15:48:00+00:00",
        "title": "Lockheed Martin Secures a Contract for HELLFIRE II Missiles &amp; JAGM",
        "content": "Lockheed Martin Corporation LMT recently secured a modification contract valued at $42 million to provide HELLFIRE II Missiles and Joint Air-to-Ground Missiles (JAGM). The work related to this deal will be carried out in Orlando, FL, and is projected to be completed by Sept. 30, 2027.\r\n\r\nThe award has been provided by the U.S. Army Contracting Command, Redstone Arsenal, AL.\n\nWhat’s Favoring LMT?\n\nWith countries worldwide enhancing their defense capabilities, spending on advanced military arms and ammunition has been rapidly increasing. This also includes growing investments in missiles and missile systems, which are crucial for warfare missions. Lockheed Martin, as a prominent manufacturer of missiles and missile defense systems, has thus been witnessing a steady flow of orders from the Pentagon and other U.S. allies. The latest contract win is an example of that.\r\n \r\nNotably, Lockheed Martin’s HELLFIRE II missile provides precision-strike accuracy across multiple missions and targets. It offers maximum flexibility in combat. Its versatility ensures effective performance in a wide range of operational scenarios.\r\n\r\nOn the other hand, LMT’s JAGM combines the capabilities of the HELLFIRE and LONGBOW missiles into one system, providing multi-domain combat solutions. Its fire-and-forget feature enhances user survivability and allows for rapid attacks on multiple targets, thereby making it a crucial weapon against evolving global threats.\r\n\r\nSuch notable features of the aforementioned missiles of Lockheed Martin are likely to have been boosting their demand, which is further evident from the latest contract win.\n\nLMT Stock’s Growth Prospects\n\nRising military conflicts, terrorism and border disputes have led nations to increase their focus on national security, particularly on missile defense systems, backed by the rapid development of advanced missile technologies over the last decade.\r\n \r\nThis is likely to have prompted Mordor Intelligence to forecast a compound annual growth rate of 5% for the missiles and missile defense systems market during the 2024-2029 time period.\r\n\r\nThis should benefit Lockheed Martin, with its Missile and Fire Control unit being a recognized developer of high-performance missiles. The unit also pursues business in more than 50 countries worldwide. Some of its major programs are the Patriot Advanced Capability-3 and Terminal High Altitude Area Defense air and missile defense programs as well. Its prominent missiles include Precision Strike Missile, Joint Air-to-Surface Standoff Missile and Long Range AntiShip Missile.\n\nStory continues\n\nProspects of LMT’s Peers\n\nOther defense companies that are likely to enjoy the perks of the expanding missiles and missile system market have been discussed below.\r\n\r\nNorthrop Grumman Corporation NOC: Northrop Grumman provides high-speed, long-range strike weapons like the AARGM-ER, which is a supersonic, air-launched tactical missile system. It also develops and builds advance missile defense technology, ranging from command systems to directed energy weapons, advanced munitions and powerful sensors.\r\n\r\nThe company’s long-term (three to five years) earnings growth rate is 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales indicates year-over-year growth of 5.4%.\r\n\r\nRTX Corporation RTX: It is known for its missile defense systems like the Patriot and SM-6, which are in high demand globally. RTX also provides advanced sensors and interceptors to identify, track and defeat threats as part of a layered missile defense.\r\n \r\nThe company’s long-term earnings growth rate is 10.4%. The Zacks Consensus Estimate for RTX’s 2024 sales indicates year-over-year growth of 7%.\r\n\r\nThe Boeing Company BA: It manufactures various missile defense systems, including the Ground-based Midcourse Defense, Aegis Ballistic Missile Defense and Avenger. Boeing-built and supported air and missile defense systems have been protecting its customers for nearly 25 years against threats ranging from intercontinental ballistic missiles to hostile aircraft.\r\n\r\nThe company has a long-term earnings growth rate of 21.3%.  The Zacks Consensus Estimate for BA’s 2025 sales indicates year-over-year growth of 21.7%.\n\nLMT Stock’s Price Movement\n\nShares of LMT have gained 25.3% in the past three months compared with the industry’s 7.3% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLMT’s Zacks Rank\n\nLMT currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-secures-contract-hellfire-154800672.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.059,
            "neu": 0.761,
            "pos": 0.18
        }
    },
    {
        "date": "2024-09-25T14:52:00+00:00",
        "title": "This Under-the-Radar Sector Is Getting Ready to Take Flight Amid Falling Rates",
        "content": "Fed's jumbo rate cuts have eased recession fears as stocks reach record highs. Meanwhile, the industrial sector shows growth potential amid the broadening rally. We'll take a look at the sector's prospects and one stock worth considering. Looking for actionable trade ideas to navigate the current market volatility? Unlock access to InvestingPro’s AI-selected stock winners for under $9 a month!\n\nThe market has made it clear: rate cuts don't signal an imminent recession, won't bring inflation back, and don’t cap equity yields.\n\nDespite early fears in 2022 that a recession was inevitable due to the inverted yield curve and soaring inflation, those concerns never materialized.\n\nInflation appears to be under control, the Fed has already cut rates, and the stock market continues to hit record highs.\n\nHistorically, the 12-month returns following a Fed rate cut have been solid. The chart below tracks future yields after each rate cut since 1957, and the numbers speak for themselves—annual returns have been impressive. 12-Month Equity Returns\n\nIndustrials Could Ride the Rate-Cut Wave Higher\n\nIf you're looking for the next hot sector, consider industrials. Over the past decade, it has surged over 200%, driven by a strong bullish trend.\n\nBut when we compare it to the Nasdaq, we see industrials have hit new lows in the past four years. This isn’t a sign of weakness in industrial stocks but rather the exceptional strength of growth stocks. Industrial Sector Vs. Nasdaq\n\nTop Stocks to Watch From the Sector\n\nHere are 10 stocks that could extend the bullish trend in the coming months:\n\nGE Aerospace (NYSE:GE) Caterpillar (NYSE:CAT) RTX Corp. (NYSE:RTX) Union Pacific (NYSE:UNP) Uber Technologies (NYSE:UBER) Honeywell International (NASDAQ:HON) Eaton Corporation (NYSE:ETN) Lockheed Martin (NYSE:LMT) Boeing (NYSE:BA) Automatic Data Processing (NASDAQ:ADP)\n\nWe’ve ranked them in Pro watchlists based on analysts' predicted upside potential. PRO Watchlist\n\nSource: InvestingPro\n\nA review of their performance over the past five years, as well as the last year, reveals robust growth across the board, with analysts projecting an average upside of 20%.\n\nThe majority of these companies belong to the aerospace and ground transportation sectors. Analysis Section\n\nSource: InvestingPro\n\nUber Technologies: The Top Pick?\n\nAdditionally, when ranked by growth rate, Uber Technologies stock emerges as both a top performer and one of the most undervalued stocks. Analysts' watchlists indicate substantial upside potential. Ranking by Growth Rate\n\nSource: InvestingPro\n\nThis indicates a substantial price increase during this period, signaling a favorable market response to the company's strategies.\n\nStory continues Annual Return Vs. Competitor\n\nSource: InvestingPro\n\nUber’s financial health score supports its bullish outlook, with a rating of 4 out of 5.\n\nThe company boasts a low price-to-earnings (P/E) ratio relative to its short-term earnings growth, further highlighting its undervalued status. PEG Ratio\n\nSource: InvestingPro\n\nAnalysts expect Uber to be profitable this year, signaling stronger revenue than costs—a key indicator of its potential to continue growing and reinvesting in its business. Net Income to Common Ex. Extra Items\n\nSource: InvestingPro\n\nBottom Line\n\nThe current market landscape offers attractive opportunities, especially in the industrial sector. With rate cuts alleviating recession concerns and some stocks showing notable growth potential, investors should look for strategic positions.\n\nCompanies like Uber Technologies highlight a mix of strong financial health and undervaluation, positioning them well for future gains.\n\nSubscribe now with an exclusive discount and unlock access to several market-beating features, including:\n\nInvestingPro Fair Value: Instantly find out if a stock is underpriced or overvalued. AI ProPicks: AI-selected stock winners with proven track record. Stock Screener: Search for the best stocks based on hundreds of selected filters, and criteria. Top Ideas: See what stocks billionaire investors such as Warren Buffett, Michael Burry, and George Soros are buying. Subscribe Today!\n\n***\n\nDisclaimer:This article is written for informational purposes only. It is not intended to encourage the purchase of assets in any way, nor does it constitute a solicitation, offer, recommendation or suggestion to invest. I would like to remind you that all assets are evaluated from multiple perspectives and are highly risky, so any investment decision and the associated risk is at the investor's own risk. We also do not provide any investment advisory services. We will never contact you to offer investment or advisory services.\n\nRelated Articles\n\nThis Under-the-Radar Sector Is Getting Ready to Take Flight Amid Falling Rates\n\nFedEx Stock: Why Analysts Think This Rebound Still Has Legs\n\n3 Undervalued Chinese Stocks Poised to Take Off Thanks to Beijingâ\u0080\u0099s Stimulus\n\nView comments",
        "link": "https://finance.yahoo.com/news/under-radar-sector-getting-ready-145200471.html",
        "symbols": [
            "0A1U.IL",
            "ADP.US",
            "BA.US",
            "CAT.US",
            "ETN.US",
            "GE.US",
            "HON.US",
            "LMT.US",
            "RTX.US",
            "U1BE34.SA",
            "UBER.NEO",
            "UBER.US",
            "UNP.US",
            "UT8.F",
            "UT8.STU",
            "UT8.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.048,
            "neu": 0.779,
            "pos": 0.174
        }
    }
]