[
    {
        "date": "2024-05-23T13:52:00+00:00",
        "title": "Kratos' (KTOS) SATCOM System Showcased at Space Symposium",
        "content": "Kratos Defense & Security Solutions, Inc. KTOS recently announced that BlueHalo showcased the capabilities of its completely virtualized satellite communications (SATCOM) ground system, OpenSpace, at the 2024 Space Symposium held in Colorado. At this symposium, BlueHalo exhibited the utility of integrated backend mission services for the U.S. Space Force’s (“USSF”) Satellite Communication Augmentation Resource (“SCAR”) program and the importance of OpenSpace in the backend system.\n\nBenefits of the OpenSpace Platform\n\nBuilt upon widely accepted industry standards and a containerized architecture, Kratos' OpenSpace Platform is a completely software-defined and managed satellite ground system that enables scalable deployments inside an elastic, cloud-agnostic, virtualized environment. The Space Force can instantiate new services using OpenSpace in minutes as opposed to the weeks or even months that are typically needed with conventional hardware-based ground systems.\r\n\r\nIt is the industry’s only commercially available digital transformation solution that enables operators of satellites, Ground Systems-as-a-Service (GSaaS) providers, teleports and others in the satellite services supply chain to capitalize on dynamic ground capabilities.\n\nGrowth Prospects\n\nFactors like increasing earth observation missions, rapid digitization of industries across the board, rising usage of satellite communications in tactical operations and the growing use of satellite internet services have been boosting reliance on satcom-dependent services. This has prompted major nations like the United States, Germany, China, India, Japan and the United Kingdom to aggressively invest in satellite deployment, thereby significantly bolstering the Satellite Communications market.\r\n\r\nTherefore, the Satellite Communications market’s prospects remain robust, particularly driven by rapid growth in the launch of the Low Earth Orbit satellites and the expanding use of satellite technology in military and government applications. To this end, per a report by the Markets and Markets firm, the global SATCOM market is projected to witness a CAGR of 11.3% during the 2023-2028 period.\r\n\r\nSuch a solid market prediction offers strong growth opportunities to Kratos Defense, which, for more than 30 years, has been providing satellite Command & Control (C2) products and services, with a long history of successful SATCOM NetOps execution of commercial, military, civil and intelligence community satellite ground segment programs. For instance, its EPOCH product provides powerful satellite C2 for individual satellites, as well as small and large constellations of various designs and complexities.\n\nStory continues\n\nPeer Prospects\n\nConsidering the solid growth opportunities offered by the global Satellite Communications market, other defense primes like Lockheed Martin LMT, Airbus SE EADSY and Northrop Grumman Corp. NOC, with a strong presence in this space, should also benefit.\r\n\r\nLockheed Martin uses cutting-edge technology to build capabilities that comprise layered space defense systems. The LM 400, a multi-mission satellite that can be tailored for almost any mission, is LMT’s most flexible satellite bus.\r\n\r\nLMT boasts a long-term (three to five years) earnings growth rate of 4.1%. The Zacks Consensus Estimate for 2024 sales indicates an improvement of 3.2% from the previous year's estimated figure.\r\n\r\nAirbus is a world leader in military satellite communication services with a broad portfolio of services, including the SATCOMBw, Syracuse 4A and 4B, Skynet 5 and many more. Airbus has been a long-term operator of the SATCOMBw secure satellite communications system for Germany’s Armed Forces.\r\n\r\nEADSY boasts a long-term earnings growth rate of 21.4%. The Zacks Consensus Estimate for 2024 sales indicates an improvement of 8.2% from the previous year's estimated figure.\r\n\r\nNorthrop Grumman’s portfolio of space systems includes Strategic SATCOM, Protected Tactical SATCOM satellites and payloads. Its GEOStar geostationary Earth orbit commercial satellites are among the industry's best-selling small and medium-class communications satellites.\r\n\r\nNOC boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for 2024 sales implies an improvement of 4.6% from the year-ago estimated figure.\n\nPrice Movement\n\nIn the past three months, shares of Kratos Defense have risen 15.4% compared with the industry’s average return of 0.1%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nKratos Defense currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nKratos Defense & Security Solutions, Inc. (KTOS) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/kratos-ktos-satcom-system-showcased-135200271.html",
        "symbols": [
            "0JS0.LSE",
            "0K92.LSE",
            "0KVV.IL",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "EADSF.US",
            "EADSY.US",
            "KTOS.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.006,
            "neu": 0.816,
            "pos": 0.178
        }
    },
    {
        "date": "2024-05-23T13:00:00+00:00",
        "title": "Lockheed Martin COO and CFO to Speak at the Bernstein's 40th Annual Strategic Decisions Conference",
        "content": "BETHESDA, Md., May 23, 2024 /PRNewswire/ -- Lockheed Martin (NYSE: LMT) will webcast live a presentation by Chief Operating Officer Frank St. John and Chief Financial Officer Jay Malave at the Bernstein's 40th Annual Strategic Decisions Conference on Thursday, May 30 at 8 a.m. to 8:50 a.m. ET. Lockheed Martin Logo. (PRNewsFoto/Lockheed Martin)\n\nAccess to the webcast will be available at: http://www.lockheedmartin.com/investor. An audio replay will be available for two weeks following the presentation.\n\nAbout Lockheed Martin Lockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at LockheedMartin.com. Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/lockheed-martin-coo-and-cfo-to-speak-at-the-bernsteins-40th-annual-strategic-decisions-conference-302154195.html\n\nSOURCE Lockheed Martin\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-coo-cfo-speak-130000917.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.927,
            "neg": 0,
            "neu": 0.872,
            "pos": 0.128
        }
    },
    {
        "date": "2024-05-23T12:51:00+00:00",
        "title": "Lockheed Martin (LMT) Wins Contract to Aid Missile Production",
        "content": "Lockheed Martin Corp.’s LMT Space Systems business unit recently clinched a modification contract involving missile production. The award has been offered by the Strategic Systems Programs, Washington, D.C.\n\nDetails of the Deal\n\nValued at $99 million, the contract is expected to be completed by Feb 2, 2027. Per the terms of the deal, Lockheed will provide systems engineering, test planning and long lead material to support missile production.\n\nA major portion of the work related to this deal will be executed in Denver, CO.\n\nWhat’s Favoring Lockheed?\n\nNations are reinforcing their military capabilities to strengthen their defense structure in the growing threat environment. In this context, increased spending has been witnessed on missile capabilities, resulting in a significant order inflow for companies like Lockheed Martin, which enjoys a dominant position in the development of missiles.\r\n\r\nTo this end, it is imperative to mention that Lockheed’s weapon systems include precision strike weapons with long standoff ranges to keep pilots and aircraft out of harm's way.\r\n\r\nOther missiles manufactured by Lockheed include air-to-air missiles to provide pilots with air supremacy; helicopter-launched anti-armor missiles to destroy enemy tanks and other armored vehicles; man-portable short-range anti-armor and assault weapons; kinetic energy hyper-velocity missiles that can defeat all current and future armored threats, hit-to-kill air defense systems that protect the troops from ballistic missiles, cruise missiles, enemy aircraft and weapons of mass destruction.\n\nSuch a varied number of missiles in its product portfolio has been ushering in solid order flow for Lockheed, involving missile production and other associated services like the latest one.\n\nGrowth Prospect\n\nThe global peace index reflects an unstable environment worldwide, with the Russia-Ukraine war continuing for more than two years now, in addition to the ongoing hostility in different parts of the Middle East. This has set the stage for the defense sector to witness rising demand for military products, particularly missiles, as nations worldwide strive to protect their borders from unprecedented attacks.\n\nTherefore, the growth prospect for the missile and missile defense systems market remains solid. To this end, the Mordor Intelligence firm projects the market to witness a CAGR of 5% over the 2024-2029 period.\n\nLMT’s proficiency in manufacturing varied missiles, positions it favorably to capitalize on the growth opportunities offered by the missile and missile defense systems market. The fact that Lockheed is currently on track to double the production of its HIMARS to 96 per year and deliver more than 10,000 GMLRS by the end of 2024, and has increased Javelin’s production to 2,400 units per year, makes us confident about the company receiving more missile-related order flows in future, like the latest one. Such contract wins, in turn, are likely to boost revenue growth for the company’s MFC unit, which witnessed a solid 25.3% year-over-year top-line growth in the first quarter.\n\nStory continues\n\nOpportunities for Peers\n\nLMT apart, other prominent defense contractors that stand to benefit from the expanding missile and missile defense systems market are:\r\n\r\nNorthrop Grumman NOC: Northrop is a prominent developer of missile and counter systems, including strategic deterrents, subsystems and components. Its product portfolio includes the Integrated Air and Missile Defense Battle Command System, the Guided Multiple Launch Rocket System propulsion and warhead subsystems, the Hypersonic Attack Cruise Missile, the Advanced Anti-Radiation Guided Missile and a few other combat-proven products that support missile defense systems.\r\n\r\nNOC boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for Northrop’s 2024 sales indicates an improvement of 4.6% from the 2023 reported figure.\r\n\r\nGeneral Dynamics GD: The company’s Ordnance and Tactical Systems unit is the system integrator of the 2.75-inch Hydra-70 family of rockets. It is a key supplier of major strategic and tactical missile programs, ranging from warheads to missile housings to structural components to solid rocket motor cases.\n\nGD has a long-term earnings growth rate of 12%. The consensus estimate for General Dynamics’ 2024 sales indicates an improvement of 10.5% from the 2023 reported figure.\n\nRTX Corp. RTX: RTX’s business unit, Missiles and Defense, is a prominent U.S. missile maker. Its portfolio includes the AIM-9X Sidewinder missile, the AIM-9X Block II missile, RAM-guided missile weapon system, etc. In a partnership with BAE Systems, RTX has built the Excalibur artillery projectile, which increases precision, minimizes collateral damage and reduces the logistical burden for artillery forces.\n\nRTX boasts a long-term earnings growth rate of 10.6%. The Zacks Consensus Estimate for its 2024 sales indicates an improvement of 6.2% from the 2023 reported figure.\n\nPrice Movement\n\nIn the past year, shares of Lockheed have risen 3.8% against the industry’s 6.8% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLockheed currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-wins-contract-125100632.html",
        "symbols": [
            "0IUC.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.072,
            "neu": 0.765,
            "pos": 0.163
        }
    },
    {
        "date": "2024-05-23T00:19:47+00:00",
        "title": "The Largest Weapon Manufacturer in the World",
        "content": "In this article, we look at the largest weapon manufacturer in the world. If interested, you can also view our recently released complete list of the 15 Largest Weapon Manufacturers in the World.\n\nLatest figures released by the Stockholm International Peace Research Institute (SIPRI) in April this year estimated the global military spending in 2023 at a record-high of $2.44 trillion, up 6.8% compared to 2022. The year witnessed the steepest rise in defense expenditure since 2009, and was the ninth successive year in which defense spending had increased worldwide.\n\nThe United States continued to remain the largest spender on military expenditure in 2023 as well, having incurred a whopping $916 billion in defense bills during the year, growing 2.3% from last year. Washington’s spending represented 37.5% of the world’s military expenditure, and accounted for 68% of all NATO spending. $588 billion was spent by countries in Europe, which was equivalent to 24% of the global share. Of this amount, an overwhelming 69% was expensed in Central and Western Europe. Both Russia and Ukraine substantially increased their military expenditure during the year, whereas other countries in the region actively racked up their defenses as well with war having returned to the continent after decades of peace.\n\nAnother report by SIPRI highlighted that arms imported by countries in Europe between 2019-2023 were 94% higher than the monetary volume in 2014-2018. The United States was the origin of an estimated 55% of all weapons received by Europe, making the country the largest exporter of arms in the world.\n\nThe spike in defense expenditure has resulted in a boom in the defense industry. Lockheed Martin Corporation (NYSE:LMT)’s stock price has surged 29% since the start of the war in Ukraine. Several countries in Europe are eying the company’s famed F-35 fifth-generation fighter, while the production of HIMARS is also in full swing to replenish stocks of allies arming Kyiv. This month, the US Army awarded a $861 million contract to Lockheed Martin Corporation (NYSE:LMT) for the supply of additional HIMARS, believed to be linked to military assistance for Ukraine. According to the Defense Post, the contract did not specify the number of launchers ordered, but is expected to be around 288 based on previous solicitation documents that were seen.\n\nRTX Corporation (NYSE:RTX)’s numbers have also been promising, having posted $68.9 billion in revenue in 2023, with a year-on-year growth of 3%, aided by the ongoing conflict in Europe. Between February 2022, when the war started, and October 2023, the company had received orders worth $3 billion for its AMRAAM rockets alone to assist Ukraine in pushing back advancing Russian troops. Earlier last year in March, RTX Corporation (NYSE:RTX) also won a $1.2 billion contract from Germany to build Patriot air and missile defense systems for the country and boost its air defenses, while in November, Hungary received the delivery of two units of the NASAMS air defense system it had ordered from Kongsberg Defence & Aerospace and RTX Corporation (NYSE:RTX).\n\nStory continues\n\nOn the other hand, General Dynamics Corporation (NYSE:GD) too posted its highest-ever revenue in history last year, totaling $42.3 billion, up 7.7% from the previous year. The company has reported an increase in its artillery production from 14,000 rounds per month to 20,000. The company’s 155 millimeter artillery replacements have played a vital role in Kyiv’s fightback against Russia, which have been regularly provided to the country as part of military assistance by the United States.\n\nWith that said, let’s take a look at the largest weapon manufacturer in the world. The Largest Weapon Manufacturer in the World\n\nMethodology\n\nTo compile the list, we ranked the largest weapon manufacturers in the world in ascending order of their arms revenue in 2022. This is the latest year for which revenue breakdown is available for all major defense companies in the world. Data has been sourced from the Stockholm International Peace Research Institute (SIPRI).\n\nThe largest weapon manufacturer in the world is Lockheed Martin Corporation (NYSE:LMT).\n\n1. Lockheed Martin Corporation (NYSE:LMT)\n\nCountry of Origin: United States\n\nTotal Revenue in 2022: $65.98 billion\n\nArms Revenue in 2022: $59.39 billion\n\nShare of Overall Revenue: 90%\n\nLockheed Martin Corporation (NYSE:LMT) is the largest weapon manufacturer in the world, with over $59 billion worth of arms revenue in 2022 – three-fourths of which came from over $45 billion in DoD contracts. It is the manufacturer of the famed F-35 fifth-generation fighter jet, and the company is likely to retain its status as a cornerstone for the US Air Force as it works alongside other partners in the industry on the Next Generation Air Dominance (NGAD) program to build a sixth-generation fighter.\n\nYou can see the rest of the rankings here.\n\nIf you are looking for states where the US military spends the most funds, you can head over to our article on the Top 20 States Where the US Military Spends the Most Money.\n\nREAD NEXT:15 Biggest Aircraft Carriers in the World\n\nDisclosure: None. This article is originally published on Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/largest-weapon-manufacturer-world-001947620.html",
        "symbols": [
            "0IUC.LSE",
            "0R3E.LSE",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.04,
            "neu": 0.847,
            "pos": 0.114
        }
    }
]