[
    {
        "date": "2024-07-15T14:33:10+00:00",
        "title": "RTX unit Pratt &amp; Whitney completes preliminary design review of engine upgrade",
        "content": "(Reuters) - RTX Corp's Pratt & Whitney said on Monday it has completed the preliminary design review for an engine upgrade to increase durability and performance in all three variants of the F-35 fighter jet.\n\nThe F-35 jet is manufactured by Lockheed Martin Corp, accounting for about 27% of the company's sales.\n\nRTX received full funding from the U.S. government in March for its F135 engine core upgrade (ECU), which will modernize the F-35's propulsion system.\n\n\"Upgrading the F-35's propulsion system to ECU is a critical step toward ensuring the F-35 remains the world's premier air dominance fighter,\" Pratt & Whitney said.\n\nThe U.S. government had cleared Pratt & Whitney in February, allowing the company to resume deliveries of its F-135 engine for the F-35 fighter jet, after a halt was put in place in December following the discovery of a safety concern.\n\nIn May, the Department of Defense also resumed accepting F-35 jet deliveries from Lockheed Martin, after a brief halt starting late March due to a dispute over who would cover the costs related to fixing a production error discovered in 2017 that had caused corrosion.\n\n(Reporting by Ananta Agarwal in Bengaluru; Editing by Krishna Chandra Eluri)\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-unit-pratt-whitney-completes-143310338.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.718,
            "neg": 0.038,
            "neu": 0.876,
            "pos": 0.087
        }
    },
    {
        "date": "2024-07-15T08:13:22+00:00",
        "title": "A Look Back at Defense Contractors Stocks' Q1 Earnings: CACI (NYSE:CACI) Vs The Rest Of The Pack",
        "content": "A Look Back at Defense Contractors Stocks' Q1 Earnings: CACI (NYSE:CACI) Vs The Rest Of The Pack\n\nAs the Q1 earnings season wraps, let's dig into this quarter's best and worst performers in the defense contractors industry, including CACI (NYSE:CACI) and its peers.\n\nDefense contractors typically require technical expertise and government clearance. Companies in this sector can also enjoy long-term contracts with government bodies, leading to more predictable revenues. Combined, these factors create high barriers to entry and can lead to limited competition. Lately, geopolitical tensions–whether it be Russia’s invasion of Ukraine or China’s aggression towards Taiwan–highlight the need for defense spending. On the other hand, demand for these products can ebb and flow with defense budgets and even who is president, as different administrations can have vastly different ideas of how to allocate federal funds.\n\nThe 13 defense contractors stocks we track reported a strong Q1; on average, revenues beat analyst consensus estimates by 3.5%. while next quarter's revenue guidance was 0.7% above consensus. Inflation progressed towards the Fed's 2% goal at the end of 2023, leading to strong stock market performance. The start of 2024 has been a bumpier ride, as the market switches between optimism and pessimism around rate cuts due to mixed inflation data, and defense contractors stocks have held roughly steady amidst all this, with share prices up 1% on average since the previous earnings results.\n\nCACI (NYSE:CACI)\n\nFounded to commercialize SIMSCRIPT, CACI International (NYSE:CACI) offers defense, intelligence, and IT solutions to support national security and government transformation efforts.\n\nCACI reported revenues of $1.94 billion, up 11.1% year on year, exceeding analysts' expectations by 4.4%. Overall, it was a very good quarter for the company with an impressive beat of analysts' backlog sales estimates and full-year revenue guidance exceeding analysts' expectations.\n\n“CACI’s outstanding performance reflects the continued successful execution of our strategy. We’re winning and delivering in the marketplace with differentiated capabilities, exceptional business development, and program execution,” said John Mengucci, CACI President and Chief Executive Officer. CACI Total Revenue\n\nCACI scored the highest full-year guidance raise of the whole group. The stock is up 15.6% since reporting and currently trades at $439.23.\n\nIs now the time to buy CACI? Access our full analysis of the earnings results here, it's free.\n\nBest Q1: Northrop Grumman (NYSE:NOC)\n\nResponsible for the development of the first stealth bomber, Northrop Grumman (NYSE:NOC) specializes in providing aerospace, defense, and security solutions for various industry applications.\n\nStory continues\n\nNorthrop Grumman reported revenues of $10.13 billion, up 8.9% year on year, outperforming analysts' expectations by 3.8%. It was a stunning quarter for the company with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates. Northrop Grumman Total Revenue\n\nAlthough it had a great quarter compared its peers, the market seems unhappy with the results as the stock is down 8.3% since reporting. It currently trades at $435.13.\n\nIs now the time to buy Northrop Grumman? Access our full analysis of the earnings results here, it's free.\n\nWeakest Q1: Mercury Systems (NASDAQ:MRCY)\n\nFounded in 1981, Mercury Systems (NASDAQ:MRCY) specializes in providing processing subsystems and components for primarily defense applications.\n\nMercury Systems reported revenues of $208.3 million, down 21% year on year, falling short of analysts' expectations by 2.9%. It was a weak quarter for the company with a miss of analysts' earnings and organic revenue estimates.\n\nMercury Systems posted the weakest performance against analyst estimates and slowest revenue growth in the group. Interestingly, the stock is up 7.1% since the results and currently trades at $31.18.\n\nRead our full analysis of Mercury Systems's results here.\n\nLockheed Martin (NYSE:LMT)\n\nHeadquartered in Maryland, Famous for the F-35 aircraft, Lockheed Martin (NYSE:LMT) specializes in defense, space, homeland security, and information technology products.\n\nLockheed Martin reported revenues of $17.2 billion, up 13.7% year on year, surpassing analysts' expectations by 7.5%. Zooming out, it was a stunning quarter for the company with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates.\n\nThe stock is up 1.5% since reporting and currently trades at $468.59.\n\nRead our full, actionable report on Lockheed Martin here, it's free.\n\nKratos (NASDAQ:KTOS)\n\nEstablished with a commitment to supporting national security, Kratos (NASDAQGS:KTOS) is a provider of advanced engineering, technology, and security solutions tailored for critical national security applications.\n\nKratos reported revenues of $277.2 million, up 19.6% year on year, surpassing analysts' expectations by 10.7%. Revenue aside, it was a very strong quarter for the company with an impressive beat of analysts' earnings estimates.\n\nKratos delivered the biggest analyst estimates beat and fastest revenue growth among its peers. The stock is up 12.6% since reporting and currently trades at $21.15.\n\nRead our full, actionable report on Kratos here, it's free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/look-back-defense-contractors-stocks-081322467.html",
        "symbols": [
            "0K92.LSE",
            "CA8A.F",
            "CACI.US",
            "KTOS.US",
            "LMT.US",
            "MCY.F",
            "MCY.MU",
            "MCY.STU",
            "MRCY.US",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.036,
            "neu": 0.8,
            "pos": 0.163
        }
    }
]