[
    {
        "date": "2024-09-06T15:38:00+00:00",
        "title": "General Dynamics Wins $496M Deal From Space Development Agency",
        "content": "General Dynamics Corp.’s GD business unit, General Dynamics Missions Systems, recently secured a contract worth $496.1 million to conduct design, analysis, engineering studies and technical augmentation for the Ground Management and Integration (GMI) program's integrated ground system. The contract has been awarded by the Space Development Agency (SDA).\r\n\r\nAs part of this agreement, General Dynamics will collaborate with SDA and important parties to build and supply a tranche-agnostic ground system for Proliferated Warfighter Space Architecture. Furthermore, the company will be managing the T2 constellation's enterprise integration.\n\nGD’s Growth Prospects\n\nMilitary satellite technology is quickly evolving, propelled by the rising need for improved communication, surveillance and reconnaissance capabilities and increased resistance to future attacks. With increased hostility across different parts of the globe, investment in technologically advanced military satellite systems has been rapidly expanding. This has been boosting the growth prospects of the military satellite market.   \r\n\r\nTo this end, per the Mordor Intelligence firm, the military satellite market is projected to witness a CAGR of 11% during the 2024-2029 period. Such market growth expectations are likely to benefit General Dynamics, which has been a top provider of satellite ground systems for more than 30 years.\r\n\r\nNotably, its Mobile User Objective System is the U.S. Navy's next-generation satellite communications system that provides voice and data communications to U.S. personnel anytime, anywhere. It enables warfighters on the go to communicate easily.\r\n\r\nSuch capabilities of General Dynamics reflect the critical role it plays in the military satellite market. The company expects to benefit from the market growth projection in the form of more order flows, like the latest one, in the near future.\n\nOpportunities for GD’s Peers\n\nConsidering the solid growth opportunities of the military satellite market, other defense primes like Lockheed Martin LMT, Airbus SE EADSY and Northrop Grumman Corp. NOC, with a strong presence in this space, should also benefit.\r\n\r\nLockheed Martin uses cutting-edge technology to build capabilities that comprise layered space defense systems. The LM 400, a multi-mission satellite that can be tailored for almost any mission, is LMT’s most flexible satellite bus with capabilities to serve military, civil or commercial users.\r\n\r\nLMT boasts a long-term (three to five years) earnings growth rate of 4.7%. The Zacks Consensus Estimate for its 2024 sales indicates an improvement of 5.3% from the previous year's reported figure.\r\n\r\nAirbus is a world leader in military satellite communication services with a broad portfolio of services, including the SATCOMBw, Syracuse 4A and 4B, Skynet 5 and many more. Airbus has been a long-term operator of the SATCOMBw secure satellite communications system for Germany’s Armed Forces.\r\n\r\nEADSY boasts a long-term earnings growth rate of 13.9%. The Zacks Consensus Estimate for its 2024 sales indicates an improvement of 6.9% from the previous year's reported figure.\r\n\r\nNorthrop Grumman has provided jam-resistant equipment for military communications satellites for more than 30 years. Its Anti-Jam MilSatCom offers flexible, scalable payload capabilities, as well as consistent, reliable, jam-resistant covert communications for tactical and strategic warfighters in wartime scenarios.\r\n\r\nNOC has a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales implies growth of 5.4% from the prior-year figure.\n\nStory continues\n\nGD Stock’s Price Movement\n\nIn the past six months, shares of General Dynamics have gained 8.9% compared with the industry’s 1.7% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nGeneral Dynamics currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/general-dynamics-wins-496m-deal-153800594.html",
        "symbols": [
            "0IUC.LSE",
            "0K92.LSE",
            "0KVV.IL",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "EADSF.US",
            "EADSY.US",
            "GD.MX",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.012,
            "neu": 0.788,
            "pos": 0.2
        }
    },
    {
        "date": "2024-09-06T12:59:00+00:00",
        "title": "Lockheed Secures a Navy Contract to Aid CH-53K Helicopter Program",
        "content": "Lockheed Martin Corp.’s LMT business unit, Sikorsky Aircraft, recently clinched a contract involving its CH-53K helicopter. The award has been provided by the Naval Supply Systems Command Weapon Systems Support, Philadelphia, PA.\n\nDetails of the Deal\n\nValued at $38.9 million, the contract is projected to be completed by December 2028. Per the terms of the deal, Lockheed will procure various parts, including six probes, 28 center cargo hooks, 29 machine bolts, 11 helicopter underslung sling hooks, 32 air heat exchangers, 23 communication systems and a few more, to support CH-53K helicopters.\n\nWork related to this contract will be executed in Stratford, CT.\n\nWhat’s Favoring LMT Stock?\n\nThe CH-53K King Stallion builds on Sikorsky’s five decades of success with earlier models like the CH-53A, CH-53D/G and CH-53E. Engineered for modern warfare, including shipboard operations, the CH-53K is designed to be intelligent, reliable, low maintenance and highly survivable in harsh, remote environments.\n\nHaving accumulated more than 1,200 test flight hours, the helicopter has attained certain milestones in 2018, such as performing in high altitudes, extreme heat and degraded visual conditions.\n\nThese advanced capabilities must have been driving demand for the CH-53K helicopter, leading to increased contract awards for Lockheed, like the latest one. Such order flows are expected to boost LMT’s revenues in the coming quarters, reinforcing its dominance in military aviation.\n\nGrowth Prospects of LMT Stock\n\nLately, military helicopters have gained significant traction due to advancements in tactical, logistical and other key features. Lockheed has played a crucial role in this progress by bringing in state-of-the-art, lethal, combat-proven helicopters into the market for warfare. Impressively, its Black Hawk helicopter serves the armed forces of 34 countries, other than the U.S. military.\n\nThe rise in geopolitical tensions and cross-border conflicts across the globe has caused nations to increase their defense spending, particularly on new aircraft and helicopters, to strengthen their aerial security. This might have prompted the Mordor Intelligence firm to project a compound annual growth rate (CAGR) of more than 4% for the military rotorcraft market during 2024-2029.\n\nSuch a solid growth projection is expected to boost Lockheed, which holds a leading position in the military helicopter market with a portfolio that includes the Seahawk, Raider-X, CH-148 and a few more helicopters. This should position the company for continued growth in the coming years.\n\nStory continues\n\nOpportunities for LMT’s Peers\n\nOther defense companies that are expected to enjoy the perks of the expanding military rotorcraft market have been discussed below.\n\nThe Boeing Company BA: Its military rotorcraft serves the U.S. Army, Navy, Marines and Air Force and allied defense forces in more than 20 countries across the globe. Boeing’s Defense, Space & Security segment produces rotorcraft and rotary-wing programs, such as H-47 Chinook, AH-64 Apache, AH-6 Little Bird and V-22 Osprey.\n\nThe company has a long-term (three to five years) earnings growth rate of 21.3%.  The Zacks Consensus Estimate for BA’s third-quarter 2024 sales indicates an improvement of 10.8% from the prior-year quarter’s reported figure.\n\nAirbus Group EADSY: It is one of the world's largest suppliers of advanced military helicopters. EADSY’s product portfolio includes the H135 combat helicopter, the H145M helicopter, AS565 MBe, H160M, H175M, H215M, H225M and a few more.\n\nThe company’s long-term earnings growth rate is 13.9%. The Zacks Consensus Estimate for EADSY’s 2024 sales indicates an improvement of 7.2% from the 2023 reported figure.\n\nTextron TXT: Its business unit, Textron Aviation Defense, designs, builds and supports versatile and globally known military helicopters, preferred for training and attack missions. Some of Textron’s renowned products are the Beechcraft T-6C trainer and the AT-6 Wolverine.\n\nTXT boasts a long-term earnings growth rate of 10.1%. The consensus estimate for TXT’s 2024 sales indicates an improvement of 5.6% from the 2023 reported figure.\n\nPrice Movement\n\nIn the past year, shares of Lockheed have risen 33.5% compared with the industry’s growth of 2.6%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLockheed currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-secures-navy-contract-aid-125900800.html",
        "symbols": [
            "0BOE.LSE",
            "0KVV.IL",
            "0LF0.LSE",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.033,
            "neu": 0.801,
            "pos": 0.167
        }
    },
    {
        "date": "2024-09-06T07:05:03+00:00",
        "title": "30 Least Peaceful Countries in the World",
        "content": "In this article, we will be looking at the 30 least peaceful countries in the world. If you want to skip our detailed analysis, you can go directly to 5 Least Peaceful Countries in the World.\n\nAn unpeaceful environment can encourage violence, mob culture, economic instability, and push back foreign investments. In an era impacted by climate change, extreme poverty, and escalating geopolitical tensions, the world is becoming increasingly riddled with instability and conflicts.\n\nThe Global Unrest\n\nCountries with multidimensional poverty and food scarcity are more prone to civil unrest and increasing agitation. Some of the poorest countries in the world are also the least peaceful countries. Yemen, Central African Republic, Malawi, Syria, South Sudan, and Sudan are among many countries with low GDP per capita and high poverty rates.\n\nThe war in Gaza has had an immense impact on global peacefulness, with Israel continuing its aggression on Palestine. According to the Global Peace Index (GPI) 2024 report by the Institute for Economics & Peace (IEP), Israel and Palestine have the first and fourth largest deterioration in peacefulness in 2024, respectively. As per the Geneva-based human rights monitor organization, Euro-Med Human Rights Monitor, approximately 70,000 tons of bombs were dropped on Gaza between October 7 and April 24. This far surpasses the combined attacks of Dresden, Hamburg, and London during World War II. To add further to the context, Israel’s bombing of Gaza is 4.6 times stronger in total explosives than the Hiroshima bombing.\n\nOver the last 16 years, the world has become less peaceful, with the average country score deteriorating by 4.5% since 2008, the year GPI began its research. Out of the 163 countries in the GPI, 95 recorded deteriorations, 66 recorded improvements and two remained unchanged between 2008 and 2023. In 2023, the average global peacefulness level declined by 0.56%, recording the 12th downward trend in peacefulness in the last 16 years. Almost 97 countries dropped points and ended up less peaceful compared to 65 countries improving in peacefulness in 2023. This marks the highest number of countries to record maximum deterioration in peacefulness in a single year since the inception of the GPI.\n\nThe gap between the most and least peaceful countries is now wider than at any point in the last 16 years. The 25 most peaceful countries were 1% more peaceful in 2024 and the 25 least peaceful countries were 7.5% less peaceful in 2024, compared to 2008. Almost 100 countries have been involved in some form of external conflict in the past five years, up from 59 in 2008. In addition, these countries offered some form of support to an existing government against internal armed rebels or terrorist groups. The increasing violence has had a massive impact on the global economy. Ukraine is one of the countries with enormous falls in GDP due to violent conflicts and war. Ukraine’s economy shrank by an estimated 30% in 2022.\n\nStory continues\n\nIn 2023, the economic impact of violence on the global economy was over $19.1 trillion in GDP (PPP), almost 13.5% of the world’s economic activity, or $2,380 per person. Military and internal security expenditures account for nearly 74% of the total economic impact of violence. The economic impact of military spending was over $8.4 trillion in 2023. Wars are a big reason for the increase in military expenditure. There has been a significant rise in both conflicts and battle deaths in the past two decades, with battle deaths reaching 30-year high in 2022.\n\nCountries are focused on improving their defense capabilities and fighting against any form of terrorism. According to a report by MarketsandMarkets, the global defense market is estimated to have reached over $2 trillion in 2023. The market is anticipated to reach $2.54 trillion by 2028, growing at a compound annual growth rate of 4.9% between 2024 and 2028. New military technologies and government initiatives are increasing the development of military modernization programs. Moreover, rising internal and external security threats are all major factors leading to a positive outlook for the global defense market. This means that there are significant opportunities for corporations operating in the defense industry.\n\nREAD ALSO: 15 Best Flood Insurance Companies Heading into 2024 and 13 States That Don’t Tax Pension Income in the US.\n\nThe Defense Industry Kingpin\n\nLockheed Martin Corporation (NYSE:LMT) is the largest global aerospace, arms, defense, and technology corporation, with a market capitalization of $134 billion, as of September 5. The company is responsible for leading the F-35 production effort. Lockheed’s other famous productions include the U-2 and F-22. Lockheed Martin is working with more than 50 countries worldwide, assisting governments in protecting their national interests to strengthen their economies and industries. The company has over 350 facilities worldwide that help in achieving its goals.\n\nThe rising violent conflicts that occurred in the past few years in different regions across the world have led more nations to invest heavily in defense products. With solid market growth projections and rising tensions in the Middle East, Europe, and Taiwan, Lockheed should benefit from it. LMT’s Missiles and Fire Control unit offers decent combat-proven air and missile defense systems along with tactical missiles, apart from MLRS. Moreover, these include Joint Air-to-Surface Standoff Missile, Long Range Anti-Ship Missile, and a few more missile programs. The company has recently received a $3.43 billion modification contract from the US Army to manufacture surface-to-surface weapon systems for the service branch. The work on the Guided Multiple Launch Rocket System supply contract is expected to be completed by October 2027.\n\nOn August 28, Lockheed Martin Corporation (NYSE:LMT) announced that it presented Poland's first F-35A Lightning II to the Polish government during a rollout ceremony at Lockheed Martin's F-35 production facility. With that, F-35s are now operating from 32 bases globally, while LMT has delivered more than 1,000 F-35s to date.\n\nIn the recent earnings update, LMT surpassed its EPS estimates by quite a margin. During Q2 2024, Lockheed Martin Corporation (NYSE:LMT) posted earnings per share of $7.11, surpassing the consensus estimates of $6.45. The revenue came in at $18.12 billion, with a surprise of 6.52%. Here are some of the comments from LMT’s Q2 2024 earnings call:\n\n“Over the past few months, Lockheed Martin’s people, systems, and platforms have again demonstrated their ability to enhance security in Eastern Europe, the Red Sea, and the Middle East. From the PAC-3s critical role in air defense, to the Aegis Combat System with AI augmentation to the F-35 of this advanced sensor and data management capabilities, our company has made major contributions to Allied and Partner defense.\n\nConsequently, demand for our defense technology solutions remains robust, with a backlog of nearly $160 billion greater than two times our annual revenue. Our strong performance so far in 2024 extends beyond blast backlog as well giving us confidence to raise our 2024 full year outlook for sales, segment operating profit, and EPS. In the second quarter, sales increased 9% year-over-year and 5% sequentially and reflected growth in all four of our business segments. The supply chain continues to improve and defense outlays also continue to increase. Our focus on operational execution helped us achieve segment operating margins of 11.3%, up 20 basis points compared to last year’s second quarter, and free cash flow of more than $1.5 billion, an increase both year-over-year and sequentially.”\n\nLMT has a dividend yield of 2.19%, as of September 5, with a dividend-paying history since 1995. Israel Englander’s Millennium Management has increased its stake in LMT by 878% and now holds nearly 546,379 shares in the stock valued at $255 million, as of August 14. As per the Insider Monkey’s Hedge Fund database, 56 funds held LMT by the end of Q2 2024 compared to 47 hedge funds in Q1 2024.\n\nWhile we acknowledge the potential of LMT as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than NVDA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nNow, let’s take a look at the 30 least peaceful countries in the world. 15 Most Depressed Countries in the World in 2017\n\nOleg Znamenskiy / Shutterstock.com\n\nOur Methodology\n\nTo compile the list of the 20 least peaceful countries in the world, we gathered data from the 2024 Global Peace Index (GPI) by the Institute for Economics & Peace (IEP). The rankings on GPI are based on 18 indicators in the economic impact of violence model which includes military expenditure, internal security expenditure, direct costs of deaths from internal violent conflict, direct costs of deaths from external violent conflict, terrorism, violent assault, and fear of crime, among others. The 30 least peaceful countries out of the total 163 countries listed on GPI are ranked in ascending order of the peace score. The countries with a higher score are considered to be least peaceful.\n\nAt Insider Monkey we are obsessed with the stocks that hedge funds pile into. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\n\n30 Least Peaceful Countries in the World\n\n30. Lebanon\n\nOverall Score: 2.693\n\nLebanon is engaging against Israel in support of Palestine and has been in a war situation for many years now. Lebanon has one of the lowest GDP per capita of $4,059, as of 2023. With a peace score of 2.693, Lebanon ranks among the 30 least peaceful countries in the world.\n\n29. Chad\n\nOverall Score: 2.704\n\nChad has a GDP per capita of $1,100 and is one of the poorest countries.\n\n28. Eritrea\n\nOverall Score: 2.748\n\nEritrea has a GDP per capita of $1,000 and has a staggering poverty rate of 40% which is projected to fall by 13% by 2040. Eritrea ranks 28th among the least peaceful countries in the world.\n\n27. Cameroon\n\nOverall Score: 2.773\n\nCameroon has a GDP per capita of $1,810 and had a $341.6 per capita economic impact of violence in 2023.\n\n26. Mexico\n\nOverall Score: 2.778\n\nMexico suffers from conflicts and had a $2,948 per capita economic impact of violence in 2023. Mexico with a peace score of 2.778 ranks among the 30 least peaceful countries in the world.\n\n25. Turkiye\n\nOverall Score: 2.78\n\nTurkiye has a mixed culture of modernists and Sufism. The country has a GDP per capita of around $12,760 and ranks 25th among the least peaceful countries in the world.\n\n24. Pakistan\n\nOverall Score: 2.783\n\nPakistan has been facing high poverty levels in Sindh, Balochistan, and KPK provinces. The civil unrest and terrorism over the years have caused huge economic costs to Pakistan. Pakistan had a 10.29% economic cost of violence as a percentage of GDP in 2023.\n\n23. Niger\n\nOverall Score: 2.792\n\nNiger faces corruption, political instability, and unemployment. Niger had a per capita violence impact of $155 in 2023.\n\n22. Venezuela\n\nOverall Score: 2.821\n\nVenezuela ranks 22nd among the least peaceful countries in the world. Venezuela is going through a post-election crisis with each party claiming wins in the election in 2024.\n\n21. Haiti\n\nOverall Score: 2.827\n\nHaiti has a GDP per capita of $1,940, as of 2024. Haiti recorded the fifth-largest deterioration in peacefulness in the 2024 GPI.\n\n20. Ethiopia\n\nOverall Score: 2.845\n\nEthiopia ranks 20th among the least peaceful countries in the world. Ethiopia suffered a per capita violence impact of $265 in 2023.\n\n19. Palestine\n\nOverall Score: 2.872\n\nPalestine has been facing Israeli aggression for several years now. The events after October 7 last year escalated the situation in Palestine. Gaza faces extreme levels of child and adult malnutrition. Palestine ranks among the 30 least peaceful countries in the world.\n\n18. Colombia\n\nOverall Score: 2.887\n\nColombia has a GDP per capita of $7,330 in 2024. Colombia is the least peaceful country in South America with over $6,541 per capita impact of violence in 2023.\n\n17. Nigeria\n\nOverall Score: 2.907\n\nNigeria has a GDP per capita of $1,110 and faced a $698 per capita impact of violence in 2023.\n\n16. Myanmar\n\nOverall Score: 2.943\n\nThe conflicts in Myanmar remain high and it is the second least peaceful country in the Asia-Pacific region. Myanmar has a GDP per capita of around $1,250.\n\n15. Burkina Faso\n\nOverall Score: 2.969\n\nBurkina Faso is one of the poorest countries in the world having a GDP per capita of $910. With a peace score of 2.969, Burkina Faso ranks 15th among the least peaceful countries in the world.\n\n14. Central African Republic\n\nOverall Score: 3.009\n\nThe Central African Republic has a GDP per capita of $537, as of 2024. In 2023, the Central African Republic suffered a violence cost of $336 per capita.\n\n13. Iraq\n\nOverall Score: 3.045\n\nIraq has been suffering from war for many years now. Iraq faced a violence cost of almost $1,483.5 per capita in 2023. Iraq ranks among the 30 least peaceful countries in the world.\n\n12. North Korea\n\nOverall Score: 3.055\n\nNorth Korea faces extreme restrictions and censorship. North Korea incurred one of the highest relative economic costs of violence in 2023, which was around 41.6% of its GDP.\n\n11. Somalia\n\nOverall Score: 3.091\n\nSomalia is one of the poorest countries in the world. Somalia also incurred one of the highest relative economic costs of violence in 2023, almost 39.78% of its GDP.\n\n10. Mali\n\nOverall Score: 3.095\n\nMali ranks 10th among the least peaceful countries in the world. In 2023, Mali suffered a violence cost of $468 per capita.\n\n9. Israel\n\nOverall Score: 3.115\n\nIsrael has raged war on Gaza and has spent a huge amount on militarisation. Israel’s economic impact of violence increased by nearly 63% in 2023.\n\n8. Syria\n\nOverall Score: 3.173\n\nSyria has suffered from war for many years now. Syria has one of the lowest GDP per capita of $361, as of 2023. Syria ranks eighth among the least peaceful countries in the world.\n\n7. Russia\n\nOverall Score: 3.249\n\nRussia has faced international sanctions following its invasion of Ukraine. Russia’s overall peacefulness deteriorated by almost 0.28% in 2023.\n\n6. Democratic Republic of the Congo\n\nOverall Score: 3.264\n\nThe Democratic Republic of the Congo is one of the poorest countries in the world with a GDP per capita of $714, as of 2024. The Democratic Republic of the Congo has been entangled in conflict for decades, involving national armed forces, rebel groups, local militias, and foreign troops.\n\n5. Ukraine\n\nOverall Score: 3.28\n\nUkraine is fighting a war against Russia with the support of NATO and other allies. Ukraine incurred the highest relative economic cost of violence in 2023, which was around 68.6% of its GDP.\n\n4. Afghanistan\n\nOverall Score: 3.294\n\nAfghanistan is now under Taliban rule after the US forces completely left the country in 2021. In 2023, Afghanistan incurred the second-highest relative economic cost of violence, which was around 53.2% of its GDP. Afghanistan ranks among the 30 least peaceful countries in the world.\n\n3. South Sudan\n\nOverall Score: 3.324\n\nSouth Sudan is one of the poorest countries in the world with a GDP per capita of $422. With a peace score of 3.324, South Sudan ranks third among the least peaceful countries in the world.\n\n2. Sudan\n\nOverall Score: 3.327\n\nSudan faces extreme conflicts. In 2023, peacefulness in the country declined as conflict erupted between the Sudanese Armed Forces and the paramilitary Rapid Support Forces (RSF) following a proposal to dissolve the RSF and integrate it with the army.\n\n1. Yemen\n\nOverall Score: 3.397\n\nYemen is up against Israel in support of Palestine. Yemen is one of the poorest countries in the world. With a peace score of 3.397, Yemen is the least peaceful country in the world in 2024.\n\nREAD NEXT: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n\nDisclosure: None. This article is originally published on Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/30-least-peaceful-countries-world-070503238.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -1,
            "neg": 0.143,
            "neu": 0.779,
            "pos": 0.078
        }
    }
]