[
    {
        "date": "2024-05-24T20:10:15+00:00",
        "title": "NASA Confirms Boeing's Delayed Starliner Launch Despite Helium Leak",
        "content": "NASA Confirms Boeing's Delayed Starliner Launch Despite Helium Leak\n\nBoeing (NYSE: BA) and NASA are reportedly advancing with launching the company’s Starliner capsule, set to carry U.S. astronauts for the first time, despite a stable leak in the spacecraft’s propulsion system.\n\nThis mission, known as the Starliner Crew Flight Test, is a critical final development test.\n\nIt aims to deliver a pair of NASA astronauts to and from the International Space Station before commencing routine missions.\n\nAlso Read: Boeing’s Starliner Crewed Test Flight Postponed Due To Technical Issue, Continuing Challenges In Space Program\n\nCNBC reported that the first crewed launch of Starliner is targeted for June 1, with backup opportunities on June 2, June 5, and June 6.\n\nThe debut of Starliner’s crew has faced years of delays, while SpaceX’s Dragon capsule has been regularly flying astronauts for NASA since 2020.\n\nBoeing has incurred $1.5 billion in costs due to setbacks with Starliner, on top of nearly $5 billion in NASA development funds.\n\nA launch attempt on May 6 was aborted two hours before liftoff due to an issue with the Atlas V rocket, built and operated by United Launch Alliance (ULA), a joint venture between Boeing and Lockheed Martin Corp (NYSE:LMT).\n\nA ULA official noted that the rocket’s problematic valve was replaced within a week. Subsequently, a “small” helium leak in Starliner was identified, prompting new assessments of the capsule’s safety.\n\nNASA Associate Administrator Ken Bowersox explained that the helium leak issue took time to analyze due to its complexity, emphasizing the collaborative effort required to resolve it.\n\nFollowing analysis, NASA and Boeing determined the leak originated from a seal in one of the spacecraft’s helium propulsion system flanges.\n\nTesting after the May 6 postponement indicated that the leak rate remained stable.\n\nCiting NASA’s Commercial Crew Program manager Steve Stich, CNBC noted that the plan is to monitor the leak before launch and reassess it after reaching the International Space Station.\n\nStich expressed confidence in the other seals’ integrity, noting that NASA has previously flown vehicles with small helium leaks, including missions by the Space Shuttle and SpaceX’s Dragon.\n\nA final review of the leak is scheduled for May 29, with plans to roll the rocket and capsule to the launch pad on May 30 for the June 1 attempt.\n\nPrice Action: BA shares are up 1.28% at $174.42 at the last check on Friday.\n\nStory continues\n\nDisclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n\nPhoto via Shutterstock\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nBOEING (BA): Free Stock Analysis Report\n\nThis article NASA Confirms Boeing's Delayed Starliner Launch Despite Helium Leak originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nView comments",
        "link": "https://finance.yahoo.com/news/nasa-confirms-boeings-delayed-starliner-201015826.html",
        "symbols": [
            "0BOE.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.865,
            "neg": 0.06,
            "neu": 0.857,
            "pos": 0.082
        }
    },
    {
        "date": "2024-05-24T14:45:00+00:00",
        "title": "Bulletproof Your Portfolio: 3 Defense Stocks to Own Now",
        "content": "With two significant wars at the moment, you would think the question of which defense stocks to buy would be a topic of interest for investors. However, according to Barron’s, the top five defense stocks: Lockheed Martin (NYSE:LMT), Northrop Grumman (NYSE:NOC), Boeing (NYSE:BA), General Dynamics (NYSE:GD) and RTX (NYSE:RTX) have only gained an average of 30% over the past five years, significantly less than the index itself. That could explain some of the investor reluctance.\n\nMoreover, the industry feels inadvertently unpredictable to many investors, with the potential for government spending priorities to shift based on the administration. Nevertheless, defense stocks, if selected correctly, can be exceptionally defensive for a portfolio. That’s because not all defense stocks rely on large government spending packages to remain competitive, due to the critical nature of the products they sell, like ammo or aircraft maintenance parts.\n\nIf you’re interested in defense stocks, here are three to buy to bulletproof your portfolio.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nRTX (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nRTX (NYSE:RTX), formerly known as Raytheon Technologies, has three operating segments: Collins Aerospace, Pratt & Whitney, and Raytheon. Collins sells products and services to aircraft manufacturers, airlines, the U.S. government, defense contractors, and independent distributors worldwide. Pratt & Whitney supplies aircraft engines to both commercial and military customers. Lastly, Raytheon manufactures and sells advanced radar detection systems and sensors for missile defense applications.\n\nAll three sectors generated around $6.5 billion in revenue in Q1, 2024. However, of the three, Raytheon had the highest operating margin at 15.0%, 230 basis points higher than Collins Aerospace and more than double Pratt & Whitney’s. Together, RTX had total segment sales of $19.79 billion and operating profits of $2.26 billion, both considerably higher than a year ago.\n\nWhile its shares aren’t cheap, the company continues to grow revenues and operating profits at a decent pace, making it a good long-term hold. It’s also an incredibly relevant producer of defense technologies, as the wars of today depend on missile technology more than ever before.\n\nHeico (HEI)\n\nSource: Shutterstock\n\nHeico (NYSE:HEI) was founded in 1957 and today operates two segments: Flight Support Group (60% of revenue) and Electronic Technologies Group (40%).\n\nThe Flight Support Group designs and manufactures jet engine and aircraft component replacement parts in accordance with Federal Aviation Administration guidelines. It also repairs, overhauls, and distributes jet engines and aircraft components like avionics and instruments for domestic and foreign commercial air carriers, aircraft repair companies, and military and business aircraft operators.\n\nStory continues\n\nThe Electronic Technologies Group designs, manufactures, and sells various electronic, microwave, and electro-optical products. From the time the current management took control of the business in 1990 through fiscal 2023, its annual revenues have grown from $26 million to nearly $3 billion, a compound annual growth rate (CAGR) of 15%. The CAGR for its net income is even higher at 18%.\n\nOver the past three years, its annualized revenue and operating income growth rate was 18.4%. While analysts are lukewarm about its business, its shares have doubled over the past five years for a reason.\n\nNational Presto Industries (NPK) Gold shield; digital shield, defense, protection\n\nSource: anttoniart / Shutterstock\n\nThis last pick is a bit of a wildcard. National Presto Industries (NYSE:NPK). According to MarketWatch, only one analyst covers the small-cap stock, rating it a buy, with a $128 target, 68% higher than where it’s currently trading.\n\nNational Presto is one of those stocks you buy and forget about for years because it does a few things rather than specializing in one industry or sector. It operates three businesses: Housewares/Small Appliances (29% of revenue), Defense (70%), and Safety (1%).\n\nConsumers could be familiar with its housewares segment, which makes everything from skillets and griddles to air fryers and rice cookers, even coffee makers. However, it’s the defense segment that gets it into this article.\n\nThe company has several subsidiaries under the National Defense Corporation, including AMTEC, which manufactures 40mm ammunition for the U.S. Department of Defense. As I mentioned, defense accounts for nearly three-quarters of its annual revenue and about 84% of its operating profits.\n\nOf the three defense stocks, National Presto is the value play. Its enterprise value of $476 million is 10.5x its EBITDA (earnings before interest, taxes, depreciation, and amortization), way less than RTX (18.6x) and HEI (35.3x).\n\nOn the date of publication, Will Ashworth did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nWill Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post Bulletproof Your Portfolio: 3 Defense Stocks to Own Now appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/bulletproof-portfolio-3-defense-stocks-144500765.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "BA.US",
            "GD.US",
            "HEI.US",
            "LMT.US",
            "NOC.US",
            "NPK.US",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.02,
            "neu": 0.876,
            "pos": 0.105
        }
    },
    {
        "date": "2024-05-24T13:27:00+00:00",
        "title": "RTX Secures a $227M Contract to Support AIM-9X Missile Program",
        "content": "RTX Corp. RTX recently clinched a contract involving its AIM-9X and AIM-9X Block II missiles. The award has been offered by the Naval Air Systems Command, Patuxent River, MD.\n\nDetails of the Deal\n\nValued at $227.4 million, the contract is expected to be completed by May 2029. Per the terms of the deal, RTX will provide depot-level repairs and other related services to support AIM-9X and AIM-9X Block II missile sustainment efforts.\n\nThese services include logistics support, sustainment engineering, software support, integration support, failure analysis, configuration management, technical data, diminishing manufacturing sources, material shortages management, training, field support, spare predictions, ordnance assessment, reliability, and management of government property.\n\nMajority of the work related to this deal will be executed in Tucson, AZ.\n\nWhat’s Favoring RTX?\n\nNations are reinforcing their military capabilities to strengthen their defense structure in the growing threat environment. In this context, increased spending has been witnessed on missile capabilities, resulting in a significant order inflow for companies like RTX, which is a prominent missile maker in the United States with a strong international presence.\r\n\r\nNotably, RTX’s AIM-9X Sidewinder is the most advanced infrared-tracking, short-range, air-to-air and surface-to-air missile in the world. It is configured for easy installation in a range of modern aircraft, including Boeing’s F-15, F/A-18 and E/A-18G and Lockheed’s F-22 and F-35 fighters.\n\nThe latest variant of AIM-9X Sidewinder, the AIM-9X Block II missile features a redesigned fuse and a digital ignition safety device that enhances ground handling and in-flight safety. Backed by such advanced technology, the company witnesses significant orders for the same, like the latest one. The demand for this product line of RTX can be further gauged from the fact that the AIM-9X SIDEWINDER missile has 31 foreign military sales partners.\n\nGrowth Prospects\n\nThe global peace index reflects an unstable environment worldwide, with the Russia-Ukraine war continuing for more than two years now, in addition to the ongoing hostility in different parts of the Middle East. This has set the stage for the defense sector to witness rising demand for military products, particularly missiles, as nations worldwide strive to protect their borders from unprecedented attacks.\n\nTherefore, the growth prospect for the missile and missile defense systems market remains solid. To this end, the Mordor Intelligence firm projects the market to witness a CAGR of 5% over the 2024-2029 period.\n\nStory continues\n\nSuch a solid market growth projection stands to benefit RTX, which enjoys an extensive missile portfolio, including SM-6, SM-3 interceptor, TOW missiles and many more such weapons, apart from the AIM-9X missile.\n\nPeer Opportunities\n\nOther defense contractors that are likely to benefit from the growth opportunities offered by the missile and missile defense market are as follows:\n\nNorthrop Grumman NOC: Northrop is a prominent developer of missile systems and counter systems, including strategic deterrents, as well as subsystems and components. Its product portfolio includes the Integrated Air and Missile Defense Battle Command System, the Guided Multiple Launch Rocket System propulsion and warhead subsystems, the Hypersonic Attack Cruise Missile, the Advanced Anti-Radiation Guided Missile and a few other combat-proven products that support missile defense systems.\n\nNOC boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for Northrop’s 2024 sales indicates an improvement of 4.6% from the 2023 reported figure.\n\nLockheed Martin LMT: Lockheed’s Missiles and Fire Control business unit develops, manufactures and supports advanced combat missiles and rockets for military customers, including the U.S. Army, Navy, Air Force, Marine Corps, NASA and dozens of foreign allies. Some of its prominent products are the PAC-3 missile and the Terminal High Altitude Area Defense missile.\n\nLMT boasts a long-term earnings growth rate of 4.1%. The Zacks Consensus Estimate for Lockheed’s 2024 sales indicates an improvement of 3.2% from the 2023 reported figure.\n\nGeneral Dynamics GD: General Dynamics’ Ordnance and Tactical Systems unit is the system integrator of the 2.75-inch Hydra-70 family of rockets. It also produces composite rocket motor cases and launch tubes for tactical and strategic missiles.\r\n\r\nGD boasts a long-term earnings growth rate of 12%. The Zacks Consensus Estimate for General Dynamics’ 2024 sales indicates growth of 10.5% from the 2023 reported figure.\n\nPrice Movement\n\nIn the past year, shares of RTX have risen 13.2% against the industry’s decline of 6.6%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nRTX currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-secures-227m-contract-support-132700383.html",
        "symbols": [
            "0IUC.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.052,
            "neu": 0.764,
            "pos": 0.184
        }
    },
    {
        "date": "2024-05-24T12:00:22+00:00",
        "title": "Lockheed Martin's (NYSE:LMT) Returns Have Hit A Wall",
        "content": "There are a few key trends to look for if we want to identify the next multi-bagger. Typically, we'll want to notice a trend of growing return on capital employed (ROCE) and alongside that, an expanding base of capital employed. Basically this means that a company has profitable initiatives that it can continue to reinvest in, which is a trait of a compounding machine. So when we looked at Lockheed Martin (NYSE:LMT), they do have a high ROCE, but we weren't exactly elated from how returns are trending.\n\nReturn On Capital Employed (ROCE): What Is It?\n\nFor those that aren't sure what ROCE is, it measures the amount of pre-tax profits a company can generate from the capital employed in its business. The formula for this calculation on Lockheed Martin is:\n\nReturn on Capital Employed = Earnings Before Interest and Tax (EBIT) ÷ (Total Assets - Current Liabilities)\n\n0.24 = US$9.0b ÷ (US$55b - US$18b) (Based on the trailing twelve months to March 2024).\n\nThus, Lockheed Martin has an ROCE of 24%.  In absolute terms that's a great return and it's even better than the Aerospace & Defense industry average of 9.8%.\n\nView our latest analysis for Lockheed Martin  roce\n\nIn the above chart we have measured Lockheed Martin's prior ROCE against its prior performance, but the future is arguably more important. If you'd like to see what analysts are forecasting going forward, you should check out our free analyst report for Lockheed Martin .\n\nWhat Does the ROCE Trend For Lockheed Martin Tell Us?\n\nThere hasn't been much to report for Lockheed Martin's returns and its level of capital employed because both metrics have been steady for the past five years. It's not uncommon to see this when looking at a mature and stable business that isn't re-investing its earnings because it has likely passed that phase of the business cycle. Although current returns are high, we'd need more evidence of underlying growth for it to look like a multi-bagger going forward. With fewer investment opportunities, it makes sense that Lockheed Martin has been paying out a decent 49% of its earnings to shareholders. Given the business isn't reinvesting in itself, it makes sense to distribute a portion of earnings among shareholders.\n\nThe Key Takeaway\n\nAlthough is allocating it's capital efficiently to generate impressive returns, it isn't compounding its base of capital, which is what we'd see from a multi-bagger. Although the market must be expecting these trends to improve because the stock has gained 56% over the last five years. Ultimately, if the underlying trends persist, we wouldn't hold our breath on it being a multi-bagger going forward.\n\nStory continues\n\nOn a final note, we've found  2 warning signs for Lockheed Martin that we think you should be aware of.\n\nHigh returns are a key ingredient to strong performance, so check out our free list ofstocks earning high returns on equity with solid balance sheets.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martins-nyse-lmt-returns-120022664.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.021,
            "neu": 0.849,
            "pos": 0.13
        }
    }
]