[
    {
        "date": "2024-10-03T19:24:11+00:00",
        "title": "Lockheed Martin's Greatest Upside Potential Is In Space: Analyst Sees Dividend Hikes, Buyback Top Ups",
        "content": "Lockheed Martin's Greatest Upside Potential Is In Space: Analyst Sees Dividend Hikes, Buyback Top Ups\n\nDeutsche Bank analyst Scott Deuschle maintains Lockheed MartinCorporation (NYSE:LMT) with a Buy, raising the price forecast from $600 to $620.\n\nThe analyst suggests that Lockheed Martin likely prefunds its pension in the fourth quarter, although the company may delay a formal announcement until after it’s completed.\n\nDeuschle adds that the associated debt issuance for this funding is expected to occur sooner.\n\nThe analyst forecasts third-quarter EPS of $6.70, approximately 4% above the Street’s estimate of $6.47.\n\nDeuschle sees revenue of around $17.4 billion, which is $100 million below the Street’s expectation, as the analyst incorporates the $500 million F-35 contract delay impact at Aeronautics, which is not fully reflected in the Street’s projections.\n\nThe analyst identifies the greatest upside potential in Space, noting that underlying margins excluding United Launch Alliance (ULA) are expected to decline significantly in the second half.\n\nAlso Read: Lockheed Martin’s Unit Secures Contract for CH-53K Gearbox Assemblies\n\nThis outlook seems conservative, considering that two major contracts—Orion and OPIR—are entering a highly mature phase of their production lifecycle.\n\nThe analyst projects a third-quarter revenue beat, which may lead to an upward revision of the full-year revenue guidance, potentially nearing $72 billion.\n\nDeuschle also sees a 1%-2% increase to the midpoint of the full-year segment EBIT guidance, especially if EBIT upside is realized in Space during the third quarter, as seen in the first half.\n\nThe analyst sees the company offer some indication for 2025 financial trends.\n\nGiven the firm’s conservative track record, the analyst sees the company is likely to project approximately 3% revenue growth and reiterates its target for 10-20 basis points of margin expansion.\n\nDeuschle also projects a dividend increase announcement ahead of earnings, and the buyback authorization will likely be topped up.\n\nPrice Action: LMT shares are trading lower by 0.29% to $601.79 at last check Thursday.\n\nPhoto via Shutterstock\n\nRead Next:\n\nHow Many EVs Has Tesla Delivered, Produced Each Quarter? A Look At The Results Since 2019\n\nLatest Ratings for LMT\n\nDate Firm Action From To Mar 2022 Wells Fargo Maintains Equal-Weight Mar 2022 Morgan Stanley Maintains Overweight Feb 2022 Wolfe Research Upgrades Peer Perform Outperform\n\nView More Analyst Ratings for LMT\n\nView the Latest Analyst Ratings\n\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools. Click now to access unique insights that can set you ahead in today's competitive market.\n\nStory continues\n\nGet the latest stock analysis from Benzinga?\n\nLOCKHEED MARTIN (LMT): Free Stock Analysis Report\n\nThis article Lockheed Martin's Greatest Upside Potential Is In Space: Analyst Sees Dividend Hikes, Buyback Top Ups originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martins-greatest-upside-potential-192411180.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.981,
            "neg": 0.025,
            "neu": 0.89,
            "pos": 0.086
        }
    },
    {
        "date": "2024-10-03T15:25:00+00:00",
        "title": "Boeing Wins a $251M Contract for KC-135 Refueling Tanker Aircraft",
        "content": "The Boeing Company BA recently secured a modification contract worth $251.4 million for the production of fan duct transactional spares for KC-135 aerial refueling tanker aircraft. The award has been offered by the Defense Logistics Agency Aviation, Tinker Air Force Base, OK.\n\nSignificance of BA’s KC-135\n\nBoeing’s KC-135 Stratotanker is an aerial refueling aircraft that provides core aerial refueling capability for the U.S. Air Force and has excelled in this role for more than 60 years.\n\nThe KC-135 is also capable of transporting litter and ambulatory patients using patient support pallets during aeromedical evacuations. Over the years, this aircraft has been altered to perform a variety of operations ranging from flying command post missions to reconnaissance.\n\nBA’s Place in Military Aviation Market\n\nApart from holding a lion's share of the commercial aviation industry along with Airbus, Boeing is a renowned manufacturer of combat aircraft. Its Defense, Space & Security business segment engages in the research, development, production and modification of manned and unmanned military aircraft as well as commercial derivative aircraft, including anti-submarine and tanker aircraft.\n\nSome of its renowned combat-proven jets are the C-17 Globemaster III, F/A-18 Super Hornet, EA-18G Growler, P-8 and F-15EX. The dominant position that Boeing enjoys in the aerial defense space, particularly in the United States, can be gauged from the fact that it has always been the primary aircraft supplier for the nation’s Air Force One program. Impressively, once Boeing 747-8 takes flight as the next Air Force One, its airplanes will mark more than half a century of U.S. presidential service.\n\nGrowth Prospects for BA Stock\n\nIn recent times, rapidly increasing hostilities worldwide, especially the unrest witnessed in different parts of the Middles East, along with the rising complexity of warfare as well as technological advancements in arms and ammunition, have prompted nations across the globe to significantly boost their defense structure in the form of increased investments in military products. Since aerial security plays a critical role in defending a nation’s border from unprecedented attacks, demand for state-of-the-art, agile, combat-proven aircraft has been on the rise.\n\nAs modern military strategies emphasize rapid deployment, long-range strike capabilities and sustained air patrols, advanced refueling support offered by multi-role refueling tanker jets like KC-135 remains the need of the hour. The latest contract win by Boeing is a bright example of that.\n\nStory continues\n\nTo this end, the Mordor Intelligence firm predicts that the global military aviation market will witness a CAGR of 5.2% in the 2024-2029 period. These projections indicate significant growth opportunities for leading combat jet manufacturers like Boeing.\n\nNotably, Boeing’s Defense, Space & Security business segment ended the second quarter of 2024 with a backlog count of $59.06 billion, which reflects solid revenue generation prospects for this unit in the near future.\n\nOpportunities for BA’s Peers\n\nOther aerospace companies that are likely to reap the benefits of the expanding global military aviation market are as follows:\n\nNorthrop Grumman Corp. NOC: The company is a leading provider of manned and unmanned combat aircraft. NOC builds some of the world’s most advanced military jets like the E-2C Hawkeye 2000, A-10 Thunderbolt II, F-5 Tiger Fighter Jet and many more.\n\nNorthrop has a long-term (three to five years) earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales calls for an improvement of 5.4% from the prior-year reported figure.\n\nEmbraer S.A. ERJ: The company offers a comprehensive portfolio of the most advanced aircraft in the combat market, which includes the A-29 Super Tucano light attack and advanced trainer and the C-390 Millennium military multi-mission aircraft.\n\nEmbraer delivered an average earnings surprise of 52.28% in the trailing four quarters. The Zacks Consensus Estimate for ERJ’s 2024 sales implies an improvement of 19.1% from the prior-year reported figure.\n\nLockheed Martin Corp. LMT: The company is a prominent forerunner in the combat aircraft space, with its product portfolio constituting some of the most advanced military aircraft like the F-35 Lightning II, C-130 J Super Hercules, F-16 Fighting Falcon and a few more.\n\nLockheed Martin boasts long-term earnings growth rate of 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales indicates an improvement of 5.3% from the prior-year reported figure.\n\nBA Stock’s Price Movement\n\nIn the past year, shares of Boeing have lost 18.1% against the industry’s growth of 19.3%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nBoeing currently carries a Zacks Rank #4 (Sell).\n\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nEmbraer-Empresa Brasileira de Aeronautica (ERJ) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/boeing-wins-251m-contract-kc-152500140.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "EMBR3.SA",
            "EMY.F",
            "ERJ.US",
            "LMT.US",
            "LMTB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.036,
            "neu": 0.775,
            "pos": 0.189
        }
    },
    {
        "date": "2024-10-03T15:00:00+00:00",
        "title": "RTX Secures $192M Contract to Upgrade Next Generation Jammer",
        "content": "RTX Corporation’s RTX business segment, Raytheon, recently won a $192 million modification contract to upgrade the Next Generation Jammer Mid-Band Expansion (NGJ-MB) system. The contract was provided by the U.S. Navy.\n\nDetails of the Deal Secured by RTX\n\nPer the terms of the deal, RTX will develop the NGJ-MBX system, which is an upgraded version of its existing Next NGJ-MB system. The latest modification will extend the frequency range of the NGJ-MB system to counter additional threats, as MBX provides additional capabilities, which should improve the operational effectiveness of the NGJ-MB.\r\n\r\nThe work related to this deal will be executed in Dallas, TX; Forest, MI; El Segundo, CA, and Fort Wayne, IN, through 2027.\n\nSignificance of RTX’s NGJ-MB System\n\nRaytheon's NGJ-MB is a jamming system that improves airborne electronic attack capabilities for EA-18G Growler fighter aircraft. The NGJ-MB is the U.S. Navy's sophisticated electronic attack system designed to destroy enemy technology, such as air defense systems and communication tools. The NGJ-MB employs digital, software-based and Active Electronically Scanned Array technology, allowing operators to non-kinetically attack more targets at longer distances.\n\nWhat’s Favoring RTX?\n\nRising geopolitical tensions globally have prompted countries to enhance their military capabilities, including electronic warfare (EW) systems, by increasing spending on the production and modernization of varied programs. During the past decade, the utilization of cutting-edge technology in EW systems has rapidly evolved, making them an essential component of any country's defensive architecture.\r\n\r\nTo this end, the Mordor Intelligence firm predicts the Electronic Warfare market to witness a CAGR of 5.1% during the 2024-2029 period. This should benefit EW system manufacturers like RTX in the form of steady order flows from the Pentagon and other U.S. allies for advanced EW systems like NGJ-MB. The latest contract win is a bright example of that.\n\nProspects for RTX’s Peers\n\nOther defense contractors that are expected to reap the benefits of the expanding EW market are listed below:\r\n\r\nL3Harris Technologies LHX: It manufactures electronic warfare systems like AN/ALQ-214 (IDECM) F/A-18 Countermeasure System, Viper Shield AN/ALQ-254(V)1 All-digital Electronic Warfare Suite, CREW Vehicle Receiver/Jammer and The Next Generation Jammer-Low Band.\r\n\r\nL3Harris has a long-term (three to five years) earnings growth rate of 8.9%. The Zacks Consensus Estimate for LHX’s 2024 sales suggests growth of 9.6% from the prior-year reported figure.\r\n\r\nLockheed Martin LMT: It provides global ground EW solutions to U.S. forces as well as partner nations through a unique next-generation open architecture product platform and open business model.  Its Advanced Off-Board Electronic Warfare program delivers persistent electronic surveillance and attack capability against naval threats like anti-ship missiles.\r\n\r\nLockheed boasts a solid long-term earnings growth rate of 4.7%. The consensus estimate for LMT’s 2024 sales indicates a 5.3% improvement from the prior year's reported figure.\r\n\r\nNorthrop Grumman NOC: The company has been providing Naval Airborne Electronic Warfare solutions for more than 55 years. Some of its EW systems include the ALQ-251 radio frequency countermeasures system and the AN/APR-39 Radar Warning Receiver/Electronic Warfare Management System.\r\n\r\nNOC boasts a solid long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for its 2024 sales indicates year-over-year growth of 5.4%.\n\nStory continues\n\nPrice Movement\n\nIn the past six months, shares of RTX have risen 24.9% compared with the industry’s growth of 9.3%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nRTX currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nL3Harris Technologies Inc (LHX) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-secures-192m-contract-upgrade-150000462.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.XETRA",
            "LHX.US",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.063,
            "neu": 0.78,
            "pos": 0.157
        }
    },
    {
        "date": "2024-10-03T12:11:00+00:00",
        "title": "Lockheed Wins $2.1B Contract to Aid Trident II D5 Missile Program",
        "content": "Lockheed Martin Corp.’s LMT business segment, Space Systems, recently clinched a modification contract for manufacturing its Trident II D5 missile. Per the terms of the deal, Lockheed will also offer deployed systems support and Warhead 93/Mark7 development for Trident II D5 missile.\n\nDetails of the Deal\n\nValued at $2.11 billion, the contract is projected to be completed by Sept. 30, 2029. The award has been provided by the Strategic Systems Programs, Washington, D.C.\n\nA major portion of work related to this deal will be carried out in Denver, CO, Valley Forge, PA, Titusville, FL and Magna, UT.\n\nLMT Stock’s Place in Missile Market\n\nLockheed is a well-known manufacturer of missiles and missile defense systems in the global defense industry. While its Missiles and Fire Control (MFC) business segment provides air and missile defense systems, tactical missiles and air-to-ground precision strike weapon systems like the Patriot Advanced Capability-3 (PAC-3), Terminal High Altitude Area Defense and Hellfire missiles, its Space Systems division builds notable strike missile as well as missile defense systems like the Next Generation Interceptor (NGI).\n\nAs far as Lockheed’s Trident II D5 missile is concerned, it is the latest generation of the U.S. Navy's submarine-launched fleet ballistic missiles, following the highly successful Polaris, Poseidon and Trident I C4 programs. The fact that this program is the only submarine-launched intercontinental ballistic missile currently in production in the United States surely highlights its significance in the country’s naval defense and the solid demand the company enjoys in the missile marketplace. The latest contract win is a bright example of that.\n\nWith such unique featured missile products in its portfolio, Lockheed frequently enjoys a solid order flow for the company’s missiles from the Pentagon and other U.S. allies. This boosts the top-line growth for its MFC and Space Systems unit. Evidently, LMT’s MFC unit registered 12.6% year-over-year growth in its sales in the last reported quarter, while Space Systems witnessed a 1% top-line rise.\n\nWhat Lies Ahead for LMT Stock?\n\nIn the past decade, nations across the globe have significantly increased their spending on military equipment and weaponry to modernize and upgrade their defense systems in the face of rapidly rising geopolitical tensions and cross-border disputes worldwide. Amid this backdrop, the demand for missiles has also gained substantial momentum as these play a very important role in military missions.\n\nThis must have prompted the Morder Intelligence firm to predict that the global missile and missile defense systems market will witness a CAGR of 5% in the 2024-2029 period. Such solid market expansion projections exemplify immense growth opportunities for Lockheed.\n\nStory continues\n\nNotably, the company’s Space Systems unit’s major programs include the Next Generation Overhead Persistent Infrared (Next Gen OPIR) system, which provides the U.S. Space Force with enhanced worldwide missile warning capabilities, apart from the Trident II missile. Moreover, its NGI program utilizes next-generation propulsion and sensors to provide homeland missile defense.\n\nGrowth Opportunities for LMT’s Peers\n\nApart from LMT, other prominent defense majors that are likely to enjoy the perks of the expanding global missile and missile defense market are mentioned below:\n\nNorthrop Grumman NOC: It manufactures notable strike missiles like the Advanced Anti-Radiation Guided Missile Extended Range (AARGM-ER), which is a supersonic, air-launched tactical missile system. NOC’s Missile Products business unit is a leading U.S. provider of solid rocket propulsion for national security and defense, providing stages for weapon systems, such as air-launched missiles, interceptors, submarine-launched systems and hypersonic missile systems.\n\nNOC has a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for its 2024 sales implies growth of 5.4% from the prior-year reported figure.\n\nThe Boeing Company BA: Its air and missile defense systems have been protecting the United States, warfighters, allies and international partners against threats ranging from intercontinental ballistic missiles to hostile aircraft for the past 25 years. Its renowned missile and related products include the Aegis Ballistic Missile Defense, PAC-3 Missile Seeker, Ground-Based Midcourse Defense and a few more.\n\nBA boasts a long-term earnings growth rate of 21.3%. The Zacks Consensus Estimate for BA’s third-quarter 2024 sales indicates growth of 10% from the prior-year reported figure.\n\nRTX Corp. RTX: It is a renowned manufacturer of missiles and missile defense systems. RTX’s product portfolio includes combat-proven missiles like the TOW missile, Guidance Enhanced Missile, Advanced Medium Range Air-to-Air Missile, Tomahawk, Standard Missile 2 and a few more.\n\nRTX boasts a long-term earnings growth rate of 10.4%. The Zacks Consensus Estimate for its 2024 sales indicates growth of 7% from the prior-year reported figure.\n\nPrice Movement\n\nIn the past year, shares of Lockheed have surged a solid 49.3% compared with the industry’s growth of 17.9%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLMT currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-wins-2-1b-contract-121100793.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.033,
            "neu": 0.794,
            "pos": 0.173
        }
    },
    {
        "date": "2024-10-03T10:24:00+00:00",
        "title": "The Zacks Analyst Blog Highlights NextEra, Lockheed Martin, Palo Alto, Rave Restaurant and AXIL",
        "content": "For Immediate Release\n\nChicago, IL – October 3, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: NextEra Energy, Inc. NEE, Lockheed Martin Corp. LMT, Palo Alto Networks, Inc. PANW, Rave Restaurant Group, Inc. RAVE and AXIL Brands, Inc. AXIL.\n\nHere are highlights from Wednesday’s Analyst Blog:\n\nTop Analyst for NextEra, Lockheed Martin and Palo Alto Networks\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including NextEra Energy, Inc., Lockheed Martin Corp. and Palo Alto Networks, Inc., as well as two micro-cap stocks Rave Restaurant Group, Inc. and AXIL Brands, Inc. The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\r\n\r\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\r\n\r\nYou can see all of today’s research reports here >>>\r\n\r\nNextEra Energy’s shares have outperformed the Zacks Utility - Electric Power industry over the past year (+66.5% vs. +39.4%). The company continues to expand its operations through organic projects and acquisitions. NextEra Energy will add more renewable projects to its portfolio and has nearly 22.6 GW of renewable projects in its backlog.\r\n\r\nEfficient cost management is boosting the company's margins. Florida’s improving economy boosts the company’s subsidiary Florida Power & Light Company’s customer base. NextEra Energy has ample liquidity to meet its short-term debt obligations.\r\n\r\nYet, due to the nature of NextEra Energy’s business, it is subject to complex rules and regulations. Risks in operating nuclear power-based generation units, unfavorable weather conditions, and increasing supply costs can adversely impact earnings.\r\n\r\n(You can read the full research report on NextEra Energy here >>>)\r\n\r\nShares of Lockheed Martin have outperformed the Zacks Aerospace - Defense industry over the past year (+54.1% vs. +19.9%). The company’s broad product offerings allow it to secure major defense contracts, which in turn boosts its backlog count. Lockheed remains the largest U.S. defense contractor with a steady order flow from its leveraged presence in the Army, Air Force, Navy and IT programs.\r\n\r\nThe solid U.S. defense budgetary provisions should boost its business. Its products also witness a strong international demand from the countries like Germany, Taiwan, Japan and Australia. Meanwhile, the company also holds a strong solvency position.\r\n\r\nHowever, Lockheed is facing performance issues concerning some of its products that may affect its results. Shortage of skilled labor may adversely impact the company’s operating results. The sanctions imposed by China on Lockheed might also affect its business.\r\n\r\n(You can read the full research report on Lockheed Martin here >>>)\r\n\r\nPalo Alto Networks’ shares have gained +42.2% over the past year against the Zacks Internet - Software industry’s gain of +45.9%. The company has been benefiting from continuous deal wins and the increasing adoption of its next-generation security platforms, attributable to the rise in the hybrid work environment and the heightened need for stronger security.\r\n\r\nPANW’s strong back-to-back quarterly performances reflect its sustained focus on product innovation, a shift in its business model to subscription-based services, platform integration and continued investments in the go-to-market strategy. The normalization of the supply chain is also aiding growth across the Products, Services and Subscription segments.\r\n\r\nHowever, softening IT spending amid macroeconomic headwinds might hurt its near-term prospects. Forex headwinds and higher marketing and sales expenses are likely to continue hurting its profitability. Also, high acquisition-related expenses are denting margins.\r\n\r\n(You can read the full research report on Palo Alto Networks here >>>)\r\n\r\nShares of Rave Restaurant’s have gained +5.9% over the past year against the Zacks Retail - Restaurants industry’s gain of +21.7%. This microcap company with market capitalization of $32.38 million continues to demonstrate strong financial performance, posting its 17th consecutive quarter of positive earnings. Fiscal 2024 net income rose 53.3% to $2.5 million.\r\n\r\nRave Restaurant’s debt-free balance sheet with $7.8 million in cash reflects financial stability. Its expansion efforts are focused on the Pizza Inn brand, with reimaging initiatives underway for 25% of its buffet restaurants by fiscal 2025 and 21 new domestic sites contracted.\r\n\r\nDespite growth, challenges persist, including declining same-store sales, particularly in the Pie Five brand (which declined 10.6% in fourth-quarter fiscal 2024), rising operating costs and limited unit expansion. Rave Restaurant’s reliance on franchisees, shrinking international presence, modest revenue growth, and geographic concentration further pose risks to sustained growth.\r\n\r\n(You can read the full research report on Rave Restaurant here >>>)\r\n\r\nAXIL Brands’ shares have underperformed the Zacks Consumer Products - Staples industry over the past year (-65.1% vs. +14.2%). This microcap company with market capitalization of $27.17 million is facing risks which include high reliance on Shopify and Amazon (91% of revenues), rising operating expenses, vendor dependence and limited product diversification (95% of revenues from hearing products). Also, dilution risks from stock issuances and geopolitical factors may impact AXIL's performance.\r\n\r\nNevertheless, AXIL presents a compelling growth opportunity through its expanding market reach across the United States, Canada, the EU and Asia. Partnerships with companies, such as Racing Electronics and Kinsey’s, enhance brand visibility and market penetration, positioning AXIL for revenue growth.\r\n\r\nThe company’s focus on innovation in hearing protection and enhancement products, along with its premium Reviv3 Procare hair and skincare line, ensures alignment with evolving consumer demands. AXIL’s revenues grew 17% year over year in fiscal 2024, driven by its hearing products, while maintaining a strong gross margin of 73.4%.\r\n\r\n(You can read the full research report on AXIL Brands here >>>)\n\nStory continues\n\nWhy Haven't You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\n\nToday you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNextEra Energy, Inc. (NEE) : Free Stock Analysis Report\n\nPalo Alto Networks, Inc. (PANW) : Free Stock Analysis Report\n\nRave Restaurant Group, Inc. (RAVE) : Free Stock Analysis Report\n\nAXIL Brands, Inc. (AXIL): Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-nextera-102400984.html",
        "symbols": [
            "0K80.LSE",
            "0R3E.LSE",
            "5AP.F",
            "FP3.BE",
            "FP3.DU",
            "FP3.F",
            "FP3.MU",
            "FP3.STU",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NEE.US",
            "NEP.US",
            "NEXT34.SA",
            "PANW.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.031,
            "neu": 0.831,
            "pos": 0.138
        }
    },
    {
        "date": "2024-10-03T09:40:00+00:00",
        "title": "The Zacks Analyst Blog Highlights United States Oil, Lockheed Martin, Tesla, Freeport McMoran and Netflix",
        "content": "For Immediate Release\n\nChicago, IL – October 3, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: United States Oil Fund USO, Lockheed Martin LMT, Tesla TSLA, Freeport McMoran FCX and Netflix NFLX.\n\nHere are highlights from Wednesday’s Analyst Blog:\n\nMiddle East Tensions Rise: Correction Ahead?\n\nGeopolitical Tensions Rise as Earnings Season Approaches\n\nStocks swooned Thursday after reports circulated that Iran fired hundreds of rockets into Israel in an apparent escalation of the conflict in the Middle East. Crude oil, which had been down-trending, got a firm bid and was up more than 2% on massive volume. Meanwhile, investors flocked to the United States Oil Fund and defensive stocks such as Lockheed Martin. Following Iran’s aggression, the IDF pre-announced that they would retaliate and potentially target Iran’s crude oil infrastructure.\n\nEarnings Season Approaches\n\n“Earning’s season” usually occurs two weeks after the end of the quarter and refers to when most companies in the major U.S. indices like the S&P 500 Index report earnings. Over the next few weeks, leading stocks such as Tesla, Freeport McMoran and Netflix will report earnings. Often, strong stocks such as these will rally into earnings. However, investors likely have some concerns over the escalating conflicts worldwide. Are investors being too emotional, or should they panic?\n\n“Buy Bombs”\n\n“Buy Bombs” is an old Wall Street saying that illustrates the contrarian nature of markets. Though geopolitical events like 9/11 have caused broad market selloffs, in most instances, stocks sell off in anticipation of the events, and then, when the event finally occurs, stocks rally amid rampant fear. Markets are notoriously manipulative, and though every world citizen should be concerned and market participants should watch for further escalations, geopolitical events are often buyable dips, especially in bull markets (like the one we’re in now).\n\nMarket Internals Tell the Story\n\nSavvy investors understand the importance of looking under the hood and beyond the market indices themselves. Late Thursday, the cumulative tick indicator (a technical analysis indicator that assesses overall buying or selling pressure) flipped positive, and down volume was muted (especially considering how weak the major indices were).\n\nIn other words, thus far, the market is more robust than it looks. Though the conflict could escalate further, savvy investors understand the benefits of interpreting the action rather than predicting the future.\n\nWill October Bring Tax Selling?\n\nTax loss harvesting is a procedure implemented by retail and institutional investors to decrease their taxable income by selling investments they are underwater in towards year-end. Often, institutional investors, who comprise the bulk of trading volume, give themselves a buffer and sell their losers in October.\n\nHowever, thus far, in 2024, U.S. equities are off to one of the best starts in history. Though October can sometimes spell danger like it did in 2023, the S&P 500 Index produced gains of ~8% in 2023 and ~7% in 2021. While some volatility is possible, investors should be open various outcomes in October.\n\nOctober Seasonality\n\nRegarding seasonality, historical data suggests that analysis of the month of October requires investors to exercise some nuance. October is historically a positive month. That said, during presidential election years (like the one we’re in now), October is down -0.8% on average as investors show skittishness amidst uncertainty.\n\nBottom Line\n\nWith geopolitical tensions rising and tax selling season in full swing, some October volatility is possible. However, the historical reactions to geopolitics and bullish market internals suggest it is too early for investors to panic.\n\nWhy Haven't You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\n\nToday you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNetflix, Inc. (NFLX) : Free Stock Analysis Report\n\nFreeport-McMoRan Inc. (FCX) : Free Stock Analysis Report\n\nTesla, Inc. (TSLA) : Free Stock Analysis Report\n\nUnited States Oil ETF (USO): ETF Research Reports\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-united-094000437.html",
        "symbols": [
            "0R3E.LSE",
            "FCX.MX",
            "FCX.US",
            "FCXO34.SA",
            "FPMB.BE",
            "FPMB.DU",
            "FPMB.F",
            "FPMB.MU",
            "FPMB.STU",
            "GSPC.INDX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.98,
            "neg": 0.06,
            "neu": 0.848,
            "pos": 0.092
        }
    }
]