[
    {
        "date": "2024-07-31T13:51:19+00:00",
        "title": "McDonald's downgraded, PayPal upgraded: Wall Street's top analyst calls",
        "content": "McDonald's downgraded, PayPal upgraded: Wall Street's top analyst calls\n\nThe most talked about and market moving research calls around Wall Street are now in one place. Here are today's research calls that investors need to know, as compiled by The Fly.\n\nTop 5 Upgrades:\n\nBernstein upgraded PayPal (PYPL) to Outperform from Market Perform with a price target of $78, up from $71. The firm is encouraged by improved transaction gross profit performance from the company's positive branded growth, Braintree pricing initiatives, and Venmo monetization. BofA upgraded Lockheed Martin(LMT) to Buy from Neutral with a price target of $635, up from $465. Lockheed's upgraded F-35s with Tech Refresh-3 packages have restarted deliveries, notes the firm, which views the company as poised to outperform on strong global demand across segments as it anticipates Lockheed benefiting from ramping programs like the PAC-3, HIMARS, JASSM, and LRASM. BofA upgraded Ecolab (ECL) to Buy from Neutral with a price target of $272, up from $251. The shares sold off following Ecolab's 35% earnings growth in Q2 on 4% organic sales, but the firm found the results \"constructive\" and has increased conviction that Ecolab can generate mid-teens earnings growth in the coming years along with expanding operating margins. Citi also upgraded Ecolab to Buy from Neutral with a price target of $265, down from $267. BofA upgraded RTX (RTX) to Buy from Neutral with a price target of $140, up from $110. As the Geared Turbo Fan, or GTF, fix is ongoing, the firm is now more confident the scale and scope of the fix has been fairly considered by the company and sees potential for further derisking as Maintenance, Repair, and Overhaul, or MRO, throughput increased 10% quarter-over-quarter with more shops coming online. Mizuho double upgraded Upstart (UPST) to Outperform from Underperform with a price target of $31, up from $17. The company \"doesn't have many fans\" with short interest at 33% and zero sell-side buy ratings, but the firm says the growing likelihood of lower interest rates, improving borrower risk, lower delinquencies and positive industry commentary \"are all signs that the skies might be brightening,\" allowing Upstart to \"re-open the credit box and increase issuance of loans.\"\n\nTop 5 Downgrades:\n\nTD Cowen downgraded McDonald's(MCD) to Hold from Buy with a price target of $280, down from $285. The firm says the positive stock reaction to the company's \"challenged\" Q2 results and \"soft\" second half of 2024 outlook presents a balanced risk/reward over the next 12-months. Benchmark downgraded IPG Photonics(IPGP) to Hold from Buy with no price target after the company posted June-end quarter results that were in line with prior guidance, but gave a forecast for the September-ed quarter that was well below investor expectations. Wolfe Research downgraded Charter (CHTR) to Peer Perform from Outperform. The company's EBITDA trends proved resilient amid peak disruption, but its price and cost-driven strategy warrants a low multiple, the firm tells investors in a research note. Craig-Hallum downgraded Grocery Outlet (GO) to Hold from Buy with a price target of $20, down from $32. The firm says its checks over the past two months indicate a deceleration in same-store sales since May that creates potential downside to Q2/Q3 estimates. Citi downgraded Penumbra (PEN) to Neutral from Buy with a price target of $178, up from $165. The company's strong quarter was accompanied by a cut to 2024 revenue guidance \"that was multi-factorial,\" the firm tells investors in a research note.\n\nStory continues\n\nTop 5 Initiations:\n\nRaymond James initiated coverage of On Holding(ONON) with an Outperform rating and $46 price target. The firm expects strong demand and operating margin expansion to drive annual growth of over 25% for revenue, over 30% for EBITDA, and over 50% for earnings through 2026. Benchmark initiated coverage of Blink Charging (BLNK) with a Buy rating and $5 price target. Blink Charging, which manufactures, sells, and owns/operates primarily level 2 networked electric vehicle charging equipment, is \"well-positioned\" with a focus on Level 2 chargers, which is expected to be 90% of the market, the firm tells investors. William Blair initiated coverage of Applied Therapeutics(APLT) with an Outperform rating. The firm says Applied Therapeutics is an \"under-the-radar company\" developing a \"nice mix\" of therapeutics targeting rare diseases and some larger indications with potential for several major value inflections over the next 12 months. Raymond James initiated coverage of Black Diamond Therapeutics(BDTX) with an Outperform rating and $20 price target. The firm sees the potential for BDTX-1535 to potently target a broad spectrum of Estimated Glomerular Filtration Rate mutations in non-small cell lung cancer that are inadequately addressed by current standard of care, including non-classical EGFR mutations, osimertinib resistance mutations, and the L855R classical mutation, the firm tells investors in a research note. Truist initiated coverage of Nurix Therapeutics(NRIX) with a Buy rating and $36 price target. The firm says the company's lead drug, NX-5948, has potential to be best-in-class Bruton's tyrosine kinase degrader and may be used in B-cell cancers, a multi-billion market.\n\nView comments",
        "link": "https://finance.yahoo.com/news/mcdonalds-downgraded-paypal-upgraded-wall-135119550.html",
        "symbols": [
            "0IFA.LSE",
            "0R3E.LSE",
            "2PP.F",
            "2PP.STU",
            "2PP.XETRA",
            "2PP0.F",
            "E1CL34.SA",
            "ECJ.BE",
            "ECJ.DU",
            "ECJ.F",
            "ECJ.MU",
            "ECJ.STU",
            "ECL.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.044,
            "neu": 0.84,
            "pos": 0.116
        }
    },
    {
        "date": "2024-07-31T12:00:33+00:00",
        "title": "Institutional investors have a lot riding on Lockheed Martin Corporation (NYSE:LMT) with 74% ownership",
        "content": "Key Insights\n\nSignificantly high institutional ownership implies Lockheed Martin's stock price is sensitive to their trading actions The top 7 shareholders own 50% of the company Insiders have been selling lately\n\nTo get a sense of who is truly in control of Lockheed Martin Corporation (NYSE:LMT), it is important to understand the ownership structure of the business. The group holding the most number of shares in the company, around 74% to be precise, is institutions. Put another way, the group faces the maximum upside potential (or downside risk).\n\nAnd as as result, institutional investors reaped the most rewards after the company's stock price gained 7.3% last week. One-year return to shareholders is currently 22% and last week’s gain was the icing on the cake.\n\nLet's delve deeper into each type of owner of Lockheed Martin, beginning with the chart below.\n\nCheck out our latest analysis for Lockheed Martin  ownership-breakdown\n\nWhat Does The Institutional Ownership Tell Us About Lockheed Martin?\n\nInstitutions typically measure themselves against a benchmark when reporting to their own investors, so they often become more enthusiastic about a stock once it's included in a major index. We would expect most companies to have some institutions on the register, especially if they are growing.\n\nAs you can see, institutional investors have a fair amount of stake in Lockheed Martin. This can indicate that the company has a certain degree of credibility in the investment community. However, it is best to be wary of relying on the supposed validation that comes with institutional investors. They too, get it wrong sometimes. If multiple institutions change their view on a stock at the same time, you could see the share price drop fast. It's therefore worth looking at Lockheed Martin's earnings history below. Of course, the future is what really matters. earnings-and-revenue-growth\n\nInvestors should note that institutions actually own more than half the company, so they can collectively wield significant power. We note that hedge funds don't have a meaningful investment in Lockheed Martin. Looking at our data, we can see that the largest shareholder is State Street Global Advisors, Inc. with 15% of shares outstanding. With 11% and 9.0% of the shares outstanding respectively, Lockheed Martin Corporation, ESOP and The Vanguard Group, Inc. are the second and third largest shareholders.\n\nWe also observed that the top 7 shareholders account for more than half of the share register, with a few smaller shareholders to balance the interests of the larger ones to a certain extent.\n\nStory continues\n\nResearching institutional ownership is a good way to gauge and filter a stock's expected performance. The same can be achieved by studying analyst sentiments. There are a reasonable number of analysts covering the stock, so it might be useful to find out their aggregate view on the future.\n\nInsider Ownership Of Lockheed Martin\n\nThe definition of company insiders can be subjective and does vary between jurisdictions. Our data reflects individual insiders, capturing board members at the very least. Management ultimately answers to the board. However, it is not uncommon for managers to be executive board members, especially if they are a founder or the CEO.\n\nInsider ownership is positive when it signals leadership are thinking like the true owners of the company. However, high insider ownership can also give immense power to a small group within the company. This can be negative in some circumstances.\n\nOur information suggests that Lockheed Martin Corporation insiders own under 1% of the company. Being so large, we would not expect insiders to own a large proportion of the stock. Collectively, they own US$70m of stock. It is always good to see at least some insider ownership, but it might be worth checking if those insiders have been selling.\n\nGeneral Public Ownership\n\nThe general public-- including retail investors -- own 15% stake in the company, and hence can't easily be ignored. While this size of ownership may not be enough to sway a policy decision in their favour, they can still make a collective impact on company policies.\n\nNext Steps:\n\nI find it very interesting to look at who exactly owns a company. But to truly gain insight, we need to consider other information, too. For example, we've discovered 2 warning signs for Lockheed Martin that you should be aware of before investing here.\n\nIf you are like me, you may want to think about whether this company will grow or shrink. Luckily, you can check this free report showing analyst forecasts for its future.\n\nNB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/institutional-investors-lot-riding-lockheed-120033300.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.018,
            "neu": 0.886,
            "pos": 0.096
        }
    },
    {
        "date": "2024-07-31T11:40:00+00:00",
        "title": "5 High ROE Stocks to Bet on as Markets Seek Rate Cut Clarity",
        "content": "The broader U.S. equity markets witnessed a modest uptrend over the past few trading days, buoyed by optimism related to rate cuts driven by easing inflationary pressures and solid economic metrics that portrayed the resilience of the economy. In addition, a relatively healthy earnings performance from hitherto reported companies ignited hopes of a possible rate cut as early as September.\r\n\r\nThe markets now await the Federal Reserve’s update on the monetary policy as it wraps up its policy meeting later today. Although the Fed is widely expected to keep the benchmark funds rate steady in the 5.25% to 5.5% range, investors are seeking cues for probable cuts in the near future. With a better-than-expected 2.8% annualized GDP growth in the second quarter and a robust labor market scenario, the conditions appear primed to heed the broader sentiments.\r\n\r\nAs investors employ a wait-and-see approach in a classic example of “backing and filling” in the market, they can benefit from “cash cow” stocks that garner higher returns. However, identifying cash-rich stocks alone does not make for a solid investment proposition unless it is backed by attractive efficiency ratios like return on equity (ROE). A high ROE ensures that the company is reinvesting cash at a high rate of return. Best Buy Co., Inc. BBY, The AES Corporation AES, Lockheed Martin Corporation LMT, PulteGroup, Inc. PHM and Banco de Chile BCH are some of the stocks with high ROE to profit from.\n\nWhy ROE?\n\nROE = Net Income/Shareholders’ Equity\r\n\r\nROE helps investors distinguish profit-generating companies from profit burners and is useful in determining the financial health of a company. In other words, this financial metric enables investors to identify companies that diligently deploy cash for higher returns.\r\n\r\nMoreover, ROE is often used to compare the profitability of a company with other firms in the industry — the higher, the better. It measures how well a company is multiplying its profits without investing new equity capital and portrays management’s efficiency in rewarding shareholders with attractive risk-adjusted returns.\n\nParameters Used for Screening\n\nIn order to shortlist stocks that are cash-rich with high ROE, we have added Cash Flow greater than $1 billion and ROE greater than X-Industry as our primary screening parameters. In addition, we have taken a few other criteria into consideration to arrive at a winning strategy.\r\n\r\nPrice/Cash Flow lesser than X-Industry: This metric measures how much investors pay for $1 of free cash flow. A lower ratio indicates that investors need to pay less for a better cash flow-generating stock.\r\n\r\nReturn on Assets (ROA) greater than X-Industry: This metric determines how much profit a company earns for every dollar of asset, which includes cash, accounts receivable, property, equipment, inventory and furniture. The higher the ROA, the better it is for the company.\r\n\r\n5-Year EPS Historical Growth greater than X-Industry: This criterion indicates that continued earnings momentum has translated into solid cash strength. \r\n\r\nZacks Rank less than or equal to 2: Zacks Rank #1 (Strong Buy) or 2 (Buy) stocks are known to outperform irrespective of the market environment.\r\n\r\nHere are five of the 14 stocks that qualified the screening:\r\n\r\nBest Buy: Headquartered in Richfield, MN, Best Buy is a multinational specialty retailer of consumer electronics, home office products, entertainment software, communication, food preparation, wellness, health, security, appliances and related services. The company retails technology products in the United States and Canada.\r\n\r\nIt has a long-term earnings growth expectation of 5.1% and delivered a trailing four-quarter earnings surprise of 11%, on average. It has a VGM Score of B. Best Buy carries a Zacks Rank #2. You can see the complete list of today’s Zacks #1 Rank stocks here. \r\n\r\nAES: Arlington, VA-based AES is a global power company. Its businesses are spread across four continents in 14 countries. The company has four Strategic Business Units located in the United States and other regions across the globe. AES remains one of the forerunners in the utility industry's transition to clean energy by investing in sustainable growth and innovative solutions while delivering superior results.\r\n\r\nIt delivered a trailing four-quarter earnings surprise of 13.8%, on average. AES carries a Zacks Rank #2. It has a VGM Score of A.\r\n\r\nLockheed Martin: Based in Bethesda, MD, Lockheed Martin is the largest defense contractor in the world. Its main areas of focus are defense, space, intelligence, homeland security and information technology, including cyber security. Lockheed Martin currently operates through four businesses — Aeronautics, Missiles and Fire Control, Rotary and Missions Systems and Space Systems. \r\n\r\nThe company has a long-term earnings growth expectation of 4.2% and delivered a trailing four-quarter earnings surprise of 7.5%, on average. Lockheed Martin carries a Zacks Rank #2.\r\n\r\nPulteGroup: Based in Atlanta, GA, PulteGroup engages in homebuilding and financial services businesses, primarily in the United States. The company conducts operations through two primary business segments – Homebuilding and Financial Services. The company engages in maintaining a 50/50 balance between build-to-order and spec sales, enabling it to meet immediate demand with spec homes while also accommodating buyers who prefer to customize their homes with build-to-order options.\r\n\r\nThe company has a long-term earnings growth expectation of 19% and delivered a trailing four-quarter earnings surprise of 10%, on average. It has a VGM Score of B. PulteGroup carries a Zacks Rank #2. \r\n\r\nBanco de Chile: Headquartered in Santiago, Chile, Banco de Chile provides various banking services to customers in the Latin American country. These include deposit accounts, loans, payment-related cards and insurance solutions. The company also offers services such as cash management, treasury, financial advisory, trade finance, leasing, factoring, payment, payroll, collection, mutual fund management, securities brokerage, currency trading, investment management, collection, securitization and capital markets services.\r\n\r\nIt delivered a trailing four-quarter earnings surprise of 7.1%, on average. Banco de Chile carries a Zacks Rank #2.\r\n\r\nYou can get the rest of the stocks on this list by signing up now for your 2-week free trial to the Research Wizard and start using this screen in your own trading. Further, you can also create your own strategies and test them first before taking the investment plunge. \r\n\r\nThe Research Wizard is a great place to begin. It's easy to use. Everything is in plain language. And it's very intuitive. Start your Research Wizard trial today. And the next time you read an economic report, open up the Research Wizard, plug your finds in, and see what gems come out.\r\n\r\nClick here to sign up for a free trial to the Research Wizard today.\r\n\r\nDisclosure: Officers, directors and/or employees of Zacks Investment Research may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material. An affiliated investment advisory firm may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material. \r\n\r\nDisclosure: Performance information for Zacks’ portfolios and strategies are available at: https://www.zacks.com/performance.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nBest Buy Co., Inc. (BBY) : Free Stock Analysis Report\n\nPulteGroup, Inc. (PHM) : Free Stock Analysis Report\n\nThe AES Corporation (AES) : Free Stock Analysis Report\n\nBanco De Chile (BCH) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/5-high-roe-stocks-bet-114000106.html",
        "symbols": [
            "0H6G.LSE",
            "0KS6.LSE",
            "0R18.LSE",
            "0R3E.LSE",
            "AES.BE",
            "AES.DU",
            "AES.F",
            "AES.MU",
            "AES.STU",
            "AES.US",
            "BBY.MX",
            "BBY.US",
            "BBYY34.SA",
            "BCH.US",
            "BUY.BE",
            "BUY.DU",
            "BUY.F",
            "BUY.STU",
            "CHILE.SN",
            "G4RA.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.016,
            "neu": 0.81,
            "pos": 0.175
        }
    }
]