[
    {
        "date": "2024-09-20T16:25:00+00:00",
        "title": "Boeing Secures an Order for F/A-18 E/F Jet's Windshield Spares",
        "content": "The Boeing Company BA recently secured a $29.5 million contract for the procurement of black III spare windshield panels for the F/A-18 E/F fighter jets. The award was offered by the Naval Supply Systems Command in Philadelphia, PA.\r\n \r\nThe work, which will be performed in St. Louis, MO, is expected to be finished by December 2029.\n\nSignificance of BA’s F/A-18 Jets\n\nBoeing engages in the research, development, production and modification of manned and unmanned military aircraft and weapons systems for strike, surveillance and mobility, including fighter and trainer aircraft, vertical lift, including rotorcraft and tilt-rotor aircraft, and commercial derivative aircraft, including anti-submarine and tanker aircraft.\r\n\r\nBoeing's F/A-18 Super Hornet is particularly noteworthy as it can perform nearly every mission within the tactical spectrum. These missions include air superiority, day/night precision strikes, fighter escorts, close air support, suppression of enemy air defenses, maritime strikes, reconnaissance, forward air control and tanker missions.\r\n\r\nThe latest model of this jet, Block III, currently being used by the U.S. military, is the most networked and survivable F/A-18 built. Boeing delivered the first of 78 contracted Block III F/A-18 Super Hornets to the U.S. Navy in August 2021.\n\nBA’s Growth Prospects\n\nAmid the volatile global landscape, the demand for military aircraft has been surging significantly. With more nations focusing on increasing their aerial supremacy, coupled with the emergence of modern-day jets that come with more sophisticated technologies like enhanced stealth, precision targeting and electronic warfare capabilities, the global fighter aircraft market’s growth opportunities remain immense.\r\n \r\nThis is likely to have led Mordor Intelligence to predict that the global fighter aircraft market will witness a CAGR of 3.7% during the 2024-2029 period.\r\n\r\nThese projections indicate significant growth opportunities for leading combat jet manufacturers like Boeing. The company’s military jet portfolio includes combat-proven aircraft, such as the F-15, P-8, T-7A Red Hawk, E/A-18G and C-17 Globemaster III, in addition to the F/A-18 jets.\n\nOpportunities for Boeing’s Peers\n\nLockheed Martin Corporation LMT: It is the producer of some of the most advanced military jets in the world. Its key jet programs include the F-35 Lightning II, F-22 Raptor, F-16 Fighting Falcon and C-130 Hercules.\r\n\r\nLockheed has a long-term (three to five years) earnings growth rate of 4.7%. The Zacks Consensus Estimate for 2024 sales indicates year-over-year growth of 5.3%.\r\n\r\nNorthrop Grumman Corporation NOC: It is a leading provider of proven manned and unmanned air systems. It builds some of the world’s most advanced aircraft like the B-2 Spirit Stealth Bomber, A-10 Thunderbolt II and B-21 Raider.\r\n\r\nNorthrop Grumman has a long-term earnings growth rate of 8.7%. The consensus estimate for 2024 sales indicates year-over-year growth of 5.4%.\r\n\r\nEmbraer ERJ: It is a prominent combat aircraft manufacturer. The company’s product portfolio includes the A-29 Super Tucano light attack and advanced trainer and the C-390 Millennium military multi-mission aircraft.\r\n\r\nThe Zacks Consensus Estimate for ERJ’s 2024 sales indicates year-over-year growth of 19.1%. The consensus estimate for 2024 earnings per share indicates year-over-year growth of 262.8%.\n\nStory continues\n\nBA Stock’s Price Performance\n\nIn the past three months, shares of Boeing have lost 12.4% against the industry’s 5% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nBA’s Zacks Rank\n\nBoeing currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nEmbraer-Empresa Brasileira de Aeronautica (ERJ) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/boeing-secures-order-f-18-162500907.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.049,
            "neu": 0.775,
            "pos": 0.175
        }
    },
    {
        "date": "2024-09-20T13:00:00+00:00",
        "title": "Lockheed Wins $297M Contract to Build GeoXO LMX Instruments",
        "content": "Lockheed Martin Corp. LMT recently announced that it clinched a contract worth $297 million from NASA to design and construct next-generation GeoXO Lightning Mapper (“LMX”) instruments. The instrument will be delivered to the National Oceanic and Atmospheric Administration (“NOAA”).\r\n\r\nPer the terms of the deal, Lockheed will build two LMX instruments, with options for two additional instruments. The work related to this contract will be carried out in Lockheed Martin’s facility in Sunnyvale, CA.\n\nA Brief Note on LMT’s GeoXO Lightning Mapper\n\nThe LMX is a single-channel, near-infrared optical instrument designed to detect, identify and quantify the intensity, duration and extent of lightning flashes in near-real time. The LMX instrument detects and monitors lightning strikes while aboard NOAA's next-generation GeoXO weather satellites. This new mapper will enhance storm research and forecast and assist in the discovery of tornado-producing storms for public safety.\r\n\r\nThe imagers aid in hurricane strength forecast, lightning hazard identification, wildfire ignition detection and aviation threat avoidance.\n\nWhat’s Favoring Lockheed?\n\nDiverse industries across the board are now utilizing GEO satellites in multiple applications, such as agriculture, transportation, disaster management and climate research, in addition to their traditional usage in defense and space industries, resulting in solid growth in demand for technologically advanced GEO satellites.\r\n\r\nThis must have prompted the Mordor Intelligence firm to expect the GEO Satellite market to witness a CAGR of 3.7% over the 2024-2029 period. Such a growth opportunity offered by the global GEO Satellite market should bode well for LMT.\r\n\r\nLockheed Martin works together with NASA, NOAA and other government organizations to provide cutting-edge satellite solutions for missions involving Earth observation. The company has built more than 120 weather and environmental spacecraft for the U.S. government over the past 50 years.\r\n\r\nAlong with the GeoXO Lightning Mapper, Lockheed Martin offers a broader variety of GEO satellites in its product line.  LMT’s GOES-R satellite series provides vital atmospheric, hydrologic, oceanic, climatic, solar and space data, improving the identification and monitoring of environmental events.\r\n\r\nGiven the growth of the GEO satellite market, LMT's recent contract win is indicative of the high demand the company enjoys in this industry and suggests that there may be more such order flows in the near future.\n\nProspects of LMT’s Peers\n\nThe growing GEO satellite market also provides growth opportunities to other aerospace players like Northrop Grumman Corp. NOC, The Boeing Company BA and Airbus Group EADSY, which hold a strong presence in this space.\r\n\r\nNorthrop Grumman's experience in satellite systems and payloads has helped build sophisticated weather monitoring capabilities. The company-built JPSS-2 satellite provides meteorological data and observations to enhance the prediction and preparation for extreme weather conditions and observe long-term climate trends.\r\n\r\nNorthrop Grumman boasts a long-term (three to five years) earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales implies an improvement of 5.4% from the prior-year reported figure.\r\n\r\nOver the years, Boeing has produced many noteworthy GEO (Geostationary Earth Orbit) satellite products that have served a variety of government, broadcasting and communication purposes. Its flagship model, 702 series GEO satellites, can operate in the geosynchronous, medium-Earth or low-Earth orbital planes.\r\n\r\nBoeing has a long-term earnings growth rate of 21.3%. The Zacks Consensus Estimate for 2025 sales indicates an improvement of 20.4% from the 2024 estimated figure.\r\n\r\nAirbus has delivered more than 110 geo satellites to more than 60 nations to date. Its MetOp-SG twins A and B satellites are designed to enhance environmental research, monitoring climate change and weather forecasting.\r\n\r\nAirbus’ long-term earnings growth rate is 11.4%. The Zacks Consensus Estimate for EADSY’s 2024 sales calls for an improvement of 5.4% from the prior-year reported figure.\n\nStory continues\n\nLMT Stock Price Movement\n\nIn the past three months, shares of Lockheed Martin have rallied 21.2% compared with the industry’s rise of 4.7%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLMT’s Zacks Rank\n\nLockheed Martin currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-wins-297m-contract-build-130000960.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0KVV.IL",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.02,
            "neu": 0.849,
            "pos": 0.132
        }
    },
    {
        "date": "2024-09-20T07:01:24+00:00",
        "title": "LightPath Technologies Inc (LPTH) Q4 2024 Earnings Call Transcript Highlights: Revenue Decline ...",
        "content": "Revenue: $8.6 million for Q4 2024, down from $9.7 million in Q4 2023. Infrared Component Sales: $3 million, 35% of consolidated revenue. Visible Component Sales: $3.2 million, 37% of consolidated revenue. Assemblies and Modules Revenue: $1.4 million, 16% of consolidated revenue. Engineering Services Revenue: $1 million, 12% of consolidated revenue. Gross Margin: $2.5 million, 29% of revenue, down from 32% in Q4 2023. SG&A Costs: $3.6 million, up 20% from Q4 2023. Net Loss: $2.4 million, $0.06 per share, compared to $2.8 million, $0.02 per share in Q4 2023. EBITDA: Loss of $1.3 million, compared to an income of $0.1 million in Q4 2023. Full-Year Revenue: $31.7 million, down from $32.9 million in fiscal 2023. Full-Year Infrared Component Sales: $14.1 million, 44% of consolidated revenue. Full-Year Visible Component Sales: $11.2 million, 35% of consolidated revenue. Full-Year Assemblies and Solutions Revenue: $4.5 million, 14% of consolidated revenue. Full-Year Engineering Services Revenue: $2 million, 6% of consolidated revenue. Full-Year SG&A Costs: $12.3 million, up 8% from fiscal 2023. Full-Year Net Loss: $8 million, $0.21 per share, compared to $4 million, $0.13 per share in fiscal 2023. Full-Year EBITDA: Loss of $3.7 million, compared to $0.4 million in fiscal 2023. Cash and Cash Equivalents: $3.5 million as of June 30, 2024. Working Capital: $7.5 million as of June 30, 2024. Cash Flow from Operations: $0.5 million for fiscal 2024, compared to -$2.8 million in fiscal 2023. Capital Expenditures: $2.2 million for fiscal 2024, compared to $3.1 million in fiscal 2023. Backlog: $19.3 million as of June 30, 2024, down 11% from $21.7 million as of June 30, 2023.\n\nWarning! GuruFocus has detected 4 Warning Signs with LPTH.\n\nRelease Date: September 19, 2024\n\nFor the complete transcript of the earnings call, please refer to the full earnings call transcript.\n\nPositive Points\n\nSuccessful transformation from a component supplier to a systems provider, with 20% of revenue now coming from new product lines. Significant growth in the infrared components business, now accounting for 44% of overall revenue. Exclusive partnerships and licenses, including a significant contract with the Department of Defense and an exclusive license from the government for new materials. Strong entry into the thermal camera market, with innovative products like the Mantis camera generating significant interest. Potentially transformative contracts, such as the Lockheed Martin missile program, which could bring in $50 million to $100 million annually once in full production.\n\nStory continues\n\nNegative Points\n\nOverall revenue decreased to $31.7 million from $32.9 million in the prior fiscal year. Gross margin decreased to 29% from 32% in the same quarter of the prior fiscal year. Net loss for fiscal 2024 increased to $8 million from $4 million in fiscal 2023. Significant decrease in sales of infrared components due to the non-renewal of a large annual contract for Germanium-based products. Increased SG&A costs, primarily due to non-recurring executive severance costs and legal fees, impacting overall profitability.\n\nQ & A Highlights\n\nQ: Based on your backlog and pipeline, how should we think about fiscal 2025 in terms of revenue? Do you expect double-digit growth? A: We expect low-end double-digit growth for the next fiscal year. The largest customer has not yet started volume delivery of BlackDiamond optics but is still in the evaluation stage.\n\nQ: Have you received feedback on Lockheed's standing in the missile system competition with Raytheon? When do you expect an award? A: The down select has already happened, and both Lockheed and Raytheon are fully funded to deliver ready products. We expect a decision by September or November 2025.\n\nQ: Can you provide more details on the second opportunity for an airborne system? When will production begin? A: We are the sole source for the prime building the system for Apache helicopters. We expect to deliver the first three prototypes by the end of this calendar year or early next year. If successful, we will move to low-rate initial production (LRIP) immediately.\n\nQ: What is the status of the new Mantis Cameras for greenhouse gas emissions? Are they available for sale? A: We have already shipped orders for the new Mantis Cameras. We estimate the addressable market to be in the range of 100 to 200 units per year, priced up to $30,000 per unit.\n\nQ: How should we think about SG&A costs going forward? A: We have reduced structural costs by $1.2 million, but we will reinvest these savings into business development initiatives, including sales, marketing, and product development.\n\nQ: Has the timetable for the automotive opportunity changed? A: Yes, the timeline has shifted. We expect lower volumes in the next two years, with significant volume shipments beginning to ramp up in fiscal 2027.\n\nQ: How quickly can you move to production if Lockheed wins the missile program? A: We could start shipping within about three months after the decision is made. We are setting up the infrastructure for production in Orlando next calendar year.\n\nQ: What are the gross margin dynamics for assemblies and engineering services? A: Margins for assemblies and modules are higher, typically north of 40%.\n\nQ: What is the cash requirement to run the business? A: We project being operating cash flow positive. Additional cash needs will be for CapEx and business development initiatives.\n\nQ: Is there any expense related to setting up for LRIP with Lockheed? A: The infrastructure and layout are already in place. Specific capital equipment needed will be paid by the customer.\n\nQ: How is the AI technology being integrated into your cameras? A: We started focusing on infrared cameras but are now also considering visible cameras. We are working with partners to make AI modules compatible with our cameras, enabling easier implementation for customers.\n\nFor the complete transcript of the earnings call, please refer to the full earnings call transcript.\n\nThis article first appeared on GuruFocus.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lightpath-technologies-inc-lpth-q4-070124155.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.025,
            "neu": 0.888,
            "pos": 0.088
        }
    }
]