[
    {
        "date": "2024-08-27T21:50:04+00:00",
        "title": "Lockheed Martin (LMT) Surpasses Market Returns: Some Facts Worth Knowing",
        "content": "Lockheed Martin (LMT) closed at $560.41 in the latest trading session, marking a +0.41% move from the prior day. This move outpaced the S&P 500's daily gain of 0.16%. Meanwhile, the Dow experienced a rise of 0.02%, and the technology-dominated Nasdaq saw an increase of 0.16%.\n\nThe aerospace and defense company's stock has climbed by 5.77% in the past month, exceeding the Aerospace sector's gain of 2.37% and the S&P 500's gain of 2.97%.\n\nAnalysts and investors alike will be keeping a close eye on the performance of Lockheed Martin in its upcoming earnings disclosure. The company is predicted to post an EPS of $6.40, indicating a 5.47% decline compared to the equivalent quarter last year. Meanwhile, the latest consensus estimate predicts the revenue to be $17.45 billion, indicating a 3.37% increase compared to the same quarter of the previous year.\n\nFor the entire fiscal year, the Zacks Consensus Estimates are projecting earnings of $26.49 per share and a revenue of $71.14 billion, representing changes of -4.78% and +5.28%, respectively, from the prior year.\n\nFurthermore, it would be beneficial for investors to monitor any recent shifts in analyst projections for Lockheed Martin. Recent revisions tend to reflect the latest near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.\n\nResearch indicates that these estimate revisions are directly correlated with near-term share price momentum. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.\n\nThe Zacks Rank system, ranging from #1 (Strong Buy) to #5 (Strong Sell), possesses a remarkable history of outdoing, externally audited, with #1 stocks returning an average annual gain of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.31% lower within the past month. Lockheed Martin is holding a Zacks Rank of #3 (Hold) right now.\n\nDigging into valuation, Lockheed Martin currently has a Forward P/E ratio of 21.07. For comparison, its industry has an average Forward P/E of 20.4, which means Lockheed Martin is trading at a premium to the group.\n\nIt's also important to note that LMT currently trades at a PEG ratio of 4.51. The PEG ratio is akin to the commonly utilized P/E ratio, but this measure also incorporates the company's anticipated earnings growth rate. The Aerospace - Defense industry had an average PEG ratio of 1.87 as trading concluded yesterday.\n\nThe Aerospace - Defense industry is part of the Aerospace sector. This industry, currently bearing a Zacks Industry Rank of 52, finds itself in the top 21% echelons of all 250+ industries.\n\nStory continues\n\nThe strength of our individual industry groups is measured by the Zacks Industry Rank, which is calculated based on the average Zacks Rank of the individual stocks within these groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nKeep in mind to rely on Zacks.com to watch all these stock-impacting metrics, and more, in the succeeding trading sessions.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-surpasses-market-215004017.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.003,
            "neu": 0.889,
            "pos": 0.108
        }
    },
    {
        "date": "2024-08-27T11:15:00+00:00",
        "title": "Better Buy: GE Aerospace vs. Lockheed Martin",
        "content": "Comparing commercial aerospace giant GE Aerospace(NYSE: GE) with leading defense contractor Lockheed Martin(NYSE: LMT) is always interesting because it requires taking a big-picture view. This isn't about one quarter's earnings or even a year's worth; it concerns a long-term view of how each company makes money. So let's dive in and see what we can find out.\n\nThe better stock\n\nSpoiler alert: GE Aerospace, which makes aircraft engines, is the better stock. While not everyone will agree with that conclusion, the debate will shed some light on the long-term investment cases for each stock.\n\nGE Aerospace operates in the commercial aviation industry, an indispensable part of the global economy. While airlines haven't always been such great investments, and the industry has suffered periodic cyclical highs and lows, airlines have traditionally not had an issue raising debt (not least because debts are securitized with valuable assets, the planes themselves).\n\nPlus, there's no way to avoid air travel if you want to travel quickly over large distances.\n\nGE Aerospace's market position\n\nAs such, GE Aerospace operates in an industry with only two truly global airplane manufacturers, Boeing and Airbus. That means it has a high level of certainty over its developmental programs. At the same time, there are numerous end-market customers, including the airlines themselves. As noted above, even if some airlines fail, there are usually others coming along backed up by bondholders.\n\nWith engines on both major narrowbody airplanes -- the Boeing 737 MAX and the Airbus A320 neo family (RTX also offers an engine on these planes) -- GE Aerospace is ideally placed to generate lucrative aftermarket revenue from its installed base of engines for many decades to come.\n\nAircraft engines can last for over 40 years and generate parts and services revenue over that cycle as they are overhauled and repaired. This adds up to a highly favorable set of end market conditions, where GE Aerospace has a high degree of certainty over the development of its engines (mainly sold into Boeing and Airbus programs) and a high degree of certainty of its end market due to its ability to diversify and reduce risk by selling engines to many different airlines.\n\nLockheed Martin: This time, it's not the same\n\nFor investors who don't believe in coincidences, there's much to consider regarding major defense contractors. Boeing's defense business keeps generating losses, notably on fixed-price development programs. Meanwhile, RTX's defense business also keeps struggling with profit margins and recently took a charge on the termination of a fixed-price development program in its defense business. RTX also reduced its overall free-cash-flow guidance in 2024 due to the issue.\n\nStory continues\n\nThe bulls' case for Lockheed Martin\n\nTurning back to Lockheed Martin, the defense contractor has also had margin issues in recent years. Management believes that 2024 will be a low-water mark for margins, and according to CFO Jesus Malave on the last earnings call, the company expects margins \"to improve gradually over the next few years.\"\n\nRecent struggles with defense company margins challenge the investment narrative around defense stocks. Investors like defense stocks because they are seen as being in a relatively stable industry with solid growth prospects and low-end market risk since their customers are sovereign governments. Image source: Getty Images.\n\nDefense company bulls will argue that the recent margin pressures focus on fixed-price development programs procured in less inflationary times. Moreover, defense companies have been uniquely hit with supply chain issues, raw material price increases, and product availability issues (for example, rocket motors or titanium castings).\n\nThe bulls argue that margins will improve once these issues abate and Lockheed Martin and others work through the fixed-price programs.\n\nThe bears' case for Lockheed Martin\n\nThe other side of the argument notes that margin deterioration appeared to be in place before anyone had heard of the pandemic. Moreover, many other industrial companies have overcome supply chain difficulties and raw material prices, but the defense industry is finding it a lot harder to do -- suggesting this may be a structural, rather than temporary, issue. LMT Gross Profit Margin Chart\n\nMoreover, with seemingly ever-rising levels of sovereign government indebtedness, there's a tangible movement toward forcing fixed-price programs on defense contractors. That's a real concern as it suggests the industry needs to prepare itself for structurally lower margins over the long term.\n\nGE Aerospace vs. Lockheed Martin\n\nAll told, investors have cause for concern until the question of structural profit margins is resolved in the defense industry. Despite the cyclical risk in the commercial aerospace industry, GE Aerospace is the better buy as its long-term earnings growth trajectory looks more secure.\n\nShould you invest $1,000 in GE Aerospace right now?\n\nBefore you buy stock in GE Aerospace, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and GE Aerospace wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $792,725!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of August 26, 2024\n\nLee Samaha has no position in any of the stocks mentioned. The Motley Fool recommends Lockheed Martin and RTX. The Motley Fool has a disclosure policy.\n\nBetter Buy: GE Aerospace vs. Lockheed Martin was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/better-buy-ge-aerospace-vs-111500907.html",
        "symbols": [
            "GE.US",
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.983,
            "neg": 0.056,
            "neu": 0.841,
            "pos": 0.103
        }
    }
]