[
    {
        "date": "2024-07-22T20:26:58+00:00",
        "title": "US stock futures dip after tech rebound; Alphabet, Tesla earnings loom",
        "content": "Investing.com-- U.S. stock index futures fell slightly in evening deals on Monday, steadying after a sharp rebound on Wall Street as investors returned to technology stocks ahead of key earnings from the sector.\n\nWall Street indexes were still trading well below record highs hit last week, as a mix of profit-taking and rotation into more economically-sensitive sectors battered tech in recent sessions.\n\nThe second quarter earnings season is now widely expected to dictate tech’s trajectory in the coming weeks.\n\nS&P 500 Futures fell 0.1% to 5,605.50 points, while Nasdaq 100 Futures fell 0.2% to 19,955.75 points by 19:51 ET (23:51 GMT). Dow Jones Futures were flat at 40,680.0 points.\n\nAlphabet, Tesla set to report Q2 earnings\n\nFocus was now squarely on upcoming earnings prints from tech majors Alphabet Inc (NASDAQ:GOOGL) and Tesla Inc (NASDAQ:TSLA), due on Tuesday.\n\nAlphabet is set to offer more cues on how Wall Street’s internet giants are benefiting from artificial intelligence, as well as how much they are spending on developing the new technology.\n\nTesla’s earnings are set to show how the electric vehicle maker is navigating a sharp decrease in demand, while focus will also be on its promises of AI-driven autonomous driving and robotaxis.\n\nBeyond the two tech giants, a slew of other Wall Street majors are set to report on Tuesday, including Visa Inc (NYSE:V), Coca-Cola Co (NYSE:KO), Texas Instruments Incorporated (NASDAQ:TXN), Lockheed Martin Corporation (NYSE:LMT), General Electric Company (NYSE:GE), United Parcel Service Inc (NYSE:UPS) and Freeport-McMoran Copper&Gold Inc (NYSE:FCX).\n\nWall St benefits from tech rebound, but uncertainties persist\n\nA large rotation back into technology stocks saw Wall Street rebound on Monday, although benchmark indexes still remained well below recent peaks.\n\nThe S&P 500 jumped 1.1% to 5,564.41 points, while the NASDAQ Composite surged 1.6% to 18,007.57 points. The Dow Jones Industrial Average rose 0.3% to 40,415.44 points.\n\nGrowing optimism that the Federal Reserve will cut interest rates in September saw investors pivot into sectors more likely to benefit from an economic recovery.\n\nBut uncertainty over the U.S. political outlook increased after President Joe Biden said he will not seek reelection, instead endorsing Vice President Kamala Harris as the Democratic presidential nominee.\n\nRecent polls showed Republican nominee Donald Trump was polling ahead of Biden and Harris, although it was unclear whether Harris’ nomination will shift this trend.\n\nSpeculation over a Trump presidency also drove flows into economically sensitive sectors.\n\nStory continues\n\nRelated Articles\n\nUS stock futures dip after tech rebound; Alphabet, Tesla earnings loom\n\nUS congressional panel calls on CrowdStrike CEO to testify on outage\n\nPorsche lowers 2024 outlook, warns of impairments on alloy shortage",
        "link": "https://finance.yahoo.com/news/us-stock-futures-dip-tech-202658300.html",
        "symbols": [
            "0RIH.IL",
            "1GOOG.MI",
            "1GOOGL.MI",
            "1TSLA.MI",
            "ABE0.F",
            "ABEA.F",
            "ABEA.XETRA",
            "ABEC.F",
            "ABEC.STU",
            "ABEC.XETRA",
            "FCX.US",
            "GE.US",
            "GOGL34.SA",
            "GOGL35.SA",
            "GOOG.MX",
            "GOOG.NEO",
            "GOOG.US",
            "GOOGL.BA",
            "GOOGL.MX",
            "GOOGL.SN"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.886,
            "neg": 0.046,
            "neu": 0.886,
            "pos": 0.068
        }
    },
    {
        "date": "2024-07-22T14:01:04+00:00",
        "title": "Investing in Lockheed Martin (NYSE:LMT) three years ago would have delivered you a 40% gain",
        "content": "By buying an index fund, investors can approximate the average market return. But if you choose individual stocks with prowess, you can make superior returns. For example, Lockheed Martin Corporation (NYSE:LMT) shareholders have seen the share price rise 29% over three years, well in excess of the market return (14%, not including dividends). On the other hand, the returns haven't been quite so good recently, with shareholders up just 6.9%, including dividends.\n\nSo let's assess the underlying fundamentals over the last 3 years and see if they've moved in lock-step with shareholder returns.\n\nCheck out our latest analysis for Lockheed Martin\n\nTo paraphrase Benjamin Graham: Over the short term the market is a voting machine, but over the long term it's a weighing machine. One flawed but reasonable way to assess how sentiment around a company has changed is to compare the earnings per share (EPS) with the share price.\n\nLockheed Martin was able to grow its EPS at 4.0% per year over three years, sending the share price higher. This EPS growth is lower than the 9% average annual increase in the share price. This indicates that the market is feeling more optimistic on the stock, after the last few years of progress. It's not unusual to see the market 're-rate' a stock, after a few years of growth.\n\nYou can see how EPS has changed over time in the image below (click on the chart to see the exact values). earnings-per-share-growth\n\nWe know that Lockheed Martin has improved its bottom line lately, but is it going to grow revenue? You could check out this freereport showing analyst revenue forecasts.\n\nWhat About Dividends?\n\nIt is important to consider the total shareholder return, as well as the share price return, for any given stock. The TSR is a return calculation that accounts for the value of cash dividends (assuming that any dividend received was reinvested) and the calculated value of any discounted capital raisings and spin-offs. Arguably, the TSR gives a more comprehensive picture of the return generated by a stock. In the case of Lockheed Martin, it has a TSR of 40% for the last 3 years. That exceeds its share price return that we previously mentioned. And there's no prize for guessing that the dividend payments largely explain the divergence!\n\nA Different Perspective\n\nLockheed Martin provided a TSR of 6.9% over the last twelve months. But that was short of the market average. If we look back over five years, the returns are even better, coming in at 8% per year for five years. It's quite possible the business continues to execute with prowess, even as the share price gains are slowing. It's always interesting to track share price performance over the longer term. But to understand Lockheed Martin better, we need to consider many other factors. To that end, you should be aware of the  1 warning sign  we've spotted with Lockheed Martin .\n\nStory continues\n\nWe will like Lockheed Martin better if we see some big insider buys. While we wait, check out this freelist of undervalued stocks (mostly small caps) with considerable, recent, insider buying.\n\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com",
        "link": "https://finance.yahoo.com/news/investing-lockheed-martin-nyse-lmt-140104318.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.026,
            "neu": 0.837,
            "pos": 0.137
        }
    },
    {
        "date": "2024-07-22T12:02:34+00:00",
        "title": "Market Chatter: Lockheed Martin Upgrade to F-35 Jet Allows US to Resume Accepting Deliveries",
        "content": "Market Chatter: Lockheed Martin Upgrade to F-35 Jet Allows US to Resume Accepting Deliveries",
        "link": "https://finance.yahoo.com/news/market-chatter-lockheed-martin-upgrade-120234762.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.382,
            "neg": 0,
            "neu": 0.833,
            "pos": 0.167
        }
    },
    {
        "date": "2024-07-22T11:00:00+00:00",
        "title": "Worldwide C-130J Super Hercules Fleet Soars Past 3 Million Flight Hours",
        "content": "FARNBOROUGH, England, July 22, 2024 /PRNewswire/ -- Lockheed Martin (NYSE: LMT) announced today at the Farnborough International Airshow that the worldwide C-130J Super Hercules fleet recently surpassed 3 million flight hours. With 545+ Super Hercules delivered worldwide, this achievement reflects the C-130J's unmatched global reach, multi-mission versatility and proven tactical performance capabilities. Lockheed Martin announced today at Farnborough International Airshow that the global C-130J Super Hercules fleet has surpassed 3 million flight hours. (Photo by Thinh D. Nguyen)\n\nOperators and crews from 21 nations contributed to this achievement, logging hours through 18 different mission requirements including combat, transport, aerial refueling, Special Operations, medevac, humanitarian relief, search and rescue, weather reconnaissance, firefighting and commercial freight delivery.\n\n\"From the highest landing strip in the world to the snow-packed runways of Antarctica and all the many mission locations in between, these 3 million hours represent the proven power and wide-reaching presence of the C-130J's global fleet,\" said Rod McLean, vice president and general manager of Lockheed Martin's Air Mobility & Maritime Missions line of business. \"In celebrating this achievement, we also honor the many crew members, maintainers and airlift partners who truly keep the global Super Hercules fleet ready for any and every mission requirement.\"\n\n3 million hours by the numbers\n\nThese hours were logged beginning with the C-130J's first flight on April 5, 1996, through the beginning of July 2024. Countries with C-130Js contributing to these flight hours include (in order of delivery) the United Kingdom, United States (the U.S. Air Force, Marine Corps and Coast Guard; Pallas Aviation), Australia, Italy, Denmark, Norway, Canada, India, Qatar, Iraq, Oman, Tunisia, Israel, Kuwait, South Korea, Kingdom of Saudi Arabia, France, Bahrain, Bangladesh, Indonesia and Germany. Also contributing to these flight hours is the Lockheed Martin Flight Operations team, whose crews are the first to fly every C-130J produced, and the U.S. Air Force Defense Contract Management Agency crews that support C-130J test flights at Lockheed Martin's Aeronautics site in Marietta, Georgia, home of Super Hercules production line. Super Hercules variants used to log these hours include: C-130J and C-130J-30 (tactical airlifter), KC-130J (tanker), WC-130J (weather reconnaissance), EC-130J (information operations), MC-130J (Special Operations), HC-130J (search and rescue, U.S. Air Force and U.S. Coast Guard variants), AC-130J (gunship) and LM-100J (commercial freighter). Hours flown include test, training and operational missions on all seven continents.\n\nStory continues\n\nAlways evolving, continually innovating and ready for what's next, the Super Hercules leads the charge by setting standards and shaping the future of tactical airlift missions, offering a multitude of advantages found in no other medium-sized tactical airlifter in production or operation today.\n\nThese discriminators include proven operational readiness with the greatest ease of transition, increased reliability, superior tactical airlift and combat airdrop capabilities, certification by more than 20 airworthiness authorities, and engine-out performance with extended range. The C-130J also delivers unmatched interoperability with NATO and global air forces, robust industrial partnerships and verified low life-cycle costs with significant fuel savings resulting in a reduced carbon footprint compared to other medium-sized jet airlifters.\n\nSee how and why the C-130J continues to be the worldwide choice in tactical airlift through the newest episode of \"Into the Cockpit\" on Lockheed Martin's YouTube channel, which offers exclusive behind-the-scenes access to the Super Hercules.\n\nAbout Lockheed Martin \r\nLockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at Lockheedmartin.com. (PRNewsfoto/Lockheed Martin Aeronautics) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/worldwide-c-130j-super-hercules-fleet-soars-past-3-million-flight-hours-302202198.html\n\nSOURCE Lockheed Martin Aeronautics",
        "link": "https://finance.yahoo.com/news/worldwide-c-130j-super-hercules-110000882.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.018,
            "neu": 0.819,
            "pos": 0.164
        }
    },
    {
        "date": "2024-07-22T07:03:02+00:00",
        "title": "Lockheed Martin (LMT) Reports Earnings Tomorrow: What To Expect",
        "content": "Lockheed Martin (LMT) Reports Earnings Tomorrow: What To Expect\n\nSecurity and Aerospace company Lockheed Martin (NYSE:LMT) will be reporting earnings tomorrow before market open. Here's what you need to know.\n\nLockheed Martin beat analysts' revenue expectations by 7.5% last quarter, reporting revenues of $17.2 billion, up 13.7% year on year. It was a stunning quarter for the company, with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates.\n\nIs Lockheed Martin a buy or sell going into earnings? Read our full analysis here, it's free.\n\nThis quarter, analysts are expecting Lockheed Martin's revenue to grow 1.9% year on year to $17.01 billion, slowing from the 8.1% increase it recorded in the same quarter last year. Adjusted earnings are expected to come in at $6.45 per share. Lockheed Martin Total Revenue\n\nThe majority of analysts covering the company have reconfirmed their estimates over the last 30 days, suggesting they anticipate the business to stay the course heading into earnings. Lockheed Martin has missed Wall Street's revenue estimates twice over the last two years.\n\nLooking at Lockheed Martin's peers in the aerospace and defense segment, some have already reported their Q2 results, giving us a hint as to what we can expect. Hexcel delivered year-on-year revenue growth of 10.1%, beating analysts' expectations by 3%, and AAR reported revenues up 18.7%, in line with consensus estimates. Hexcel traded down 7.5% following the results while AAR was also down 12.1%.\n\nRead our full analysis of Hexcel's results here and AAR's results here.\n\nThere has been positive sentiment among investors in the aerospace and defense segment, with share prices up 4.5% on average over the last month. Lockheed Martin's stock price was unchanged during the same time and is heading into earnings with an average analyst price target of $492.4 (compared to the current share price of $474.0).\n\nWhen a company has more cash than it knows what to do with, buying back its own shares can make a lot of sense–as long as the price is right. Luckily, we’ve found one, a low-priced stock that is gushing free cash flow AND buying back shares. Click here to claim your Special Free Report on a fallen angel growth story that is already recovering from a setback.",
        "link": "https://finance.yahoo.com/news/lockheed-martin-lmt-reports-earnings-070302001.html",
        "symbols": [
            "0R3E.LSE",
            "HXL.F",
            "HXL.STU",
            "HXL.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.99,
            "neg": 0.019,
            "neu": 0.853,
            "pos": 0.128
        }
    }
]