[
    {
        "date": "2024-09-12T12:11:00+00:00",
        "title": "RTX Wins a $1.2B Deal for AMRAAM Production &amp; Associated Spare Parts",
        "content": "RTX Corp. RTX recently clinched a contract for manufacturing the 38th lot of its Advanced Medium Range Air-to-Air Missile (“AMRAAM”). The award has been provided by the Air Force Life Cycle Management Center, Air Dominance Division Contracting Office, Eglin Air Force Base, FL.\n\nDetails of the Deal\n\nValued at $1.20 billion, the contract is projected to be completed by Dec. 31, 2028. Per the terms of the deal, in addition to AMRAAM production, RTX will also provide AMRAAM telemetry system, initial and field spares, and other production engineering support hardware and activities.\n\nWork related to this deal will be carried out in Tucson, AZ. The contract will serve Bahrain, Bulgaria, Canada, Finland, Germany, Hungary, Italy, Japan, Norway, Switzerland, Ukraine and the United Kingdom.\n\nWhat’s Favoring the RTX Stock?\n\nEscalating geopolitical tensions around the globe have driven nations to significantly bolster their defense systems. With rapid technological advancements, missile defense has become a crucial element of national defense strategies. As the world’s largest weapon supplier, the United States, along with RTX, a leading U.S. missile manufacturer, is well-positioned to benefit from the increased adoption of missile defense systems. The recent contract win serves as a strong example of that.\n\nNotably, RTX’s AMRAAM, a versatile and combat-tested air dominance missile, is currently deployed by 37 nations. It has been integrated into renowned fighter jets like Boeing’s F-15 and F/A-18, as well as Lockheed Martin’s F-22 Raptor and F-35 Lightning.\n\nWith advanced weaponry like AMRAAM in its portfolio, RTX continues to experience high demand in the defense sector. The recent contract win is a testament to this and is expected to boost the company’s revenues in the coming quarters.\n\nWhat Lies Ahead for RTX Stock?\n\nThe global peace index reflects an unstable environment worldwide, with the Russia-Ukraine war continuing for more than two years now, in addition to the ongoing hostility in different parts of the Middle East. This has set the stage for the defense sector to witness rising demand for military products, particularly missiles, as nations worldwide strive to protect their borders from unprecedented attacks.\n\nTherefore, the growth prospect for the global missile and missile defense systems market remains solid. The Mordor Intelligence firm projects the aforementioned market to witness a CAGR of 5% over the 2024-2029 period.\n\nSuch massive growth projections indicate solid opportunities for RTX, which has a handful of combat-proven missiles in its product portfolio, like TOW missile, Guidance Enhanced Missile (GEM-T), the National Advanced Surface-to-Air Missile System (NASAMS), Tomahawk, Standard Missile 2 (SM-2) and a few more, in addition to the AMRAAM.\n\nStory continues\n\nProspects for RTX’s Peers\n\nConsidering the solid growth opportunities offered by the global missile and missile defense market, other major defense primes like Northrop Grumman NOC, Lockheed Martin LMT and The Boeing Company BA that specialize in developing technologically advanced missiles should also benefit.\n\nNorthrop Grumman’s missile defense program includes AGM-88E advanced anti-radiation guided missiles, the Ground Based Strategic Deterrent weapon system and rocket propulsion systems. In August 2022, the company had been chosen by the U.S. Missile Defense Agency to lead the Homeland Missile Defense Program.\n\nNOC boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for 2024 sales implies an improvement of 5.4% from the 2023 reported figure.\n\nLockheed Martin’s missile defense program includes the Patriot Advanced Capability-3 (PAC-3) and Terminal High-Altitude Area Defense air and missile defense programs. It also manufactures the Multiple Launch Rocket System, the Joint Air-to-Surface Standoff Missile and Javelin tactical missile programs alongside other tactical missiles.\n\nThe stock has a long-term earnings growth rate of 4.7%. The Zacks Consensus Estimate for its 2024 sales implies an improvement of 5.3% from the 2023 reported figure.\n\nFor almost 25 years, Boeing-built and supported air and missile defense systems have protected nations, warfighters, allies and international partners against threats ranging from intercontinental ballistic missiles to hostile aircraft. BA’s missile and missile portfolio includes Aegis Ballistic Missile Defense, Avenger, Ground-Based Midcourse Defense and PAC-3 Missile Seeker.\n\nThe Zacks Consensus Estimate for Boeing’s third-quarter 2024 sales indicates an improvement of 10.8% from the prior-year quarter’s reported figure. The stock has a long-term earnings growth rate of 21.3%.\n\nPrice Performance\n\nIn the past year, RTX’s shares have rallied 57.8% compared to the industry’s 5.6% rise. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nRTX currently carries a Zacks Rank #3 (Hold).  You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-wins-1-2b-deal-121100023.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.036,
            "neu": 0.777,
            "pos": 0.187
        }
    }
]