[
    {
        "date": "2024-06-19T11:49:00+00:00",
        "title": "Lockheed (LMT) Wins Contract to Support F-35 Fighter Jet Program",
        "content": "Lockheed Martin Corp.’s LMT business unit, Aeronautics, recently clinched a modification contract involving its F-35 fighter jet program. The award has been offered by the Naval Air Systems Command, Patuxent River, MD.\n\nDetails of the Deal\n\nValued at $63.5 million, the contract is expected to be completed by August 2024. The latest modification should enable Lockheed to extend services involving continued infrastructure support for F-35 Joint Strike Fighter (JSF) laboratory facilities and F-35 developmental flight test activities. This infrastructure support includes engineering, maintenance, logistics, manpower and material aid.\n\nThe contract will serve the U.S. Navy, Air Force, Marine Corps, and F-35 cooperative program partners. Majority of the work related to this deal will be executed in Fort Worth, TX.\n\nWhat’s Favoring Lockheed?\n\nNations across the globe are reinforcing their military capabilities to strengthen their defense structure in the growing threat environment worldwide. In this context, military aircraft that play a critical role in military missions have also been witnessing a significant rise in demand. This, in turn, has been ushering in solid order flows for major combat aircraft manufacturers like Lockheed.\n\nNotably, Lockheed’s F-35 program is the most lethal fighter jet in the world and delivers unrivaled advantage to its customers. Equipped with advanced sensors and communications suites, it can serve across every domain, including air, land, sea, space and cyber.\n\nSuch remarkable features must have been boosting the demand for this jet, which in turn has enabled Lockheed to deliver 992 F-35 airplanes to date, with 373 jets in the backlog as of Mar 31, 2024.  The latest contract win is another testament to the solid demand that the F-35 jets enjoy in the combat jet market.\r\n\r\nSuch contract wins tend to boost the company’s operating results from the Aeronautics segment, which registered a 9% year-over-year top-line improvement in the last reported quarter, with F-35 program being one of the primary growth catalysts.\n\nGrowth Prospects\n\nAmid the geopolitical tensions prevalent across the globe, nations are rapidly augmenting defense purchases to strengthen their warfare capabilities. This has led to an increased demand for fighter jets, which form an integral part of a country’s defense products. Per a report by the Mordor Intelligence firm, the global military aviation market is estimated to witness a CAGR of 5.2% during 2024-2030.\n\nSuch projections indicate immense growth opportunities for prominent combat jet manufacturers like Lockheed. Its Aeronautics segment is engaged in the research, design, development, manufacture, integration, sustainment, support and upgrade of advanced military aircraft, including combat and air mobility aircraft, unmanned air vehicles and related technologies. The company’s fighter jet portfolio includes C-130 Super Hercules, F-16 Fighting Falcon jet and F-16 Fighting Falcon, in addition to F-35 jets.\n\nStory continues\n\nPeer Opportunities\n\nLMT apart, a few other defense players that can gain from the expanding military aviation market are Airbus SE EADSY, Boeing BA and Northrop Grumman NOC.\n\nAirbus’ military aircraft consists of A400M, C295 tactical transporter, the new-generation A330 Multi Role Tanker Transport and Eurofighter, the most advanced swing-role fighter ever conceived. The company delivered a total of 1,783 military aircraft as of Dec 31, 2023.\n\nEADSY boasts a long-term (three-to-five years) earnings growth rate of 17.9%. The Zacks Consensus Estimate for Airbus’ 2024 sales indicates an improvement of 8.2% from the top line reported in 2023.\n\nBoeing’s product portfolio includes a range of combat-proven aircraft like the F/A-18 Super Hornet, P-8, C-17 Globemaster III, EA-18G and a few more. In 2023, Boeing delivered 22 F/A-18s, nine F-15s, three T-7A Red Hawks and 11 P-8 models.\n\nBA boasts a long-term earnings growth rate of 25.5%. The company boasts a four-quarter average earnings surprise of 17.83%.\n\nNorthrop Grumman has built some of the world’s most advanced aircraft, ranging from the innovative B-2 Spirit stealth bomber to the game-changing E-2D Advanced Hawkeye. The significant awards won by NOC in 2023 included $2.1 billion for F-35 programs, $1.7 billion for E-2 and $1.5 billion for Triton.\n\nNOC boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for Northrop Grumman’s 2024 sales indicates an improvement of 4.6% from the top line reported in 2023.\n\nPrice Performance\n\nIn the past year, shares of LMT have risen 3.2% against the industry’s 10.9% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLockheed currently has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-wins-contract-support-114900383.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0KVV.IL",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.037,
            "neu": 0.758,
            "pos": 0.205
        }
    },
    {
        "date": "2024-06-19T05:02:45+00:00",
        "title": "Nvidia's longer-term growth prospects justify price target raise - Stifel",
        "content": "Investing.com -- Nvidia's (NASDAQ:NVDA) longer-term growth prospects and profitability metrics justify have led analysts at Stifel to raise their price target for shares in the artificial intelligence chipmaker.\n\nIn a note to clients on Tuesday, the analysts said they are lifting their price target for Nvidia's shares to $165 from $114, which was adjusted to account for Nvidia's recent decision to carry out a ten-for-one stock split.\n\nThe increase is based on Stifel's new projections for Nvidia's stock to trade at roughly 40 times expected fiscal 2027 earnings per share of $4.10, the analysts said.\n\n\"We expect the majority of near-to-medium term opportunities will come from high performance computing, hyperscale and cloud data center, and enterprise and edge computing,\" they argued. \"While we continue to view Nvidia’s exposure to Gaming, Automotive and Professional Visualization favorably, the shift from general purpose compute to accelerated compute represents the company’s most significant revenue and profitability growth opportunity over the next several years.\"\n\nBut they noted several risks to the updated price target, including a \"potential digestion period following several quarters of significant investment\", unforeseen tightening of U.S. trade restrictions on technology shipped to China and \"general macro[economic] events.\"\n\nNvidia's stock price rose more than 3% to $135.58 on Tuesday, pushing its market capitalization above software giant Microsoft (NASDAQ:MSFT) to become the world's most valuable company.\n\nCalifornia-based Nvidia, which designs processors that are seen as critical components of powerful AI models like OpenAI's ChatGPT, added a little over $110 billion to its market cap -- roughly the equivalent of the entire value of Lockheed Martin (NYSE:LMT).\n\nOnce known as a manufacturer of chips optimized for the gaming community, Nvidia has evolved over the last two years into one of the figureheads of soaring enthusiasm around the capabilities of AI. Chief Executive Jensen Huang has said Nvidia is at the heart of a new \"industrial revolution\" that could fundamentally alter the global economy.\n\nIts massive share increase -- including about a 170% skyrocketing so far this year -- has lifted broader stock markets. A third of the 14% jump in the S&P 500 in 2024 is solely due to Nvidia's rise.\n\nRelated Articles\n\nNvidia's longer-term growth prospects justify price target raise - Stifel\n\nToyota's chairman sees shareholder backing slide to 72% amid governance concerns\n\nJust Eat Takeaway, Amazon announce partnership in Germany, Austria and Spain\n\nView comments",
        "link": "https://finance.yahoo.com/news/nvidias-longer-term-growth-prospects-050245986.html",
        "symbols": [
            "1NVDA.MI",
            "LMT.US",
            "MSFT.US",
            "NVD.BE",
            "NVD.DU",
            "NVD.F",
            "NVD.HA",
            "NVD.HM",
            "NVD.MU",
            "NVD.STU",
            "NVD.XETRA",
            "NVDA.MX",
            "NVDA.NEO",
            "NVDA.US",
            "NVDC34.SA",
            "NVDG.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.016,
            "neu": 0.823,
            "pos": 0.161
        }
    },
    {
        "date": "2024-06-19T03:48:41+00:00",
        "title": "U.S. stock markets close, Nvidia reaches No.1 market cap - what's moving markets",
        "content": "Investing.com -- U.S. financial markets are due to be closed for the Juneteenth holiday on Wednesday, potentially limiting trading activity a day after Nvidia (NASDAQ:NVDA) leapfrogged Microsoft (NASDAQ:MSFT) to become the world's most valuable company. Meanwhile, Federal Reserve Governor Adriana Kugler says the central bank could slash interest rates if economic conditions continue to move in the \"right direction.\"\n\n1. U.S. stock markets to close for Juneteenth holiday\n\nU.S. stock markets are set to remain shuttered for the Juneteenth holiday on Wednesday.\n\nOn Tuesday, the benchmark S&P 500 and tech-heavy Nasdaq Composite both registered fresh record high closes, boosted by a surge in Nvidia shares that pushed the market capitalization of the artificial intelligence chipmaker above software group Microsoft to become the world's most valuable company (more below).\n\nAlso aiding sentiment was softer-than-anticipated U.S. retail sales data for May, which pointed to a slackening momentum in consumer spending. Traders subsequently bolstered bets that the Federal Reserve will roll out two interest rate cuts this year despite the central bank recently signaling it only expects one.\n\n2. Nvidia becomes world's most valuable company\n\nNvidia's stock price rose more than 3% to $135.58 in the prior session, pushing its market cap to $3.34 trillion and above Microsoft's valuation of $3.31 trillion.\n\nThe California-based company, which designs processors that are seen as critical components of powerful AI models like OpenAI's ChatGPT, added a little over $110 billion to its market cap -- roughly the equivalent of the entire value of Lockheed Martin (NYSE:LMT).\n\nOnce known as a manufacturer of chips optimized for the gaming community worth around $300 billion, Nvidia has evolved over the last two years into one of the figureheads of soaring enthusiasm around the capabilities of AI. Chief Executive Jensen Huang has said Nvidia is at the heart of a new \"industrial revolution\" that could fundamentally alter the global economy.\n\nIts massive share increase -- including about a 170% skyrocketing so far this year -- has lifted broader stock markets. A third of the 14% jump in the S&P 500 in 2024 is solely due to Nvidia's rise.\n\n3. Kugler signals rate cut in 2024\n\nInflation in the U.S. remains too high, but if economic conditions continue to move in the \"right direction\" it will be appropriate to slash interest rates, according to Federal Reserve Governor Adriana Kugler.\n\nIn a prepared statement on Wednesday, Kugler said that several recent signs -- including fewer markups, inflation expectations, and anecdotal evidence from businesses -- suggest that price increases are not being as frequently passed on to consumers. These trends, she added, indicate that \"on balance, price-setting behavior is likely to continue to move closer to consistency\" with the rate-setting Federal Open Market Committee's stated 2% target.\n\nStory continues\n\nBut she noted that she believes interest rates -- currently at a more than two-decade high of 5.25% to 5.50% -- are at a \"sufficiently restrictive\" level to ease economic activity and cool inflation.\n\nKugler's comments were her first since Fed officials, persuaded by stronger-than-anticipated inflation readings in the opening months of 2024, released updated rate projections last week which showed they do not expect to roll out more than one rate cut this year. In March, they had previously called for as many as three.\n\nElsewhere on Tuesday, New York Fed President John Williams predicted rates will come down gradually, while Richmond Fed President Thomas Barkin said he wanted to see further evidence of abating inflation before backing a rate cut.\n\n4. Golden Goose postpones IPO\n\nItalian high-end sportswear brand Golden Goose has postponed its planned initial public offering in Milan, citing a \"significant deterioration\" in market conditions following European elections earlier this month and an upcoming snap election in France.\n\nThe group, which is owned by British private equity firm Permira, added that these trends had impacted the luxury sector in particular.\n\nGolden Goose, known for its sneakers worn by celebrities like Taylor Swift, was due to price its IPO this week. It is aiming to raise about 600 million euros at a 1.86 million euro valuation. The company noted that it would look into reviving the IPO \"in due course.\"\r\n\r\n5. Crude prices inch down\n\nCrude prices edged lower Wednesday, as an unexpected build in U.S. crude inventories raised concerns over demand.\n\nBy 03:44 ET, the U.S. crude futures (WTI) traded 0.2% lower at $80.52 per barrel, while the Brent contract dropped 0.2% to $85.13 a barrel.\n\nU.S. crude stocks rose by 2.26 million barrels in the week ended June 14, according data from the American Petroleum Institute, released late Tuesday. Analysts had expected a 2.2 million barrel draw in crude stocks.\n\nOfficial U.S. inventories from the Energy Information Administration are due on Thursday, a day later than usual due to the U.S. holiday.\n\nRelated Articles\n\nU.S. stock markets close, Nvidia reaches No.1 market cap - what's moving markets\n\nChinese automakers seek retaliatory tariffs on EU cars, state media reports\n\nEurope needs greater political stability, EY says\n\nView comments",
        "link": "https://finance.yahoo.com/news/u-stock-markets-close-nvidia-034841088.html",
        "symbols": [
            "1NVDA.MI",
            "91D.F",
            "COMP.US",
            "GSPC.INDX",
            "IXIC.INDX",
            "LMT.US",
            "MSFT.US",
            "NVD.BE",
            "NVD.DU",
            "NVD.F",
            "NVD.HA",
            "NVD.HM",
            "NVD.MU",
            "NVD.STU",
            "NVD.XETRA",
            "NVDA.MX",
            "NVDA.NEO",
            "NVDA.US",
            "NVDC34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.306,
            "neg": 0.067,
            "neu": 0.848,
            "pos": 0.085
        }
    }
]