[
    {
        "date": "2024-10-04T23:25:16+00:00",
        "title": "20 Most Powerful States in the US",
        "content": "In this article, we will be taking a look at the 20 most powerful states in the US. If you want to skip our detailed analysis of the global defense industry, you can go directly to see the 5 Most Powerful States in the US.\n\nThe Global Defense Industry: Powers in Motion\n\nThe global defense industry is experiencing significant growth driven by ongoing geopolitical tensions. According to new data on global military spending published by the Stockholm International Peace Research Institute (SIPRI), total global military expenditure reached $2.443 trillion in 2023, marking a 6.8% increase in real terms from the previous year. This rise represents the steepest year-on-year increase since 2009, driven primarily by escalating tensions and conflicts around the world. The ten largest military spenders, including the US, China, and Russia, all raised their defense budgets.\n\nNotably, Russia's military spending surged by 24% to an estimated $109 billion in 2023, reflecting a 57% increase since 2014. In 2023, Ukraine's military spending was 59% of Russia’s military spending. Ukraine also received at least $35 billion in military aid from various countries, including $25.4 billion from the US. When combined with Ukraine's own spending, this amounts to around 91% of Russia's military expenditure.\n\nMilitary expenditure in the Middle East rose by 9% to reach $200 billion in 2023, marking the highest annual growth rate in the region over the past decade. This increase was largely driven by Israel, which saw its military spending grow by 24% to reach $27.5 billion, following its large-scale offensive in Gaza after the October attack by Hamas. Iran also ranked as the fourth largest military spender in the Middle East, with an expenditure of $10.3 billion in 2023. Diego Lopes da Silva, a senior researcher with the Stockholm International Peace Research Institute (SIPRI), noted that the surge in military spending reflects the rapidly changing dynamics in the region, from improving diplomatic relations to fears of a broader conflict.\n\nThe United States remains the world's largest military spender. In 2023, the US raised its military budget by 2.3%, bringing total spending to $916 billion. Meanwhile, China, the second-largest military spender, allocated approximately $296 billion to its defense efforts, reflecting a 6% increase from the previous year.\n\nREAD ALSO: 30 Least Peaceful Countries in the World and 20 Countries with the Best Economy in the World in 2024.\n\nGrowing Budgets: A Win for Defense Contractors\n\nThe increase in military spending signals a growing demand for military equipment, new weapons systems, advanced technologies, and modernization efforts. This trend can lead to increased revenues and growth for companies in the defense sector, as governments seek to enhance their military capabilities in response to global security challenges.\n\nLockheed Martin Corporation (NYSE:LMT) is one of the largest companies in the defense and technologies industry. In April, the corporation was awarded a significant $17 billion contract by the US Missile Defense Agency (MDA) to develop the Next Generation Interceptor (NGI), which aims to enhance the country's missile defense capabilities. As the prime contractor, Lockheed Martin Corporation (NYSE:LMT) will create a modern, reliable, and technically advanced interceptor designed to protect the US from long-range ballistic missile threats posed by rogue nations like North Korea and Iran. This contract is part of a modernization effort for the Ground-Based Midcourse Defense (GMD) system, which includes a network of radars and interceptors. The first NGI interceptor is expected to be operational by 2028, marking a crucial advancement in national security efforts.\n\nLMT has shown impressive performance in 2024, driven by strong demand for its defense technology solutions and a backlog of nearly $160 billion, more than double its annual revenue. In the second quarter, the company reported a 9% year-over-year increase in sales, reaching over $18 billion. The company reported earnings per share (EPS) of $7.11, surpassing expectations by $0.66. As of October 3, Lockheed Martin Corporation (NYSE: LMT) has seen its stock price increase by 35% over the past 6 months.\n\nThe company has also demonstrated a commitment to shareholder value through consistent dividend increases and aggressive share buybacks. On October 2, Lockheed Martin (NYSE:LMT) announced a fourth-quarter dividend of $3.30 per share, marking a $0.15 increase from the previous quarter and the company's 22nd consecutive year of dividend growth. Additionally, the board authorized an increase of up to $3 billion for its share repurchase program, bringing the total authorization for future buybacks to approximately $10 billion.\n\nWhile we acknowledge the potential of LMT as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than NVDA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nWith this background in mind, let’s explore the 20 most powerful states in the US. 20 Most Powerful States in the US\n\nCopyright: dolgachov / 123RF Stock Photo\n\nMethodology\n\nIn this article, we have listed the 20 most powerful states in the US. We utilized two key metrics: population and Gross Domestic Product (GDP). Economic strength and population numbers are effective metrics for assessing a state's overall power as they provide insights into economic capacity and human resources. While military strength is often considered when discussing state power, our focus on population and GDP allows for a broader understanding of how states can leverage their workforce potential and economic capabilities to assert influence. Population reflects the potential workforce and market size, while GDP indicates economic strength and resource availability, both of which are essential for assessing a state's overall power.\n\nWe gathered data from the United States Census Bureau, which provided us with estimated populations of US states as of July 2023. Additionally, we consulted the US Bureau of Economic Analysis (BEA), which provided us with the GDP data for each state in 2023. We then ranked each state based on both population and real GDP. Subsequently, we calculated the average ranking of these two metrics and assigned a score to each state, which helped us identify the most powerful states in the US.\n\nA lower Insider Monkey Score indicates a better overall ranking in terms of GDP and population. In the case where multiple states had the same score, we used GDP as a tie-breaker. The 20 most powerful states in the US are listed below in ascending order.\n\nAt Insider Monkey we are obsessed with the stocks that hedge funds pile into. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\n\n20 Most Powerful States in the US\n\n20. Missouri\n\nReal Gross Domestic Product (2023): $344.11 Billion\n\nTotal Population (2023): 6,196,156\n\nInsider Monkey Score: 19.5\n\nMissouri, a landlocked state in the Midwestern region, is one of the 20 most powerful states in the US. According to recent estimates by the US Bureau of Economic Analysis, Missouri's real GDP in 2023 was $344.11 billion. Manufacturing, healthcare, real estate, aerospace, and transportation are major sectors that contribute to the state’s GDP.\n\n19. Indiana\n\nReal Gross Domestic Product (2023): $401.47 Billion\n\nTotal Population (2023): 6,862,199\n\nInsider Monkey Score: 18\n\nIndiana is a state in the Midwestern region of the US. It is the 17th-most populated of the 50 states. Indiana has a diverse economy and the state’s real GDP in 2023 was $401.47 billion.\n\n18. Maryland\n\nReal Gross Domestic Product (2023): $420.99 Billion\n\nTotal Population (2023): 6,180,253\n\nInsider Monkey Score: 18\n\nMaryland is a small state in the Mid-Atlantic region. It is one of the most densely populated states in the US. Maryland boasts a highly diversified economy that includes key sectors such as manufacturing, retail services, real estate, information technology, defense contracting, healthcare, and biotechnology. It is one of the top US states by median household income. In 2023, Maryland’s real GDP was $420.99 billion.\n\n17. Colorado\n\nReal Gross Domestic Product (2023): $428.04 Billion\n\nTotal Population (2023): 5,877,610\n\nInsider Monkey Score: 18\n\nColorado is one of the Mountain states in the Western United States. Key sectors that contribute to the state’s economy include government and defense, real estate, mining, and agriculture. As one of the most powerful states in the US, Colorado recorded a real GDP of $428.04 billion in 2023.\n\n16. Arizona\n\nReal Gross Domestic Product (2023): $414.27 Billion\n\nTotal Population (2023): 7,431,344\n\nInsider Monkey Score: 16\n\nArizona, a state in the Southwestern region of the United States, is the 6th-largest by area and the 14th-most-populated of the 50 states. Some of the state's largest sectors are real estate, healthcare, and manufacturing. In 2023, Arizona’s real GDP was $414.27 billion.\n\n15. Tennessee\n\nReal Gross Domestic Product (2023): $425.41 Billion\n\nTotal Population (2023): 7,126,489\n\nInsider Monkey Score: 15.5\n\nTennessee is a landlocked state in the Southeastern region that ranks among the top 15 on our list of the most powerful states in the US. The state has a diverse economy comprising various sectors, including real estate, manufacturing, agriculture, healthcare, and finance. Tennessee recorded a real GDP of $425.41 billion in 2023.\n\n14. Massachusetts\n\nReal Gross Domestic Product (2023): $615.14 Billion\n\nTotal Population (2023): 7,001,399\n\nInsider Monkey Score: 14\n\nMassachusetts is a state in the New England region of the Northeastern US that ranks among the states with the best economy. With a real GDP of $615.14 billion in 2023, Massachusetts is one of the most powerful states in the US.\n\n13. Virginia\n\nReal Gross Domestic Product (2023): $590.8 Billion\n\nTotal Population (2023): 8,715,698\n\nInsider Monkey Score: 12.5\n\nVirginia is a state in the Southeastern and Mid-Atlantic regions of the US. Arms and aerospace, technology, and banking and finance are major sectors that contribute to the state’s GDP. The state of Virginia’s real GDP in 2023 was $590.8 billion. It ranks 13th on our list of the most powerful states in the US.\n\n12. Michigan\n\nReal Gross Domestic Product (2023): $547.77 Billion\n\nTotal Population (2023): 10,037,261\n\nInsider Monkey Score: 12\n\nMichigan is a state in the Great Lakes region that ranks 12th on our list of the most powerful states in the US. It is the 10th largest state by area. Michigan recorded a real GDP of $547.77 billion in 2023.\n\n11. New Jersey\n\nReal Gross Domestic Product (2023): $656.48 Billion\n\nTotal Population (2023): 9,290,841\n\nInsider Monkey Score: 10.5\n\nNew Jersey, located in the Mid-Atlantic and Northeastern regions, is the most densely populated state in the US. The state's economy is highly diversified, featuring key sectors such as biotechnology, healthcare, information technology, finance, and tourism. In 2023, New Jersey’s real GDP was $656.48 billion.\n\n10. Washington\n\nReal Gross Domestic Product (2023): $672.12 Billion\n\nTotal Population (2023): 7,812,880\n\nInsider Monkey Score: 10.5\n\nWashington state, in the Pacific Northwest region, ranks among the top 10 on our list of the most powerful states in the US. Washington state has a strong economy. Key economic sectors include government, real estate and rental leasing, information, and manufacturing, along with important contributions from fruit and vegetable production and hydroelectric power. In 2023, the state of Washington recorded a real GDP of $672.12 billion.\n\n9. North Carolina\n\nReal Gross Domestic Product (2023): $625.68 Billion\n\nTotal Population (2023): 10,835,491\n\nInsider Monkey Score: 10\n\nNorth Carolina, a state in the Southeastern region, is one of the most powerful states in the US. The state serves as a major banking and finance center, with other important sectors including agriculture, manufacturing, and technology. North Carolina’s real GDP in 2023 was $625.68 billion.\n\n8. Georgia\n\nReal Gross Domestic Product (2023): $661.11 Billion\n\nTotal Population (2023): 11,029,227\n\nInsider Monkey Score: 8.5\n\nGeorgia, a state in the Southeastern region, ranks 8th on our list of the most powerful states in the US. Atlanta, the capital city of the state, is a global city and a major hub for finance, insurance, technology, manufacturing, real estate, services, logistics, and transportation. The Hartsfield–Jackson Atlanta International Airport is the world’s busiest airport. In 2023, the state of Georgia recorded a real GDP of $661.11 billion.\n\n7. Ohio\n\nReal Gross Domestic Product (2023): $698.21 Billion\n\nTotal Population (2023): 11,785,935\n\nInsider Monkey Score: 7\n\nOhio is a state located in the Midwestern region of the US. The state’s key sectors include banking and insurance, research and development, bioscience, steel production, manufacturing, and traditional industries such as agriculture. As one of the most powerful states in the US, Ohio recorded a real GDP of $698.21 billion in 2023.\n\n6. Pennsylvania\n\nReal Gross Domestic Product (2023): $789.5 Billion\n\nTotal Population (2023): 12,961,683\n\nInsider Monkey Score: 5.5\n\nPennsylvania, located in the Northeastern region of the United States, ranks 6th on our list of the most powerful states. The state is home to a thriving manufacturing sector, and it plays a crucial role in the state’s economy. Pennsylvania’s real GDP in 2023 was $789.5 billion. It is the fifth most populated state in the US.\n\n5. Illinois\n\nReal Gross Domestic Product (2023): $875.56 Billion\n\nTotal Population (2023): 12,549,689\n\nInsider Monkey Score: 5.5\n\nIllinois, a state in the Midwestern region, ranks among the top 5 on our list of the most powerful states in the US. Illinois has a highly diversified economy, with strengths in agribusiness and food processing, as well as advanced manufacturing, energy, life sciences and biotechnology, and business and professional services. In 2023, Illinois recorded a real GDP of $875.56 billion.\n\n4. Florida\n\nReal Gross Domestic Product (2023): $1.27 Trillion\n\nTotal Population (2023): 22,610,726\n\nInsider Monkey Score: 3.5\n\nFlorida, a state in the Southeastern region, ranks high among the most powerful states in the US. Florida's economy is supported by various sectors, including agriculture, tourism, construction, international banking, biomedical and life sciences, healthcare research, aerospace and defense, and commercial space travel. Florida’s real GDP in 2023 was $1.27 trillion. It is also one of the best states in the US to live in.\n\n3. New York\n\nReal Gross Domestic Product (2023): $1.77 Trillion\n\nTotal Population (2023): 19,571,216\n\nInsider Monkey Score: 3.5\n\nNew York State is a Mid-Atlantic state in the Northeastern US. It ranks among the top 3 on our list of the 20 most powerful states in the US. The state has a significant manufacturing sector and is a leading center for banking, finance, and communication in the United States. In 2023, New York State recorded a real GDP of $1.77 trillion.\n\n2. Texas\n\nReal Gross Domestic Product (2023): $2.03 Trillion\n\nTotal Population (2023): 30,503,301\n\nInsider Monkey Score: 2\n\nTexas, in the South Central region of the United States, is the second-largest state by both area and population. Key sectors contributing to the state’s economy include manufacturing, aerospace, aviation and defense, biotechnology and life sciences, energy, information technology, petroleum refining, and chemical products. With a real GDP of $2.03 trillion in 2023, Texas ranks second on our list of the most powerful states in the US.\n\n1. California\n\nReal Gross Domestic Product (2023): $3.23 Trillion\n\nTotal Population (2023): 38,965,193\n\nInsider Monkey Score: 1\n\nCalifornia, located in the Western United States, tops our list of the most powerful states in the US. It is the most populated state in the US. California's economy is diverse, featuring significant sectors such as finance, business services, and manufacturing. Additionally, California’s Silicon Valley is home to some of the world's biggest technology companies. California ranks as the most powerful state in the US due to its combination of population size and wealth, boasting a real GDP of $3.23 trillion in 2023. If it were a separate country, California would be among the five largest economies globally, thanks to its enormous GDP.\n\nREAD NEXT:$30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n\nDisclosure: None. This article was originally published on Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/20-most-powerful-states-us-232516366.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.042,
            "neu": 0.838,
            "pos": 0.12
        }
    },
    {
        "date": "2024-10-04T14:58:32+00:00",
        "title": "Boeing-Lockheed JV's Vulcan rocket launches second mission",
        "content": "(Reuters) - Boeing and Lockheed Martin's joint venture, United Launch Alliance, said on Friday its Vulcan rocket successfully launched its second mission, in what is a crucial step to receive certification for Pentagon missions.\n\nVulcan, developed to replace ULA's workhorse Atlas V rocket and rival the reusable Falcon 9 from Elon Musk's SpaceX, took off from the Cape Canaveral Space Force Station in Florida.\n\nIt had successfully debuted in January this year.\n\nWith the launch, ULA is looking to fulfill flight test obligations and complete its certification process with the U.S. Space Force, which requires two verification flights before it can put national security payloads aboard.\n\nULA said the U.S. Space Force — a key customer for Vulcan — will review the data and compare it to ULA's first certification mission to ensure that the vehicle performed as expected, before it can be certified.\n\n(Reporting by Utkarsh Shetti in Bengaluru; Editing by Shilpi Majumdar)\n\nView comments",
        "link": "https://finance.yahoo.com/news/boeing-lockheed-jvs-vulcan-rocket-145832286.html",
        "symbols": [
            "0BOE.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.949,
            "neg": 0,
            "neu": 0.879,
            "pos": 0.121
        }
    },
    {
        "date": "2024-10-04T13:42:00+00:00",
        "title": "Lockheed Shares More Profit, Raises Dividend &amp; Buyback Authorization",
        "content": "Lockheed Martin Corp. LMT announced that its board of directors approved a 4.8% hike in its quarterly dividend to $3.30 per share, marking the 22nd consecutive annual dividend hike. The revised quarterly dividend is payable on Dec. 27, 2024, to shareholders of record at the close of the business on Dec. 2, 2024.\r\n\r\nThe company’s new annualized dividend rate is $13.20. The current dividend yield is 2.08%, better than the Zacks S&P 500 composite’s 1.24%.\r\n\r\nAlong with dividend payments, Lockheed’s management continues to increase shareholder value by repurchasing shares. The board authorized an additional $3 billion for share repurchases, which resulted in a total authorization under the repurchase program of nearly $10 billion.\n\nCan Lockheed Sustain Dividend Hikes?\n\nLockheed has a platform-centric focus and leveraged presence in the Army, Air Force, Navy and IT programs of the U.S. Department of Defense that guarantee a steady inflow of follow-on orders. The company continues to clinch big defense deals from the U.S. government and allied countries. As a consequence, it exited the second quarter of 2024 with a record backlog of $158.3 billion, backed by increasing demand and a rising global defense budget. This shall boost LMT’s sales growth and cash flow in the coming quarters.\r\n\r\nApart from domestic orders, the company also enjoys the advantage of having a wide international customer base. In the second quarter of 2024, 25.8% of total net sales were from international customers. The company is focused on expanding its international footprint, which continues to support earnings.\r\n\r\nLockheed Martin is the largest U.S. defense contractor with a platform-centric focus that guarantees a steady inflow of follow-on orders from its leveraged presence in the Army, Air Force, Navy and IT programs. The F-35 program continues to be a key growth program for Lockheed. The production of F-35 jets is expected to continue for many years ahead, given the U.S. government's current inventory target of 2,456 aircraft for the Air Force, Marine Corps and Navy. This will support its top line and boost its earnings.\r\n\r\nCourtesy of Lockheed’s global presence, strong backlog, F-35 program and contract wins, the company continues to generate strong operating cash flow, which provides assurance that it will be able to sustain shareholder-friendly moves in the future as well.\n\nOther Aerospace Companies’ Recent Dividend Hikes\n\nHere are some defense companies that have been rewarding shareholders with impressive dividend payouts.\r\n\r\nOn May 14, 2024, Northrop Grumman Corp. NOC announced that its board of directors approved a 10% hike in its quarterly dividend to $2.06 per share, marking the 21st consecutive annual dividend hike.\r\n\r\nNorthrop boasts a long-term (three to five years) earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales implies an improvement of 5.4% from the previous year’s level.\r\n\r\nOn May 10, 2024, Curtiss-Wright CW announced that its board of directors declared a 5% increase in the quarterly dividend to 21 cents per share. The company authorized an additional $300 million for future share repurchases, increasing the total available authorization to $400 million.\r\n\r\nCurtiss-Wright boasts a four-quarter earnings surprise of 11.52%, on average. The Zacks Consensus Estimate for CW’s 2024 sales implies an improvement of 7.1% from the prior-year figure.\r\n\r\nOn May 2, 2024, RTX Technologies RTX announced a dividend of 63 cents per, calling for an increase of 6.8% over the prior quarter's dividend amount.\r\n\r\nRTX Technologies has a long-term earnings growth rate of 10.4%. The Zacks Consensus Estimate for RTX’s 2024 sales calls for an improvement of 7% from the prior-year figure.\n\nStory continues\n\nLMT Stock Price Movement\n\nIn the past three months, shares of LMT have rallied 31.1% compared with its industry’s rise of 12.2%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLMT’s Zacks Rank\n\nLockheed Martin currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nCurtiss-Wright Corporation (CW) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-shares-more-profit-raises-134200847.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "CW.US",
            "CWT.F",
            "CWT.STU",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.002,
            "neu": 0.831,
            "pos": 0.167
        }
    },
    {
        "date": "2024-10-04T13:00:12+00:00",
        "title": "Here is What to Know Beyond Why Lockheed Martin Corporation (LMT) is a Trending Stock",
        "content": "Lockheed Martin (LMT) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\n\nOver the past month, shares of this aerospace and defense company have returned +6.6%, compared to the Zacks S&P 500 composite's +3.2% change. During this period, the Zacks Aerospace - Defense industry, which Lockheed falls in, has gained 2%. The key question now is: What could be the stock's future direction?\n\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\n\nEarnings Estimate Revisions\n\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\n\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nFor the current quarter, Lockheed is expected to post earnings of $6.40 per share, indicating a change of -5.5% from the year-ago quarter. The Zacks Consensus Estimate remained unchanged over the last 30 days.\n\nThe consensus earnings estimate of $26.49 for the current fiscal year indicates a year-over-year change of -4.8%. This estimate has remained unchanged over the last 30 days.\n\nFor the next fiscal year, the consensus earnings estimate of $28.87 indicates a change of +9% from what Lockheed is expected to report a year ago. Over the past month, the estimate has remained unchanged.\n\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #2 (Buy) for Lockheed.\n\nStory continues\n\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n\n12 Month EPS\n\nProjected Revenue Growth\n\nWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\n\nFor Lockheed, the consensus sales estimate for the current quarter of $17.45 billion indicates a year-over-year change of +3.4%. For the current and next fiscal years, $71.14 billion and $73.99 billion estimates indicate +5.3% and +4% changes, respectively.\n\nLast Reported Results and Surprise History\n\nLockheed reported revenues of $18.12 billion in the last reported quarter, representing a year-over-year change of +8.6%. EPS of $7.11 for the same period compares with $6.73 a year ago.\n\nCompared to the Zacks Consensus Estimate of $17.12 billion, the reported revenues represent a surprise of +5.88%. The EPS surprise was +10.23%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\n\nValuation\n\nWithout considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\n\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\n\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\n\nLockheed is graded B on this front, indicating that it is trading at a discount to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\n\nBottom Line\n\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Lockheed. However, its Zacks Rank #2 does suggest that it may outperform the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/know-beyond-why-lockheed-martin-130012183.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.008,
            "neu": 0.86,
            "pos": 0.132
        }
    },
    {
        "date": "2024-10-04T12:25:13+00:00",
        "title": "Boeing-Lockheed Venture Launches New Rocket in Key Test",
        "content": "(Bloomberg) -- United Launch Alliance’s new Vulcan rocket blasted off to space on Friday, a critical test of the Boeing Co. and Lockheed Martin Corp. joint venture’s ability to loft spy satellites for the US government.\n\nMost Read from Bloomberg\n\nThe Corner Store Comeback NYC Schools Reverse Course on Cell-Phone Ban After Parents Balk Roofs of Mexico City’s Massive Food Market Will Power Public Buses Mexico City Restricts Airbnb Rentals to Curb ‘Gentrification’ A Housing Crisis Brews in Rwanda’s Capital City\n\nVulcan thundered off the launchpad at 7:25 a.m. local time from Cape Canaveral, Florida, nine months after the vehicle made its debut launch. The flight lasted roughly 30 minutes.\n\nIt’s a critical time for ULA, which is a key launch provider for the US government. The Pentagon has been putting pressure on the company and levying fines over delays with Vulcan, which is five years behind schedule. And as SpaceX’s primary competitor, a successful launch of Vulcan would help pave the way for ULA to compete for more lucrative contracts and jump-start its commercial business.\n\nNo customer satellites were on board this mission. Instead, ULA launched carrying a dummy satellite — with some technical experiments embedded inside — to simulate the weight of a spacecraft.\n\nULA made the decision to fly the dummy payload in order to get off the launchpad sooner rather than later. It made the swap due to delays with its original cargo, Sierra Space’s Dream Chaser plane.\n\nSubscribe Now: Business of Space newsletter, a weekly look at the inside stories of investments beyond Earth.\n\nULA’s been in a hurry to fly Vulcan as the company is under contract to launch more than two dozen Space Force missions with the new rocket. Because the rocket is a new vehicle, the military required ULA to launch two flights to certify it was capable of handling the government’s most sensitive spacecraft.\n\nThe flight happened as Boeing, which is burning cash as it navigates a worker strike, and Lockheed explore the sale of ULA — most recently during talks with Sierra Space.\n\nGoing into Friday’s flight, ULA Chief Executive Officer Tory Bruno was confident about Vulcan’s chances of getting certified for Space Force missions given how well the rocket performed during its January debut.\n\n“It was the cleanest first launch I’ve ever had,” Bruno told reporters ahead of the flight.\n\nULA is gearing up for a busy end of the year — and an even busier 2025. The company hopes to launch two Space Force missions with Vulcan before the new year. And next year, the company plans to fly as many as 20 launches — a mixture of flights using Vulcan and the company’s retiring Atlas V.\n\nStory continues\n\nAlso on the docket for next year are the first launches for Amazon.com Inc.’s Project Kuiper, the internet-from-space initiative set to rival SpaceX’s Starlink. Originally, Amazon had planned to launch its first satellites for the project on ULA’s Atlas V rocket by the end of this year. But Bruno said the first launches will now take place early next year, as ULA needed to prioritize its launches for the US government.\n\n“It’s because of the national security space missions that are urgent, that Amazon is supportive of,” Bruno said.\n\nBruno also said ULA would find time in 2025 to fly Sierra Space’s Dream Chaser, but did not specify when that might take place.\n\n(Updates with mission completion in second paragraph.)\n\nMost Read from Bloomberg Businessweek\n\nAdam Neumann’s Latest Project Is a WeWork Competitor How Bogg Bags, the Crocs of Totes, Won Over America’s Moms Rotting Rice in India Fuels Discontent About Modi’s Food Policy Elon Musk’s Role in Reanimating the Far-Right Term ‘Remigration’ The Great €3 Billion Shipping Container Heist\n\n©2024 Bloomberg L.P.\n\nView comments",
        "link": "https://finance.yahoo.com/news/boeing-lockheed-venture-launches-rocket-122513010.html",
        "symbols": [
            "0BOE.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.965,
            "neg": 0.022,
            "neu": 0.914,
            "pos": 0.064
        }
    },
    {
        "date": "2024-10-04T11:52:00+00:00",
        "title": "Buy 5 High ROE Stocks as Middle East Tensions Spark Oil Crisis",
        "content": "Just when it appeared that the broader U.S. equity markets were cruising on a smooth sail buoyed by a solid economy, the escalating geopolitical tensions in the Middle East have doused investor enthusiasm. Stocks tumbled across the board as Iran fired ballistic missiles at Israel to avenge the death of Hezbollah leader Hassan Nasrallah and an Iranian commander in Lebanon.  \r\n\r\nWith Israel launching a counter-offensive strike against Lebanon, markets remained on the tenterhooks as the energy crisis began to soar. Crude oil prices have surged on the market uncertainty as traders brace for more volatility slugfest.\r\n\r\nAs investors employ a wait-and-see approach in a classic example of “backing and filling” in the market, they can benefit from “cash cow” stocks that garner higher returns. However, identifying cash-rich stocks alone does not make for a solid investment proposition unless it is backed by attractive efficiency ratios like return on equity (ROE). A high ROE ensures that the company is reinvesting cash at a high rate of return. Lockheed Martin Corporation LMT, CF Industries Holdings, Inc. CF, Arch Capital Group Ltd. ACGL, PulteGroup, Inc. PHM and Banco de Chile BCH are some of the stocks with high ROE to profit from.\n\nWhy ROE?\n\nROE = Net Income/Shareholders’ Equity\r\n\r\nROE helps investors distinguish profit-generating companies from profit burners and is useful in determining the financial health of a company. In other words, this financial metric enables investors to identify companies that diligently deploy cash for higher returns.\r\n\r\nMoreover, ROE is often used to compare the profitability of a company with other firms in the industry — the higher, the better. It measures how well a company is multiplying its profits without investing new equity capital and portrays management’s efficiency in rewarding shareholders with attractive risk-adjusted returns.\n\nParameters Used for Screening\n\nIn order to shortlist stocks that are cash-rich with high ROE, we have added Cash Flow greater than $1 billion and ROE greater than X-Industry as our primary screening parameters. In addition, we have taken a few other criteria into consideration to arrive at a winning strategy.\r\n\r\nPrice/Cash Flow lesser than X-Industry: This metric measures how much investors pay for $1 of free cash flow. A lower ratio indicates that investors need to pay less for a better cash flow-generating stock.\r\n\r\nReturn on Assets (ROA) greater than X-Industry: This metric determines how much profit a company earns for every dollar of asset, which includes cash, accounts receivable, property, equipment, inventory and furniture. The higher the ROA, the better it is for the company.\r\n\r\n5-Year EPS Historical Growth greater than X-Industry: This criterion indicates that continued earnings momentum has translated into solid cash strength. \r\n\r\nZacks Rank less than or equal to 2: Zacks Rank #1 (Strong Buy) or 2 (Buy) stocks are known to outperform irrespective of the market environment.\r\n\r\nHere are five of the nine stocks that qualified the screening:\r\n\r\nLockheed Martin: Based in Bethesda, MD, Lockheed Martin is the largest defense contractor in the world. Its main areas of focus are defense, space, intelligence, homeland security and information technology, including cyber security. Lockheed Martin currently operates through four businesses — Aeronautics, Missiles and Fire Control, Rotary and Missions Systems and Space Systems. \r\n\r\nThe company has a long-term earnings growth expectation of 4.7% and delivered a trailing four-quarter earnings surprise of 7.5%, on average. Lockheed Martin carries a Zacks Rank #2. You can see the complete list of today’s Zacks #1 Rank stocks here. \r\n\r\nCF Industries: Headquartered in Deerfield, IL, CF Industries is one of the largest manufacturers and distributors of nitrogenous fertilizer and other nitrogen products globally. The company’s principal nitrogenous fertilizer products are ammonia, granular urea, urea ammonium nitrate solution and ammonium nitrate. The company operates two of the largest fertilizer complexes in North America, one in Donaldsonville, Louisiana, United States and the other in Medicine Hat, Alberta, Canada.\r\n\r\nIt has a long-term earnings growth expectation of 6%. CF Industries carries a Zacks Rank #2.\r\n\r\nArch Capital: Headquartered in Pembroke, Bermuda, Arch Capital offers insurance, reinsurance and mortgage insurance across the world. It provides a wide range of products and services, which include primary and excess casualty coverages, professional indemnity, workers’ compensation and umbrella liability and employers’ liability insurance coverages. The company offers a full range of property, casualty and mortgage insurance and reinsurance lines while maintaining a focus on writing specialty lines of insurance and reinsurance.\r\n\r\nIt has a long-term earnings growth expectation of 6.1% and delivered a trailing four-quarter earnings surprise of 28.9%, on average. It has a VGM Score of B. Arch Capital carries a Zacks Rank #2. \r\n\r\nPulteGroup: Based in Atlanta, GA, PulteGroup engages in homebuilding and financial services businesses, primarily in the United States. The company conducts operations through two primary business segments – Homebuilding and Financial Services. The company engages in maintaining a 50/50 balance between build-to-order and spec sales, enabling it to meet immediate demand with spec homes while accommodating buyers who prefer to customize their homes with build-to-order options.\r\n\r\nThe company has a long-term earnings growth expectation of 19% and delivered a trailing four-quarter earnings surprise of 10%, on average. It has a VGM Score of B. PulteGroup carries a Zacks Rank #2. \r\n\r\nBanco de Chile: Headquartered in Santiago, Chile, Banco de Chile provides various banking services to customers in the Latin American country. These include deposit accounts, loans, payment-related cards and insurance solutions. The company also offers services such as cash management, treasury, financial advisory, trade finance, leasing, factoring, payment, payroll, collection, mutual fund management, securities brokerage, currency trading, investment management, collection, securitization and capital markets services.\r\n\r\nIt delivered a trailing four-quarter earnings surprise of 6.1%, on average. Banco de Chile carries a Zacks Rank #2.\r\n\r\nYou can get the rest of the stocks on this list by signing up now for your 2-week free trial to the Research Wizard and start using this screen in your own trading. Further, you can also create your own strategies and test them first before taking the investment plunge. \r\n\r\nThe Research Wizard is a great place to begin. It's easy to use. Everything is in plain language. And it's very intuitive. Start your Research Wizard trial today. And the next time you read an economic report, open up the Research Wizard, plug your finds in, and see what gems come out.\r\n\r\nClick here to sign up for a free trial to the Research Wizard today.\r\n\r\nDisclosure: Officers, directors and/or employees of Zacks Investment Research may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material. An affiliated investment advisory firm may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material. \r\n\r\nDisclosure: Performance information for Zacks’ portfolios and strategies are available at: https://www.zacks.com/performance.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nPulteGroup, Inc. (PHM) : Free Stock Analysis Report\n\nCF Industries Holdings, Inc. (CF) : Free Stock Analysis Report\n\nBanco De Chile (BCH) : Free Stock Analysis Report\n\nArch Capital Group Ltd. (ACGL) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/buy-5-high-roe-stocks-115200152.html",
        "symbols": [
            "0HQU.LSE",
            "0KS6.LSE",
            "0R3E.LSE",
            "ACGL.US",
            "ACGLN.US",
            "ACGLO.US",
            "BCH.US",
            "C4F.BE",
            "C4F.DU",
            "C4F.F",
            "C4F.MU",
            "C4F.STU",
            "CF.US",
            "CHILE.SN",
            "G4RA.F",
            "G4RA.STU",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.034,
            "neu": 0.831,
            "pos": 0.135
        }
    }
]