[
    {
        "date": "2024-05-02T20:41:00+00:00",
        "title": "Lockheed Martin Declares Second Quarter 2024 Dividend and Announces Election of Thomas Falk as Independent Lead Director of the Board",
        "content": "BETHESDA, Md., May 2, 2024 /PRNewswire/ -- The Lockheed Martin (NYSE: LMT) board of directors has authorized a second quarter 2024 dividend of $3.15 per share. The dividend is payable on June 28, 2024, to holders of record as of the close of business on June 3, 2024. Lockheed Martin Logo. (PRNewsFoto/Lockheed Martin)\n\nThe independent members of Lockheed Martin's board of directors also unanimously elected Thomas J. Falk as independent lead director of the board effective today, succeeding Daniel F. Akerson who, along with James O. Ellis, Jr., retired from the board this morning following the company's annual stockholders meeting.\n\n\"We are pleased to announce Tom's election as our next independent lead director. His demonstrated independent judgement, integrity, and in-depth knowledge of the company allows for a smooth transition and will enable Tom to offer the kind of independent oversight that the role calls for,\" said Lockheed Martin Chairman, President and CEO Jim Taiclet. \"On behalf of the entire board, we thank Dan for his tireless work as our independent lead director since 2019 and for his dedication to Lockheed Martin and the board since 2014. We also extend our thanks to Jim Ellis, who retired from the board today after 20 years, for his service to our company and efforts to advance 21st Century Security.\"\n\nFalk has served on Lockheed Martin's board of directors since 2010 and as Audit Committee chair since 2015. As independent lead director, Falk will assume all duties and responsibilities of that position, including presiding over executive sessions of independent directors, approving agendas for board meetings and providing feedback to management. He will also chair the board's Nominating and Corporate Governance Committee and serve as ex officio member of each of the other committees. In connection with Falk's election as independent lead director, Patricia E. Yarrington has been appointed Chair of the board's Audit Committee.\n\nLockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at Lockheedmartin.com. Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/lockheed-martin-declares-second-quarter-2024-dividend-and-announces-election-of-thomas-falk-as-independent-lead-director-of-the-board-302135138.html\n\nSOURCE Lockheed Martin\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-declares-second-quarter-204100876.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.986,
            "neg": 0,
            "neu": 0.899,
            "pos": 0.101
        }
    },
    {
        "date": "2024-05-02T14:07:00+00:00",
        "title": "Huntington Ingalls (HII) Q1 Earnings Beat, Revenues Rise Y/Y",
        "content": "Huntington Ingalls Industries, Inc.’s HII first-quarter 2024 earnings of $3.87 per share increased a solid 19.8% from $3.23 reported in the prior-year quarter. The bottom line also surpassed the Zacks Consensus Estimate of $3.50 by 10.6%.\n\nTotal Revenues\n\nRevenues for the quarter totaled $2.81 billion, which beat the Zacks Consensus Estimate of $2.80 billion by 0.2%. The top line also increased 4.9% from $2.67 billion recorded in the year-ago quarter, driven primarily by growth at its Mission Technologies business segment.\n\nOperational Performance\n\nHuntington Ingalls reported segmental operating income of $170 million compared with $156 million in the first quarter of 2023. The segmental operating margin expanded 30 basis points from the prior-year quarter’s figure to 6.1%.\n\nHuntington Ingalls Industries, Inc. Price, Consensus and EPS Surprise Huntington Ingalls Industries, Inc. Price, Consensus and EPS Surprise\n\nHuntington Ingalls Industries, Inc. price-consensus-eps-surprise-chart | Huntington Ingalls Industries, Inc. Quote\n\nHII received orders worth $3.1 billion in the reported quarter. As a result, its total backlog reached $48.4 billion as of Mar 31, 2024.\n\nSegmental Performance\n\nNewport News Shipbuilding: Revenues totaled $1.43 billion in this segment, down 4.8% year over year due to lower volumes from aircraft carriers and the Virginia class submarine program.\n\nThe segment reported operating earnings of $82 million, down 2.4% year over year due to lower volumes.\n\nIngalls Shipbuilding: Revenues in this segment totaled $655 million, up 13.5% year over year, primarily driven by higher volumes from amphibious assault ships and surface combatants.\n\nThe segment’s operating income of $60 million increased 9.1% year over year, partly driven by higher volumes.\n\nMission Technologies: Revenues in this segment totaled $750 million, up 20.2% year over year. The upside was primarily driven by higher volumes from C5ISR and cyber, electronic warfare and space.\n\nThe operating income soared 64.7% year over year to $28 million, driven by higher volumes.\n\nFinancial Update\n\nThe company’s cash and cash equivalents as of Mar 31, 2024, totaled $10 million, significantly down from $430 million as of Dec 31, 2023.\n\nThe long-term debt as of Mar 31, 2024, totaled $2.24 billion compared with the 2023-end level of $2.21 billion.\n\nThe cash outflow from operating activities amounted to $202 million compared with $9 million in the previous year.\n\nIt generated free cash outflow worth $274 million compared with $49 million in the first quarter of 2023.\n\nGuidance\n\nHuntington Ingalls reiterated its 2024 guidance. The company still expects 2024 shipbuilding revenues to be in the range of $8.8-$9.1 billion.\n\nStory continues\n\nFor Mission Technologies, HII continues to expect revenues in the range of $2.70-$2.75 billion.\n\nThe company expects free cash flow in the band of $600-$700 million for 2024.\n\nZacks Rank\n\nHuntington Ingalls currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nRecent Defense Releases\n\nGeneral Dynamics Corporation GD reported first-quarter 2024 earnings per share (EPS) of $2.88, which missed the Zacks Consensus Estimate of $2.89 by 0.4%. However, the figure increased 9.1% from $2.64 per share recorded in the year-ago quarter.\n\nGD’s revenues of $10,731 million beat the Zacks Consensus Estimate of $10,201 million by 5.2%. The top line also improved 8.6% from the prior-year reported figure.\n\nRTX Corporation’s RTX first-quarter 2024 adjusted EPS of $1.34 beat the Zacks Consensus Estimate of $1.23 by 8.9%. The bottom line also improved 9.8% from the year-ago quarter’s level of $1.22.\n\nRTX’s net sales were $19,305 million, which surpassed the Zacks Consensus Estimate of $18,412.6 million by 4.8%. The top line also improved 12% from $17,214 million recorded in the first quarter of 2023.\n\nLockheed Martin Corporation LMT reported first-quarter 2024 adjusted earnings of $6.33 per share, which beat the Zacks Consensus Estimate of $5.80 by 9.1%. The bottom line, however, declined 1.6% from the year-ago quarter's recorded figure of $6.43.\n\nLMT’s net sales were $17.20 billion, which surpassed the Zacks Consensus Estimate of $16.19 billion by 6.2%. The top line also increased 13.7% from $15.13 billion reported a year ago.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nHuntington Ingalls Industries, Inc. (HII) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/huntington-ingalls-hii-q1-earnings-140700265.html",
        "symbols": [
            "0IUC.LSE",
            "0J76.LSE",
            "0R3E.LSE",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "HI4.F",
            "HI4.STU",
            "HII.US",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.019,
            "neu": 0.878,
            "pos": 0.103
        }
    }
]