[
    {
        "date": "2024-06-05T17:46:27+00:00",
        "title": "3 Defense Stocks to Defend Your Portfolio Against Economic Mayhem",
        "content": "While “economic mayhem” is far from being my base case scenario, I can envision a few events that could indeed play havoc with the U.S. economy. One problem that could trigger economic mayhem is the huge, unsustainable amount of debt that the U.S. government has accumulated. BlueBay asset manager Mark Dowling told the Economist that “sooner or later” the debt would likely produce “a big earthquake.”\n\nIn another potential scenario, a massive war in the Mideast could cause oil prices to leap to $150 per barrel or more, causing the U.S. to enter a recession. And finally, a large terrorist attack against the U.S. certainly can’t be ruled out, especially because many terrorists may have entered America across its southern border. Additionally, America’s involvement in the Israel-Hamas War makes a terrorist attack more likely.\n\nGiven the ongoing wars in Gaza and Ukraine, along with widespread fear of Russia, China and Iran, the demand for U.S. weapons is likely to stay strong going forward no matter what happens economically. As a result, defense stocks are likely to prove fairly resilient if the economy does take a big hit. Here are three top defense names to buy.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nRTX (RTX) A German army mobile Raytheon (RTX) MIM-104 Patriot surface-to-air missile (SAM) system on display during the Laage airbase open house.\n\nSource: VanderWolf Images / Shutterstock.com\n\nRTX (NYSE:RTX) includes the defense company formerly known as Raytheon and United Technologies.\n\nThe defense contractor is clearly benefiting tremendously from geopolitical conflicts and potential conflicts around the world. For example, in Q1 the firm sold $1.2 billion of Patriot anti-air defense systems to Germany, and Ukraine ordered $282 million of Advanced Surface-to-Air Missile Systems from it. The company also received $1.6 billion of  “classified bookings,” and announced a $301.76 million contract modification from the U.S. Navy on May 31.\n\nCEO Chris Calio noted that America’s defense budget for this year is favorable for RTX, as it funds the company’s key offerings. Those include “next generation propulsion, critical munitions, and upgrades to the F-135” and RTX provides the engines for the F-35 Joint Strike Fighter. The CEO indicated that RTX would also benefit from the Pentagon’s spending on “counter unmanned aircraft and hypersonics.”\n\nWhile a significant portion of RTX’s revenue and profit are generated from commercial airlines, I expect that business to be relatively resilient to economic shocks as well, given the very long-term outlook that airlines have to adopt.\n\nKratos Defense & Security (KTOS) a group of soldiers in the desert with a drone flying over their heads\n\nSource: Shutterstock\n\nStory continues\n\nAs I noted in a previous column, Kratos Defense & Security (NASDAQ:KTOS) “provides a variety of defense products, but specializes in developing extremely high tech military drones.”\n\nIn the previous column, I noted Kratos appeared to have been obtaining a large number of contracts from the Pentagon. As a result, I’m not surprised to see the firm reported excellent first-quarter results on May 7. Specifically, its revenue jumped 20% versus the same period a year earlier while its net income came in at $1.3 million, up from a loss of $7 million in Q1 of 2022. Also unsurprisingly, the company’s drone business powered the strong showing as its unmanned systems revenue jumped 24% year-over-year to $59.4 million. Kratos expects its drone business to expand by a robust 20% in 2024.\n\nThe defense contractor has developed the Valkyrie, an AI-powered combat drone. With China and Russia investing a great deal in AI and Iran developing many drones of its own, the U.S. and its allies are likely to continue investing a great deal of money in Kratos’ AI-powered, advanced drones to counter their adversaries.\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) C-130J Super Hercules of the United States Air Force performing at Aero India 2017.\n\nSource: Joe Ravi / Shutterstock.com\n\nLockheed Martin (NYSE:LMT) is a large, multifaceted defense contactor. Over the U.S. government’s last fiscal year, the company benefited from multiple initiatives undertaken by the Pentagon, including increases in its purchases of Lockheed’s F-35 fighter jets, combat rescue helicopters and C130 military transport aircraft. During the current fiscal year, the firm expects to get boosts from elevated outlays on the Sikorsky CH-53K helicopters, its space hypersonic weapon and missile defense systems, which it refers to as the Next Generation Interceptor.\n\nLast quarter, the company’s top line jumped to $17.2 billion, up from $15.1 billion during the same period a year earlier. The company’s earnings per share came in at $6.42, down from $6.62 in Q1 of 2023. However, easing inflationary pressures should boost the company’s bottom line going forward.\n\nWhat’s more, in 2023 Lockheed’s operating income jumped to $9.06 billion from $7.47 billion in 2022, and the shares have a rather low enterprise value/EBITDA ratio of 12.4 times.\n\nOn the date of publication, Larry Ramer did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines\n\nLarry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been SMCI, INTC, and MGM. You can reach him on Stocktwits at @larryramer.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 3 Defense Stocks to Defend Your Portfolio Against Economic Mayhem appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-defense-stocks-defend-portfolio-174627875.html",
        "symbols": [
            "0JS0.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "KTOS.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "WF5A.BE",
            "WF5A.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.065,
            "neu": 0.815,
            "pos": 0.12
        }
    },
    {
        "date": "2024-06-05T17:09:00+00:00",
        "title": "Lockheed Martin to buy up to 25 rocket launches from Firefly Aerospace",
        "content": "(Reuters) - Lockheed Martin has entered a purchase agreement with Firefly Aerospace for up to 25 launches on its Alpha rocket by 2029, the U.S. defense contractor said on Wednesday.\n\nTexas-based Firefly makes small and medium launch vehicles for commercial launches to orbit. Its small-launch vehicle, Alpha, will fly Lockheed's spacecraft and payload into low-Earth orbit from its facilities on west and east coasts, Lockheed said.\n\nThe companies did not disclose the financial details of the deal. The lower-cost launch vehicles would help reduce risk for its self-funded technology demonstration missions, Lockheed said.\n\nProfit at its space division jumped in its latest quarter, benefiting from higher launch volume in United Launch Alliance, its joint venture with planemaker Boeing.\n\nADVERTISEMENT\n\nBoeing and Lockheed merged their rocket programs in 2006 and are looking to sell the jointly-owned venture, media reports said.\n\n(Reporting by Pratyush Thakur in Bengaluru; Editing by Mohammed Safi Shamsi)",
        "link": "https://ca.finance.yahoo.com/news/lockheed-martin-buy-25-rocket-170900358.html",
        "symbols": [
            "0BOE.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.886,
            "neg": 0.013,
            "neu": 0.895,
            "pos": 0.092
        }
    },
    {
        "date": "2024-06-05T13:23:00+00:00",
        "title": "Lockheed (LMT) Clinches a $1.9 billion Contract for HIMARS",
        "content": "Lockheed Martin Corp. LMT recently secured a modification contract for High Mobility Artillery Rocket Systems (“HIMARS”). The award has been provided by the Army Contracting Command, Redstone Arsenal, AL.\r\nValued at $1.93 billion, the contract is expected to be completed by May 31, 2028.\n\nWhat’s Favoring Lockheed?\n\nNations across the globe are reinforcing their military capabilities to strengthen their defense structure in the rapidly evolving threat environment worldwide. Since missiles play a very important role in military missions, the demand for these weapons systems and their associated parts has gained solid traction in recent times. This, in turn, has resulted in a significant order inflow (like the latest one) for Lockheed, which enjoys a dominant position in the field of missile development.\r\n\r\nTo this end, it is imperative to mention that LMT’s HIMARS is the most technically advanced, affordable and sustainable artillery solution that can fire Guided Multiple Launch Rocket System (“GMLRS”) rockets, ATACMS missiles, the next-generation Precision Strike Missile (PrSM) and Extended-Range GMLRS rockets. It boasts the capability to launch the entire Multiple Launch Rocket System family of munitions.\n\nSuch remarkable features of the HIMARS are likely to have been boosting its demand of late. This can be gauged from the fact that there are currently more than 600 HIMARS fielded systems worldwide.\n\nGrowth Prospect\n\nThe global peace index reflects an unstable environment worldwide, with the Russia-Ukraine war continuing for more than two years now, in addition to the ongoing hostility in different parts of the Middle East. This has set the stage for the defense sector to witness rising demand for military products, particularly missiles, as nations worldwide strive to protect their borders from unprecedented attacks. As the demand for missiles is on the rise, so is the demand for missile launchers like HIMARS.\n\nTherefore, the growth prospect for the missile and missile defense systems market remains solid. To this end, the Mordor Intelligence firm projects the missile and missile defense systems market to witness a CAGR of 5% over the 2024-2029 period.\n\nLMT’s proficiency in manufacturing missiles and associated missile launchers, particularly that of HIMARS, positions it favorably to capitalize on the growth opportunities offered by the aforementioned market. The fact that Lockheed remains on track to double the production of its HIMARS to 96 per year by the end of 2024, makes us confident that the company will witness more order flows for this product, like the latest one.\n\nStory continues\n\nThe company also excels in manufacturing air-to-air missiles, helicopter-launched anti-armor missiles, kinetic energy hyper-velocity missiles, hit-to-kill air defense systems, as well as cruise missiles. Such a varied number of missiles in its product portfolio will surely fetch more notable contracts for Lockheed in the near future, thereby bolstering its revenue generation prospects.\n\nOpportunities for Peers\n\nLMT apart, other prominent defense contractors that stand to benefit from the expanding missile and missile defense systems market are as follows:\r\n\r\nNorthrop Grumman NOC: Northrop is a prominent developer of missile systems and counter systems, including strategic deterrents, subsystems and components. Its product portfolio includes the Integrated Air and Missile Defense Battle Command System, the GMLRS propulsion and warhead subsystems, the Hypersonic Attack Cruise Missile, the Advanced Anti-Radiation Guided Missile and a few other combat-proven products that support missile defense systems.\r\n\r\nNOC boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for Northrop’s 2024 sales indicates an improvement of 4.6% from the 2023 reported figure.\r\n\r\nGeneral Dynamics GD: The company’s Ordnance and Tactical Systems unit is the system integrator of the 2.75-inch Hydra-70 family of rockets. It is a key supplier of major strategic and tactical missile programs, ranging from warheads to missile housings to structural components to solid rocket motor cases.\n\nGD has a long-term earnings growth rate of 12%. The consensus estimate for General Dynamics’ 2024 sales indicates an improvement of 10.5% from the 2023 reported figure.\n\nRTX Corp. RTX: RTX’s business unit, Missiles and Defense, is a prominent U.S. missile maker. Its portfolio includes the AIM-9X Sidewinder missile, the AIM-9X Block II missile, the RAM-guided missile weapon system, etc.\n\nRTX boasts a long-term earnings growth rate of 10.6%. The Zacks Consensus Estimate for its 2024 sales indicates an improvement of 6.2% from the 2023 reported figure.\n\nPrice Movement\n\nIn the past year, shares of Lockheed have risen 5.1% against the industry’s 7.4% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLockheed currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-clinches-1-9-132300940.html",
        "symbols": [
            "0IUC.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "GD.MX",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NTH.BE",
            "NTH.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.045,
            "neu": 0.78,
            "pos": 0.175
        }
    },
    {
        "date": "2024-06-05T13:00:00+00:00",
        "title": "Skunk Works® Demonstrates AI for Air-to-Air Tactical Intercepts",
        "content": "IOWA CITY, Iowa, June 5, 2024 /PRNewswire/ -- Lockheed Martin Skunk Works® (NYSE: LMT) partnered with the University of Iowa's Operator Performance Laboratory (OPL) to demonstrate the use of artificial intelligence (AI) in air-to-air intercept scenarios. Two University of Iowa Operator Performance Laboratory L-29 Delfin jets conduct simulated air-to-air intercepts using AI as part of flight demonstrations in partnership with Lockheed Martin Skunk Works. Photo by: University of Iowa’s Operator Performance Laboratory\n\nThe successful flights are a significant milestone for Skunk Works' Tactical AI team, in which AI directly flew and conducted tactical exercises with a full-scale, live aircraft – one of OPL's L-29 Delfin jets – using heading, speed and altitude commands. The team executed simulated-to-real transfer test objectives against a virtual adversary in offensive and defensive risk postures.\n\nEight test cases were conducted per flight to exercise the AI agent in a variety of situations, from standard head-to-head fights to off-aspect encounters, missile support and missile defeat scenarios. The team was encouraged to see clean sim-to-real transfer of learned behaviors and that the AI agent appeared intentional and decisive in its actions.\n\n\"This was the first live exercise of the new flight interface; it's thrilling to see the separate components successfully integrate on the L-29 to demonstrate new capabilities. The complete system performed even better in live flight than in simulation,\" said Dr. Tom \"Mach\" Schnell, OPL professor at Iowa Technology Institute.\n\n\"Live flight tests are a crucial aspect of advancing our expertise in AI and autonomy. These flights are powerful demonstrations of our ability to quickly and affordably develop and test operationally relevant AI capabilities,\" said Matthew \"Gabe\" Beard, Lockheed Martin Skunk Works autonomy/AI and machine learning engineering manager.\n\nThese flight tests are part of a broader initiative to rapidly develop and test AI-driven autonomy for air-to-air missions. Several other flight tests are planned for this year, building on these achievements, and increasing the complexity by introducing additional aircraft into offensive counter air and battle management scenarios. Lockheed Martin is continuously elevating AI mission performance in operationally representative simulated environments, using open mission systems standards to ensure broad compatibility and rapid transition with future platforms.\n\nLockheed Martin provides AI and machine learning solutions that augment human performance by processing, fusing, and analyzing tremendous volumes of data to give our customers actionable intelligence and a strategic advantage. Lockheed Martin is aligned and closely adheres to the U.S. Department of Defense's guidance on the ethical and safe use of autonomous systems. Humans are and will remain on-the-loop, providing final decision-making authority in Lockheed Martin AI and machine learning systems.\n\nStory continues\n\nAbout Lockheed Martin\n\nLockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at Lockheedmartin.com. (PRNewsfoto/Lockheed Martin Aeronautics) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/skunk-works-demonstrates-ai-for-air-to-air-tactical-intercepts-302163728.html\n\nSOURCE Lockheed Martin Aeronautics\n\nView comments",
        "link": "https://finance.yahoo.com/news/skunk-works-demonstrates-ai-air-130000786.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.991,
            "neg": 0.034,
            "neu": 0.842,
            "pos": 0.124
        }
    },
    {
        "date": "2024-06-05T12:59:00+00:00",
        "title": "Lockheed Martin Purchases Up to 25 Rocket Launches from Firefly Aerospace",
        "content": "Companies Ink Agreement to Help Bring New Tech to Orbit Faster and Increase Access to Space\n\nDENVER, June 5, 2024 /PRNewswire/ -- Lockheed Martin (NYSE: LMT) signed an agreement with Firefly Aerospace, Inc., for up to 25 launches on the company's Alpha rocket through 2029. Lockheed Martin Logo. (PRNewsfoto/Lockheed Martin)\n\nUnder this agreement, Firefly will routinely launch a variety of future Lockheed Martin spacecraft, including new payload technologies, into low-Earth orbit from Firefly's facilities on the west and east coasts.\n\nLockheed Martin benefits from Firefly's lower-cost launch vehicle, which helps reduce risk for the company's self-funded technology demonstration missions and paves the way for future efforts. The agreement also creates the benefits of a long-term partnership between the two companies and allows for a steady manifest supporting continued growth and technology investment.\n\n\"Our goal is to accelerate the delivery of new technology solutions that are flight proven and ready to carry out our customers' critical space missions. Diversifying our options for launch services ensures our ability to prove out technologies we're developing on orbit,\" said Bob Behnken, director, Ignite Technology Acceleration at Lockheed Martin Space. \"This agreement with Firefly solidifies our strategic partnership and will help us continue to deliver new advanced capabilities that keep our armed forces and allies ahead of ready.\"\n\n\"Firefly appreciates Lockheed Martin's confidence in our rapid launch capability and support to drive critical missions for years to come,\" said Bill Weber, CEO of Firefly Aerospace. \"The Firefly team has scaled up Alpha production and testing, and significantly streamlined our launch operations to fly Alpha more frequently and responsively – enabling us to continue delivering the one metric ton rocket the industry demands.\"\n\nLockheed Martin is developing payload technologies through internal investment to support a variety of mission areas, such as earth observation, global ubiquitous communications, climate monitoring and beyond.\n\nAbout Lockheed Martin Lockheed Martin is a global defense technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready. More information at Lockheedmartin.com.\n\nPlease follow @LMNews on X for the latest announcements and news across the corporation, and @LMSpace to learn more about the latest technologies, missions and people driving the future of space.\n\nStory continues Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/lockheed-martin-purchases-up-to-25-rocket-launches-from-firefly-aerospace-302164802.html\n\nSOURCE Lockheed Martin\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-purchases-25-rocket-125900205.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.015,
            "neu": 0.813,
            "pos": 0.172
        }
    },
    {
        "date": "2024-06-05T12:57:35+00:00",
        "title": "The 2025 Millionaire’s Club: 3 Space Stocks to Buy Now",
        "content": "Space stocks are some of the hottest bets on the market right now. Thanks to our rapidly advancing technology, space has transformed into a fully inhabitable and more commercialized place for both governments and corporations. And where there’s business, there’s profit. This new industry is attracting the attention of investors, who are eager to explore the potentially lucrative opportunities that space holds.\n\nThese three space stocks provide a ticket to the profits that result from the continued exploration and technological use of space. As providers of machines and technology and pioneers of new business opportunities in space, there are no better stocks to get your hands on now for serious profit as the industry grows.\n\nLet’s learn more about these stocks’ newest products and long-term deals with government agencies that have secured their foothold in the space market for years to come.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nLeidos Holdings (LDOS) Leidos (LDOS) logo on the side of an office building\n\nSource: Jer123 / Shutterstock.com\n\nLeidos Holdings (NYSE:LDOS) is a defense company that specializes in IT-based services for space technology and programs. Some of Leidos’s biggest customers are government agencies that work in space, such as NASA, the FBI, and the U.S. Army.\n\nThe company has a history of investing significantly in expanding its services and capabilities into space. In 2020, Leidos spent $1.65 billion on Dynetics. Dynetics specializes in engineering and IT consulting and has a history of working closely with government agencies on the most challenging, technologically advanced missions.\n\nThanks to its expansion efforts, Leidos now has a firm grip on space-related tech such as payloads, mission communication systems, cargo provisions, and related hardware. These efforts have paid off, as continued business with huge customers like NASA has taken Leidos to new heights.\n\nIn its most recent quarter, Leidos smashed estimates for revenue and EPS. The company reported a 7% increase in revenue year over year and net bookings of $3.7 billion for Q1. With a backlog of $36.6 billion, the company has plenty of cash and leeway for continued investments in space and further expansion. Thus, it is an excellent buy for investors looking to get into space.\n\nVirgin Galactic Holdings (SPCE) spce stock\n\nSource: rafapress / Shutterstock.com\n\nVirgin Galactic Holdings (NYSE:SPCE) is leading the race for the massively popular space tourism business. The company completed its public release following a merger between famous investors Richard Branson and Chamath Palihapitiya.\n\nStory continues\n\nWhile this company has yet to be able to launch any passenger rockets into space, it already has a long list of reservations from wealthy individuals worldwide. Initially, the company set out to launch its first spacecraft in 2020 but could not meet its goal.\n\nHowever, this stock is so exciting because of its incredible potential once it sees lift-off. More than 700 passengers worldwide have already put their names on the waiting list. The approximate cost for each passenger is over $400,000. The potential cash flow is undeniable.\n\nVirgin Galactic recently announced plans to begin Delta-class flight service in 2026. The craft is projected to hold six passengers and complete eight monthly flights. Virgin Galactic will have a monthly revenue potential of just shy of $29 million a month.\n\nIf you can stomach some risk and have faith in its ability to make this plan a reality, now is a great time to get on board.\n\nLockheed Martin (LMT) Close top view of a Lockheed Martin (LMT) F-35C Lightning II with afterburner on\n\nSource: ranchorunner / Shutterstock.com\n\nLockheed Martin (NYSE:LMT) is one of the most successful companies in space technology. It provides satellites and missiles to government agencies like NASA and the Department of Defense. However, the company has commercial ventures and does not limit itself to government customers.\n\nEarlier this year, Lockheed Martin won a contract with aircraft manufacturing giant Boeing, securing its position at the forefront of satellite technology and design. For its other prominent space offerings, missiles, the company has the most advanced hypersonic technology in the field and secured a large contract with the U.S. Army for its tech.\n\nThe space department accounted for 19% of net sales in the most recent quarter, and the company saw a net earnings of $6.39 per share. Thus, with a secure space position and many other solid revenue streams, Lockheed is a fantastic investment for investors this year.\n\nOn the date of publication, Joel Lim did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nJoel Lim is a contributor at InvestorPlace.com and a finance content contractor who creates content for several companies like LTSE and Realtor, along with financial publications, including Business Insider, Yahoo Finance, Mises Institution and Foundation for Economic Education.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post The 2025 Millionaire’s Club: 3 Space Stocks to Buy Now appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/2025-millionaire-club-3-space-125735767.html",
        "symbols": [
            "0R3E.LSE",
            "L1DO34.SA",
            "LDOS.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "S6IA.F",
            "SPCE.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.009,
            "neu": 0.878,
            "pos": 0.113
        }
    },
    {
        "date": "2024-06-05T00:00:00+00:00",
        "title": "The 2025 Millionaire&#039;s Club: 3 Space Stocks to Buy Now",
        "content": "Don’t miss out on these space stocks primed to grow through cutting-edge technology and massive contracts with government agencies.",
        "link": "https://investorplace.com/2024/06/the-2025-millionaires-club-3-space-stocks-to-buy-now/",
        "symbols": [
            "LDOS.US",
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.153,
            "neg": 0.082,
            "neu": 0.918,
            "pos": 0
        }
    },
    {
        "date": "2024-06-05T00:00:00+00:00",
        "title": "3 Defense Stocks to Defend Your Portfolio Against Economic Mayhem",
        "content": "The U.S. could indeed enter economic mayhem, and, given the state of the world,  defense stocks are a very good way to defend your portfolio.",
        "link": "https://investorplace.com/2024/06/3-defense-stocks-to-defend-your-portfolio-against-economic-mayhem/",
        "symbols": [
            "KTOS.US",
            "LMT.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.567,
            "neg": 0,
            "neu": 0.825,
            "pos": 0.175
        }
    }
]