[
    {
        "date": "2024-07-05T19:50:47+00:00",
        "title": "Lockheed Martin Insiders Sold US$9.4m Of Shares Suggesting Hesitancy",
        "content": "In the last year, many Lockheed Martin Corporation (NYSE:LMT) insiders sold a substantial stake in the company which may have sparked shareholders' attention. When analyzing insider transactions, it is usually more valuable to know whether insiders are buying versus knowing if they are selling, as the latter sends an ambiguous message. However, shareholders should take a deeper look if several insiders are selling stock over a specific time period.\n\nWhile insider transactions are not the most important thing when it comes to long-term investing, we do think it is perfectly logical to keep tabs on what insiders are doing.\n\nCheck out our latest analysis for Lockheed Martin\n\nLockheed Martin Insider Transactions Over The Last Year\n\nIn the last twelve months, the biggest single sale by an insider was when the Chief Operating Officer, Frank St. John, sold US$2.8m worth of shares at a price of US$428 per share. So it's clear an insider wanted to take some cash off the table, even below the current price of US$466. We generally consider it a negative if insiders have been selling, especially if they did so below the current price, because it implies that they considered a lower price to be reasonable. However, while insider selling is sometimes discouraging, it's only a weak signal. It is worth noting that this sale was 100% of Frank St. John's holding.\n\nIn total, Lockheed Martin insiders sold more than they bought over the last year. You can see the insider transactions (by companies and individuals) over the last year depicted in the chart below. If you click on the chart, you can see all the individual transactions, including the share price, individual, and the date! insider-trading-volume\n\nI will like Lockheed Martin better if I see some big insider buys. While we wait, check out this freelist of undervalued and small cap stocks with considerable, recent, insider buying.\n\nInsider Ownership Of Lockheed Martin\n\nLooking at the total insider shareholdings in a company can help to inform your view of whether they are well aligned with common shareholders. Usually, the higher the insider ownership, the more likely it is that insiders will be incentivised to build the company for the long term. Insiders own 0.06% of Lockheed Martin shares, worth about US$64m. While this is a strong but not outstanding level of insider ownership, it's enough to indicate some alignment between management and smaller shareholders.\n\nSo What Does This Data Suggest About Lockheed Martin Insiders?\n\nIt doesn't really mean much that no insider has traded Lockheed Martin shares in the last quarter. Still, the insider transactions at Lockheed Martin in the last 12 months are not very heartening. The modest level of insider ownership is, at least, some comfort. So while it's helpful to know what insiders are doing in terms of buying or selling, it's also helpful to know the risks that a particular company is facing. Every company has risks, and we've spotted 1 warning sign for Lockheed Martin you should know about.\n\nStory continues\n\nOf course, you might find a fantastic investment by looking elsewhere. So take a peek at this freelist of interesting companies.\n\nFor the purposes of this article, insiders are those individuals who report their transactions to the relevant regulatory body. We currently account for open market transactions and private dispositions of direct interests only, but not derivative transactions or indirect interests.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-insiders-sold-us-195047682.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.981,
            "neg": 0.036,
            "neu": 0.884,
            "pos": 0.079
        }
    }
]