[
    {
        "date": "2024-09-11T22:17:00+00:00",
        "title": "Top Aerospace &amp; Defense Stocks to Consider as We Commemorate 9/11",
        "content": "It’s been over 20 years since the September 11th attacks but many of us vividly remember where we were and what we were doing on this tragic day.\n\nOne of the gifts of the stock market is that investors have the option to invest in companies that may help to prevent these heinous acts in the future.\n\nOutside of reaping potential monetary gains, these types of investments may fulfill a call to support and strengthen our patriotism and the ability to keep our world safe from future terror.\n\nThe Top-Rated Aerospace-Defense Industry\n\nNotably, the Zacks Aerospace-Defense Industry is currently in the top 9% of over 250 Zacks industries. One of the well-known companies to consider in the space is Lockheed Martin LMT, a crucial contributor to homeland security.\n\nHeadquartered near Washington D.C., Lockheed Martin is the largest defense contractor in the world with its operations extending to aeronautics including the production of fighter jets along with information and intelligence security.\n\nRising over 20% YTD, Lockheed Martin’s stock currently lands a Zacks Rank #3 (Hold). While there could be better buying opportuniteis ahead, longer-term investors may still be rewarded considering the defense giant’s robust top and bottom lines. Plus, LMT offers a generous 2.2% annual dividend yield.\n\nFurthermore, Lockheed Martin’s defense technology solutions remain in high demand with the company having a backlog of $160 billion which is 2X greater than its annual revenue. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nHidden Gem\n\nSporting a Zacks Rank #1 (Strong Buy), Air Industries Group AIRI has been a prime beneficiary among the top-rated aerospace-defense industry. Based in New York, Air Industries’ stock has skyrocketed over +80% YTD as a manufacturer of landing gear components and other critical safety parts to the defense and commercial markets. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nWith its stock trading around $6, the continued rally in AIRI comes as earnings estimate revisions have soared in the last 30 days. Even better, Air Industries is on the cusp of turning a profit next year with fiscal 2025 EPS projected at $0.26.\n\nAir Industries' top line growth also alludes to its future earnings potential with total sales expected to be up 7% this year and projected to rise another 9% in FY25 to $60 million. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nPalantir Technologies PLTR\n\nAmong the business services sector, Palantir Technologies has remained one of the most intriguing companies to invest in regarding homeland security. Located in Denver Colorado, Palantir provides artificial intelligence-driven software platforms to the intelligence community including counter-terrorism agencies.\n\nStory continues\n\nPalantir’s stock has soared +100% year to date and sports a Zack Rank #2 (Buy) with high double-digit top and bottom line growth in the forecast for FY24 and FY25. Reassuringly, earnings estimate revisions have remained higher in the last 30 days with it noteworthy that Palantir’s Zacks Technology Services Industry is in the top 28% of all Zacks industries.\n\nPLTR has soared over +200% since its IPO in 2020 with investors becoming more engaged by Palantir’s AI offerings and the fact that the company is already profitable. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nFinal Thoughts\n\nAs we commemorate 9/11 these top aerospace and defense stocks may certainly be attractive not only for financial gains but to support and invest in homeland security.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nAir Industries Group (AIRI) : Free Stock Analysis Report\n\nPalantir Technologies Inc. (PLTR) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/top-aerospace-defense-stocks-consider-221700206.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "P2LT34.SA",
            "PLTR.US",
            "PTX.F",
            "PTX.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.016,
            "neu": 0.765,
            "pos": 0.22
        }
    },
    {
        "date": "2024-09-11T13:00:11+00:00",
        "title": "Lockheed Martin Corporation (LMT) is Attracting Investor Attention: Here is What You Should Know",
        "content": "Lockheed Martin (LMT) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\n\nOver the past month, shares of this aerospace and defense company have returned +2.3%, compared to the Zacks S&P 500 composite's +2.9% change. During this period, the Zacks Aerospace - Defense industry, which Lockheed falls in, has gained 2.3%. The key question now is: What could be the stock's future direction?\n\nAlthough media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision.\n\nRevisions to Earnings Estimates\n\nHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.\n\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nLockheed is expected to post earnings of $6.40 per share for the current quarter, representing a year-over-year change of -5.5%. Over the last 30 days, the Zacks Consensus Estimate has changed -0.1%.\n\nThe consensus earnings estimate of $26.49 for the current fiscal year indicates a year-over-year change of -4.8%. This estimate has changed -0.2% over the last 30 days.\n\nFor the next fiscal year, the consensus earnings estimate of $28.86 indicates a change of +8.9% from what Lockheed is expected to report a year ago. Over the past month, the estimate has changed +0.2%.\n\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Lockheed is rated Zacks Rank #3 (Hold).\n\nStory continues\n\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n\n12 Month EPS\n\nRevenue Growth Forecast\n\nWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\n\nFor Lockheed, the consensus sales estimate for the current quarter of $17.45 billion indicates a year-over-year change of +3.4%. For the current and next fiscal years, $71.14 billion and $73.99 billion estimates indicate +5.3% and +4% changes, respectively.\n\nLast Reported Results and Surprise History\n\nLockheed reported revenues of $18.12 billion in the last reported quarter, representing a year-over-year change of +8.6%. EPS of $7.11 for the same period compares with $6.73 a year ago.\n\nCompared to the Zacks Consensus Estimate of $17.12 billion, the reported revenues represent a surprise of +5.88%. The EPS surprise was +10.23%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\n\nValuation\n\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\n\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\n\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\n\nLockheed is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\n\nConclusion\n\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Lockheed. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-corporation-lmt-attracting-130011813.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.006,
            "neu": 0.861,
            "pos": 0.133
        }
    }
]