[
    {
        "date": "2024-08-07T22:05:45+00:00",
        "title": "BA vs LMT: Which Aerospace Stock Is the Better Buy?",
        "content": "In this piece, I evaluated two aerospace stocks, Boeing (BA) and Lockheed Martin (LMT), using TipRanks’ Comparison Tool to see which is better. A closer look suggests a bearish view of Boeing and a neutral view of Lockheed Martin.\n\nBoeing is the largest aerospace company in the world, and it sells airplanes, rockets and missile systems, satellites, and more. Lockheed Martin designs, develops, and manufactures jets, missiles, space systems, and more, mostly for the U.S. Department of Defense and other federal agencies.\n\nShares of Boeing have plunged 37% year-to-date and are down 31% over the last year. On the other hand, Lockheed Martin stock has surged 23% year-to-date, accounting for almost all of its one-year gain of 25%.\n\nDespite such a dramatic difference in their share-price performances, the two companies’ valuations (on a sales basis) are not that far off.\n\nSince Boeing is not profitable, we’ll compare the companies’ price-to-sales (P/S) ratios to gauge their valuations against each other and that of their industry. We’ll also consider Lockheed Martin’s price-to-earnings (P/E) ratio for additional information.\n\nFor comparison, the aerospace and defense industry is trading at a P/S of 2.2x versus its three-year average of 1.9x. It’s also trading at a price-to-earnings (P/E) ratio of 36.6x, higher than its three-year average of 27.1x.\n\nBoeing (NYSE:BA)\n\nAt a P/S of 1.4x, Boeing is trading at a discount to its industry and to Lockheed Martin. However, that discount is absolutely warranted due to the many problems the company faces, so a bearish view seems appropriate.\n\nFor one thing, Boeing faces increased scrutiny as the National Transportation Safety Board (NTSB) holds two days of hearings on a mid-air emergency involving the company’s 737-9 MAX plane. In the January incident, a door plug blew out. The NTSB rebuked Boeing earlier this summer for overstepping in sharing details about the agency’s investigation during a media briefing.\n\nAside from the problems with the Boeing MAX aircraft, the company also faces problems with the astronaut crew it sent up on its Starliner spacecraft. They were supposed to be home on June 14, but issues with the Starliner have kept them stranded on the International Space Station (ISS).\n\nThe issues lie with the thrusters, which experienced significant strain during the ascent. Some of those thrusters even failed, and there was an issue with a helium leak. NASA is now considering “all options” to get that crew home, and reports now suggest a greater than 50/50 chance that the Starliner crew won’t be going home on Boeing’s spacecraft.\n\nStory continues\n\nBoeing is also running out of time to move the Starliner from the dock at the International Space Station. The ISS needs that dock for another upcoming mission.\n\nAdditionally, Boeing faces problems with its aerial refueling and transport aircraft, the KC-46. Additionally, the Federal Aviation Administration is investigating a new directive around Boeing’s 787 Dreamliner, which would require record maintenance checks on the aircraft due to a missed test for a landing gear.\n\nDue to all these issues, it just seems like a good idea to avoid Boeing stock at this point.\n\nWhat Is the Price Target for BA Stock?\n\nBoeing has a Moderate buy consensus rating based on 15 Buys, four Holds, and one Sell rating assigned over the last three months. At $218.00, the average Boeing stock price target implies upside potential of 33.2%.\n\nLockheed Martin (NYSE:LMT)\n\nAt a P/S of 1.8x, Lockheed Martin is trading roughly in line with the industry’s three-year average, but on a P/E basis, it’s trading at a significant discount at 19.8x. However, its Relative Strength Index (RSI) of 83.8 suggests the stock could be overdue for a correction, calling for a neutral rating until that comes back down.\n\nI’d really like to assign a bullish view to Lockheed Martin, but that extremely high RSI gives me pause. An RSI over 70 suggests that a stock is in overbought territory and signals a possible correction around the corner — despite the discounted valuation.\n\nTensions in the Middle East are ratcheting up, which is one reason for the latest rise in the shares. As such, Lockheed Martin’s greater focus on defense over commercial aircraft is another reason to prefer its stock over Boeing’s.\n\nThus, I would monitor Lockheed Martin stock for the correction that appears to be coming and buy on any dip that occurs.\n\nWhat Is the Price Target for LMT Stock?\n\nLockheed Martin has a Moderate Buy consensus rating based on seven Buys, six Holds, and one Sell rating assigned over the last three months. At $554.46, the average Lockheed Martin stock price target implies upside potential of 0.9%.\n\nConclusion: Bearish on BA, Neutral on LMT\n\nLockheed Martin looks like a stock worth buying and holding for the long term, but with a correction looking likely in the near term, a buy-the-dip opportunity may present itself. The company’s valuation looks quite attractive, even after the recent run-up in the shares, which is why it gets a neutral valuation — pending an exit from overbought territory.\n\nOn the other hand, Boeing has so many problems that its stock looks too risky to buy and hold for the long term. Thus, I would avoid BA stock at all costs. There are plenty of other aerospace plays that are better.\n\nDisclosure\n\nView comments",
        "link": "https://finance.yahoo.com/news/ba-vs-lmt-aerospace-stock-220545934.html",
        "symbols": [
            "0BOE.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.99,
            "neg": 0.04,
            "neu": 0.877,
            "pos": 0.083
        }
    },
    {
        "date": "2024-08-07T20:14:37+00:00",
        "title": "What Are the Hottest Space Stocks Right Now? 3 Top Picks.",
        "content": "With the stock market crashing, nothing may seem “hot” at the moment but don’t be blinded by short-term events. It is when stocks are down that you want to buy. It’s the perfect opportunity to put into action the philosophy of buy low, sell high.\n\nAnd some of the hottest stocks will be those involved in the new space race. Space stocks offer the potential for tremendous returns, so long as you have an appropriate investment horizon.\n\nEven in normal times, investors should hold a stock for a minimum of three to five years but a decade would be best. Or as Warren Buffett once said, “the best time to sell is never.” But in turbulent markets, a long-term investment horizon is essential.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nOf course, even Buffett doesn’t strictly follow that advice. He just dumped a boatload of stock onto the market to bring Berkshire Hathaway’s (NYSE:BRK-A, NYSE:BRK-B) cash position to a massive $277 billion. But that means he has plenty of dry powder to be a buyer when the dust settles. You should too.\n\nBelow are the three best space stocks to consider buying for your portfolio with those cash reserves.\n\nLockheed Martin (LMT) Close top view of a Lockheed Martin (LMT) F-35C Lightning II with afterburner on\n\nSource: ranchorunner / Shutterstock.com\n\nAs the largest U.S. defense contractor, Lockheed Martin (NYSE:LMT) doesn’t receive much attention as a space stock. However, the segment is a growing one and generated over $3.2 billion in revenue in the second quarter, or almost 18% of the total. Space also accounted for 17% of Lockheed’s operating profits, giving it 11% operating margins.\n\nIt’s true that buying Lockheed stock means you are primarily buying a military contractor, but one with a space kicker. It also means virtually all of the defense and aerospace company’s revenue comes from the government, both domestic and foreign. That does make it subject to the vagaries of defense budgets, even if it is a government priority that typically rises year-to-year. Yet with so many hot spots raging around the world and with the U.S. military’s munitions stockpiles reduced, the likelihood of any material impact on Lockheed’s business is minimal for the foreseeable future.\n\nEven in the current market collapse, LMT stock is down less than 1%, indicating it has limited downside risk. With funding from the Defense Dept. and NASA flowing through it, Lockheed is a space stock to buy.\n\nRedwire (RDW) (RKLB stock, space stocks) satellite over the Earth\n\nSource: Andrzej Puchta / Shutterstock.com\n\nThere are more than 3,400 U.S. satellites orbiting the earth that will increasingly contain hardware and infrastructure from Redwire (NYSE:RDW). The space stock provides avionics, sensors, power generation and structures for them. It is also behind rockets going into space, to the Moon and beyond.\n\nStory continues\n\nIn cooperation with Lockheed Martin, Redwire provides NASA’s Artemis program with the Orion Camera System for advanced imaging capabilities. It was also the “eyes” for Lunar Interactive’s (NASDAQ:LUNR) lunar lander that touched down on the Moon earlier this year.\n\nThe space stock also notes it is providing on-board computers for the European Space Agency’s Hera and Comet Interceptor projects. In May, it was chosen by Rocket Labs USA (NASDAQ:RKLB) to provide antenna and RF hardware for its rockets contracted by the Space Development Agency.\n\nThe space stock is still a small player but is rapidly growing. Revenue was up 52% in the first quarter to $87 million allowing it to produce adjusted EBITDA of $4.3 million. This is an up-and-coming space stock that offers exciting growth potential.\n\nARK Space Exploration & Innovation ETF (ARKX) A concept art of an astronaut with a space secene behind. Space Stocks to buy\n\nSource: Shutterstock\n\nInstead of picking and choosing a winner amongst many possibilities, buying a basket of space stocks may be a better option. ARK Space Exploration & Innovation ETF (NYSEARCA:ARKX) is one of the exchange-traded funds (ETF) actively managed by investing guru Cathie Wood. It buys stocks focused on space exploration (hence the name) but it also seeks out companies that benefit technologically from products or services that “occur beyond the surface of the Earth” (the innovation part).\n\nThat gives the ETF some wide latitude in the stocks it buys. So while investors will find the likes of Lockheed and Rocket Labs in the portfolio, there are also electric vertical takeoff & landing aircraft makersJoby Aviation (NYSE:JOBY) and Archer Aviation (NYSE:ACHR); 3-D printing stock 3D Systems (NYSE:DDD); and, inexplicably, farm equipment manufacturer Deere (NYSE:DE), though it may have to do with the GPS and satellite navigation farm equipment it offers.\n\nARK Space Exploration & Innovation ETF has $231 million in net assets and a reasonable expense ratio of 0.75%. The stock had been doing well in 2024 until the sector rotation away from tech names began last month. It dropped sharply with the market rout on Monday and trades down 8% for the year.\n\nStill, it represents a good investment for long-term investors who seek to capitalize on the renewed interest in space exploration.\n\nOn the date of publication, Rich Duprey did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nRich Duprey has written about stocks and investing for the past 20 years. His articles have appeared on Nasdaq.com, The Motley Fool, and Yahoo! Finance, and he has been referenced by U.S. and international publications, including MarketWatch, Financial Times, Forbes, Fast Company, USA Today, Milwaukee Journal Sentinel, Cheddar News, The Boston Globe, L’Express, and numerous other news outlets.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post What Are the Hottest Space Stocks Right Now? 3 Top Picks. appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/hottest-space-stocks-now-3-201437947.html",
        "symbols": [
            "0R3E.LSE",
            "ACHR.US",
            "DDD.US",
            "DE.US",
            "JOBY.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "LUNR.US",
            "RDW.US",
            "RKLB.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.024,
            "neu": 0.847,
            "pos": 0.128
        }
    },
    {
        "date": "2024-08-07T00:00:00+00:00",
        "title": "What Are the Hottest Space Stocks Right Now? 3 Top Picks.",
        "content": "Space stocks represent the next frontier in investing as they provide the opportunity for otherworldly returns.",
        "link": "https://investorplace.com/2024/08/what-are-the-hottest-space-stocks-right-now-3-top-picks/",
        "symbols": [
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.422,
            "neg": 0,
            "neu": 0.843,
            "pos": 0.157
        }
    }
]