[
    {
        "date": "2024-09-10T13:04:00+00:00",
        "title": "RTX Wins $112M Contract to Support F-35 Jet's Propulsion System",
        "content": "RTX Corp.’s RTX business segment, Pratt & Whitney, recently clinched a modification contract for the F-35 fighter jet’s propulsion system. The award has been offered by the Naval Air Systems Command, Patuxent River, MD.\n\nDetails of the Deal\n\nValued at $111.9 million, the contract is projected to be completed by December 2026. Per the terms of the deal, RTX will offer continued technical engineering, flight test support, special tooling, test equipment repair, as well as flight test spare and repair parts for the F-35 Lightning II Propulsion System Block Four Flight Test Program.\n\nThe contract will serve the U.S. Navy, Marine Corps, Air Force and F-35 Cooperative Program Partners. Work related to this deal will be carried out in East Hartford, CT; Edwards Air Force Base, CA; and Patuxent River, MD.\n\nWhat’s Favoring RTX Stock?\n\nAs countries ramp up their defense purchases to strengthen their aerial combat readiness, the demand for fighter jets has surged over the past decade. Consequently, the demand for jet engines, particularly those powering advanced fighter jets, is also gaining traction.\n\nThe F-35 fighter jet, built by the United States’ largest defense contractor, Lockheed Martin LMT, plays a key role in many nations' air defense systems. Resultantly, RTX, through its Pratt & Whitney division, which manufactures the F135 engines for the F-35 aircraft, enjoys a steady influx of orders from the U.S. Army and international partners. The latest contract win is a bright example of that.\n\nNotably, LMT’s F-35 program continues to enhance its market reach across the globe, which, in turn, sets the stage for RTX to win more contracts involving the production of the F135 engine and other associated spare parts. Evidently, in July 2024, the Greek government finalized its intention to procure 20 of Lockheed’s F-35 Lightning II aircraft, with an option to obtain another 20. No doubt such orders confirm the integration of RTX-made engines and other related parts in these jets, which, in turn, boosts the company’s revenue growth prospects.\n\nWill RTX Stock Gain in the Future?\n\nThe U.S. government's current inventory target consists of 2,456 F-35 aircraft for the U.S. Air Force, Marine Corps and Navy. Moreover, as geopolitical tensions across the globe have prompted a larger number of nations to invest more in strengthening their defense capabilities, the prospects for F-35 outside the United States also remain bright.\n\nNotably, by the 2030s, more than 600 F-35s are anticipated to work together from more than 10 European countries.\n\nStory continues\n\nSuch growth projections for the F-35 fleet across the globe should usher in more order flows for Pratt & Whitney, which, in turn, should provide a substantial boost to RTX’s revenues.\n\nOpportunities for RTX’s Peers\n\nApart from Lockheed and RTX, defense majors that stand to benefit from the expanding F-35 fleet have been discussed below.\n\nNorthrop Grumman NOC: The company is part of the international partnership involved in building three variants of the F-35 jet. It is engaged in the design and production of the AN/ASQ-242 Communications, Navigation and Identification avionics suite, which can be dynamically programmed to arm the F-35 pilot with multiple-mission capabilities, engineered for seamless transition from one mission phase to the next.\n\nNorthrop boasts a (three-to-five years) long-term earnings growth rate of 8.7%. The consensus estimate for NOC’s 2024 sales implies an improvement of 5.4% from the 2023 reported figure.\n\nBAE Systems BAESY: This defense major’s short takeoff and vertical landing experience, along with air systems sustainment, supports F-35’s combat capabilities. The company provides an electronic warfare suite for F-35 that includes fully integrated radar warning (targeting support and self-protection) to detect and defeat surface and airborne threats.\n\nBAE Systems boasts a long-term earnings growth rate of 12.4%. The Zacks Consensus Estimate for BAESY’s 2024 sales implies an improvement of 36.3% from the 2023 reported figure.\n\nPrice Performance\n\nIn the past year, shares of RTX have rallied 57.6% compared with the industry’s 3.5% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nRTX currently has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nBae Systems PLC (BAESY) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-wins-112m-contract-support-130400289.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "BA.LSE",
            "BAESF.US",
            "BAESY.US",
            "BSP.BE",
            "BSP.DU",
            "BSP.F",
            "BSP.STU",
            "BSP.XETRA",
            "BSPA.F",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.034,
            "neu": 0.796,
            "pos": 0.17
        }
    },
    {
        "date": "2024-09-10T13:01:00+00:00",
        "title": "Lockheed Martin to Deliver Two C-130J Super Hercules to Egypt",
        "content": "Lockheed Martin Corporation LMT is set to deliver two C-130J-30 Super Hercules tactical airlifters to Egypt as part of a foreign military sale facilitated by the U.S. Air Force. This was revealed at the Egypt International Air Show.\r\n \r\nWith these new airlifters, Egypt will join seven other countries in the Middle East North Africa region that rely on C-130J as a primary tactical airlift and tanker solution.\n\nMore on LMT’s C-130J\n\nLockheed Martin’s C-130J Super Hercules is one of the most sought-after tactical airlifters in the world. With rising global tensions, more nations are investing in technologically advanced aircraft that can perform well in difficult situations to boost their aerial security. The C-130J is uniquely positioned to perform well on the battlefield, thanks to its proven ability to handle a variety of mission-critical scenarios.\r\n\r\nThe aircraft’s versatility has made it essential in air fleet worldwide. With more than 545 units delivered and 3 million flight hours logged, the Super Hercules program continues to strengthen Lockheed Martin’s presence in the global defense market, enabling it to secure new contracts and expand its customer base.\n\nLMT’s Growth Opportunities\n\nWith rising global geopolitical tensions, nations are rapidly augmenting their defense purchase to strengthen their warfare capabilities. This has led to an increased demand for fighter jets, which form an integral part of a country’s defense program.\r\n\r\nPer a report by Mordor Intelligence, the global military aviation market is expected to witness a CAGR of 5.2% during the 2024-2029 period. Such projections indicate immense opportunities for Lockheed Martin to reap the benefits of the military aviation market's expansion. The company’s Aeronautics business segment is engaged in the research, design, development, manufacture, integration, sustainment and support of advanced military aircraft.\r\n\r\nNotably, Aeronautics’ major programs include the F-35 Lightning II fighter jet, the F-16 Fighting Falcon jet, the F-16 Fighting Falcon jet and the F-22 Raptor stealth fighter aircraft, in addition to the C-130J airlifter.\n\nProspects of LMT’s Peers\n\nOther defense companies that are likely to enjoy the perks of the expanding global military aviation market have been discussed below.\r\n\r\nThe Boeing Company BA is a well-known manufacturer of fighter aircraft.  The company’s product portfolio includes a range of combat-proven aircraft like the P-8, F-15, C-17 Globemaster III and T-7A Red Hawk, as well as F/A-18 and EA-18G.\r\n\r\nBoeing has a long-term (three to five years) earnings growth rate of 21.3%. The Zacks Consensus Estimate for BA’s third-quarter 2024 sales indicates year-over-year growth of 10.8%.\r\n\r\nNorthrop Grumman NOC is known for its advanced surveillance and air command systems and has been strengthening its portfolio with projects like the E-2D Advanced Hawkeye. These aircraft enhance operational readiness and provide crucial airborne early warning systems.\r\n\r\nNorthrop Gruman has a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales indicates year-over-year growth of 5.4%.\r\n\r\nRTX Corporation RTX provides advanced engines for military aircraft through its Pratt and Whitney business division. Currently, more than 7,000 Pratt and Whitney military engines are in service with 34 armed forces worldwide.\r\n \r\nRTX has a long-term earnings growth rate of 10.4%. The Zacks Consensus Estimate for RTX’s 2024 sales indicates year-over-year growth of 7%.\n\nStory continues\n\nLMT Stock’s Price Movement\n\nShares of LMT have gained 25.2% in the past three months compared with the industry’s 5.7% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLMT’s Zacks Rank\n\nLMT currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-deliver-two-c-130100135.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.031,
            "neu": 0.775,
            "pos": 0.194
        }
    },
    {
        "date": "2024-09-10T11:02:00+00:00",
        "title": "3 Incredible Dividend Growth Stocks That Can Provide a Lifetime of Passive Income",
        "content": "Passive income is crucial for maintaining your lifestyle in retirement, especially given the uncertain future of Social Security benefits. The Office of Retirement and Disability Policy, part of the Social Security Administration, projects that by 2037, the program's trust fund reserves might be exhausted, potentially reducing scheduled benefits to 76% of their current levels. This looming challenge underscores the importance of building alternative income streams for retirees.\n\nAs a result, many investors turn to dividend stocks as a cornerstone of their retirement income strategy. However, not all dividend-paying companies offer the same potential for stable, growing income. Image Source: Getty Images.\n\nThe most attractive dividend stocks share three key characteristics: payout ratios below 50%, dividend growth rates exceeding 6%, and capital appreciation that keeps pace with the broader market. These traits often indicate thriving businesses with strong cash flows and shareholder-friendly management teams -- precisely the type of companies that can provide a reliable, growing income stream for retirees.\n\nHere is a nuts-and-bolts overview of three tier 1 dividend growth stocks that tick these boxes, making them prime contenders for a passive income portfolio with a long-term focus.\n\n1. Lowe's: The home improvement giant that keeps on giving\n\nLowe's Companies(NYSE: LOW) is a leading home improvement retailer, operating over 1,700 stores across North America. The company offers a wide range of products for construction, maintenance, and remodeling, catering to both do-it-yourselfers and professional contractors. Lowe's business model benefits from the ongoing demand for home improvement and its strong brand recognition.\n\nIt has a blistering 15.2% 10-year dividend growth rate, one of the highest among large-cap equities. With a payout ratio of just 36.7%, the company maintains a significant margin of safety for income investors, ensuring the sustainability of its dividend even in the face of economic shocks.\n\nThis buffer dramatically reduces the risk of dividend cuts or suspensions, allowing investors to benefit from uninterrupted compounding. Lowe's has also aggressively reduced its share count by 41% over the past decade, effectively boosting per-share earnings and dividend growth.\n\nThe stock's forward price-to-earnings ratio (P/E) of 20.4 compares favorably to the broader market, as represented by the S&P 500, which trades at 22.5 times 2025 projected earnings. This lower valuation could amplify returns in a marketwide tilt toward value.\n\nStory continues\n\nLastly, Lowe's 1.89% dividend yield is above average for its peer group, a feature that enhances its ability to build an income snowball when held over a 10- to 20-year time span.\n\n2. Lockheed Martin: A defensive play with stable returns\n\nLockheed Martin(NYSE: LMT) is a global aerospace and defense company, specializing in the design, development, and manufacturing of advanced technology systems. The company's diverse portfolio includes military aircraft, missile systems, and space technologies. Lockheed Martin's core business model revolves around long-term government contracts, providing a stable revenue stream and visibility into future earnings.\n\nThe company has a solid 7.7% 10-year dividend growth rate, which is unusually generous for a company of Lockheed's size. With a payout ratio of 45.1%, Lockheed Martin offers prospective income investors a robust safety net, making it highly unlikely the company will reduce or suspend its dividend even during serious economic downturns. This reliability ensures consistent compounding for long-term investors.\n\nLockheed's commitment to shareholder returns is further evident in its 22% reduction in share count over the past decade, effectively boosting per-share earnings and ramping up its dividend growth.\n\nThe stock's forward P/E of 19.9 sits slightly below that of the broader market. However, Lockheed Martin's dividend yield of 2.22% is substantially higher than the S&P 500's average of 1.35%. This higher-yield, top-tier dividend growth rate and low payout ratio make the stock attractive for investors looking to build a steadily growing passive income stream.\n\n3. Target: Bull's-eye for dividend growth\n\nTarget(NYSE: TGT) is a major retailer, operating a chain of discount stores across the United States. The company offers various merchandise, including clothing, electronics, and groceries. Target's business model focuses on providing a superior shopping experience through competitive pricing, trendy product offerings, and a strong omnichannel presence.\n\nTarget is a dividend growth powerhouse with an incredible 10% 10-year dividend growth rate. The retailer's 45.4% payout ratio also provides a considerable cushion for income seekers, significantly reducing the risk of a dividend cut even in a challenging economy.\n\nOver the past decade, Target has reduced its share count by 27.7%, boosting shareholder value and supporting its aggressive dividend growth. The stock's forward P/E of 16.3 represents a significant discount compared to the S&P 500.\n\nTarget's dividend yield of 2.96% is also more than double the S&P 500's average of 1.35%, offering a compelling income proposition for dividend-focused investors. This relatively high yield, coupled with Target's scorching dividend growth rate and modest payout ratio, makes it an ideal choice for a passive income portfolio.\n\nTop picks for a passive income portfolio\n\nThese three dividend growth stocks --Lowe's, Lockheed Martin, and Target --offer investors a powerful combination of current income, long-term sustainability, and above-average dividend growth. As a bonus, all three dividend payers have outperformed the benchmark S&P 500 over the prior 10-year period in terms of total returns (including dividends and assuming reinvestment), showcasing the power of the dividend growth strategy and compounding returns. ^SPXTR Chart\n\nThese elite dividend growers thus scan as top picks for a long-term-focused passive income portfolio.\n\nShould you invest $1,000 in Lowe's Companies right now?\n\nBefore you buy stock in Lowe's Companies, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Lowe's Companies wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $630,099!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of September 9, 2024\n\nGeorge Budwell has positions in Target. The Motley Fool has positions in and recommends Target. The Motley Fool recommends Lockheed Martin and Lowe's Companies. The Motley Fool has a disclosure policy.\n\n3 Incredible Dividend Growth Stocks That Can Provide a Lifetime of Passive Income was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-incredible-dividend-growth-stocks-110200355.html",
        "symbols": [
            "LMT.US",
            "LOW.US",
            "TGT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.04,
            "neu": 0.776,
            "pos": 0.184
        }
    },
    {
        "date": "2024-09-10T07:12:00+00:00",
        "title": "Lockheed Martin and Tata Advanced Systems Announce Agreement to Expand C-130J Super Hercules Opportunities in India",
        "content": "Agreement Supports India's Medium Transport Aircraft Program and New Maintenance Facility\n\nDELHI, India, Sept. 10, 2024 /PRNewswire/ -- Lockheed Martin (NYSE: LMT) and Tata Advanced Systems Limited have entered into a teaming agreement to expand upon the companies' business relationship through the C-130J Super Hercules tactical airlifter. This announcement marks a significant step in enhancing India's defence and aerospace capabilities while also deepening India-U.S. strategic ties. Lockheed Martin and Tata Advanced Systems Limited have entered into a teaming agreement to expand upon the companies’ business relationship through the C-130J Super Hercules tactical airlifter.\n\nThis agreement provides a framework for collaboration on future potential business opportunities to include:\n\nEstablishing a Maintenance, Repair and Overhaul (MRO) facility in India to support the Indian Air Force's (IAF) existing fleet of 12 C-130Js as well as other global Super Hercules fleets; Expanding C-130J manufacturing and assembly in India to produce aircraft for the IAF's Medium Transport Aircraft (MTA) program, subject to U.S. and Indian government approvals.\n\nLockheed Martin will continue to build C-130Js for the U.S. government and other global operators at the existing Super Hercules production facility in Marietta, Georgia, USA. Lockheed Martin will establish additional production and assembly capacity in India if awarded the MTA contract.\n\n\"Collaborating with Lockheed Martin on the C-130J platform proposition for IAF's MTA project is a milestone for Tata Advanced Systems,\" said Sukaran Singh, chief executive officer and managing director of Tata Advanced Systems. \"The current announcement is also significant as it marks the entry of Tata Advanced Systems into the defence MRO space in India for large aircraft platforms. This also helps towards a deeper relationship between the two companies, adding to the aerostructure work by Tata Advanced Systems for Lockheed Martin platforms.\"\n\n\"The C-130J is known as the world's workhorse, not just for its large global presence, but also for its international supply chain partners including the single source provider of empennages — Tata Lockheed Martin Aerostructures Limited in Hyderabad,\" said Rod McLean, vice president and general manager of the Air Mobility and Maritime Missions line of business at Lockheed Martin. \"This teaming agreement between Lockheed Martin and Tata Advanced Systems further demonstrates Lockheed Martin's commitment to a self-reliant India and the degree of confidence that exists in our relationships with our partners in India and the Indian industry at large.\"\n\nThe IAF is actively seeking to acquire up to 80 medium transport aircraft and issued a request for information (RFI) last year. Lockheed Martin responded to the RFI as the C-130J-30 Super Hercules is ideally suited to meet the requirements.\n\nStory continues\n\nLockheed Martin and Tata Advanced Systems Limited have a long-standing partnership through the Tata Lockheed Martin Aerostructures Ltd., (TLMAL) joint venture. Established in 2010, TLMAL exemplifies the government of India's\"Make in India\" objectives and has the distinction of being the single global source of C-130J empennage assemblies included on all new Super Hercules aircraft produced in the United States. To date, TLMAL has manufactured more than 220 C-130J empennages.\n\nAbout the C-130J-30\n\nThe C-130J-30 delivers unmatched interoperability with global air forces, robust industrial partnerships, and verified low lifecycle costs with significant fuel savings resulting in a reduced carbon footprint compared to other medium-sized jet airlifters. Since the arrival of India's first C-130J-30 in 2011, IAF crews have demonstrated the capabilities found only on a Super Hercules ― from landing at the world's highest airfield to daring night operations in inclement weather.\n\nAlways evolving, continually innovating and ready for what's next, the Super Hercules leads the charge by setting standards and shaping the future of tactical airlift missions. The global C-130J fleet spans 27 operators in 23 nations with 20+ air worthiness certifications. More than 3 million flight hours have been logged by 545+ C-130Js in support of 19 different mission requirements, including critical worldwide search and rescue, peacekeeping, combat delivery, maritime patrol, special operations, aerial refueling, commercial cargo transport, medevac and humanitarian response missions. Invaluable insights gained from missions in every scenario equip the C-130J for any challenge.\n\nFor additional information, visit our websites: www.lockheedmartin.com/c130 or www.lockheedmartin.com/india.\n\nAbout Lockheed Martin\n\nLockheed Martin is a global defence technology company driving innovation and advancing scientific discovery. Our all-domain mission solutions and 21st Century Security® vision accelerate the delivery of transformative technologies to ensure those we serve always stay ahead of ready.\n\nPresent in India for more than three decades, Lockheed Martin is proud of its longstanding relationships and commitment to customers and partners on existing and future programs. These range from transport, maritime and fighter aircraft, to sea and land-based air and missile defence projects, as well as capabilities in civil sectors including new and renewable energy. A strategic partner and developer of sovereign industrial, workforce and enterprise capability, Lockheed Martin India's joint ventures, apprenticeships, and founding membership of the India Innovation Growth Program underscore its conviction to Indian industry, talent and progress.\n\nPlease follow @LMIndiaNews on X, formerly Twitter, for the latest announcements and news across the corporation.\n\nAbout Tata Advanced Systems Limited\n\nTata Advanced Systems Limited, a wholly owned subsidiary of Tata Sons, is a significant player for aerospace and defence solutions in India. TASL offers a full range of integrated solutions across: Aerostructures & Aeroengines, Airborne Platforms & Systems, Defence & Security, and Land Mobility. Tata Advanced Systems has a strong portfolio of partnerships and joint ventures with leading global aerospace and defence firms, making it an integral partner in the international supply chain and in some instances, a global single source provider for leading aerospace and defence OEMs. With the requisite capabilities, resources and scale, Tata Advanced Systems is equipped to deliver end-to-end innovative solutions throughout the entire aerospace and defence value chain from design to full platform assembly, and is well positioned in areas that include satellites, missiles, radars, unmanned aerial systems, artillery guns, command and control systems, optronics, homeland security and land systems, in addition to aircraft and helicopters. (PRNewsfoto/Lockheed Martin Aeronautics) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/lockheed-martin-and-tata-advanced-systems-announce-agreement-to-expand-c-130j-super-hercules-opportunities-in-india-302243211.html\n\nSOURCE Lockheed Martin Aeronautics\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-tata-advanced-systems-071200001.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.02,
            "neu": 0.78,
            "pos": 0.2
        }
    }
]