[
    {
        "date": "2024-06-27T15:26:00+00:00",
        "title": "Boeing (BA) Wins $115M Deal to Aid MH-47G Helicopter Program",
        "content": "The Boeing Company BA recently clinched a modification contract to procure MH-47G renew build rotary helicopter. The award has been offered by the U.S. Special Operations Command (USSOCOM) MacDill Air Force Base, FL.\n\nValued at $115.2 million, the contract is expected to be completed by July 2027. Majority of the work related to this deal will be carried out in Ridley Park, PA.\n\nWhat’s Favoring Boeing?\n\nRecurring geopolitical tensions worldwide, along with the evolving dynamics of modern warfare, which requires swift and agile aerial support, have been prompting nations across the globe to invest more in lethal air forces. To this end, it is imperative to mention that combat helicopters play a critical role in air warfare missions, thanks to their rapid technological advancement over the last decade, which has made them more lethal, survivable as well as adaptable for a wide range of aerial missions.\n\nConsequently, Boeing, being a prominent manufacturer of such new-age military helicopters, has been witnessing a solid flow of orders from the Pentagon and other U.S. allies for its combat-proven rotorcraft. The latest contract win is a bright example of that.\n\nNotably, its MH-47G is a special operation variant of the CH-47 Chinook multi-role, heavy-lift helicopter. In December 2023, Boeing secured a contract worth $271 million from the U.S. Army Special Operations Aviation Command (“USASOAC”) for six remanufactured MH-47G Block II aircraft. With this, the company had 42 MH-47G aircraft under contract with USASOAC, as of 2023-end.\n\nSuch contract wins, including the latest one, should boost the top-line performance of Boeing Defense, Space & Security segment, which registered a year-over-year improvement of 6% in the last reported quarter.\n\nWhat Lies Ahead?\n\nAs nations seek to enhance their military capabilities, the demand for multi-role combat helicopters that are capable of performing diverse missions, from reconnaissance to close air support, is also rising. This might have prompted the Mordor Intelligence firm to project that the military helicopters market will witness a CAGR of more than 2.9% during the 2024-2030 period.\n\nSuch expanding market prospects should boost Boeing’s growth, thanks to its well-established position in manufacturing combat helicopters like AH-64 Apache, MH-139 and AH-6 light attack helicopter, apart from the MH-47G helicopter. Notably, its AH-64 Apache represents the backbone of the U.S. Army’s attack helicopter fleet and a growing number of international defense forces.\n\nOther defense primes that are expected to reap the benefits of the military helicopter market have been discussed below.\n\nStory continues\n\nAirbus EADSY is one of the world's largest suppliers of advanced military helicopters. Some of its military helicopters are H125M, H135, H145M, AS565MBe, H160M, H175M, H215M, H225M, etc.\n\nAirbus boasts a long-term earnings growth rate of 17.9%. The Zacks Consensus Estimate for EADSY’s 2024 sales indicates an improvement of 8.2% from the 2023 reported figure.\n\nLockheed Martin’s LMT Sikorsky business unit provides military and rotary-wing aircraft to all five branches of the U.S. armed forces, along with military services and commercial operators in 40 nations. Some of LMT’s renowned products are Armed Black Hawk, CH-53K, MH-60R, Defiant X, Raider X, S-97 Raider, FireHawk, etc.\n\nLockheed boasts a long-term earnings growth rate of 4.1%. The consensus estimate for LMT’s 2024 sales indicates an improvement of 3.2% from the 2023 reported figure.\n\nTextron’s TXT Bell business supplies advanced military helicopters and provides parts and support services to the U.S. government and military customers outside the United States. TXT Bell’s primary U.S. government programs are meant for the production and support of the V-22 tiltrotor aircraft and H-1 helicopters.\n\nTextron boasts a long-term earnings growth rate of 10.1%. The consensus mark for TXT’s 2024 sales indicates an improvement of 5.7% from the 2023 reported number.\n\nPrice Movement\n\nShares of Boeing have lost 7.6% in the past three months compared with the industry’s 9.3% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nBoeing currently has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/boeing-ba-wins-115m-deal-152600228.html",
        "symbols": [
            "0BOE.LSE",
            "0KVV.IL",
            "0LF0.LSE",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.042,
            "neu": 0.786,
            "pos": 0.173
        }
    },
    {
        "date": "2024-06-27T15:26:00+00:00",
        "title": "Lockheed (LMT) Wins Contract to Support F-35 Jet program",
        "content": "Lockheed Martin Corp.’s LMT business segment, Aeronautics, recently clinched a contract involving its F-35 aircraft program. The award has been provided by the Naval Air Systems Command, Patuxent River, MD.\n\nDetails of the Deal\n\nValued at $31.2 million, the contract is expected to be completed by January 2025. Per the terms of the deal, Lockheed will provide production and non-recurring engineering support for landing gear design, redesign, and analysis to boost the ability to produce and deliver the F-35 landing and arresting gear system.\n\nLMT will also offer engineering efforts for correcting component deficiencies in production line cut-in and engineering release to support all three variants of F-35 aircraft. Work related to this deal will be carried out in Fort Worth, TX.\n\nWhat’s Favoring Lockheed?\n\nThanks to rapidly increasing global security threats, nations worldwide are reinforcing their military capabilities to strengthen their borders. In this backdrop, it is imperative to mention that technologically advanced fighter jets like F-35 play a crucial role in defending a nation’s security, with aerial strength constituting a critical part of a nation’s defense structure.\r\n\r\nTherefore, as nations are investing heftily in their aerial arsenals, major combat aircraft manufacturers like Lockheed are witnessing a solid flow of contracts, like the latest one.\n\nNotably, Lockheed’s F-35 program is the most lethal fighter jet in the world and delivers unrivaled advantage to its customers. Equipped with advanced sensors and communications suites, it can serve across every domain, including air, land, sea, space and cyber.\n\nSuch remarkable features must have been boosting the demand for this jet, which, in turn, has enabled Lockheed to deliver 992 F-35 airplanes to date, with 373 jets in the backlog as of Mar 31, 2024.  The latest contract win is yet another testament to the solid demand that the F-35 jets enjoy in the combat jet market.\n\nGrowth Prospects\n\nAmid the evolving dynamics of aerial warfare, technological advancements in areas such as stealth, unmanned aerial vehicles (UAVs), and artificial intelligence have significantly enhanced the capabilities and mission readiness of combat aircraft. This, along with rising defense budget from developed as well as emerging markets like Brazil and India, have been significantly fueling the demand for fighter jets. This might have prompted the Mordor Intelligence firm to project that the global military aviation market will witness a CAGR of 5.2% during 2024-2030.\n\nSuch projections indicate immense growth opportunities for prominent combat jet manufacturers like Lockheed. Notably, its Aeronautics segment is engaged in the research, design, development, manufacture, integration, sustainment, support and upgrade of advanced military aircraft, including combat and air mobility aircraft, unmanned air vehicles and related technologies. The company’s fighter jet portfolio includes C-130 Super Hercules, F-16 Fighting Falcon jet and F-16 Fighting Falcon, in addition to F-35 jets.\n\nStory continues\n\nPeer Opportunities\n\nLMT apart, a few other defense players that can gain from the expanding military aviation market are Airbus SE EADSY, Boeing BA and Northrop Grumman NOC.\n\nAirbus’ military aircraft consists of A400M, C295 tactical transporter, the new-generation A330 Multi Role Tanker Transport and Eurofighter, the most advanced swing-role fighter ever conceived. The company delivered a total of 1,783 military aircraft as of Dec 31, 2023.\n\nEADSY boasts a long-term (three-to-five years) earnings growth rate of 17.9%. The Zacks Consensus Estimate for Airbus’ 2024 sales indicates an improvement of 8.2% from the top line reported in 2023.\n\nBoeing’s product portfolio includes a range of combat-proven aircraft like the F/A-18 Super Hornet, P-8, C-17 Globemaster III, EA-18G and a few more. In 2023, Boeing delivered 22 F/A-18s, nine F-15s, three T-7A Red Hawks and 11 P-8 models.\n\nBA boasts a long-term earnings growth rate of 25.5%. It has a trailing four-quarter average earnings surprise of 17.83%.\n\nNorthrop Grumman has built some of the world’s most advanced aircraft, ranging from the innovative B-2 Spirit stealth bomber to the game-changing E-2D Advanced Hawkeye. The significant awards won by NOC in 2023 included $2.1 billion for F-35 programs, $1.7 billion for E-2 and $1.5 billion for Triton.\n\nNOC boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for Northrop Grumman’s 2024 sales indicates an improvement of 4.6% from the top line reported in 2023.\n\nPrice Performance\n\nIn the past year, shares of LMT have surged 6.7% against the industry’s 9.2% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLockheed currently has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-wins-contract-support-152600380.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0KVV.IL",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.034,
            "neu": 0.755,
            "pos": 0.212
        }
    }
]