[
    {
        "date": "2024-05-04T21:03:00+00:00",
        "title": "How Lockheed Martin Crushed Its Q1 Earnings Report",
        "content": "Lockheed Martin (NYSE: LMT) reported big earnings beats on both the top and bottom lines in its earnings report last week -- not that you would guess it from the stock price. The company beat sales predictions by 7.5% and earnings estimates by 10%, yet Lockheed stock ended the week below where it began.\n\nIs that fair?\n\nLockheed's Q1 earnings\n\nFor Q1 2024, Lockheed earned $6.39 on sales of $17.2 billion. Sales increased nearly 14% year over year, but earnings declined a bit -- down about 3% year over year. Free cash flow came in even lower than reported earnings. That's the opposite of what you'd expect to happen, so to an extent it actually was fair for investors to not bid up Lockheed stock despite the company beating expectations.\n\nWhy didn't Lockheed do even better in Q1? And why are investors upset with it despite the beat?\n\nStrange as it is to say since we're in the middle of a global bull market for weapons systems, in general, and for missiles, in particular, but Lockheed's sole underperforming business in Q1 was its missiles and fire control division. Out of Lockheed's four main divisions, each of which enjoyed growing sales in the quarter, the missiles business was the only one to show declining profits -- down 18%, despite sales climbing 25%.\n\nThe reason? Lockheed is working hard to ramp up production of pretty much every kind of missile it makes: Guided Multiple Launch Rocket Systems (GMLRS), High Mobility Artillery Rocket Systems (HIMARS), Joint Air-to-Surface Standoff Missiles (JASSM), Long Range Anti-Ship Missiles (LRASM), and PAC-3 Patriot and Terminal High Altitude Area Defense (THAAD) interceptors, too. Presumably, it's the very same production expansion that's both enabling higher revenue growth and entailing costs that depress profits.\n\nAs for the other divisions, aeronautics sales grew 9%, space 10%, and rotary and mission systems 16%. Profits grew in each of these three units, with the biggest improvement seen in space (profits up 16%) and rotary -- profits up 25%. Aeronautics was the outlier, showing good sales growth but little improvement in profits, belying hopes that the F-35 fighter jet program would get steadily more profitable as it scales up in size.\n\nA short side trip to space\n\nI want to say a few words on Lockheed's space business -- space being the industry I focus on. Lockheed is the world's biggest pure-play defense company, so it's no surprise that its \"space\" business is primarily military in nature. The company cited higher Fleet Ballistic Missile (FBM) production, as well as money from its just-won $17.7 billion Next Generation Interceptor (NGI) project as contributing to revenue growth, as well as $115 million from \"national security\" satellites.\n\nStory continues\n\nLockheed also mentioned that it booked $30 million in profit from its 50-50 ownership (alongside Boeing) of United Launch Alliance. After launching just three rockets in all of 2023, ULA launched once in Q1 2024 and again at the start of Q2 2024. Management credited this \"higher launch volume\" for contributing a bit more profit to its bottom line.\n\nMore important to investors is that, because we know that (1) ULA launched only one single rocket in the quarter, (2) Lockheed got half the profit from that launch, and (3) this profit was $30 million, we can presume that this launch earned a total profit of $60 million for ULA.\n\nULA is a private space company, so it's difficult to gauge its profitability. But thanks to Lockheed's earnings report, we can now put a tentative value on each launch the company conducts -- $60 million -- and apply that to the rates the government pays the company for future launches to at least guess at a profit margin. And of course, we can compare that amount to the profit margin of Lockheed's publicly traded space rivals to determine whether ULA is winning or losing the space race.\n\nNow that Lockheed has let this secret slip, let's make sure to remember it.\n\nIs Lockheed Martin stock a buy?\n\nAs for the rest of Lockheed Martin, based on last week's data, we know the stock sells for about 17 times trailing earnings and 1.7 times trailing sales. According to data provided by S&P Global Market Intelligence, Lockheed Martin averaged only about a 1.2x price-to-sales ratio over the first 20 years of this 21st Century -- so a 1.7x sales ratio seems on the expensive side, historically. Regarding earnings, however, Lockheed stock usually trades closer to a 22 price-to-earnings ratio (P/E) than its current 17 P/E, implying that from a profits perspective, Lockheed stock is historically cheap.\n\nAs a conservative investor, I'm inclined to avoid Lockheed because of its high price-to-sales ratio (P/S). That being said, if Lockheed can keep its profit margins as high as they currently are, I might be persuaded its stock is actually a buy.\n\nShould you invest $1,000 in Lockheed Martin right now?\n\nBefore you buy stock in Lockheed Martin, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Lockheed Martin wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $544,015!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of April 30, 2024\n\nRich Smith has no position in any of the stocks mentioned. The Motley Fool recommends Lockheed Martin. The Motley Fool has a disclosure policy.\n\nHow Lockheed Martin Crushed Its Q1 Earnings Report was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-crushed-q1-earnings-210300552.html",
        "symbols": [
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.044,
            "neu": 0.794,
            "pos": 0.161
        }
    },
    {
        "date": "2024-05-04T15:21:00+00:00",
        "title": "Stock Market Crash Alert: 3 Must-Buy Space Stocks When Prices Plunge",
        "content": "With the S&P 500 dipping precipitously lower over the last few days, there have been some fears ignited that we may see a stock market crash. This could then benefit this list of space stocks to buy, as it could provide cheaper entry points.\n\nI chose these three space stocks to buy based on their long-term fundamentals. I believe that these firms could bounce back faster after a sell-off compared with more speculative options on the market.\n\nThe one drawback of these firms is that they are priced fairly, but a drop in their stock prices could help mitigate or eliminate the main objections to adding them to one’s portfolio. In some cases, the space industry is a growth driver for the company, as opposed to being its sole source of future earnings or revenue.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nSo, here are three spaces stocks for investors to consider adding to their portfolios in the event of a stock market crash.\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) Space Systems sign in Sunnyvale, California.\n\nSource: Ken Wolter / Shutterstock.com\n\nLockheed Martin (NYSE:LMT), a well-established defense and aerospace firm, extends its reach significantly within the space sector. It is a major provider of satellites and other space-related technologies.\n\nNotably, Lockheed has been selected by DARPA and NASA to develop a nuclear-powered spacecraft for future missions to Mars. It also continues to enhance its satellite capabilities. The company is innovating in areas like missile defense and space exploration. They are also furthering their commitment by launching new generations of more advanced satellites.\n\nLMT also benefits from the headwinds of rising geopolitical instabilities around the world. The company is famous for the F-16 line of fighter jets, and supplies arms to many NATO and neutral nations.\n\nThe firm pays a solid dividend yield of 2.72%. This which could be bolstered in the event of a sell-off across equities. In my view, this would establish it as one of those space stocks to buy. Also, consider that it has also historically outperformed the S&P 500 over the long-term as well.\n\nIridium Communications (IRDM) the Iridium Satellite Communications logo seen displayed on a smartphone\n\nSource: rafapress / Shutterstock.com\n\nIridium Communications (NASDAQ:IRDM) operates a global network of low-Earth orbit (LEO) satellites providing vital communication services.\n\nIRDM is a much less speculative pick compared to other companies in the space industry. LEOs are an established source of earnings for many companies.\n\nThe company reported a net income of $38 million for Q4 2023. This was a significant turnaround from a net loss in the same period of the previous year. For the full year, Iridium’s net income totaled $15.4 million, compared to $8.7 million in 2022. Additionally, Iridium’s subscriber base has seen substantial growth. Total billable subscribers increaed by 14% year-over-year to 2,279,000 by the end of 2023.\n\nStory continues\n\nLooking ahead, Iridium has extended the estimated useful life of its satellites by five years. This could have positive implications for its long-term asset utilization and cost management​. This then makes it one of those space stocks to buy.\n\nAstra Space (ASTR) Person holding mobile phone with logo of American aerospace company Astra Space on screen in front of web page.. ASTR stock\n\nSource: T. Schneider / Shutterstock.com\n\nAstra Space (NASDAQ:ASTR) is primarily focused on launch services for small satellites, its innovative approach in this niche area of space exploration makes it a noteworthy contender in the space industry.\n\nASTR is a penny stock with a tiny market cap of just 14.75 million. It’s therefore very risky and speculative. Furthermore, Astra’s revenue for the first nine months of 2023 was notably low at $963,000, a stark contrast to the costs incurred. The revenue primarily came from their Space Products segment, as the Launch Services did not generate revenue during this period.\n\nHowever, ASTR is actively realigning its resources, focusing more on the Astra Spacecraft Engines business, which has a better promise for revenue and earnings growth in the future.\n\nI think that given the risks involved for ASTR, the lower one’s entry price is for the company, the better, offering potentially lower financial risks as well as prospects for capital appreciation. If ASTR’s shares depreciate in the face of a broad market sell off, as most speculative stocks do, then it could be worth opening a small position in the company.\n\nOn the date of publication, Matthew Farley did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nMatthew started writing coverage of the financial markets during the crypto boom of 2017 and was also a team member of several fintech startups. He then started writing about Australian and U.S. equities for various publications. His work has appeared in MarketBeat, FXStreet, Cryptoslate, Seeking Alpha, and the New Scientist magazine, among others.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post Stock Market Crash Alert: 3 Must-Buy Space Stocks When Prices Plunge appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/stock-market-crash-alert-3-152100574.html",
        "symbols": [
            "0R3E.LSE",
            "6IC.BE",
            "6IC.F",
            "6IC.STU",
            "ASTR.US",
            "IRDM.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.036,
            "neu": 0.84,
            "pos": 0.124
        }
    },
    {
        "date": "2024-05-04T13:00:10+00:00",
        "title": "Lockheed Martin Corporation (NYSE:LMT) is a favorite amongst institutional investors who own 75%",
        "content": "Key Insights\n\nSignificantly high institutional ownership implies Lockheed Martin's stock price is sensitive to their trading actions A total of 8 investors have a majority stake in the company with 52% ownership Recent sales by insiders\n\nA look at the shareholders of Lockheed Martin Corporation (NYSE:LMT) can tell us which group is most powerful. With 75% stake, institutions possess the maximum shares in the company. In other words, the group stands to gain the most (or lose the most) from their investment into the company.\n\nGiven the vast amount of money and research capacities at their disposal, institutional ownership tends to carry a lot of weight, especially with individual investors. Therefore, a good portion of institutional money invested in the company is usually a huge vote of confidence on its future.\n\nLet's take a closer look to see what the different types of shareholders can tell us about Lockheed Martin.\n\nSee our latest analysis for Lockheed Martin  ownership-breakdown\n\nWhat Does The Institutional Ownership Tell Us About Lockheed Martin?\n\nInstitutions typically measure themselves against a benchmark when reporting to their own investors, so they often become more enthusiastic about a stock once it's included in a major index. We would expect most companies to have some institutions on the register, especially if they are growing.\n\nLockheed Martin already has institutions on the share registry. Indeed, they own a respectable stake in the company. This can indicate that the company has a certain degree of credibility in the investment community. However, it is best to be wary of relying on the supposed validation that comes with institutional investors. They too, get it wrong sometimes. When multiple institutions own a stock, there's always a risk that they are in a 'crowded trade'. When such a trade goes wrong, multiple parties may compete to sell stock fast. This risk is higher in a company without a history of growth. You can see Lockheed Martin's historic earnings and revenue below, but keep in mind there's always more to the story. earnings-and-revenue-growth\n\nInvestors should note that institutions actually own more than half the company, so they can collectively wield significant power. We note that hedge funds don't have a meaningful investment in Lockheed Martin. State Street Global Advisors, Inc. is currently the largest shareholder, with 15% of shares outstanding. In comparison, the second and third largest shareholders hold about 11% and 9.2% of the stock.\n\nOn further inspection, we found that more than half the company's shares are owned by the top 8 shareholders, suggesting that the interests of the larger shareholders are balanced out to an extent by the smaller ones.\n\nStory continues\n\nResearching institutional ownership is a good way to gauge and filter a stock's expected performance. The same can be achieved by studying analyst sentiments. Quite a few analysts cover the stock, so you could look into forecast growth quite easily.\n\nInsider Ownership Of Lockheed Martin\n\nWhile the precise definition of an insider can be subjective, almost everyone considers board members to be insiders. Management ultimately answers to the board. However, it is not uncommon for managers to be executive board members, especially if they are a founder or the CEO.\n\nInsider ownership is positive when it signals leadership are thinking like the true owners of the company. However, high insider ownership can also give immense power to a small group within the company. This can be negative in some circumstances.\n\nOur data suggests that insiders own under 1% of Lockheed Martin Corporation in their own names. Being so large, we would not expect insiders to own a large proportion of the stock. Collectively, they own US$63m of stock. Arguably recent buying and selling is just as important to consider. You can  click here to see if insiders have been buying or selling.\n\nGeneral Public Ownership\n\nThe general public, who are usually individual investors, hold a 14% stake in Lockheed Martin. While this size of ownership may not be enough to sway a policy decision in their favour, they can still make a collective impact on company policies.\n\nNext Steps:\n\nI find it very interesting to look at who exactly owns a company. But to truly gain insight, we need to consider other information, too. For instance, we've identified  2 warning signs for Lockheed Martin that you should be aware of.\n\nIf you would prefer discover what analysts are predicting in terms of future growth, do not miss this freereport on analyst forecasts.\n\nNB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-martin-corporation-nyse-lmt-130010412.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.028,
            "neu": 0.874,
            "pos": 0.098
        }
    },
    {
        "date": "2024-05-04T00:00:00+00:00",
        "title": "Stock Market Crash Alert: 3 Must-Buy Space Stocks When Prices Plunge",
        "content": "Explore three must-buy space stocks poised for a quick recovery post-market crash. Seize the chance for valuable investments!",
        "link": "https://investorplace.com/2024/05/stock-market-crash-alert-3-must-buy-space-stocks-when-prices-plunge/",
        "symbols": [
            "IRDM.US",
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.571,
            "neg": 0.117,
            "neu": 0.563,
            "pos": 0.32
        }
    }
]