[
    {
        "date": "2024-07-30T21:04:12+00:00",
        "title": "7 Top Defense Stock Picks Geopolitics Continues to Take Center Stage",
        "content": "Although a controversial sector, the concept of top defense stocks will likely become an increasingly important one. Primarily, circumstances in the geopolitical realm will likely worsen. At the same time, a critical election cycle could mean significant changes. Therefore, emotionally agnostic investors may consider the potential viability of this ecosystem.\n\nSeveral worrying catalysts come to mind. First, tensions in the Middle East could boil over, threatening regional stability. In addition, global oil supply chains could be disrupted, leading to severe economic consequences. Second, the war in Ukraine has shown no sign of abating. Add the possibility of an isolationist shift in U.S. foreign policy, and the conflict there may worsen.\n\nAt the same time this is going on, China has ambitions of its own. In other words, the U.S. can’t afford to let off the gas pedal. Cynically, such a framework may only serve to bolster top defense stocks. Below are several ideas to consider.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) Space Systems sign in Sunnyvale, California.\n\nSource: Ken Wolter / Shutterstock.com\n\nSpecializing in some of the most advanced systems in the aerospace field, Lockheed Martin (NYSE:LMT) is widely known for its fighter jets, such as the F-35 Lightning II. It also offers missile defense systems along with space communications systems. Due to the importance of air and space superiority in any future conflict that Western powers may find themselves in, demand for LMT stock should rise.\n\nIt’s not just a random musing. Lockheed enjoyed a strong showing in its second quarter, producing earnings per share of $6.85. This handily beat the projection calling for $6.46. Overall, the earnings surprise came out to 6%. In the past four quarters, the average EPS stood at $6.93, eclipsing the collective consensus view of $6.54.\n\nWhat makes LMT stock attractive is that it still trades for a relatively reasonable valuation. For example, between Q2 2023 and Q2 2024, the average sales multiple sat at 1.69x. Right now, the multiple comes in at 1.8x — higher but still reasonable.\n\nFor fiscal 2024, analysts anticipate that sales may rise to $71.08 billion, up 5.2% from the prior year. However, the high-side estimate of $72.13 billion could be realistic. With that, LMT is one of the top defense stocks to consider.\n\nNorthrop Grumman (NOC) United States Air Force Northrop Grumman (NOC) RQ-4B Global Hawk unmanned surveillance aircraft.\n\nSource: viper-zero / Shutterstock.com\n\nAnother top-tier name in the aerospace and defense industry, Northrop Grumman (NYSE:NOC), specializes in several fields. These include unmanned systems, cybersecurity, missile defense and space-related systems. Increasingly, nefarious agents are taking to connected networks to render damage or essentially hold entities financially hostage. Northrop can potentially address this critical area.\n\nStory continues\n\nWhat makes Northrop one of the credible defense stocks is the underlying financial performance. In Q2, the company posted EPS of $6.36, beating out the consensus target of $5.93. This yielded an earnings surprise of 7.2%. In the past four quarters, Northrop generated an average EPS of $6.03, exceeding the average target of $5.68.\n\nInterestingly, NOC stock appears relatively undervalued. Right now, shares trade hands at 1.76x trailing-year sales. However, in the past year since Q2, the average multiple stood at 1.81x.\n\nCircumstances could get even more favorable. In fiscal 2024, sales may rise to $41.31 billion, up 5.1% from the prior year’s haul of $39.29 billion. In fiscal 2025, revenue could bump up again to $42.95 billion. It’s one of the top defense stocks to consider.\n\nRTX (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nFormerly known as Raytheon Technologies, RTX (NYSE:RTX) has long represented one of the top defense stocks. One of its main specialties is missile systems. In addition, the company offers solutions involving radar, avionics and integrated defense networks. With tensions in multiple global regions turning sadly kinetic, the idea of missile defense systems will likely rise. Therefore, RTX stock should be cynically relevant.\n\nAs with other top defense stocks, RTX has put on a solid showing in Q2, posting EPS of $1.41. In contrast, analysts were anticipating earnings of $1.30 per share. That led to an earnings surprise of 8.61%. In the past year, the company posted an average EPS of $1.29, beating out the consensus view of $1.22.\n\nIt must be said that this enhanced performance comes at a cost. RTX trades at 2.16x sales, which is a bit pricier than some of its rivals. However, it’s not a terrible premium when considering the prior year’s print of 1.89x.\n\nMoreover, experts see sales shooting up to $79.41 billion, up 6.9% from last year’s tally of $74.31 billion. It’s easily one of the players to keep on your radar.\n\nGeneral Dynamics (GD) image of General Dynamics (GD) website, representing dividend stocks\n\nSource: Casimiro PT / Shutterstock.com\n\nProviding a vast portfolio of defense products and services, General Dynamics (NYSE:GD) has been one of the most relevant names among top defense stocks. That’s because it specializes in combat vehicles and, especially, weapons systems and munitions. The latter two categories have seen extensive use recently, underscoring their practicality and effectiveness when conflicts become kinetic.\n\nNow, it must be stated that GD stock is a higher-risk, higher-reward entity among top defense stocks. Unlike some of its peers, it slightly missed expectations in Q2, posting EPS of $3.26 against a target calling for $3.31. To be sure, the company also slightly missed earnings expectations in the past three quarters. However, Q3 2024 was strong, lifting the overall average into positive EPS territory.\n\nCurrently, GD stock trades at 1.77x sales. That’s on par with many other defense enterprises. In the past year, the metric sat at 1.68x.\n\nThe distinguishing factor for General Dynamics could be its sales front. Analysts see fiscal 2024 revenue hitting $48.07 billion. That’s up 13.7% from the prior year.\n\nL3Harris Technologies (LHX) An office building with the logo for L3Harris Industries visible on the building.\n\nSource: JennLShoots / Shutterstock.com\n\nSpecializing in advanced defense and commercial technologies, L3Harris Technologies (NYSE:LHX) covers all domains: air, land, sea, space and cyber. This integration of multiple domains will likely be critical in future conflicts. We’ve already seen how unmanned drones have been supremely effective against numerically superior forces. Thus, L3Harris should see increased demand as Western powers seek a technological edge.\r\n\r\nA key element moving in LHX stock’s favor is the financials. While not blisteringly impressive, L3Harris is getting the job done. In Q2, the company posted EPS of $3.24, beating the consensus view of $3.18. Over the past four quarters, the defense specialist’s average EPS landed at $3.14. This eclipsed experts’ target calling for $3.05.\n\nRight now, LHX stock trades hands at 2.06x sales. That’s a bit high compared to some other top defense stocks. However, in the past year, the metric was 2.1x. So, the valuation is relatively reasonable.\n\nFor fiscal 2024, analysts anticipate that sales may rise to $21.23 billion, up 9.3% from the prior year. In the following year, the top line could expand to $22.09 billion, up 4%.\n\nTextron (TXT) Bell Boeing V-22 Osprey shown during a flight demo.\n\nSource: Angel DiBilio / Shutterstock.com\n\nA multi-industry company mainly covering the aerospace solutions segment, Textron (NYSE:TXT) is perhaps best known for partnering with other companies to develop the V-22 Osprey aircraft. The company also has its hands in developing advanced land vehicles. In future conflicts, rapid deployment of special military operators may be crucial. Therefore, TXT stock could see significant demand in the years ahead.\n\nFinancially, Textron is usually consistent, though sometimes it slightly misses expectations. In Q2, it was firing on all cylinders, posting an EPS of $1.54 against a consensus view of $1.47. This produced an earnings surprise of 4.7%. In the past year, Textron posted an average EPS of $1.44, beating the average forecast of $1.32.\n\nRelative to other top defense stocks, TXT appears to be a bargain, trading at 1.28x sales. Between Q1 2023 to Q1 2024, the average metric sat at 1.2x.\n\nLooking out to year’s end, sales may reach $14.5 billion, up 6% from last year’s tally of $13.7 billion. In the following year, the top line might rise to $15.35 billion, up another 6%.\n\nKratos Defense (KTOS) The front of a Kratos (KTOS) office in Silicon Valley.\n\nSource: Michael Vi / Shutterstock.com\n\nOne of the higher-risk, higher-reward ideas among top defense stocks, Kratos Defense (NASDAQ:KTOS) just might see some awareness burgeon over the next several years. The company focuses on unmanned systems, which as stated before, is becoming a critical component of defense. Should conflicts erupt in more parts of the world, it’s reasonable to assume that demand for KTOS stock will blossom.\n\nWhile it’s a smaller enterprise compared to its peers on this list, that’s what makes Kratos so compelling. Its Q2 report will be coming up shortly on Thursday. However, if it’s anything like Q1 — when Kratos posted EPS of 11 cents against a target of 5 cents — investors may see a significant pop higher. In the past year since Q1 2023, the average earnings surprise has clocked in at around 70%.\n\nNow, the performance comes at a cost: KTOS stock trades hands at 2.8x revenue. That’s also higher than the prior year’s average multiple of 2.15x.\n\nStill, analysts believe that by year’s end, sales may rise to $1.15 billion, up 11.1%. In the following year, the top line could jump to $1.28 billion, up 10.7%.\n\nOn the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nA former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post 7 Top Defense Stock Picks Geopolitics Continues to Take Center Stage appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/7-top-defense-stock-picks-210412889.html",
        "symbols": [
            "0IUC.LSE",
            "0JS0.LSE",
            "0K92.LSE",
            "0LF0.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "GD.MX",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.XETRA",
            "KTOS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.055,
            "neu": 0.828,
            "pos": 0.117
        }
    },
    {
        "date": "2024-07-30T13:00:11+00:00",
        "title": "Investors Heavily Search Lockheed Martin Corporation (LMT): Here is What You Need to Know",
        "content": "Lockheed Martin (LMT) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\n\nOver the past month, shares of this aerospace and defense company have returned +13.1%, compared to the Zacks S&P 500 composite's +0.1% change. During this period, the Zacks Aerospace - Defense industry, which Lockheed falls in, has gained 4.6%. The key question now is: What could be the stock's future direction?\n\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\n\nEarnings Estimate Revisions\n\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\n\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nLockheed is expected to post earnings of $6.40 per share for the current quarter, representing a year-over-year change of -5.5%. Over the last 30 days, the Zacks Consensus Estimate has changed -1.7%.\n\nThe consensus earnings estimate of $26.34 for the current fiscal year indicates a year-over-year change of -5.3%. This estimate has changed +2.1% over the last 30 days.\n\nFor the next fiscal year, the consensus earnings estimate of $28.68 indicates a change of +8.9% from what Lockheed is expected to report a year ago. Over the past month, the estimate has changed +1.1%.\n\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Lockheed.\n\nStory continues\n\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n\n12 Month EPS 12-month consensus EPS estimate for LMT _12MonthEPSChartUrl\n\nProjected Revenue Growth\n\nWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\n\nFor Lockheed, the consensus sales estimate for the current quarter of $17.43 billion indicates a year-over-year change of +3.3%. For the current and next fiscal years, $70.42 billion and $73.24 billion estimates indicate +4.2% and +4% changes, respectively.\n\nLast Reported Results and Surprise History\n\nLockheed reported revenues of $18.12 billion in the last reported quarter, representing a year-over-year change of +8.6%. EPS of $7.11 for the same period compares with $6.73 a year ago.\n\nCompared to the Zacks Consensus Estimate of $17.12 billion, the reported revenues represent a surprise of +5.88%. The EPS surprise was +10.23%.\n\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\n\nValuation\n\nWithout considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\n\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\n\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\n\nLockheed is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\n\nBottom Line\n\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Lockheed. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/investors-heavily-search-lockheed-martin-130011013.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.007,
            "neu": 0.861,
            "pos": 0.131
        }
    },
    {
        "date": "2024-07-30T00:00:00+00:00",
        "title": "7 Top Defense Stock Picks Geopolitics Continues to Take Center Stage",
        "content": "The idea of top defense stocks is controversial. However, with conflicts rising in many parts of the world, it’s also relevant.\n",
        "link": "https://investorplace.com/2024/07/7-top-defense-stock-picks-geopolitics-continues-to-take-center-stage/",
        "symbols": [
            "GD.US",
            "KTOS.US",
            "LHX.US",
            "LMT.US",
            "NOC.US",
            "RTX.US",
            "TXT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.273,
            "neg": 0.178,
            "neu": 0.688,
            "pos": 0.134
        }
    }
]