[
    {
        "date": "2024-06-11T18:26:00+00:00",
        "title": "Top Stock Reports for Procter &amp; Gamble, ServiceNow &amp; Lockheed Martin",
        "content": "Tuesday, June 11, 2024\r\n\r\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including The Procter & Gamble Company (PG), ServiceNow, Inc. (NOW) and Lockheed Martin Corporation (LMT), as well as a micro-cap stock Steel Partners Holdings L.P. (SPLP). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\r\n\r\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\r\n\r\nYou can see all of today’s research reports here >>>\r\n\r\nToday's Research Daily also features the monthly Equity Strategy report from our Chief Equity Strategist where he discusses the outlook the outlook for the Tech sector in general and the 'Magnificent 7' stocks.\n\nYou can find full June Equity Strategy report here >>> Strong Mega-Cap Profit Center in the S&P\n\nProcter & Gamble shares have modestly outperformed the Zacks Soap and Cleaning Materials industry over the past year (+18.0% vs. +17.6%). The company has been gaining from robust pricing and a favorable mix, along with strength across segments. It has been focused on productivity and cost-saving plans to boost margins.\r\n\r\nThis led to bottom line beating the consensus mark for the seventh consecutive quarter in third-quarter fiscal 2024. Consequently, PG has provided an optimistic fiscal 2024 view.\r\n\r\nHowever, the company has been witnessing supply-chain issues, higher SG&A costs, higher transportation costs and rising inflation. Its significant international presence exposes it to foreign currency risks, which acts as a headwind.\r\n\r\n(You can read the full research report on Procter & Gamble here >>>)\r\n\r\nShares of ServiceNow have gained +0.4% over the year-to-date period against the Zacks Computers - IT Services industry’s gain of +5.1%. The company has been benefiting from the rising adoption of its workflows by enterprises undergoing digital transformation. ServiceNow had 1933 total customers with more than $1 million in annual contract value at the end of the first quarter.\r\n\r\nServiceNow had eight deals greater than $5 million in net new ACV, and four deals of more than $10 million. It closed 59 deals greater than $1 million net new ACV. Number of customers contributing more than $20 million or more grew 50% year over year.\r\n\r\nGenerative AI deals continued to gain traction with record-breaking net new ACV for Pro Plus, making it the fastest-selling product in ServiceNow’s history. Nevertheless, ServiceNow is suffering from high inflation, stiff competition, and challenging macro-economic environment.\r\n\r\n(You can read the full research report on ServiceNow here >>>)\r\n\r\nLockheed Martin shares have outperformed the Zacks Aerospace - Defense industry over the past year (+4.5% vs. -10.1%). The company’s broad product offerings allow it to secure big defense contracts from the Pentagon and other U.S. allies, which in turn boosts its backlog count, which was a record $159.4 billion as of Mar 31, 2024.\r\n\r\nLockheed Martin remains the largest U.S. defense contractor with a steady order flow from its leveraged presence in the Army, Air Force, Navy and IT programs. The solid U.S. defense budgetary provisions should boost its business. The company’s products also witness a strong international demand.\r\n\r\nHowever, Lockheed is facing performance issues concerning some of its products that may affect its results. Shortage of skilled labor may adversely impact Lockheed’s operating results. China’s sanctions imposed on Lockheed might also affect its business.\r\n\r\n(You can read the full research report on Lockheed Martin here >>>)\r\n\r\nShares of Steel Partners have underperformed the Zacks Diversified Operations industry over the year-to-date period (-8.5% vs. +0.9%). This microcap company with market capitalization of $747.01 million has a diversified portfolio across various sectors and the inclusion of Steel Connect, SPLP mitigates risks and boosts growth. As of Mar 31, 2024, SPLP had $273.9 million in cash, with debt reduced to $92.8 million. SPLP also reduced interest expenses by 76.7% in the first quarter.\r\n\r\nYet, the adjusted EBITDA margin declined from 14.2% to 12.3% in the first quarter of 2024 due to an underperformance in the Energy and Diversified Industrial segments. Energy revenues fell 33.7% and Diversified Industrial sales decreased 3.9%, impacting profitability. Also, fluctuations due to geopolitical tensions impact operational costs and investor confidence.\r\n\r\n(You can read the full research report on Steel Partners here >>>)\r\n\r\nOther noteworthy reports we are featuring today include Regeneron Pharmaceuticals, Inc. (REGN), McKesson Corporation (MCK) and Suncor Energy Inc. (SU).\r\n\r\nDirector of Research\r\n\r\nSheraz Mian\r\n\r\nNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\n\nStory continues\n\nToday's Must Read\n\nP&G's (PG) Productivity & Cost Savings Plan to Aid Margins\n\nGrowing Customer Base & Partnerships Aid ServiceNow (NOW)\n\nOrder Growth Boosts Lockheed (LMT), Tiff With Turkey Ails\n\nFeatured Reports\n\nDupixent Profits Fuels Regeneron (REGN), Eylea Decline A Woe\r\nPer the Zacks analyst, stellar performance of Dupixent fuels Regeneron even as lead drug Eylea faces challenges. The company's progress with the oncology portfolio is also impressive.\n\nDemand for Specialty Products Driving McKesson (MCK) Prospects\r\nPer the Zacks analyst, McKesson's distribution segment will continue to benefit from higher volume of specialty products coupled with price rise. Rising demand for extended and primary care buoys well\n\nSuncor (SU) Supported by Integrated Business Model \r\nThe Zacks analyst believes that Suncor's integrated business model positions it well for strong cash flow generation. However, the company's high oil price sensitivity is a concern.\n\nExtra Space Storage (EXR) Aided by Buyouts Amid High Rates\r\nPer the Zacks analyst, its high brand value, geographically diversified portfolio and accretive buyouts are likely to aid Extra Space Storage's performance despite a high interest rate environment.\n\nZscaler (ZS) Benefits From Acquisitions & Product Refreshes\r\nPer the Zacks analyst, Zscaler is benefiting from its strategic acquisitions like Canonic Security and ShiftRight. Moreover, frequent product refreshes are helping it in gaining new customers.\n\nStrategic Acquisitions Aid Franklin (BEN) Amid Rising Costs\r\nPer the Zacks analyst, Franklin will continue to benefit from opportunistic acquisitions and solid AUM balance. Yet, concentrated and volatile revenues and elevated expenses remain major challenges.\n\nDocuSign (DOCU) Gains From eSignature Strength, Investments\r\nThe Zacks analyst is positive about DocuSign's top line as it is significantly benefiting from continued customer demand for eSignature. Investments in technical expertise are also reaping benefits.\n\nNew Upgrades\n\nGrowth Projects, Newcrest Buyout Aid Newmont (NEM)\r\nPer the Zacks analyst, Newmont will gain from the progress of its key growth projects. The Newcrest acquisition has also created an industry-leading portfolio and will deliver significant synergies.\n\nRobust Construction Activity & Acquisitions Aid EMCOR (EME)\r\nPer the Zacks analyst, EMCOR is benefiting from increased project flows from high-tech manufacturing and network and communications market sectors. Also, focus on acquisitions bode well.\n\nGrowing Top Line, Solid Capital Position Aid Palomar (PLMR)\r\nPer the Zacks analyst, Palomar's growing revenues driven by higher premiums and net investment income have led to significant growth. Moreover, robust capital position supports capital deployment.\n\nNew Downgrades\n\nWeak Residential Kitchen Equipment Unit Hurt Middleby (MIDD)\r\nPer the Zacks analyst, Middleby is experiencing softness in the Residential Kitchen Equipment segment due to lower demand for residential kitchen products. Forex woes are an added concern.\n\nUbiquiti (UI) Plagued by Soft Demand, Fierce Competition\r\nPer the Zacks analyst, increasing competition in the wireless equipment market, combined with demand softness in the Service Provider Technology segment, will likely impede Ubiquiti's top line.\n\nBuilt to Order Model Aids KB Home (KBH), High Costs Hurt\r\nPer the Zacks analyst, KB Home is aiding from improving housing market conditions, low cancellation rate and Built to Order model. Yet, increasing costs and expenses along with labor inflation hurt.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nRegeneron Pharmaceuticals, Inc. (REGN) : Free Stock Analysis Report\n\nProcter & Gamble Company (The) (PG) : Free Stock Analysis Report\n\nMcKesson Corporation (MCK) : Free Stock Analysis Report\n\nSuncor Energy Inc. (SU) : Free Stock Analysis Report\n\nServiceNow, Inc. (NOW) : Free Stock Analysis Report\n\nSteel Partners Holdings LP (SPLP): Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/top-stock-reports-procter-gamble-182600087.html",
        "symbols": [
            "0JZU.LSE",
            "0NOF.IL",
            "0R3E.LSE",
            "4S0.F",
            "4S0.STU",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "MCK.BE",
            "MCK.DU",
            "MCK.STU",
            "MCK.US",
            "N1OW34.SA",
            "NOW.US",
            "PG.BA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.038,
            "neu": 0.801,
            "pos": 0.162
        }
    },
    {
        "date": "2024-06-11T10:40:00+00:00",
        "title": "RTX Secures a $678M Contract to Aid AN/SPY-6(V) Family of Radars",
        "content": "RTX Corp.’s RTX business unit, Missiles and Defense, recently clinched a modification deal involving the AN/SPY-6(V) family of radars. The award has been provided by the Naval Sea Systems Command, Washington, D.C.\n\nDetails of the Deal\n\nValued at $677.7 million, the contract is estimated to be completed by September 2028. The latest modification should enable RTX to exercise options for hardware production of the AN/SPY-6(V) family of radars.\n\nA major portion of the work related to this deal will be executed in Andover, MA.\n\nWhat’s Favoring RTX?\n\nWith the rapid escalation of geopolitical tensions globally in recent times, nations across the board have been significantly boosting their defense arsenal. Since radars constitute a vital part of this arsenal, escalation in defense spending has been benefiting radar manufacturing companies like RTX, in the form of solid order flows for radar production and associated upgrades. The latest contract win is a bright example of that.\n\nTo this end, it is imperative to mention that RTX’s SPY-6 is the U.S. Navy family of radars that performs air and missile defense on seven classes of ships.\n\nThese radars can defend against ballistic missiles, cruise missiles, hypersonic missiles, hostile aircraft and surface ships simultaneously. The solid demand for this product can be gauged from the fact that SPY-6 radar arrays are being integrated into the U.S. Navy’s newest ships, including DDG 51 Flight III destroyers, frigates, aircraft carriers and amphibious warships.\n\nGrowth Prospects\n\nThe demand for military radar systems has expanded manifold in recent times, driven by factors like the rise in defense spending of emerging economies, increase in regional tensions and inter-country conflicts that have boosted threats from missiles and aircraft. This has set the stage for ample growth opportunities for the military radar market.\n\nThe Markets and Markets firm projects the global military radar market to witness a CAGR of 4.7% during 2023-2027. Such growth projections bode well for prominent radar manufacturers like RTX.\n\nNotably, RTX’s product portfolio consists of varied radars like integrated air and missile defense radars, ballistic missile radars, surveillance radars as well as air dominance radars. Radars like AN-TPY-2, APG-79 and APG-82 are some of the company’s combat-proven products that enjoy solid demand in the global military radar market, apart from AN/SPY-6.\n\nOpportunities for Peers\n\nRTX apart, other defense contractors that are major radar manufacturers and thus expected to benefit from the growth opportunities offered by the global military radar market are discussed below:\n\nStory continues\n\nLockheed Martin LMT: Its radars are the choice of more than 45 nations on six continents. The company’s product portfolio includes various radar systems like AN/APY-9 radar, airborne ground surveillance radar systems, AN/TPQ-53 radar systems, SPY-7, the long-range discrimination radar, FPS-117 and a few more.\n\nLockheed boasts a long-term earnings growth rate of 4.10%. The Zacks Consensus Estimate for its 2024 earnings implies an improvement of 3.2% from the 2023 reported figure.\n\nL3Harris Technologies LHX: The company manufactures combat-proven radars like SPS-48, land-based surveillance radar, AN/APY-11 Multimode radar, Tactical Air Surveillance radar, AN/SPS-48G Long range 3D surveillance radar and many more.  Notably, its Vigilant family of software-defined, radar electronic support measures solutions is essential for survival and dominance in the electromagnetic threat environment of the modern battlefield.\n\nL3Harris boasts a long-term earnings growth rate of 9.2%. The Zacks Consensus Estimate for its 2024 earnings implies an improvement of 9.4% from the 2023 reported figure.\n\nNorthrop Grumman NOC: As a pioneer in Active Electronically Scanned Array (AESA) radars, NOC has been at the forefront of AESA innovations for more than 60 years. Its broad portfolio of products also includes radars like AN/APG-83 scalable agile beam radar, AN/ASQ-236 Dragon’s eye radar pod as well as AN/APG-81 and AN/APG-71 for F-35 and F-22 jets, respectively.\n\nNorthrop boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for its 2024 sales implies an improvement of 4.6% from the 2023 reported figure.\n\nPrice Performance\n\nThe company’s shares have risen 10.7% in the past year against the industry’s decline of 9.5%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nRTX currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nL3Harris Technologies Inc (LHX) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-secures-678m-contract-aid-104000896.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.XETRA",
            "LHX.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.033,
            "neu": 0.794,
            "pos": 0.173
        }
    },
    {
        "date": "2024-06-11T10:40:00+00:00",
        "title": "Lockheed (LMT) Secures a Contract to Support F-35 Jet Program",
        "content": "Lockheed Martin Corp.’s LMT Aeronautics business segment recently secured a contract to procure aircraft armament equipment for its F-35 fighter jets. The award has been provided by the Naval Air Systems Command, Patuxent River, MD.\n\nDetails of the Deal\n\nValued at $97 million, the contract is projected to be completed by February 2028. Per the terms of the deal, Lockheed will procure aircraft armament equipment like internal adapters and weapon umbilical cables required to employ long-range strike weapons. This procurement will allow for internal carriage and employment of the Advanced Anti-Radiation Guided Missile – Extended Range weapon for LMT’s F-35 Lightning II aircraft.\n\nThe contract will serve the U.S. Air Force, Marine Corps, Navy, Foreign Military Sales customers, and non-U.S. Department of Defense program participants. Work related to this deal will be executed in Fort Worth, TX.\n\nSignificance of F-35 Jets\n\nLockheed’s F-35 is the most lethal, survivable and connected fighter jet in the world. It can securely connect high-tech platforms to share information across every domain, air, land, sea, space and cyber. The aircraft comes in three main variants, which are F-35A (conventional takeoff and landing), F-35B (short take-off and vertical landing) and F-35C (carrier-based).\n\nSuch remarkable features of this fighter jet are likely to have been bolstering the demand for the F-35 aircraft. F-35’s solid demand can be further gauged from the fact that Lockheed has delivered 992 F-35 airplanes since the program's inception, with 373 jets in the backlog as of Mar 31, 2024.\n\nLooking ahead, LMT expects to deliver 147-153 jets in 2024 and 156 in 2025 and beyond. This, along with the latest contract win, can be expected to significantly boost Lockheed’s revenue growth in the coming quarters, considering the fact that F-35 jet program generated approximately 25% of the company’s total consolidated net sales in first-quarter 2024.\n\nLMT’s Growth Prospects\n\nAmid the geopolitical tensions prevalent across the globe, nations are rapidly augmenting defense purchases to strengthen their warfare capabilities. This has led to an increased demand for fighter jets, which form an integral part of a country’s defense products. Per a report by the Mordor Intelligence firm, the global military aviation market is estimated to witness a CAGR of 5.23% during 2024-2030.\n\nSuch projections indicate immense growth opportunities for prominent combat jet manufacturers like Lockheed. Its Aeronautics segment is engaged in the research, design, development, manufacture, integration, sustainment, support and upgradation of advanced military aircraft, including combat and air mobility aircraft, unmanned air vehicles and related technologies. The company’s fighter jet portfolio includes C-130 Super Hercules, F-16 Fighting Falcon jet and F-16 Fighting Falcon, in addition to F-35 jets.\n\nStory continues\n\nPeer Opportunities\n\nOther defense players that are expected to gain from the expanding global military aviation market are discussed below:\n\nAirbus EADSY: Its military aircraft consists of the A400M, C295 tactical transporter, the new-generation A330 Multi Role Tanker Transport and the Eurofighter, the most advanced swing-role fighter ever conceived. The company delivered a total of 1,783 military aircraft as of Dec 31, 2023.\n\nEADSY boasts a long-term (three-to-five years) earnings growth rate of 21.4%. The Zacks Consensus Estimate for Airbus’ 2024 sales indicates an improvement of 8.2% from the top line reported in 2023.\n\nThe Boeing Company BA: Its product portfolio includes a range of combat-proven aircraft like the F/A-18 Super Hornet, P-8, C-17 Globemaster III, EA-18G and a few more. In 2023, Boeing delivered 22 F/A-18s, nine F-15s, three T-7A Red Hawks and 11 P-8 models.\n\nBA has a long-term earnings growth rate of 27.5%. The consensus estimate for Boeing’s 2024 sales indicates an improvement of 2.1% from the top line reported in 2023.\n\nNorthrop Grumman NOC: It has built some of the world’s most advanced aircraft, ranging from the innovative B-2 Spirit stealth bomber to the game-changing E-2D Advanced Hawkeye. The significant awards won by NOC in 2023 included $1.7 billion for E-2 and $1.5 billion for Triton jets.\n\nNOC boasts a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for Northrop Grumman’s 2024 sales indicates an improvement of 4.6% from the top line reported in 2023.\n\nPrice Performance\n\nIn the past year, shares of LMT have risen 4.5% against the industry’s 9.5% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLockheed currently has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-secures-contract-support-104000238.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0KVV.IL",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.033,
            "neu": 0.784,
            "pos": 0.183
        }
    },
    {
        "date": "2024-06-11T10:15:00+00:00",
        "title": "The 3 Best Space Stocks to Buy in June 2024",
        "content": "As we venture into June 2024, the space industry continues to capture the imagination of investors and enthusiasts alike. With the global space economy projected to triple to $1 trillion by 2040, the potential for growth is immense. Innovation in this sector is also expected to grow. In this article, we will delve into three of the best space stocks that are making waves in the industry.\r\n\r\nEach of these companies brings a unique perspective and approach to the space sector, from established aerospace giants to emerging players pushing the boundaries of space exploration and commercialization. We will examine their financial performance, strategic initiatives, and future prospects, providing valuable insights for investors seeking to capitalize on the exciting opportunities in the space industry.\n\nSo here are three of the best space stocks to buy in June. These stocks may not stay cheap for long, so taking urgent action is advisable for investors interested in this industry.\n\nLockheed Martin (LMT) Close top view of a Lockheed Martin (LMT) F-35C Lightning II with afterburner on\n\nSource: ranchorunner / Shutterstock.com\n\nLockheed Martin (NYSE:LMT) remains a compelling buy in June 2024, despite recent turbulence in its stock price.\r\n\r\nThe company’s Space segment, which saw a 10% increase in sales to $3.27 billion in Q1 2024, focuses on satellites, space probes, and deep space exploration​​. Lockheed Martin is a key contractor for NASA, contributing to missions like the Artemis program.\r\n\r\nThe aerospace giant reported robust financial performance with net sales of $17.2 billion. This translates to an EPS of $27.31 year-to-date. The company boasts a profit margin of 9.73% and an impressive return on equity of 83.2%.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nLockheed Martin’s strategic focus on high-growth sectors is evident in its $4.1 billion contract with the U.S. Missile Defense Agency for hypersonic threat tracking. Furthermore, its aeronautics unit saw significant gains, largely due to the F-35 program, contributing to a $735 million increase in sales.\n\nLockheed projects sustained production rates and a positive revenue trajectory, with a forecasted increase to $78.61 billion by 2028. Analysts have set a target price of $489.10, signaling strong upside potential for LMT.\n\nRocket Lab USA (RKLB) Person holding smartphone with logo of aerospace company Rocket Lab USA Inc. (RKLB) on screen in front of website. Focus on phone display. Unmodified photo.\n\nSource: T. Schneider / Shutterstock.com\n\nRocket Lab USA (NASDAQ:RKLB) is an emerging player in the space sector. It is tapping into the global space economy’s potential growth, which is projected to triple to $1 trillion by 2040.\n\nDespite financial challenges, Rocket Lab’s strategic position makes it a compelling space stock in June 2024. The company reported Q1 2024 revenue of $93 million, although it currently has an EPS of -$0.37​.\n\nStory continues\n\nRocket Lab’s recent $515 million U.S. government contract for designing and operating space vehicles is something to note. The contract involves designing, manufacturing, delivering, and operating 18 space vehicles, with a base amount of $489 million and potential incentives of $26 million. The company has successfully launched 42 Electron rockets and continues to demonstrate technological advancements​.\r\n\r\nWith an analyst target price of $7.57 and a 52-week high of $8.05, Rocket Lab offers upside for growth-oriented investors​.\n\nVirgin Galactic (SPCE) spce stock\n\nSource: rafapress / Shutterstock.com\n\nVirgin Galactic (NYSE:SPCE), headquartered in Las Cruces, New Mexico, is an aerospace company focused on developing manned spaceflight for private individuals and researchers.\n\nAs of March 31, 2024, the company reported a loss of 25 cents per share and revenue came in at 2 million. With a market capitalization of $347.9 million and shares outstanding totaling 411.4 million, SPCE faces financial challenges, reflected in its negative EPS of -$1.17.\n\nDespite the company’s efforts, including plans to produce larger Delta-class ships and price tickets at $450,000 per seat, profitability remains elusive. The decision to raise $400 million through a common stock sale caused an 18% share price drop, underlining investor concerns.\n\nWith a price to sales ratio of 63.54 and a book value of $1.03, Virgin Galactic’s high volatility and uncertain financial trajectory pose substantial risks, necessitating careful consideration for potential investors.\n\nStill, despite these concerns, SPCE could be one of the best pure-play space stocks for investors to consider adding to their portfolios thanks to its tiny valuation at just 85 cents per share.\n\nOn the date of publication, Matthew Farley did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nMatthew started writing coverage of the financial markets during the crypto boom of 2017 and was also a team member of several fintech startups. He then started writing about Australian and U.S. equities for various publications. His work has appeared in MarketBeat, FXStreet, Cryptoslate, Seeking Alpha, and the New Scientist magazine, among others.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post The 3 Best Space Stocks to Buy in June 2024 appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-best-space-stocks-buy-101500950.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RKLB.US",
            "SPCE.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.018,
            "neu": 0.856,
            "pos": 0.125
        }
    },
    {
        "date": "2024-06-11T00:00:00+00:00",
        "title": "The 3 Best Space Stocks to Buy in June 2024",
        "content": "Discover the 3 best space stocks to buy in June 2024. Invest in these promising companies pushing the boundaries of space exploration.",
        "link": "https://investorplace.com/2024/06/the-3-best-space-stocks-to-buy-in-june-2024/",
        "symbols": [
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.832,
            "neg": 0,
            "neu": 0.672,
            "pos": 0.328
        }
    }
]