[
    {
        "date": "2024-08-11T11:00:23+00:00",
        "title": "Here's What To Make Of Lockheed Martin's (NYSE:LMT) Decelerating Rates Of Return",
        "content": "There are a few key trends to look for if we want to identify the next multi-bagger. Amongst other things, we'll want to see two things; firstly, a growing return on capital employed (ROCE) and secondly, an expansion in the company's amount of capital employed. Ultimately, this demonstrates that it's a business that is reinvesting profits at increasing rates of return. So when we looked at Lockheed Martin (NYSE:LMT), they do have a high ROCE, but we weren't exactly elated from how returns are trending.\n\nReturn On Capital Employed (ROCE): What Is It?\n\nJust to clarify if you're unsure, ROCE is a metric for evaluating how much pre-tax income (in percentage terms) a company earns on the capital invested in its business. The formula for this calculation on Lockheed Martin is:\n\nReturn on Capital Employed = Earnings Before Interest and Tax (EBIT) ÷ (Total Assets - Current Liabilities)\n\n0.24 = US$8.9b ÷ (US$55b - US$18b) (Based on the trailing twelve months to June 2024).\n\nThus, Lockheed Martin has an ROCE of 24%.  In absolute terms that's a great return and it's even better than the Aerospace & Defense industry average of 11%.\n\nView our latest analysis for Lockheed Martin  roce\n\nAbove you can see how the current ROCE for Lockheed Martin compares to its prior returns on capital, but there's only so much you can tell from the past. If you'd like to see what analysts are forecasting going forward, you should check out our free analyst report for Lockheed Martin .\n\nSo How Is Lockheed Martin's ROCE Trending?\n\nOver the past five years, Lockheed Martin's ROCE and capital employed have both remained mostly flat. Businesses with these traits tend to be mature and steady operations because they're past the growth phase. So while the current operations are delivering respectable returns, unless capital employed increases we'd be hard-pressed to believe it's a multi-bagger going forward. With fewer investment opportunities, it makes sense that Lockheed Martin has been paying out a decent 46% of its earnings to shareholders. Unless businesses have highly compelling growth opportunities, they'll typically return some money to shareholders.\n\nThe Bottom Line On Lockheed Martin's ROCE\n\nWhile Lockheed Martin has impressive profitability from its capital, it isn't increasing that amount of capital. Although the market must be expecting these trends to improve because the stock has gained 67% over the last five years. But if the trajectory of these underlying trends continue, we think the likelihood of it being a multi-bagger from here isn't high.\n\nStory continues\n\nOn a final note, we've found  2 warning signs for Lockheed Martin that we think you should be aware of.\n\nIf you'd like to see other companies earning high returns, check out our freelist of companies earning high returns with solid balance sheets here.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/heres-lockheed-martins-nyse-lmt-110023621.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.019,
            "neu": 0.854,
            "pos": 0.127
        }
    }
]