[
    {
        "date": "2024-09-02T14:51:00+00:00",
        "title": "Boeing to Expand Facility in Mississippi &amp; Support Aerosystem Demand",
        "content": "The Boeing Company’s BA business unit, Aurora Flight Sciences, commenced a major expansion of its manufacturing plant in Columbus, MS, next to the Golden Triangle Regional Airport. The unit specializes in producing cutting-edge composite assemblies and parts for both military and commercial aircraft.\r\n\r\nThe unit also collaborates with Mississippi State University and East Mississippi Community College to enhance workforce development, higher education and research in advanced manufacturing. Under the project, Aurora's expanding aerosystem business will be supported by the addition of new automation, robotics and non-destructive inspection technologies, as well as a 50,000-square-foot expansion and renovation of 40,000 square feet of existing space.\r\n\r\nThe expansion of the facility will support the manufacture of MQ-25 Stingray composite skins for Boeing, and an expanded amount of composite components for executive aircraft will be supported. The plant will also produce components for NASA's X-66 sustainable flying demonstration aircraft, among other things.\n\nRising Demand for Boeing’s Products\n\nCountries worldwide increasing their defense budgets in response to modernization needs, geopolitical tensions and regional conflicts have led to higher demand for advanced military aircraft components.\r\n\r\nPer a report by Econ Market Research, the Global Aerospace and Defense Materials market is projected to reach nearly $30.01 billion by 2032, with a CAGR of 4.8% between 2024 and 2032. Such growth opportunities offered by the aforementioned market should bode well for Boeing in the coming years.\r\n\r\nBoeing's Everett, WA, manufacturing plant is a major facility for assembling military and commercial aircraft. It has the largest manufacturing building in the world, producing the 747, 767, 777 and 787 airplanes.\r\n\r\nThe Auburn, WA-based Machine Fabrication Manufacturing Business Unit manufactures a range of Boeing airplane parts, including fuselage, landing gear and wings. It manufactures 22,000 components on average every month and more than 1,000 distinct products.\n\nOpportunities for BA’s Peers\n\nAerospace companies that are likely to reap the benefits of the growing Aerospace and Defense Materials market are as follows:  \r\n\r\nAirbus Group EADSY: Its production center in Columbus, MS, produces the H125 commercial helicopter and the U.S. Army's UH-72A Lakota Light Utility Helicopter. The plant handles the assembly and customization of other Airbus Helicopters models and manufactures components for use on new-production helicopters.\r\n\r\nAirbus has a long-term (three to five years) earnings growth rate of 13.9%. The Zacks Consensus Estimate for EADSY’s 2024 sales calls for an improvement of 7.2% from the prior-year reported figure.\r\n\r\nHexcel Corporation HXL: Its West Valley City is home to the largest carbon fiber and matrix manufacturing plant located at Salt Lake City, UT, which is a leading worldwide supplier of carbon fiber and prepregs, which are used in aircraft components and structures.\r\n\r\nHexcel boasts a long-term earnings growth rate of 21.9%. The Zacks Consensus Estimate for HXL’s 2024 sales implies an improvement of 7.6% from the prior-year reported figure.\r\n\r\nLockheed Martin Corp. LMT: Its Greenville site in South Carolina is the home of the F-16 Fighting Falcon production line and provides nose-to-tail aircraft modification, maintenance, repair and overhaul services for both military and civil aircraft. \r\n\r\nLockheed Martin boasts a long-term earnings growth rate of 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales suggests an improvement of 5.3% from the prior-year reported figure.\n\nStory continues\n\nBA Stock Price Movement\n\nIn the past month, shares of Boeing have risen 2.2% compared with the industry’s growth of 4.4%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nBoeing currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nHexcel Corporation (HXL) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/boeing-expand-facility-mississippi-support-145100869.html",
        "symbols": [
            "0BOE.LSE",
            "0KVV.IL",
            "0R3E.LSE",
            "1AIR.MI",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.F",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.016,
            "neu": 0.876,
            "pos": 0.108
        }
    }
]