[
    {
        "date": "2024-05-14T13:45:00+00:00",
        "title": "Leidos (LDOS) Wins $631M Deal to Aid US Army's DIABLO Program",
        "content": "Leidos Holdings, Inc. LDOS recently clinched a $631 million contract from the U.S. Army to support the Development, Integration, Acquisitions, Bridging to Logistics & Operations (“DIABLO”) program. This contract win should strengthen LDOS’ footprint in the military sensor market.\n\nAbout the Deal\n\nThe aforementioned contract, overseen by the Project Director Sensors-Aerial Intelligence (“PD SAI”), calls for the development, acquisition, fielding and lifecycle support of tactically relevant aerial intelligence, surveillance and reconnaissance (AISR) sensors and integrated systems across a wide range of intelligence capabilities. This will enable PD SAI to be agile and adaptable while advancing the Army's modernization objectives, thereby enhancing support for the U.S. Army's future capabilities.\n\nLeidos’ Take on Military Sensors\n\nLeidos Holdings develops effective advanced sensor algorithms for military sensor systems. Its product portfolio includes a wide variety of military sensors like electro-optics/infrared (EO/IR) sensors, electromagnetic radiation sensors, magnetic sensors and a few more. The company’s complicated sensor algorithms are vital for numerous missions, including ballistic missile defense, air defense, air-to-ground systems, border security, and intelligence, surveillance and reconnaissance.\r\n\r\nOne such of its products is the Assured Data Engine for Positioning and Timing sensor solution for the Defense Advanced Research Projects Agency, which allows warfighters to maintain positioning and timing awareness when a GPS signal is compromised either in a remote environment like a rocky canyon or when adversaries intentionally distort signals through jamming or spoofing.\r\n\r\nSuch significant products in its portfolio enable Leidos to witness a stream of order flow, like the latest one, which boosts its backlog and future revenue generation prospects.\n\nGrowth Prospects\n\nThe paradigm of the defense structure needs to be continuously upgraded with innovative technologies due to the ever-changing defense needs of nations worldwide. Hence, integrated and up-to-date sensors play a critical role in effectively defending a nation’s border and are thus expected to witness increased demand in the coming days.\r\n\r\nPer a report from Mordor Intelligence, the military sensor market is projected to witness a CAGR of 6.2% over the 2024-2029 period. This should bode well for Leidos, which offers a wide range of technologically developed sensor systems for military applications.\r\n\r\nOther defense majors who have carved out a position in the military sensor market and should benefit from this market’s growth prospects are as follows:\r\n\r\nLockheed Martin LMT:The company is one of the leading manufacturers of military sensors. Its infrared sensor systems provide advanced precision targeting, navigation, threat detection and next-generation intelligence, surveillance and reconnaissance capabilities. Some of LMT’s renowned sensors are LONGBOW Sensors, IRST21 sensor system, Legion Pod, etc.\r\n\r\nThe stock boasts a long-term earnings growth rate of 4.2%. The Zacks Consensus Estimate for LMT’s 2024 sales indicates an improvement of 2.9% from the previous year’s reported sales.\r\n\r\nNorthrop Grumman NOC: The company is an industry leader at the forefront of the design, development and deployment of some of the world’s most cutting-edge sensors and systems. Its product range includes JADC2, EO/IR sensors, G/ATOR, etc.\r\n\r\nThe stock boasts a long-term earnings growth rate of 9.9%. The Zacks Consensus Estimate for NOC’s 2024 sales implies an improvement of 4.6% from the previous year’s reported level.\r\n\r\nGeneral Dynamics GD: The company designs and develops high-performance sensors to gather data across the sea, land, air, space and cyber domains. Its TACLANE Trusted Sensor software can be used in several network topologies as an in-line HAIPE sensor or a separate secured network sensor. Therefore, it can act as an Intrusion Detection System or Intrusion Prevention System.\r\n\r\nThe stock boasts a long-term earnings growth rate of 11%. The Zacks Consensus Estimate for GD’s 2024 sales calls for an increase of 10.5% from the previous year’s reported figure.\n\nStory continues\n\nPrice Movement\n\nIn the past three months, shares of Leidos have risen 20.2% against the industry’s decline of 2.8%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLeidos currently sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nLeidos Holdings, Inc. (LDOS) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/leidos-ldos-wins-631m-deal-134500474.html",
        "symbols": [
            "0R3E.LSE",
            "L1DO34.SA",
            "LDOS.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "S6IA.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.014,
            "neu": 0.806,
            "pos": 0.18
        }
    },
    {
        "date": "2024-05-14T12:05:00+00:00",
        "title": "Lockheed (LMT) Secures a $332M Deal to Aid GMLRS Program",
        "content": "Lockheed Martin Corp.’s LMT Missiles and Fire Control (MFC) business segment recently clinched a modification contract for the Guided Multiple Launch Rocket System (GMLRS). The award has been offered by the Army Contracting Command, Redstone Arsenal, AL.\n\nValued at $332 million, the contract is expected to be completed by Oct 20, 2027.\n\nWhat’s Favoring Lockheed?\n\nNations are reinforcing their military capabilities to strengthen their defense structure in the growing threat environment. In this context, increased spending has been witnessed on missile capabilities, resulting in a significant order inflow for companies like Lockheed Martin, which enjoy a dominant position in the development of missiles.\n\nTo this end, it is imperative to mention that LMT’s GMLRS is a combat-proven, highly accurate, all-weather, precision-guided rocket system, which is capable of delivering precision strikes farther than many conventional weapons. Notably, the company’s MLRS Family of Munitions includes a variety of precision-strike rockets and missiles, with ongoing evolutionary development to meet the needs of today’s warfighter. Impressively, GMLRS rockets boast a reliability rate of more than 98%.\n\nSuch remarkable features of the GMLRS are likely to have been boosting its demand significantly. This can be gauged from the fact that more than 60,000 GMLRS rockets have been produced to date.\n\nWhat Lies Ahead?\n\nThe global peace index reflects an unstable environment worldwide with the Russia-Ukraine war continuing for more than two years now, in addition to the ongoing hostility prevalent in different parts of the Middle East. This has set the stage for the defense sector to witness rising demand for military products, particularly missiles, as nations worldwide strive to protect their borders from unprecedented attacks.\n\nThis should bode well for the missile industry, as evident from the Mordor Intelligence firm’s projection, which suggests a CAGR of 5% over the 2024-2029 period for the missile and missile defense systems market.\n\nLMT’s proficiency in missile manufacturing, particularly that of GMLRS, positions it favorably to capitalize on such growth opportunities. The fact that Lockheed Martin is working with the U.S. Army to increase GMLRS production capacity to 14,000 per year in 2025 makes us confident that the company will witness more order flows for its GMLRS product, like the latest one. Such contract wins, in turn, are likely to boost revenue growth for the company’s MFC unit, which witnessed a solid 25.3% year-over-year growth in its top line in the first quarter.\n\nStory continues\n\nOpportunities for Peers\n\nLMT apart, other prominent defense contractors that stand to benefit from the expanding missile and missile defense systems market are as follows:\r\n\r\nNorthrop Grumman NOC: Northrop is a prominent developer of missile systems and counter systems, including strategic deterrents, subsystems and components. Its product portfolio includes the Integrated Air and Missile Defense Battle Command System, the Guided Multiple Launch Rocket System propulsion and warhead subsystems, the Hypersonic Attack Cruise Missile, the Advanced Anti-Radiation Guided Missile and a few other combat-proven products that support missile defense systems.\n\nNOC boasts a long-term earnings growth rate of 9.9%. The Zacks Consensus Estimate for Northrop’s 2024 sales indicates an improvement of 4.6% from the 2023 reported figure.\n\nGeneral Dynamics GD: General Dynamics’ Ordnance and Tactical Systems is the system integrator of the 2.75-inch Hydra-70 family of rockets. It also produces composite rocket motor cases and launch tubes for tactical and strategic missiles.\n\nGD has a long-term earnings growth rate of 11%. The Zacks Consensus Estimate for General Dynamics’ 2024 sales indicates an improvement of 10.5% from the 2023 reported figure.\n\nRTX Corp. RTX: RTX’s business unit, Missiles and Defense, is a prominent U.S. missile maker. Its portfolio includes the AIM-9X Sidewinder missile, the AIM-9X Block II missile, RAM-guided missile weapon system, etc.\n\nRTX boasts a long-term earnings growth rate of 10.3%. The Zacks Consensus Estimate for its 2024 sales indicates an improvement of 6.2% from the 2023 reported figure.\n\nPrice Movement\n\nIn the past year, shares of Lockheed Martin have risen 4.1% against the industry’s 7.9% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nLockheed Martin currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-lmt-secures-332m-deal-120500465.html",
        "symbols": [
            "0IUC.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.048,
            "neu": 0.782,
            "pos": 0.171
        }
    }
]