[
    {
        "date": "2024-05-24T11:00:00+00:00",
        "title": "Stocks to Buy: 7 Undeniable Dow Darlings to Pile Into Now",
        "content": "Investing in Dow stocks is always a reasonable strategy for those who value the American economy. The Dow Jones is composed of 30 prominent publicly listed U.S. firms. Those firms are large and tend to be leaders in their respective industries. Thus, an investment is a vote of confidence in American industry and the economy at large.\n\nIt’s hard to argue that any of the 30 stocks in the Dow are outright terrible. It’s much easier to argue that a handful are particularly strong at any given time. That’s what we’ll be doing in this article.\n\nThe stocks and companies discussed below have had varying degrees of success in 2024. Some are up by double digits while others are down nearly as much. But there’s reason to believe that all will rise moving forward.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nMicrosoft (MSFT) Wide angle view of a Microsoft sign at the headquarters for personal computer and cloud computing company, with office building in the background.. MSFT stock\n\nSource: VDB Photos / Shutterstock.com\n\nMicrosoft (NASDAQ:MSFT) is a clear leader in artificial intelligence. The firm’s early and strong investment in AI has paid dividends, propelling the stock much higher. However, investors may wonder if the majority of gains have already been gotten and whether it makes sense to sit Microsoft out at this point.\n\nThat would be a poor decision as AI spending is sure to increase from here. That increased spending is likely to come from congress. A bipartisan group of senators is advocating for $32 billion in emergency spending on AI. Those senators are working to find greater consensus across the aisle. The worry is that if they don’t the U.S. will fall behind in relation to artificial intelligence.\n\nMicrosoft is likely to be a big beneficiary of any such spending. Otherwise, investors should simply consider Microsoft because it is fundamentally very strong. Top-line growth reached 17% in the most recent quarter. It’s difficult to find such a combination of size and growth elsewhere.\n\nAmgen (AMGN) the Amgen (AMGN) logo on a building during daylight\n\nSource: Michael Vi / Shutterstock.com\n\nAmgen (NASDAQ:AMGN) stock is a strong investment in the budding weight-loss drug category. Investors know that Eli Lilly (NYSE:LLY) and Novo Nordisk (NYSE:NVO) are the early leaders in that industry. However, a number of upcoming firms aim to chip away at their early dominance. Amgen is one of those firms.\n\nThe market knows this and has already reacted sending Amgen’s stock higher in the first month of May. The best time to have been invested was prior to recent announcements but there is still reason to remain highly optimistic.\n\nThe reason to believe so lies in the advantages of Amgen’s injectable drug, Maritide. It requires fewer injections than competitor drugs from Eli Lilly and Novo Nordisk. Further, Maritide may produce greater weight loss than competitor drugs. Beyond that, Amgen may be better suited to produce large volumes of drugs. It’s no secret that Eli Lilly and Novo Nordisk have faced problems in that regard. However, Amgen is expected to do much better on that front.\n\nStory continues\n\nHoneywell (HON) Honeywell (HON) logo on front of glass building\n\nSource: josefkubes / Shutterstock.com\n\nHoneywell (NASDAQ:HON) stock represents an industrial conglomerate well positioned for the future economy. Honeywell is highly notable for its position relative to automation of building and industry. When it comes to things like AI robots and the internet of things, Honeywell is a strong choice.\n\nSo, when those segments slow investors would generally expect Honeywell to grow weaker. That isn’t actually the case based on recent results. While Honeywell’s industrial and building automation segments did slow down in the most recent quarter, the company’s aviation business more than made up for the slowing.$3.67 billion in sales from that unit helped the company beat guidance of $9.03 billion in sales that was expected.\n\nThe point here is simple: Honeywell is proving its resilience and strong balance overall. The company continues to be well positioned to take advantage of the automation trend but isn’t fully dependent on it. Honeywell is a strong Dow stock and a great industrial share to consider for investors.\n\nMcDonald’s (MCD) New McDonalds Being Built in 2020, Close Up of Main McD Sign\n\nSource: Retail Photographer / Shutterstock.com\n\nMcDonald’s (NYSE:MCD) stock has performed poorly in 2024, falling by more than 7%. Company management has been well aware of an emerging issue with the company’s value platform, especially in light of rampant inflation.\n\nThe company proposed that franchisees bring back a $5 meal deal including four items earlier this year. The company again brought up the proposal this May as it has become more and more apparent that a consumer pullback is at hand. A few days later it was announced that the $5 meal deal will return for four weeks beginning in late June. The move should be a boon to the stock which has suffered due to stagnant results of late.\n\nCosts associated with the promotion will be largely borne by franchisees. That’s why franchisees in high cost areas such as California had pushed back against the promotion earlier this year. It’s done now. McDonald’s has a chance to regain some of the market as a value option that it had lost. The stock has long been a strong performer and now’s a good time to invest.\n\nAmerican Express (AXP) an American Express (AXP) credit card sticking out of someone's pocket\n\nSource: Shutterstock\n\nAmerican Express (NYSE:AXP) stock continues to do well as the upper class strengthens and continues to do well itself. Retail spending has been very strong through the first of 4 months of 2024 which is reflected in American Express’s earnings.\n\nEarnings jumped up by 39% during the first quarter reflecting the overall strength of American Express. The company caters to a more affluent customer base and for investors who believe that the rich will continue to get richer, American Express is a strong investment.\n\nThat notion certainly appears to be correct when it comes to credit card stocks. American Express has outperformed Visa (NYSE:V) and Mastercard (NYSE:MA) this year and in the longer term as well. Visa and MasterCard cater to a less affluent customer base. Thus, there’s a strong argument to be made in favor of American Express simply because of its customer base affluence. All three of the stocks are reasonable investments but I’d argue that American Express is the clear leader.\n\nCisco Systems (CSCO) the cisco (CSCO) logo on a wall\n\nSource: Valeriya Zankovych / Shutterstock.com\n\nThere are a lot of reasons to like Cisco Systems (NASDAQ:CSCO) stock at the moment. It’s relatively cheap at the moment and underappreciated. Cisco Systems also pays a very reliable dividend, yielding 3.2% currently. In addition, the company is transitioning to a more reliable sales base that should interest investors. That’s a good place to start.\n\nCisco Systems recently closed its acquisition of Splunk which will push its sales mix decidedly in favor of software. That’s important because software sales are recurring in nature. Thus, Cisco Systems will benefit from a more stable and predictable revenue mix. The company is already proven to be very stable although it relied on more one-off hardware networking sales historically.\n\nInvestors should also note that Cisco Systems is very attractive on the basis of its forward P/E ratio. That ratio is lower than its already attractive trailing P/E ratio — suggesting that earnings will rise.\n\nSalesforce (CRM) The entrance sign of Salesforce Tower, at the American cloud-based software company Salesforce's (CRM stock) Headquarters campus in San Francisco, California.\n\nSource: Tada Images / Shutterstock.com\n\nSalesforce (NYSE:CRM) is the dominant force in customer relationship management. The stock has long benefited from that position.It should continue to strengthen moving forward for multiple reasons, one of which is its artificial intelligence investment.\n\nSalesforce is looking to acquire Informatica for roughly $11 billion. Salesforce is looking to buy the AI powered cloud data management vendor. The move should not be particularly surprising as Google (NASDAQ:GOOG,GOOGL) is set to buy Salesforce competitor, HubSpot (NYSE:HUB).\n\nAnalysts argue that sales forces move better positions it for the AI opportunity over the coming decade. More specifically, It should help Salesforce to better integrate with data warehouses via AI.\n\nHowever, the deal will not come without substantial pushback from some Salesforce investors. the company faced a lot of pushback when it acquired Slack in 2021 for $28 billion. Nevertheless, Salesforce continues to dominate customer relationship management and is expected to grow rapidly this year and next.\n\nOn the date of publication, Alex Sirois did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.comPublishing Guidelines.\n\nAlex Sirois is a freelance contributor to InvestorPlace whose personal stock investing style is focused on long-term, buy-and-hold, wealth-building stock picks. Having worked in several industries from e-commerce to translation to education and utilizing his MBA from George Washington University, he brings a diverse set of skills through which he filters his writing.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post Stocks to Buy: 7 Undeniable Dow Darlings to Pile Into Now appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/stocks-buy-7-undeniable-dow-110000165.html",
        "symbols": [
            "4333.HK",
            "AEC1.BE",
            "AEC1.DU",
            "AEC1.F",
            "AEC1.HM",
            "AEC1.MU",
            "AEC1.STU",
            "AEC1.XETRA",
            "AMG.BE",
            "AMG.DU",
            "AMG.F",
            "AMG.HM",
            "AMG.MU",
            "AMG.STU",
            "AMG.XETRA",
            "AMGN.MX",
            "AMGN.US",
            "AMGN34.SA",
            "AXP.BA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.03,
            "neu": 0.825,
            "pos": 0.145
        }
    },
    {
        "date": "2024-05-24T00:00:00+00:00",
        "title": "Stocks to Buy: 7 Undeniable Dow Darlings to Pile Into Now",
        "content": "Most Dow stocks are strong investments but these 7 stand out at the moment as the macroenvironment trends positive again.",
        "link": "https://investorplace.com/2024/05/stocks-to-buy-7-undeniable-dow-darlings-to-pile-into-now/",
        "symbols": [
            "AMGN.US",
            "AXP.US",
            "CRM.US",
            "CSCO.US",
            "HON.US",
            "MCD.US",
            "MSFT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.794,
            "neg": 0,
            "neu": 0.707,
            "pos": 0.293
        }
    }
]