[
    {
        "date": "2024-09-04T12:30:00+00:00",
        "title": "HONEYWELL COMPLETES ACQUISITION OF CAES",
        "content": "$1.9 billion acquisition will help drive long-term growth and further diversify revenue streams on leading defense platforms Enhances Honeywell's defense and space portfolio with high-reliability radio frequency technologies that present significant opportunities for international growth  Deepens Honeywell's aerospace expertise and operations with addition of 2,200 skilled employees and highly automated facilities\n\nCHARLOTTE, N.C., Sept. 4, 2024 /PRNewswire/ -- Honeywell (NASDAQ: HON) today announced the completion of its acquisition of CAES Systems Holdings LLC (CAES) from private equity firm Advent International for approximately $1.9 billion in an all-cash transaction. The acquisition enhances Honeywell's defense technology solutions across land, sea, air and space and is also expected to create favorable tailwinds for growth across Honeywell's Aerospace Technologies business. (PRNewsfoto/Honeywell)\n\nCAES expands Honeywell's current defense and space portfolio with scalable offerings that enable Honeywell to both increase production and upgrade positions on critical platforms that include F-35, EA-18G, AMRAAM and GMLRS. Honeywell will also benefit from the ability to introduce its existing offerings on new platforms, such as the Navy Radar (SPY-6) and UAS and C-UAS technologies.\n\n\"Honeywell's acquisition of CAES builds on our leading position in defense technologies, while also strengthening and expanding the solutions and capabilities we can offer across multiple critical military platforms,\" said Honeywell Aerospace Technologies President and CEO Jim Currier. \"Together with CAES, we will continue to set the standard for excellence in the industry and deliver specialized solutions that will keep our customers at the forefront of innovation.\"\n\nCAES marks the fourth transaction Honeywell has announced this year as part of its disciplined capital deployment strategy. It follows Honeywell's recent completion of its acquisition of Carrier's Global Access Solutions business in June 2024. The company is focused on high-return acquisitions that will drive future growth across its portfolio, which is aligned with the three compelling megatrends of automation, the future of aviation and energy transition.\n\nHoneywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Forge IoT platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world smarter, safer and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nStory continues\n\nWe describe certain trends and other factors that drive our business and future results in this release. Such discussions contain forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended (the Exchange Act). Forward-looking statements are those that address activities, events, or developments that management intends, expects, projects, believes or anticipates will or may occur in the future. They are based on management's assumptions and assessments in light of past experience and trends, current economic and industry conditions, expected future developments and other relevant factors, many of which are difficult to predict and outside of our control. They are not guarantees of future performance, and actual results, developments and business decisions may differ significantly from those envisaged by our forward-looking statements. We do not undertake to update or revise any of our forward-looking statements, except as required by applicable securities law. Our forward-looking statements are also subject to material risks and uncertainties, including ongoing macroeconomic and geopolitical risks, such as lower GDP growth or recession, capital markets volatility, inflation, and certain regional conflicts, that can affect our performance in both the near- and long-term. In addition, no assurance can be given that any plan, initiative, projection, goal, commitment, expectation, or prospect set forth in this release can or will be achieved. These forward-looking statements should be considered in light of the information included in this release, our Form 10-K and other filings with the Securities and Exchange Commission. Any forward-looking plans described herein are not final and may be modified or abandoned at any time.\n\nContacts: Media Investor Relations Stacey Jones  Sean Meakim (980) 378-6258  (704) 627-6200 Stacey.Jones@honeywell.com  Sean.Meakim@honeywell.com  Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-completes-acquisition-of-caes-302237974.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-completes-acquisition-caes-123000437.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.036,
            "neu": 0.818,
            "pos": 0.146
        }
    }
]