[
    {
        "date": "2024-10-17T14:30:00+00:00",
        "title": "5 Stocks That Led Dow ETF to New Heights",
        "content": "The Dow Jones Industrial Average rallied to new highs on a solid start to third-quarter earnings. The benchmark topped 43,000 for the first time early this week and is up 14.3% so far this year. \r\n\r\nSPDR Dow Jones Industrial Average ETF DIA, which tracks the Dow Jones Index, has gained 15% this year. While most of the stocks in the ETF portfolio have been rising over the past week, we have highlighted five that have been leading the way higher. These are JPMorgan Chase & Co. JPM, The Goldman Sachs Group Inc. GS, Honeywell International Inc. HON, McDonald’s MCD and Apple Inc. AAPL.\r\n\r\nThe third-quarter earnings season is off to a strong start, with companies beating estimates and providing a reassuring comment on underlying economic trends. Total earnings for the 48 S&P 500 members that have reported third-quarter results so far are up 5.2% on 4.9% higher revenues, with 81.3% beating EPS estimates and 72.9% beating revenue estimates. This is a better beat ratio than the group of companies seen in other recent periods (read: 5 Sector ETFs to Bet on This Earnings Season).\r\n\r\nAdditionally, the latest blockbuster jobs and inflation report renewed investors’ confidence in the economy's health. The jobs data showed the biggest jump in six months in September, a fall in the unemployment rate and a solid wage increase, all pointing to a resilient economy. The United States added 254,000 jobs last month, up from a revised 159,000 in August, and unemployment dipped to 4.1% from 4.2% in August. Meanwhile, inflation cooled down to 2.4% in September, down from 2.5% recorded in August and in line with market expectations of 2.3%-2.4%. The inflation rate peaked at a 41-year high of 8.9% in June 2022.\r\n\r\nFurther, the Fed rate cut cycle benefited the stocks. Lower rates primarily benefit cyclical sectors like industrials, financials and consumer discretionary. Being highly exposed to cyclical sectors, the blue-chip index is set to outperform from this trend. Lower rates generally lead to reduced borrowing costs for mortgages, credit cards and other consumer and business loans. This helps businesses to expand their operations more easily, resulting in increased profitability. This, in turn, stimulates economic growth and boosts the stock market.\n\nDIA in Focus\n\nSPDR Dow Jones Industrial Average ETF is one of the largest and most popular ETFs in the large-cap space, with an AUM of $37 billion and an average daily volume of 3 million shares. It tracks the Dow Jones Industrial Average Index, holding 30 stocks in its basket, with each making up for less than 8.6% share. Financials (23.7%), information technology (19.2%), healthcare (17.8%), consumer discretionary (15.3%) and industrials (13.7%) are the top five sectors. \r\n\r\nSPDR Dow Jones Industrial Average ETF charges 16 bps in annual fees and has a Zacks ETF Rank #1 (Strong Buy) with a Medium risk outlook (read: 5 Sector ETFs to Bet on This Earnings Season).\n\nStory continues\n\nBest-Performing Stocks of DIA\n\nJPMorgan is one of the biggest global banks, with assets worth 4.14 trillion and stockholders’ equity worth $340.6 billion as of June 30, 2024. The stock has gained 5.5% in a week and makes up for 3.4% in the DIA portfolio. It has an expected earnings growth rate of 7.9% for this year. JPMorgan currently has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\r\n\r\nGoldman is a leading global financial holding company that provides IB, securities, investment management and consumer banking services to a diversified client base. The stock has gained 5% over the past week and has an estimated earnings growth rate of 55.2% for this year. Goldman accounts for an 8% share in DIA’s portfolio and has a Zacks Rank #3. \r\n\r\nHoneywell International is a global diversified technology and manufacturing company, with a wide range of products and services. Its diversified portfolio of solutions serves customers globally with aerospace products and services, energy-efficient products and solutions for businesses, and process technology, specialty chemicals, electronic and advanced materials for refining and petrochemicals. HON has risen 5% this year over the past week and makes up for 3.3% of DIA portfolio. Honeywell has an expected earnings growth rate of 10.3% for this year and has a Zacks Rank #4 (Sell).\r\n\r\nMcDonald’s is a leading fast-food chain that currently operates more than 39,000 restaurants in more than 100 countries. The company mainly operates and franchises quick-service restaurants (QSRs) under the McDonald’s brand. The stock has gained 3.8% over the past week and accounts for a 4.8% share in the DIA basket. McDonald’s is expected to see an earnings decline of 2% for this year and has a Zacks Rank #3.\r\n\r\nApple designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The stock has gained 3.6% in a week and makes up for 3.6% in the DIA portfolio. It has an expected earnings growth rate of 13.4% for the fiscal year (ending Sept. 2025). Apple currently has a Zacks Rank #3.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Goldman Sachs Group, Inc. (GS) : Free Stock Analysis Report\n\nJPMorgan Chase & Co. (JPM) : Free Stock Analysis Report\n\nApple Inc. (AAPL) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nMcDonald's Corporation (MCD) : Free Stock Analysis Report\n\nSPDR Dow Jones Industrial Average ETF (DIA): ETF Research Reports\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/5-stocks-led-dow-etf-143000314.html",
        "symbols": [
            "0R2V.IL",
            "AAPL.BA",
            "AAPL.MX",
            "AAPL.NEO",
            "AAPL.SN",
            "AAPL.US",
            "AAPL34.SA",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "APC.BE",
            "APC.DU",
            "APC.F",
            "APC.HA",
            "APC.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.025,
            "neu": 0.849,
            "pos": 0.126
        }
    },
    {
        "date": "2024-10-17T14:01:29+00:00",
        "title": "Honeywell International Inc. (HON) Reports Next Week: Wall Street Expects Earnings Growth",
        "content": "Wall Street expects a year-over-year increase in earnings on higher revenues when Honeywell International Inc. (HON) reports results for the quarter ended September 2024. While this widely-known consensus outlook is important in gauging the company's earnings picture, a powerful factor that could impact its near-term stock price is how the actual results compare to these estimates.\n\nThe earnings report, which is expected to be released on October 24, 2024, might help the stock move higher if these key numbers are better than expectations. On the other hand, if they miss, the stock may move lower.\n\nWhile management's discussion of business conditions on the earnings call will mostly determine the sustainability of the immediate price change and future earnings expectations, it's worth having a handicapping insight into the odds of a positive EPS surprise.\n\nZacks Consensus Estimate\n\nThis company is expected to post quarterly earnings of $2.51 per share in its upcoming report, which represents a year-over-year change of +10.6%.\n\nRevenues are expected to be $9.9 billion, up 7.4% from the year-ago quarter.\n\nEstimate Revisions Trend\n\nThe consensus EPS estimate for the quarter has been revised 0.43% lower over the last 30 days to the current level. This is essentially a reflection of how the covering analysts have collectively reassessed their initial estimates over this period.\n\nInvestors should keep in mind that an aggregate change may not always reflect the direction of estimate revisions by each of the covering analysts.\n\nEarnings Whisper\n\nEstimate revisions ahead of a company's earnings release offer clues to the business conditions for the period whose results are coming out. This insight is at the core of our proprietary surprise prediction model -- the Zacks Earnings ESP (Expected Surprise Prediction).\n\nThe Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a more recent version of the Zacks Consensus EPS estimate. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.\n\nThus, a positive or negative Earnings ESP reading theoretically indicates the likely deviation of the actual earnings from the consensus estimate. However, the model's predictive power is significant for positive ESP readings only.\n\nA positive Earnings ESP is a strong predictor of an earnings beat, particularly when combined with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold). Our research shows that stocks with this combination produce a positive surprise nearly 70% of the time, and a solid Zacks Rank actually increases the predictive power of Earnings ESP.\n\nStory continues\n\nPlease note that a negative Earnings ESP reading is not indicative of an earnings miss. Our research shows that it is difficult to predict an earnings beat with any degree of confidence for stocks with negative Earnings ESP readings and/or Zacks Rank of 4 (Sell) or 5 (Strong Sell).\n\nHow Have the Numbers Shaped Up for Honeywell International?\n\nFor Honeywell International, the Most Accurate Estimate is lower than the Zacks Consensus Estimate, suggesting that analysts have recently become bearish on the company's earnings prospects. This has resulted in an Earnings ESP of -0.35%.\n\nOn the other hand, the stock currently carries a Zacks Rank of #4.\n\nSo, this combination makes it difficult to conclusively predict that Honeywell International will beat the consensus EPS estimate.\n\nDoes Earnings Surprise History Hold Any Clue?\n\nWhile calculating estimates for a company's future earnings, analysts often consider to what extent it has been able to match past consensus estimates. So, it's worth taking a look at the surprise history for gauging its influence on the upcoming number.\n\nFor the last reported quarter, it was expected that Honeywell International would post earnings of $2.42 per share when it actually produced earnings of $2.49, delivering a surprise of +2.89%.\n\nOver the last four quarters, the company has beaten consensus EPS estimates three times.\n\nBottom Line\n\nAn earnings beat or miss may not be the sole basis for a stock moving higher or lower. Many stocks end up losing ground despite an earnings beat due to other factors that disappoint investors. Similarly, unforeseen catalysts help a number of stocks gain despite an earnings miss.\n\nThat said, betting on stocks that are expected to beat earnings expectations does increase the odds of success. This is why it's worth checking a company's Earnings ESP and Zacks Rank ahead of its quarterly release. Make sure to utilize our Earnings ESP Filter to uncover the best stocks to buy or sell before they've reported.\n\nHoneywell International doesn't appear a compelling earnings-beat candidate. However, investors should pay attention to other factors too for betting on this stock or staying away from it ahead of its earnings release.\n\nAn Industry Player's Expected Results\n\nAnother stock from the Zacks Diversified Operations industry, Danaher (DHR), is soon expected to post earnings of $1.56 per share for the quarter ended September 2024. This estimate indicates a year-over-year change of -22.8%. Revenues for the quarter are expected to be $5.59 billion, down 18.6% from the year-ago quarter.\n\nThe consensus EPS estimate for Danaher has remained unchanged over the last 30 days. However, a lower Most Accurate Estimate has resulted in an Earnings ESP of -1.03%.\n\nWhen combined with a Zacks Rank of #4 (Sell), this Earnings ESP makes it difficult to conclusively predict that Danaher will beat the consensus EPS estimate. The company beat consensus EPS estimates in each of the trailing four quarters.\n\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nDanaher Corporation (DHR) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-international-inc-hon-reports-140129491.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.043,
            "neu": 0.847,
            "pos": 0.11
        }
    },
    {
        "date": "2024-10-17T10:09:00+00:00",
        "title": "These 2 Industrial Powerhouses Just Declared Dividend Raises",
        "content": "We can't say that October is a traditionally hot time for dividend raises, but a smattering of publicly traded companies chose the spooky month for their latest payout hikes. Among the better-known lifters were a pair of sturdy industrial sector mainstays, Lockheed Martin(NYSE: LMT) and Honeywell(NASDAQ: HON). Here's a look at this fresh pair of dividend raises.\n\n1. Lockheed Martin\n\nBeing the largest pure-play defense company on this planet gives Lockheed Martin a great deal of power on the market. It also helps power its payout to ever-higher altitudes. The company wasn't shy about mentioning that its latest quarterly dividend raise -- by nearly 5% over its predecessor, to $3.30 per share -- marks the 22nd year in a row it's upped the distribution.\n\nThe beauty of being an active and busy U.S. defense contractor is the prizes a company can earn purely from major government contracts. Our armed forces want contractors they can rely on for many years, so deals in this business can be quite long in duration. They are also lucrative, given the sophisticated hardware required and the immense size of federal coffers.\n\nLockheed Martin has been a go-to defense producer for decades. It's no accident that it's the prime contractor in the F-35 program, taking the lead with the most sophisticated fighter jet in history. These days, we happen to live in a world with high-stakes conflicts either in progress or primed and ready to launch. It wasn't surprising, then, that the company boosted its sales by 9% year over year in its most recently reported quarter to over $18 billion.\n\nWe're barely one week away from Lockheed Martin's scheduled third-quarter earnings release. Analysts are expecting continued top-line growth (by almost 4% to nearly $17.4 billion). Although profitability is expected to slump to $6.47 per share from the year-ago $6.73, the former is still well in the black. At the same time, the company's free cash flow is more than high enough to keep raising the payout, so there are no worries on that front.\n\nLockheed Martin will pay that raised dividend on Dec. 27 to investors of record as of Dec. 2. At the most recent closing share price, it would yield 2.2%.\n\n2. Honeywell\n\nElsewhere in the industrial sector, we have the sprawling engineering company Honeywell. Similar to Lockheed Martin, Honeywell's board of directors recently approved a dividend raise approaching 5%, in this case to $1.13 per quarter. With the move, Honeywell has declared at least one dividend raise annually for 14 years in a row.\n\nWhile this payout profile is close to that of Lockheed Martin, unfortunately Honeywell isn't quite as soaring in terms of performance. It's difficult to effectively manage sprawl, and the storied company has been stumbling over the past few years. Its big throw on the once-promising internet of things (IoT) market has yet to pay off meaningfully, and it isn't a dominant player in any industrial segment that's hot at the moment.\n\nHoneywell's financials tell the tale. Following pandemic-era slumps in both revenue and, especially, profitability, the company has yet to reach pre-pandemic levels in either metric.\n\nThat being said, it hasn't done too badly of late. It managed to grow its top line by 5% year over year in the second quarter to nearly $9.6 billion, although only one of its four divisions -- aerospace -- saw meaningful growth (of 16%). Non-GAAP (adjusted) earnings per share, meanwhile, increased an encouraging 8% to $2.49.\n\nAt the end of 2023, Honeywell management said it would \"align\" its immense product portfolio to three significant global trends -- automation, the future of aviation, and the transition to green energy. It takes time to course-correct a ship this large, so patience will be necessary with the company. Given its history and its vast resources, I'd give it more than a fighting chance to succeed. The Honeywells of this world usually don't stay down forever.\n\nThe company's new dividend is to be handed out on Dec. 6 to stockholders of record as of Nov. 15. It would yield 2.1%.\n\nShould you invest $1,000 in Lockheed Martin right now?\n\nBefore you buy stock in Lockheed Martin, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Lockheed Martin wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $806,459!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of October 14, 2024\n\nEric Volkman has no position in any of the stocks mentioned. The Motley Fool recommends Lockheed Martin. The Motley Fool has a disclosure policy.\n\nThese 2 Industrial Powerhouses Just Declared Dividend Raises was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/2-industrial-powerhouses-just-declared-100900208.html",
        "symbols": [
            "HON.US",
            "LMT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.055,
            "neu": 0.807,
            "pos": 0.138
        }
    },
    {
        "date": "2024-10-17T08:35:58+00:00",
        "title": "General Industrial Machinery Stocks Q2 Teardown: Hillenbrand (NYSE:HI) Vs The Rest",
        "content": "General Industrial Machinery Stocks Q2 Teardown: Hillenbrand (NYSE:HI) Vs The Rest\n\nThe end of the earnings season is always a good time to take a step back and see who shined (and who not so much). Let’s take a look at how general industrial machinery stocks fared in Q2, starting with Hillenbrand (NYSE:HI).\n\nAutomation that increases efficiency and connected equipment that collects analyzable data have been trending, creating new demand for general industrial machinery companies. Those who innovate and create digitized solutions can spur sales and speed up replacement cycles, but all general industrial machinery companies are still at the whim of economic cycles. Consumer spending and interest rates, for example, can greatly impact the industrial production that drives demand for these companies’ offerings.\n\nThe 14 general industrial machinery stocks we track reported a satisfactory Q2. As a group, revenues beat analysts’ consensus estimates by 8.5% while next quarter’s revenue guidance was 4% below.\n\nInflation progressed towards the Fed's 2% goal recently, leading the Fed to reduce its policy rate by 50bps (half a percent or 0.5%) in September 2024. This is the first cut in four years. While CPI (inflation) readings have been supportive lately, employment measures have bordered on worrisome. The markets will be debating whether this rate cut's timing (and more potential ones in 2024 and 2025) is ideal for supporting the economy or a bit too late for a macro that has already cooled too much.\n\nGeneral Industrial Machinery stocks have held steady amidst all this with average share prices relatively unchanged since the latest earnings results.\n\nHillenbrand (NYSE:HI)\n\nHillenbrand, Inc. (NYSE: HI) is an industrial company that designs, manufactures, and sells highly engineered processing equipment and solutions for various industries.\n\nHillenbrand reported revenues of $786.6 million, up 9.8% year on year. This print fell short of analysts’ expectations by 3.9%. Overall, it was a slower quarter for the company with a miss of analysts’ earnings estimates and underwhelming EBITDA guidance for the full year.\n\n\"We're pleased with our progress in executing our strategy during the quarter in light of a tougher than expected macro environment. Our FPM integration continued to progress well and exceeded our expectations for margin performance. However, due to the challenging macro environment, we experienced significantly lower than expected orders and revenue in our Advanced Process Solutions segment. This level of performance was primarily due to continued customer project delays, which became more widespread throughout the quarter given ongoing concerns around interest rates, inflation, and broader macroeconomic uncertainty,\" said Kim Ryan, President and Chief Executive Officer of Hillenbrand.\n\nStory continues Hillenbrand Total Revenue\n\nUnsurprisingly, the stock is down 25.9% since reporting and currently trades at $28.18.\n\nRead our full report on Hillenbrand here, it’s free.\n\nBest Q2: 3M (NYSE:MMM)\n\nProducers of the first asthma inhaler, 3M Company (NYSE:MMM) is a global conglomerate known for products in industries like healthcare, safety, electronics, and consumer goods.\n\n3M reported revenues of $6.02 billion, down 24.7% year on year, outperforming analysts’ expectations by 3.3%. The business had an exceptional quarter with an impressive beat of analysts’ operating margin estimates and a solid beat of analysts’ organic revenue estimates. 3M Total Revenue\n\nThe market seems happy with the results as the stock is up 31.7% since reporting. It currently trades at $136.22.\n\nIs now the time to buy 3M? Access our full analysis of the earnings results here, it’s free.\n\nWeakest Q2: John Bean (NYSE:JBT)\n\nTracing back to its invention of the mechanical milk bottle filler in 1884, John Bean (NYSE:JBT) designs, manufactures, and sells equipment used for food processing and aviation.\n\nJohn Bean reported revenues of $402.3 million, down 5.9% year on year, falling short of analysts’ expectations by 7%. It was a softer quarter as it posted a miss of analysts’ earnings estimates.\n\nInterestingly, the stock is up 1.9% since the results and currently trades at $98.41.\n\nRead our full analysis of John Bean’s results here.\n\nHoneywell (NASDAQ:HON)\n\nOriginally founded in 1906 as a thermostat company, Honeywell (NASDAQ:HON) is an aerospace and defense manufacturing company building technologies, performance materials, and safety and productivity solutions.\n\nHoneywell reported revenues of $9.58 billion, up 4.7% year on year. This print topped analysts’ expectations by 1.7%. Overall, it was an exceptional quarter as it also logged full-year revenue guidance exceeding analysts’ expectations and an impressive beat of analysts’ organic revenue estimates.\n\nHoneywell pulled off the highest full-year guidance raise among its peers. The stock is up 2.2% since reporting and currently trades at $218.40.\n\nRead our full, actionable report on Honeywell here, it’s free.\n\nKadant (NYSE:KAI)\n\nHeadquartered in Massachusetts, Kadant (NYSE:KAI) is a global supplier of high-value, critical components and engineered systems used in process industries worldwide.\n\nKadant reported revenues of $274.8 million, up 12.1% year on year. This print beat analysts’ expectations by 4.3%. It was a very strong quarter as it also logged an impressive beat of analysts’ operating margin estimates and full-year revenue guidance exceeding analysts’ expectations.\n\nKadant had the weakest full-year guidance update among its peers. The stock is down 6% since reporting and currently trades at $334.83.\n\nRead our full, actionable report on Kadant here, it’s free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/general-industrial-machinery-stocks-q2-083558427.html",
        "symbols": [
            "9HI.F",
            "HI.US",
            "HON.US",
            "JBT.US",
            "KAI.US",
            "MMM.BE",
            "MMM.F",
            "MMM.HA",
            "MMM.HM",
            "MMM.MU",
            "MMM.MX",
            "MMM.STU",
            "MMM.US",
            "MMM.XETRA",
            "MMMC34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.03,
            "neu": 0.82,
            "pos": 0.15
        }
    }
]