[
    {
        "date": "2024-10-21T15:15:05+00:00",
        "title": "Honeywell Forecasts $280 Billion Business Jet Market, Predicts 12% Growth by 2025",
        "content": "Reflecting a robust increase from last year's projection, Honeywell's (HON, Financials) current global business aviation outlook forecasts delivery of up to 8,500 new business aircraft valued at $280 billion over the next decade. This estimate underscores the growing demands in the aviation space.\n\nWarning! GuruFocus has detected 5 Warning Signs with SAVE.\n\nThe five-year new jet purchase plans of business aviation operators stayed constant with last year's data, implying that demand for new aircraft is stabilizing at levels significantly above those before the pandemic. The poll also emphasizes manufacturers' intentions to increase output in response to predicted stable book-to-ratios spanning through 2024 and significant backlogs.\n\n\"We do not see any positive trend changing any time soon; the business aviation industry is in a protracted period of healthy growth,\" said Heath Patrick, president of Americas Aftermarket at Honeywell Aerospace Technologies. While spending is expected to rise by 11%, Honeywell forecasts business jet deliveries in 2025 to be 12% higher than in 2024. Furthermore demonstrating the continuous expansion in the industry, more than 90% of Honeywell's survey participants expect flying either more or the same in 2025 compared to 2024.\n\nThis article first appeared on GuruFocus.\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-forecasts-280-billion-business-151505926.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.926,
            "neg": 0.038,
            "neu": 0.855,
            "pos": 0.107
        }
    },
    {
        "date": "2024-10-21T14:37:00+00:00",
        "title": "Honeywell Gears up to Report Q3 Earnings: What to Expect?",
        "content": "Honeywell International Inc. HON is scheduled to release third-quarter 2024 results on Oct. 24, before market open. The Zacks Consensus Estimate for revenues is pegged at $9.9 billion, indicating growth of 7.4% from the prior-year quarter’s reported figure. \r\n\r\nThe consensus mark for earnings is pinned at $2.51 per share, which has edged down 0.4% in the past 60 days. The figure indicates a jump of 10.6% from the year-ago quarter's reported figure. The company’s earnings beat the consensus estimate in the preceding four quarters, delivering an average surprise of 2.1%. In the last reported quarter, its bottom line beat the consensus estimate by 2.9%. Find the latest EPS estimates and surprises on Zacks Earnings Calendar.\r\n\r\nLet us see how things have shaped up for Honeywell this earnings season.\n\nKey Factors & Estimates for Q3\n\nStrength across Honeywell’s commercial aviation aftermarket business, driven by strong demand in the air transport and business aviation markets, is likely to have supplemented the top-line performance of its Aerospace Technologies segment. Also, strength in the company’s commercial aviation original equipment business, backed by an improvement in build rates, is likely to have augmented the segment’s performance. Solid momentum in the defense and space business, owing to stable U.S. and international defense spending volumes, is expected to have been a tailwind as well. We expect the segment’s revenues to increase 12.8% year over year to $3.95 billion in the third quarter.\r\n\r\nThe Energy and Sustainability Solutions segment is expected to witness a year-over-year increase in revenues, driven by higher orders for its products and solutions within the advanced materials business. However, softness in gas processing equipment projects under the UOP business is likely to have dragged its performance. Our estimate for the segment’s revenues is pegged at $1.57 billion, indicating a year-over-year increase of 1.4%.\r\n\r\nSolid demand for building products and solutions, along with the acquisition of Global Access Solutions (in June 2024), is expected to have driven the Building Automation segment’s performance. \r\n\r\nHowever, Honeywell’s Industrial Automation segment’s performance is expected to have been weak in the quarter. Persistent weakness in the company’s warehouse and workflow solutions and sensing and safety technologies businesses owing to lower demand for projects is expected to have hurt the segment's top-line performance. Also, continued softness in the warehouse automation business owing to lower investments in the market is likely to weigh on its results. For the third quarter, our estimate for revenues from the Building Technologies and Industrial Automation segments is pegged at $1.7 billion and $2.6 billion, respectively.\r\n\r\nThe escalating cost of sales is likely to have posed a threat to HON’s bottom line. Acquisition-related costs and high input costs are expected to have pushed up its operating expenses, which are likely to have reflected in its margins. We expect the costs of sales to be $6.2 billion for the third quarter, indicating an increase of 9.1% year over year.\r\n\r\nHON has considerable exposure to overseas markets. Given the company’s substantial international operations, foreign currency headwinds are likely to have marred its margins and profitability.\n\nStory continues\n\nHoneywell International Inc. Price and EPS Surprise Honeywell International Inc. Price and EPS Surprise\n\nHoneywell International Inc. price-eps-surprise | Honeywell International Inc. Quote\n\nWhat the Zacks Model Unveils\n\nOur proven model does not conclusively predict an earnings beat for Honeywell this time around. The combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the odds of an earnings beat. That is not the case here, as elaborated below.\r\n\r\nEarnings ESP: Honeywell has an Earnings ESP of -0.35% as the Most Accurate Estimate is pegged at $2.50, lower than the Zacks Consensus Estimate of $2.51. You can uncover the best stocks before they are reported with our Earnings ESP Filter.\r\n\r\nZacks Rank: The company carries a Zacks Rank #4 (Sell).\n\nStocks With Favorable Combination\n\nHere are three companies, which according to our model, have the right combination of elements to post an earnings beat in the upcoming release:\r\n\r\nMarkel Group Inc. MKL has an Earnings ESP of +5.63% and sports a Zacks Rank of 1 at present. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nThe company is scheduled to release third-quarter 2024 results on Nov. 6. MKL’s earnings have surpassed the Zacks Consensus Estimate twice in the preceding four quarters while missing the mark on the other two occasions, the average surprise being 35.4%.\r\n\r\n3M Company MMM has an Earnings ESP of +1.81% and a Zacks Rank of 3 at present. \r\n\r\nThe company is slated to release third-quarter 2024 results on Oct. 22. 3M’s earnings have surpassed the Zacks Consensus Estimate in each of the trailing four quarters, the average surprise being 12.6%.\r\n\r\nParker-Hannifin Corporation PH has an Earnings ESP of +0.83% and a Zacks Rank of 2 at present. The company is slated to release its first-quarter fiscal 2025 results on Nov. 7.\r\n\r\nPH’s earnings have surpassed the Zacks Consensus Estimate in each of the trailing four quarters, the average surprise being 11.2%.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nParker-Hannifin Corporation (PH) : Free Stock Analysis Report\n\nMarkel Group Inc. (MKL) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-gears-report-q3-earnings-143700127.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "MMM.BE",
            "MMM.F",
            "MMM.HA",
            "MMM.HM",
            "MMM.MU",
            "MMM.MX",
            "MMM.STU",
            "MMM.US",
            "MMM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.028,
            "neu": 0.862,
            "pos": 0.11
        }
    },
    {
        "date": "2024-10-21T14:21:26+00:00",
        "title": "Honeywell partners with Google to integrate data with generative AI",
        "content": "(Reuters) - Honeywell has signed a deal with Google to connect artificial intelligence technology with its industrial data, both companies said on Monday, with a view to offer streamlined autonomous operations for its customers.\n\nThe partnership will bring together Alphabet-owned Google's Gemini - its most advanced AI technology - and Honeywell's industrial data collected through its Forge platform to automate tasks and reduce project times, in an industry that continues to grapple with a labor shortage.\n\nThe AI-powered tools will help automate tasks for engineers, warehouse workers, and technicians, among other uses, with the first AI-enabled solutions reaching Honeywell's customers in 2025.\n\n\"The path to autonomy requires assets working harder, people working smarter and processes working more efficiently,\" Vimal Kapur, chairman and CEO of Honeywell, said in a statement.\n\nWith the new AI-powered agent built on Google's Vertex AI platform, automated tasks will lead to reduced project design cycles, Honeywell said, adding that users will be able to process various data types such as images, videos, text and sensor readings.\n\nHoneywell, attempting to leverage the latest boom in AI technology, said it is aiming to reduce maintenance costs, increase operational productivity and \"upskill employees\" through the partnership for its customers.\n\n(Reporting by Utkarsh Shetti in Bengaluru; Editing by Maju Samuel)\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-partners-google-integrate-data-142126314.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.927,
            "neg": 0.009,
            "neu": 0.905,
            "pos": 0.086
        }
    },
    {
        "date": "2024-10-21T13:16:07+00:00",
        "title": "Stay Ahead of the Game With Honeywell International (HON) Q3 Earnings: Wall Street's Insights on Key Metrics",
        "content": "In its upcoming report, Honeywell International Inc. (HON) is predicted by Wall Street analysts to post quarterly earnings of $2.51 per share, reflecting an increase of 10.6% compared to the same period last year. Revenues are forecasted to be $9.9 billion, representing a year-over-year increase of 7.4%.\n\nThe current level reflects a downward revision of 0.4% in the consensus EPS estimate for the quarter over the past 30 days. This demonstrates how the analysts covering the stock have collectively reappraised their initial projections over this period.\n\nPrior to a company's earnings announcement, it is crucial to consider revisions to earnings estimates. This serves as a significant indicator for predicting potential investor actions regarding the stock. Empirical research has consistently demonstrated a robust correlation between trends in earnings estimate revision and the short-term price performance of a stock.\n\nWhile it's common for investors to rely on consensus earnings and revenue estimates for assessing how the business may have performed during the quarter, exploring analysts' forecasts for key metrics can yield valuable insights.\n\nWith that in mind, let's delve into the average projections of some Honeywell International metrics that are commonly tracked and projected by analysts on Wall Street.\n\nThe consensus estimate for 'Net Sales- Aerospace Technologies' stands at $3.97 billion. The estimate indicates a year-over-year change of +13.6%.\n\nThe average prediction of analysts places 'Net Sales- Building Automation' at $1.71 billion. The estimate points to a change of +12% from the year-ago quarter.\n\nThe combined assessment of analysts suggests that 'Aerospace Technologies- Defense and Space' will likely reach $1.48 billion. The estimate suggests a change of +13.9% year over year.\n\nThe consensus among analysts is that 'Aerospace Technologies- Commercial Aviation Original Equipment' will reach $674.92 million. The estimate points to a change of +19.9% from the year-ago quarter.\n\nAnalysts expect 'Building Automation Sales- Building Solutions' to come in at $675.10 million. The estimate points to a change of +6.2% from the year-ago quarter.\n\nThe collective assessment of analysts points to an estimated 'Aerospace Technologies- Commercial Aviation Aftermarket' of $1.84 billion. The estimate indicates a change of +12.4% from the prior-year quarter.\n\nAnalysts predict that the 'Building Automation Sales- Products' will reach $1.02 billion. The estimate indicates a change of +13.7% from the prior-year quarter.\n\nStory continues\n\nAccording to the collective judgment of analysts, 'Segment Profit- Aerospace Technologies' should come in at $1.08 billion. The estimate compares to the year-ago value of $963 million.\n\nBased on the collective assessment of analysts, 'Segment Profit- Building Automation' should arrive at $436.96 million. The estimate is in contrast to the year-ago figure of $386 million.\r\n\r\nView all Key Company Metrics for Honeywell International here>>>\r\n\r\nOver the past month, shares of Honeywell International have returned +9.2% versus the Zacks S&P 500 composite's +4.5% change. Currently, HON carries a Zacks Rank #4 (Sell), suggesting that it may underperform the overall market in the near future. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/stay-ahead-game-honeywell-international-131607216.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.986,
            "neg": 0,
            "neu": 0.923,
            "pos": 0.077
        }
    },
    {
        "date": "2024-10-21T12:00:00+00:00",
        "title": "Honeywell and Google Cloud to Accelerate Autonomous Operations with AI Agents for the Industrial Sector",
        "content": "Google Cloud AI to enhance Honeywell's product offerings and help upskill the industrial workforce\n\nNew solutions will connect to enterprise-wide industrial data from Honeywell Forge, a leading IoT platform for industrials\n\nCHARLOTTE, N.C. and SUNNYVALE, Calif., Oct. 21, 2024 /PRNewswire/ -- Honeywell (NASDAQ: HON) and Google Cloud announced a unique collaboration connecting artificial intelligence (AI) agents with assets, people and processes to accelerate safer, autonomous operations for the industrial sector. The first solutions built with Google Cloud will be available to Honeywell customers in 2025.\n\nThis partnership will bring together the multimodality and natural language capabilities of Gemini on Vertex AI – Google Cloud's AI platform – and the massive data set on Honeywell Forge, a leading Internet of Things (IoT) platform for industrials. This will unleash easy-to-understand, enterprise-wide insights across a multitude of use cases. Honeywell's customers across the industrial sector will benefit from opportunities to reduce maintenance costs, increase operational productivity and upskill employees. The first solutions built with Google Cloud AI will be available to Honeywell's customers in 2025.\n\n\"The path to autonomy requires assets working harder, people working smarter and processes working more efficiently,\" said Vimal Kapur, Chairman and CEO of Honeywell. \"By combining Google Cloud's AI technology with our deep domain expertise--including valuable data on our Honeywell Forge platform--customers will receive unparalleled, actionable insights bridging the physical and digital worlds to accelerate autonomous operations, a key driver of Honeywell's growth.\"\n\n\"Our partnership with Honeywell represents a significant step forward in bringing the transformative power of AI to industrial operations,\" said Thomas Kurian, CEO of Google Cloud. \"With Gemini on Vertex AI, combined with Honeywell's industrial data and expertise, we're creating new opportunities to optimize processes, empower workforces and drive meaningful business outcomes for industrial organizations worldwide.\"\n\nWith the mass retirement of workers from the baby boomer generation, the industrial sector faces both labor and skills shortages, and AI can be part of the solution – as a revenue generator, not job eliminator. More than two-thirds (82%) of Industrial AI leaders believe their companies are early adopters of AI, but only 17% have fully launched their initial AI plans, according to Honeywell's 2024 Industrial AI Insights report. This partnership will provide AI agents that augment the existing operations and workforce to help drive AI adoption and enable companies across the sector to benefit from expanding automation.\n\nStory continues\n\nHoneywell and Google Cloud will co-innovate solutions around:\n\nPurpose-Built, Industrial AI Agents Built on Google Cloud's Vertex AI Search and tailored to engineers' specific needs, a new AI-powered agent will help automate tasks and reduce project design cycles, enabling users to focus on driving innovation and delivering exceptional customer experiences.\n\nAdditional agents will utilize Google's large language models (LLMs) to help technicians to more quickly resolve maintenance issues (e.g., \"How did a unit perform last night?\" \"How do I replace the input/output module?\" or \"Why is my system making this sound?\"). By leveraging Gemini's multimodality capabilities, users will be able to process various data types such as images, videos, text and sensor readings, which will help its engineers get the answers they need quickly – going beyond simple chat and predictions.\n\nEnhanced Cybersecurity Google Threat Intelligence – featuring frontline insight from Mandiant – will be integrated into current Honeywell cybersecurity products, including Global Analysis, Research and Defense (GARD) Threat Intelligence and Secure Media Exchange (SMX), to help enhance threat detection and protect global infrastructure for industrial customers.\n\nOn-the-Edge Device Advances Looking ahead, Honeywell will explore using Google's Gemini Nano model to enhance Honeywell edge AI devices' intelligence multiple use cases across verticals, ranging from scanning performance to voice-based guided workflow, maintenance, operational and alarm assist without the need to connect to the internet and cloud. This is the beginning of a new wave of more intelligent devices and solutions, which will be the subject of future Honeywell announcements.\n\nBy leveraging AI to enable growth and productivity, the integration of Google Cloud technology also further supports Honeywell's alignment of its portfolio to three compelling megatrends, including automation.\n\nAbout Honeywell Honeywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Forge IoT platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world smarter and safer as well as more secure and sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nAbout Google Cloud Google Cloud is the new way to the cloud, providing AI, infrastructure, developer, data, security, and collaboration tools built for today and tomorrow. Google Cloud offers a powerful, fully integrated, and optimized AI stack with its own planet-scale infrastructure, custom-built chips, generative AI models, and development platform, as well as AI-powered applications, to help organizations transform. Customers in more than 200 countries and territories turn to Google Cloud as their trusted technology partner.\n\nContacts: Media  Investor Relations Stacey Jones, Honeywell  Sean Meakim, Honeywell Stacey.Jones@honeywell.com  Sean.Meakim@honeywell.com Ted Ladd, Google Cloud\r\npress@google.com  Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-and-google-cloud-to-accelerate-autonomous-operations-with-ai-agents-for-the-industrial-sector-302281238.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-google-cloud-accelerate-autonomous-120000253.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.02,
            "neu": 0.808,
            "pos": 0.171
        }
    },
    {
        "date": "2024-10-21T00:00:00+00:00",
        "title": "HONEYWELL FORECAST SHOWS INCREASED DEMAND FOR NEW BUSINESS JETS, STABLE GROWTH FOR NEXT DECADE",
        "content": "33rd annual Global Business Aviation Outlook projects 8,500 new business jet deliveries valued at $280 billion over the next decade Purchase plans indicate that demand for new aircraft is normalizing at an elevated level, significantly above pre-pandemic figures Aircraft utilization is projected to increase with vast majority of operators planning on flying more or the same as they did this year\n\nLAS VEGAS, Oct. 20, 2024 /PRNewswire/ -- Honeywell (NASDAQ: HON) today published its 33rd annual Global Business Aviation Outlook, which provides unique insights into current industry trends as well as longer-cycle developments and is informed by extensive surveys of business aviation operators across the globe. Honeywell Logo. (PRNewsFoto/Honeywell) (PRNewsfoto/Honeywell)\n\nBased on survey results, Honeywell forecasts up to 8,500 new business jets worth $280 billion will be delivered over the next decade, an increase in value from last year's forecast. However, the five-year new jet purchase plans of business aviation operators surveyed remained on par with last year's results, indicating that demand for new aircraft is stabilizing well above pre-pandemic levels. In addition, the survey reveals ongoing plans by business jet manufacturers to ramp up production in response to strong backlogs and stable book-to-bill ratios persisting through 2024.\n\n\"The business aviation industry is in a prolonged period of healthy growth, and we don't see that positive trend changing any time soon,\" said Heath Patrick, president, Americas Aftermarket, Honeywell Aerospace Technologies. \"Business aviation continues to see more users and, as a result, manufacturers are ramping up production to keep pace with growing demand, a trend we expect to continue for the foreseeable future. Despite a mixed macroeconomic environment and challenging geopolitical circumstances, operators are optimistic about their flight activity increasing in 2025 and beyond.\"\n\nKey findings in the 2024 Honeywell Global Business Aviation Outlook include:\n\nNew business jet deliveries in 2025 are expected to be 12% higher than in 2024. Expenditures are expected to be 11% higher. Five-year purchase plans for new business jets are comparable with last year's survey and equivalent to 18% of the current fleet. Fleet additions are consistent with results from a year ago at 3% of the fleet, which is in line with historical industry performance. More than 90% of those surveyed expect to fly more or about the same in 2025 than in 2024. Large jets are expected to account for about two-thirds of all expenditures of new business jets in the next five years, consistent with last year's results. 82% of respondents consider \"Performance\" among their top three most important criteria when purchasing their next aircraft. \"Cost\" was second at 60%.\n\nStory continues\n\nNew Business Aviation User Update: Returning to a Stable Growth Environment\n\nFollowing an influx of first-time business aviation users into the industry throughout the COVID-19 pandemic, combined with record levels of flight activity, the industry has begun to return to a more stable growth environment at new elevated levels of production and flight activity. Demand remains robust for new aircraft as business jet manufacturer backlogs stay strong and production volumes ramp up to accommodate that higher demand.\n\nBased on the findings of this year's survey, several key industry trends to watch include:\n\nDemand for New Aircraft: New aircraft models introduced in recent years have driven increased demand for new aircraft, a trend which survey results indicate will continue throughout this decade and into the early 2030s. Flight Activity & Utilization Levels: Flight activity is expected to increase in 2025 relative to 2024, especially for those who currently operate at high utilization levels. The reduction in barriers to access business aviation in recent years, driven by the introduction of new shared access models, has enabled a persistent flow of new customers opting for business aviation alternatives for their travel needs. Fractional Operators: Fractional operators may be the largest beneficiaries of new customer growth, and they are also benefitting from traditional operators wanting to supplement their current operations with fractional shares. The business aviation industry has experienced changing dynamics in recent years, resulting in new higher levels of aircraft deliveries and flight activity than seen in the previous decade, and the sector appears poised to achieve stable growth on top of this over the next decade.\n\nRegional Breakdown: North America Sees Strongest Demand, But Latin America Shows Optimism\n\nNorth America: North America will see 66% of the five-year new jet deliveries, which is consistent with historical demand for the region. 30% of respondents from North America expect to fly more next year, amounting to a large proportion of the demand, which is likely contributing to the sustained growth of new jet deliveries.\n\nEurope: European operators will comprise 13% of the five-year new jet deliveries, which is one percentage point below last year's share and follows a similar trend over the past few years. A strong regional focus on sustainability, environmental pressures, and the availability of alternative transit options are the likely cause of this slight dip in new aircraft demand.\n\nLatin America: Operators in Latin America will account for 10% of the five-year new jet deliveries, which is an increase of five percentage points from their share in 2023. In contrast to last year, respondents in Latin America are optimistic about favorable macroeconomic conditions, which will likely drive increased flight activity as well as demand for new jets. This effect is particularly strong in Brazil where year-over-year flight activity growth is stronger than the global average.\n\nAsia Pacific: Operators in Asia Pacific will make up 7% of the five-year new jet deliveries. APAC is returning to typical fleet growth after several years of decline throughout the pandemic. There is a notable uptick in flight activity in Australia, where departures are up nearly double digits year-over-year.\n\nMiddle East/Africa: Fleet growth here accounts for 3% of the five-year new jet deliveries, which is a decline of three percentage points from last year's surveyed expectations. Flight activity in the region declined year-over-year through the first half of 2024, likely due to conflicts in the region.\n\nPreowned Aircraft Update: Market Cools From Record-Low Inventory Levels\n\nThe market for pre-owned aircraft is cooling after record low inventory levels in 2021 and 2022, but used aircraft values remain strong relative to the previous decade. While pre-owned aircraft inventory will likely continue to increase slowly, prices should remain stable, thereby supporting steady demand for pre-owned aircraft. Operators mentioned expecting to rely on pre-owned aircraft purchases to expand their fleets slightly more than in prior years.\n\nSustainability in Business Aviation: Fuel-Efficient Aircraft Recognized as Most Effective Method of Improving Environmental Impact\n\nIn light of Honeywell's commitment to driving aviation sustainability and reaching carbon neutrality by 2035 in its operations and facilities, this year's survey – for the fourth consecutive year – features an analysis of sustainability in business aviation and also examines how operators are trying to lower their carbon footprint. Several key findings include:\n\nEuropean operators show the most proactive behavior in lowering their carbon footprint, with North American operators lagging slightly behind. However, the total number of operators taking proactive steps in North America is still greater than any other region given the much larger volume of business aviation operations in the region. According to those surveyed, the acquisition of new, more fuel-efficient aircraft is considered to be the most effective method to reduce environmental impact, with 85% of respondents mentioning this to be 'very effective' or 'moderately effective.'\n\nClick here to request a copy of Honeywell's 2024 Global Business Aviation Outlook.\n\nMethodology\n\nHoneywell's forecast methodology is based on multiple sources, including macroeconomic analyses, original equipment manufacturers' production and development plans shared with the company, and expert deliberations from aerospace industry leaders. Honeywell, in partnership with Seefeld Marketing International Inc. and Ad Hoc Recherche Inc., also conducted surveys of business aviation operators comprising 375 nonfractional operators representing a fleet of 1,488 business aircraft worldwide. The survey sample is representative of the entire industry in terms of geography, operation and fleet composition. This comprehensive approach provides Honeywell with unique insights into operator sentiments, preferences and concerns and provides considerable intelligence on product development needs and opportunities.\n\nMaking an Impact on Business Decisions\n\nHoneywell's Global Business Aviation Outlook reflects current operator concerns and identifies longer-cycle trends that Honeywell uses in its own product decision process. The survey has helped to identify opportunities for investments in sustainability solutions, enhance aircraft connectivity offerings, and expand propulsion offerings, innovative safety products, services and upgrades. The survey informs Honeywell's business pursuit strategy and helps consistently position the company on high-value platforms in growth sectors.\n\nAbout Honeywell\n\nProducts and services from Honeywell Aerospace Technologies are found on virtually every commercial, defense and space aircraft, and in many terrestrial systems. The Aerospace Technologies business unit builds aircraft engines, cockpit and cabin electronics, wireless connectivity systems, mechanical components, power systems, and more. Its hardware and software solutions create more fuel-efficient aircraft, more direct and on-time flights and safer skies and airports. For more information, visit aerospace.honeywell.com or follow Honeywell Aerospace Technologies on LinkedIn.\n\nHoneywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Forge IoT platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world smarter and safer as well as more secure and sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nThis release contains certain statements that may be deemed \"forward-looking statements\" within the meaning of Section 21E of the Securities Exchange Act of 1934. All statements, other than statements of historical fact, that address activities, events or developments that we or our management intends, expects, projects, believes or anticipates will or may occur in the future are forward-looking statements. Such statements are based upon certain assumptions and assessments made by our management in light of their experience and their perception of historical trends, current economic and industry conditions, expected future developments and other factors they believe to be appropriate. The forward-looking statements included in this release are also subject to a number of material risks and uncertainties, including but not limited to economic, competitive, governmental and technological factors affecting our operations, markets, products, services and prices. Such forward-looking statements are not guarantees of future performance, and actual results, developments and business decisions may differ from those envisaged by such forward-looking statements. We identify the principal risks and uncertainties that affect our performance in our Form 10-K and other filings with the Securities and Exchange Commission.\n\nContacts:\n\nMedia Adam Kress\r\n(602) 760-6252\r\nadam.kress@honeywell.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-forecast-shows-increased-demand-for-new-business-jets-stable-growth-for-next-decade-302280775.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-forecast-shows-increased-demand-000000064.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.023,
            "neu": 0.846,
            "pos": 0.131
        }
    }
]