[
    {
        "date": "2024-10-09T16:11:01+00:00",
        "title": "Honeywell Expands Qualcomm Partnership: AI And Connectivity To Supercharge Energy Industry Operations",
        "content": "Honeywell Expands Qualcomm Partnership: AI And Connectivity To Supercharge Energy Industry Operations\n\nHoneywell International Inc. (NASDAQ:HON) shares are trading higher on Wednesday. The company expanded its collaboration with QUALCOMM Incorporated (NASDAQ:QCOM) to create new AI-enabled solutions for the energy sector.\n\nThis partnership aligns with Honeywell’s focus on three key megatrends, including automation, as it enhances its portfolio to meet evolving industry demands.\n\nThrough this partnership, Honeywell plans to integrate Qualcomm’s connectivity and AI capabilities into its applications, including the Honeywell Field Process Knowledge System (PKS).\n\nAlso Read: Honeywell Seeks To Simplify Structure, Boost Flexibility With $10B Spin-Off Of Advanced Materials Unit\n\nThis will enhance connectivity in remote areas of manufacturing facilities, allowing for improved data capture and analytics.\n\nBy combining Qualcomm's low-power AI processors with Honeywell’s advanced sensing technologies, the companies will develop industrial sensors to monitor process, asset, and environmental parameters.\n\nPramesh Maheshwari, President of Honeywell Process Solutions, said, “The combination of Qualcomm Technologies’ industry-leading on-device AI processors with Honeywell’s AI- enabled technology will enable field workers to work smarter, help make assets more efficient and improve the overall performance of the process industry.”\n\n“With the introduction of AI-enabled solutions such as Honeywell’s Field PKS, Multi-Modal Intelligent Agent and sensor technologies, we are advancing what’s possible for the process industry with mobile field technicians and autonomous operations.”\n\nInvestors can gain exposure to HON via Gabelli Commercial Aerospace and Defense ETF (NYSE:GCAD) and Invesco Aerospace & Defense ETF (NYSE:PPA).\n\nPrice Action: HON shares are up 1.99% at $211.11 at the last check Wednesday.\n\nPhoto via Shutterstock\n\nRead Next:\n\nChevron, Honeywell Join Forces For AI Breakthrough: Details\n\nUNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily, plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets.\n\nGet the latest stock analysis from Benzinga?\n\nHONEYWELL INTL (HON): Free Stock Analysis Report\n\nThis article Honeywell Expands Qualcomm Partnership: AI And Connectivity To Supercharge Energy Industry Operations originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-expands-qualcomm-partnership-ai-161101495.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "GCAD.US",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "PPA.US",
            "QCI.BE",
            "QCI.DU",
            "QCI.F",
            "QCI.HM",
            "QCI.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0,
            "neu": 0.817,
            "pos": 0.183
        }
    },
    {
        "date": "2024-10-09T12:02:00+00:00",
        "title": "HONEYWELL AND QUALCOMM WORK TO REVOLUTIONIZE ENERGY SECTOR WITH 5G, LOW POWER WIRELESS AND AI-ENABLED SOLUTIONS",
        "content": "HOUSTON, Oct. 9, 2024 /PRNewswire/ -- Honeywell (Nasdaq: HON) and Qualcomm Technologies, Inc. today announced an expanded collaboration to develop new artificial intelligence (AI)-enabled solutions for the energy sector. The design and development of these solutions with Qualcomm Technologies supports Honeywell's alignment of its portfolio to three compelling megatrends, including automation. (PRNewsfoto/Honeywell)\n\nThrough the collaboration, Honeywell intends to incorporate Qualcomm Technologies' connectivity and AI capabilities into Its existing AI-powered applications, such as the Honeywell Field Process Knowledge System (PKS). By integrating these capabilities, Honeywell's Field PKS will better be able to help provide connectivity to remote corners of plant and manufacturing facilities and enable greater data capture and analytics at the edge.\n\nQualcomm Technologies' portfolio of low power AI-enabled processors with native wireless connectivity, software, and computer vision combined with Honeywell's extensive portfolio of sensing technologies will enable the development of a family of industrial sensors used for monitoring process parameters, asset parameters or environmental conditions. These new capabilities will help deliver more information to field and service technicians, enabling faster delivery of answers that can result in time savings, greater accuracy, and interactive results.\n\n\"We are committed to developing on-device generative AI solutions that will propel the expansion of the connected intelligent edge to help drive digital transformation,\" said Nakul Duggal, group general manager, automotive, industrial and embedded IoT, and cloud computing, Qualcomm Technologies, Inc. \"This collaboration with Honeywell enhances how industries and businesses interact with their environments through intelligent and responsive technology. Our recent acquisition of Sequans' 4G IoT technology adds to Qualcomm Technologies' broad portfolio, further strengthening our technology offerings for Industrial IoT applications.\"\n\n\"The combination of Qualcomm Technologies' industry-leading on-device AI processors with Honeywell's AI- enabled technology will enable field workers to work smarter, help make assets more efficient and improve the overall performance of the process industry,\" said Pramesh Maheshwari, President of Honeywell Process Solutions. \"With the introduction of AI-enabled solutions such as Honeywell's Field PKS, Multi-Modal Intelligent Agent and sensor technologies, we are advancing what's possible for the process industry with mobile field technicians and autonomous operations.\"\n\nStory continues\n\nEarlier this year, Honeywell and Qualcomm Technologies began developing an AI-enabled Multi-Modal Intelligent Agent designed to allow workers in distribution centers and retail industries to interact naturally with handheld devices through voice, pictures, and video. In 2025, Honeywell intends to add the computer vision capabilities in the Multi-Modal Intelligent Agent to Honeywell's Field PKS. To learn more about how Honeywell is leveraging AI across process industries, visit: https://process.honeywell.com/us/en/solutions/industrial-autonomous-solutions\n\nAbout Honeywell:\n\nHoneywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Forge IoT platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world smarter, safer, more secure and sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nAbout Qualcomm:\n\nQualcomm is enabling a world where everyone and everything can be intelligently connected. Our one technology roadmap allows us to efficiently scale the technologies that launched the mobile revolution – including advanced connectivity, high-performance, low-power compute, on-device intelligence and more – to the next generation of connected smart devices across industries. Innovations from Qualcomm and our family of Snapdragon platforms will help enable cloud-edge convergence, transform industries, accelerate the digital economy, and revolutionize how we experience the world, for the greater good.\n\nQualcomm Incorporated includes our licensing business, QTL, and the vast majority of our patent portfolio. Qualcomm Technologies, Inc., a subsidiary of Qualcomm Incorporated, operates, along with its subsidiaries, substantially all of our engineering, research and development functions, and substantially all of our products and services businesses, including our QCT semiconductor business. Snapdragon and Qualcomm branded products are products of Qualcomm Technologies, Inc. and/or its subsidiaries. Qualcomm patented technologies are licensed by Qualcomm Incorporated.\n\nMedia Contact: Tyler Sumrall \r\n+1 (713) 203-0992 \r\nTyler.Sumrall@honeywell.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-and-qualcomm-work-to-revolutionize-energy-sector-with-5g-low-power-wireless-and-ai-enabled-solutions-302270692.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-qualcomm-revolutionize-energy-sector-120200732.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.004,
            "neu": 0.817,
            "pos": 0.178
        }
    },
    {
        "date": "2024-10-09T10:59:07+00:00",
        "title": "Honeywell to Spin Off Advanced Materials Business",
        "content": "Honeywell International ( (HON) ) has shared an announcement.\n\nHoneywell announced plans to spin off its Advanced Materials business into a separate publicly-traded company, expected to be completed by the end of 2025 or early 2026. This tax-free transaction aims to allow both entities to focus on their strategic goals and capitalize on growth opportunities. The new company will focus on sustainability and specialty chemicals, building on its forecasted $3.8 billion revenue and strong EBITDA margin. Honeywell will continue to align with megatrends such as automation, the future of aviation, and energy transition, enhancing its portfolio through strategic acquisitions and divestitures.\n\nSee more insights into HON stock on TipRanks’ Stock Analysis page.\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-spin-off-advanced-materials-105907240.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.931,
            "neg": 0,
            "neu": 0.86,
            "pos": 0.14
        }
    }
]