[
    {
        "date": "2024-07-31T22:19:00+00:00",
        "title": "Assess Industrial ETFs Post Q2 Earnings",
        "content": "The industrial sector has performed well this year, with the S&P 500 Industrial Index outperforming the S&P 500 Index over the past month, gaining 3.55%. When compared to the broad market, the S&P 500 Industrial Index returned 14.44% over the past year compared withthe S&P 500 Index’s 19.54% gains.\n\nThe U.S. economy's faster-than-anticipated growth in the second quarter of 2024 should boost the industrial sector, leading to increased business investments, infrastructure spending and higher demand for durable goods.\n\nAgainst this backdrop, below we highlight Q2 earnings results of a few renowned U.S. industrial players. Results have been mixed so far. Let’s delve a little deeper.\n\nInside Q2 Earnings\n\nGeneral Electric\n\nOn Jul 23, General Electric GE reported its second-quarter results, with earnings surpassing the Zacks Consensus Estimate but revenues missing the same. GE currently has a Zacks Rank #2 (Buy) and a Momentum Score of A.\n\nThe conglomerate reported adjusted earnings of $1.20 per share, surging 62.2% year over year. The bottom line beat the Zacks Consensus Estimate of $0.97. Adjusted revenues of the company came in at $8.22 billion, marking an increase of 4% year over year. However, the metric missed the consensus estimate of $8.38 billion.\n\nDuring the first six months of 2024, adjusted free cash flow came in at $2.77 billion, surging 56.49% from the year-ago period. GE paid its shareholders $394 million in dividends in the first six months of 2024, marking a 12.6% increase from the previous year.\n\n3M\n\n3M MMM reported second-quarter results on Jul 26, with revenues and earnings surpassing the Zacks Consensus Estimate and increasing on a year-over-year basis.\n\nThe company’s quarterly results highlighted its commitment to investing in high-growth businesses and reviving its legacy of product innovation. MMM shares gained about 23% since reporting earnings (as of Jul 26).\n\n3M delivered adjusted earnings of $1.93 per share, which surpassed the Zacks Consensus Estimate of $1.66. The bottom line increased from earnings of $1.39 per share reported in the year-ago quarter. Adjusted net revenues of $6.02 billion outperformed the Zacks Consensus Estimate of $5.89 billion and increased 1.1% year over year, driven by organic sales growth of 1.2%.\n\nSelling, general and administrative expenses of the company decreased by 90.3% to $1.1 billion. Operating income came in at $1.3 billion against an operating loss of $9.4 billion in the year-ago period. In the first six months of 2024, 3M rewarded its shareholders with $1.2 billion in dividend payments.\n\nStory continues\n\nHoneywell International\n\nHoneywell International HON reported second-quarter earnings before market open on Jul 25. The company currently has a Zacks Rank #1 (Strong Buy). Its shares are down 5.10% since its release of Q2 results (as of Jul 26).\n\nThe conglomerate reported adjusted earnings of $2.49 per share, which surpassed the Zacks Consensus Estimate of $2.42.The bottom line increased 8% year over year. HON reported revenues of $9.58 billion, up 5% from the year-ago quarter.\n\nSegmental quarterly revenues of Aerospace Technologies were $3.9 billion, up 16% year over year, driven by growth in both commercial aviation and defense and space markets. However, segmental quarterly revenues from Industrial Automation fell 8% year over year to $2.5 billion due to volume softness in warehouse and workflow solutions.\n\nFor 2024, Honeywell expects sales of $39.1-$39.7 billion compared with the prior expected range of $38.1-$38.9 billion. The Zacks Consensus Estimate for revenues is pegged at $38.66 billion. Organic sales are expected to increase 5-6%.\n\nETFs in Focus\n\nFor investors looking to take a bet on industrial ETFs after mixed Q2 results as well as better-than-expected U.S. economic second-quarter growth, the following ETFs provide a great opportunity, having high exposure to the industrial companies discussed above.\n\nIndustrial Select Sector SPDR Fund XLI has gained 15.43% over the past year and 7.71% year to date.\n\nVanguard Industrials ETF VIS has gained 16.08% over the past year and 7.37% year to date.\n\niShares U.S. Industrials ETF IYJ has gained 13.84% over the past year and 4.96% year to date.\n\nFidelity MSCI Industrials Index ETF FIDU has gained 16.55% over the past year and 7.32% year to date.\n\nInvesco S&P 500 Equal Weight Industrials ETF RSPN has gained 12.36% over the past year and 6% year to date.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nGE Aerospace (GE) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nVanguard Industrials ETF (VIS): ETF Research Reports\n\nIndustrial Select Sector SPDR ETF (XLI): ETF Research Reports\n\niShares U.S. Industrials ETF (IYJ): ETF Research Reports\n\nFidelity MSCI Industrials Index ETF (FIDU): ETF Research Reports\n\nInvesco S&P 500 Equal Weight Industrials ETF (RSPN): ETF Research Reports\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/assess-industrial-etfs-post-q2-221900009.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "GCP.F",
            "GCP.XETRA",
            "GE.MX",
            "GE.US",
            "GEOO34.SA",
            "GNE.PA",
            "GSPC.INDX",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.011,
            "neu": 0.844,
            "pos": 0.145
        }
    },
    {
        "date": "2024-07-31T13:17:22+00:00",
        "title": "Are Hedge Funds Bullish on Honeywell International Inc. (HON) Now?",
        "content": "We recently compiled a list of the 8 Best Drone Stocks to Buy Now. In this article, we are going to take a look at where Honeywell International Inc. (NASDAQ:HON) stands against the other drone stocks.\n\nThe term \"drone\" refers to any remotely piloted aircraft (RPA), which can vary in form and autonomy, either controlled by a human pilot or capable of fully autonomous flights. In 2005, the United States Department of Defense (DoD) and the Federal Aviation Administration (FAA) adopted the term \"unmanned aircraft system\" (UAS) to describe these aerial drones. This terminology was later adopted by other governmental agencies globally, highlighting the importance of considering various system components rather than focusing solely on the aircraft for regulatory development. The rapid evolution of drones began with the advancement of defense technologies, enabling the remote piloting of aircraft equipped with both weaponized and non-weaponized systems. These larger military drones, often weighing several kilograms, are crucial for deployment in environments too dangerous for human pilots. Today, smaller drones are employed by various government agencies for a range of operations, including precision agriculture mapping and surveillance.\n\nThe Russia-Ukraine war, which began in February 2022, has driven a significant increase in demand for drones, as both militaries employ them for various operations, including intelligence, surveillance, reconnaissance, and target acquisition support. The unprecedented scale of Unmanned aerial vehicles (UAVs) deployment caught both Ukrainian and Russian forces unprepared for such extensive use. However, both militaries have rapidly advanced their drone technology, frequently modernizing and adapting these systems directly on the front lines. In a statement this past year, Anton Gerashchenko, an adviser to Ukraine's Minister of Internal Affairs, stated \"This war is a war of drones; they are the super weapon here.\" With advancements in artificial intelligence (AI) and increasing legislative support, the drone market seems poised for significant growth.\n\nAnother trend involves the development of specialized drones tailored for specific industries. These industry-specific drones are equipped with sensors, cameras, and software designed to meet the unique requirements of sectors such as agriculture, construction, and inspection. These 'Consumer' and 'Recreational' drones have become a common part of daily life, particularly among drone hobbyists. As of April of this year, over 780,000 drones were reportedly registered with the Federal Aviation Administration (FAA), with 375,226 classified as commercial and 400,858 as recreational.\n\nStory continues\n\nWhat Does the Market Think About the Future of Drones?\n\nThe U.S. commercial drone market was valued at $5.85 billion in 2023 and is projected to reach approximately $14.11 billion by 2033, growing at a compound annual growth rate (CAGR) of 9.2% from 2024 to 2033. In 2023, the rotary blade segment held the largest market share at around 81%, while the hybrid segment is anticipated to experience the fastest growth, with a CAGR of over 11% during the forecast period.\n\nOn the other hand, a report by MarkNtel Advisors states that the global military drone market was valued at approximately $20.21 billion in 2023 and is projected to grow at a CAGR of about 12.21% from 2024 to 2030. This rapid growth is driven by the widespread adoption of Extended Visual Line of Sight (EVLOS) UAVs for long-range missions focused on data collection, battle management, and electronic warfare. A notable example of this technology came in the form of General Atomics' testing of advanced datalink and avionics enhancements for the MQ-1C Gray Eagle Extended Range (GE-ER) drone back in 2022.\n\nOur Methodology\n\nTo compile the list of the best drone stocks to invest in, we first sifted through ETFs and online rankings to come up with a preliminary list. Next, we scanned Insider Monkey’s database of 920 hedge funds and selected the 8 drone stocks that were the most widely held by institutional investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple, our research has shown that we can outperform the market by imitating the top stock picks of best hedge funds. Our quarterly newsletter’s strategy picks 14 small and large-caps every quarter and it has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\n\nA shot of a commercial plane with a blur of color in the background, representing the production of auxiliary power units in the Safety and Productivity Solutions segment.\n\nHoneywell International Inc. (NASDAQ:HON)\n\nNumber of Hedge Fund Holders: 52\n\nHoneywell International Inc. (NASDAQ:HON) is an American publicly traded, multinational conglomerate headquartered in Charlotte, North Carolina. The company primarily operates in four business areas: aerospace, building automation, performance materials and technologies, and safety and productivity solutions.\n\nThe company has also collaborated with Aeroscout to provide the HGuide n580 inertial measurement unit for mapping and surveying equipment on its unmanned aerial vehicles. Additionally, Honeywell International Inc. (NASDAQ:HON)’s T-53 engine powers the K-MAX Unmanned Aircraft System, a unit of the K-MAX heavy-lift helicopter.\n\nHoneywell International Inc. (NASDAQ:HON) reported robust year-over-year sales growth of 3% in the first quarter, a growth that was driven by an 18% organic increase in Aerospace Technologies and a 5% organic rise in Energy and Sustainability Solutions. Additionally, Honeywell Connected Enterprise offerings saw more than 20% sales growth across the portfolio, with cyber and buildings offerings leading the way. The defense contractor's earnings per share for the first quarter were $2.23, up 8% year over year, while adjusted earnings per share rose to $2.25, marking a 9% year-over-year increase.\n\nAs of March 31 of this year, Honeywell International Inc. (NASDAQ:HON) had 52 hedge fund investors out of 919 funds tracked by the Insider Monkey database. Ric Dillion’s Diamond Hill Capital, with 1.13 million shares valued at $233.4 million, was one of the company's largest shareholders for the quarter.\n\nOverall HON ranks 4th on our list of the best drone stocks to buy. You can visit 8 Best Drone Stocks to Buy Nowto see the other drone stocks that are on hedge funds’ radar. While we acknowledge the potential of HON as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than HON but that trades at less than 5 times its earnings, check out our report about the cheapest AI Stock.\n\nREAD NEXT: Michael Burry Is Selling These Stocks and Jim Cramer is Recommending These Stocks.\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/hedge-funds-bullish-honeywell-international-131722475.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.018,
            "neu": 0.892,
            "pos": 0.09
        }
    }
]