[
    {
        "date": "2024-06-10T15:40:13+00:00",
        "title": "MARUY vs. HON: Which Stock Should Value Investors Buy Now?",
        "content": "Investors interested in Diversified Operations stocks are likely familiar with Marubeni Corp. (MARUY) and Honeywell International Inc. (HON). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look.\n\nThere are plenty of strategies for discovering value stocks, but we have found that pairing a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system produces the best returns. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits.\n\nMarubeni Corp. and Honeywell International Inc. are sporting Zacks Ranks of #2 (Buy) and #3 (Hold), respectively, right now. Investors should feel comfortable knowing that MARUY likely has seen a stronger improvement to its earnings outlook than HON has recently. But this is just one factor that value investors are interested in.\n\nValue investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels.\n\nOur Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years.\n\nMARUY currently has a forward P/E ratio of 9.74, while HON has a forward P/E of 20.62. We also note that MARUY has a PEG ratio of 1.56. This figure is similar to the commonly-used P/E ratio, with the PEG ratio also factoring in a company's expected earnings growth rate. HON currently has a PEG ratio of 2.24.\n\nAnother notable valuation metric for MARUY is its P/B ratio of 1.43. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. For comparison, HON has a P/B of 7.98.\n\nThese metrics, and several others, help MARUY earn a Value grade of A, while HON has been given a Value grade of D.\n\nMARUY has seen stronger estimate revision activity and sports more attractive valuation metrics than HON, so it seems like value investors will conclude that MARUY is the superior option right now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nMarubeni Corp. (MARUY) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/maruy-vs-hon-stock-value-154013811.html",
        "symbols": [
            "8002.TSE",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "MARA.BE",
            "MARA.DU",
            "MARA.F",
            "MARA.MU",
            "MARA.STU",
            "MARUF.US",
            "MARUY.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.004,
            "neu": 0.725,
            "pos": 0.271
        }
    }
]