[
    {
        "date": "2024-10-02T16:10:14+00:00",
        "title": "Will Honeywell International (HON) Beat Estimates Again in Its Next Earnings Report?",
        "content": "Have you been searching for a stock that might be well-positioned to maintain its earnings-beat streak in its upcoming report? It is worth considering Honeywell International Inc. (HON), which belongs to the Zacks Diversified Operations industry.\n\nWhen looking at the last two reports, this company has recorded a strong streak of surpassing earnings estimates. The company has topped estimates by 3.05%, on average, in the last two quarters.\n\nFor the last reported quarter, Honeywell International came out with earnings of $2.49 per share versus the Zacks Consensus Estimate of $2.42 per share, representing a surprise of 2.89%. For the previous quarter, the company was expected to post earnings of $2.18 per share and it actually produced earnings of $2.25 per share, delivering a surprise of 3.21%.\n\nWith this earnings history in mind, recent estimates have been moving higher for Honeywell International. In fact, the Zacks Earnings ESP (Expected Surprise Prediction) for the company is positive, which is a great sign of an earnings beat, especially when you combine this metric with its nice Zacks Rank.\n\nOur research shows that stocks with the combination of a positive Earnings ESP and a Zacks Rank #3 (Hold) or better produce a positive surprise nearly 70% of the time. In other words, if you have 10 stocks with this combination, the number of stocks that beat the consensus estimate could be as high as seven.\n\nThe Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a version of the Zacks Consensus whose definition is related to change. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.\n\nHoneywell International currently has an Earnings ESP of +0.04%, which suggests that analysts have recently become bullish on the company's earnings prospects. This positive Earnings ESP when combined with the stock's Zacks Rank #3 (Hold) indicates that another beat is possibly around the corner. We expect the company's next earnings report to be released on October 24, 2024.\n\nWith the Earnings ESP metric, it's important to note that a negative value reduces its predictive power; however, a negative Earnings ESP does not indicate an earnings miss.\n\nMany companies end up beating the consensus EPS estimate, though this is not the only reason why their shares gain. Additionally, some stocks may remain stable even if they end up missing the consensus estimate.\n\nStory continues\n\nBecause of this, it's really important to check a company's Earnings ESP ahead of its quarterly release to increase the odds of success. Make sure to utilize our Earnings ESP Filter to uncover the best stocks to buy or sell before they've reported.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-international-hon-beat-estimates-161014926.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.025,
            "neu": 0.823,
            "pos": 0.152
        }
    },
    {
        "date": "2024-10-02T13:45:00+00:00",
        "title": "These 3 Bargain-Bin Dividend Value Stocks Have Become Too Cheap to Ignore",
        "content": "The major stock market indexes continue to blast through record highs as 2024 shapes up to be another great year for investors. Since the start of 2023, the S&P 500 is up a mind-numbing 49.5%.\n\nDespite the impressive performance, investors can still scoop up shares of quality companies without paying an exorbitant price relative to earnings. Honeywell (NASDAQ: HON), Phillips 66(NYSE: PSX), and Delta Air Lines(NYSE: DAL) are three value stocks that pay dividends and are worth buying now. Image source: Getty Images.\n\nHoneywell is making an effort to please investors with capital commitments\n\nDaniel Foelber (Honeywell): On Sept. 27, Honeywell increased its dividend by 4.6% from $4.32 per share per year to $4.52. The increase puts Honeywell on track to deliver its 15th consecutive year of higher dividends in 2025 and is part of the company's plan to boost shareholder value through dividends, acquisitions, capital expenditures, and buybacks.\n\nHoneywell's growth has been disappointing in recent years as the company has failed to convert opportunities in automation, the industrial Internet of Things, aerospace, and the energy transition into meaningful top- and bottom-line results. But there's reason to be optimistic going forward.\n\nHoneywell tends to be a stodgy company that is slow to change. But in June 2023, former head of Honeywell Performance Materials and Technologies, Vimal Kapur, took over as Honeywell CEO. In October 2023, Honeywell announced a strategic shift to realign its business to capitalize on its highest-conviction megatrends.\n\nIn its July investor presentation, Honeywell said it had already announced $10 billion in mergers and acquisitions (M&A) since 2023 and was on track to reduce its share count by 2% in 2024 through buybacks. The company is targeting $22 billion in share repurchases, M&A, and dividends between 2023 and 2025.\n\nHoneywell remains in prove-it mode, but it has done a good job resetting expectations and setting a clear path toward achieving the steady earnings growth that investors were used to in years past.\n\nAs for Honeywell's valuation, the stock's price-to-earnings (P/E) ratio and price-to-free cash flow ratio are both below their five-year median levels, suggesting investors are less optimistic about the company's future prospects. HON Price to Free Cash Flow (5y Median) Chart\n\nHoneywell was a market darling in the 2010s, posting a total return of 499% compared to 257% for the S&P 500. But in the 2020s, Honeywell has been a market underperformer for good reason, considering its underwhelming earnings growth.\n\nIt's too early to say the worst is over for Honeywell, but the stock's valuation, growing dividend, and potential to accelerate its turnaround make it a worthy value stock to consider buying now.\n\nStory continues\n\nForget the brakes, it's time to step on the gas with Phillips 66 stock\n\nScott Levine (Phillips 66): You don't have to be an expert in energy stocks to know that when oil and gas prices decline, energy stocks are likely to also slide. This is certainly the case with Phillips 66 over the past six months. During this time period, oil-price benchmark West Texas Intermediate fell about 12.3%, and shares of Phillips 66 have plunged more than 17%. For forward-looking investors, this sell-off provides a great buying opportunity for the energy stock -- along with its juicy 3.5% forward-yielding dividend.\n\nAn operator of various midstream and downstream assets, Phillips 66 has reported strong financial results so far in 2024 albeit not as high as in the same period during 2023. Through the first half of 2024, Phillips 66 reported $3.3 billion in operating cash flow, a decrease from the $4.5 billion in cash from operations that it reported during the same period in 2023.\n\nIt's critical to recognize, however, that the inferior performance simply reflects the impact of falling commodity prices. In fact, Phillips 66 achieved $100 million in cost reductions in the first and second quarters of 2024, and in its refining segment, the company reported 98% crude utilization -- the highest such rate in over five years.\n\nAlthough the stock's slide may be disconcerting for some, it by no means signals that investors should keep it off their buy lists. Energy prices will rise again, and Phillips 66 stock will likely rebound with them. Until then -- and even after -- investors can rake in a steady stream of passive income as management intends to return 50% of operating cash flow to investors in the form of dividends.\n\nAn excellent value stock in the transportation sector\n\nLee Samaha(Delta Air Lines): The airline trades at just 7.7 times its estimated 2024 earnings and represents an excellent value opportunity for investors looking for exposure to airline stocks. The low valuation is likely a reflection of the perceived risk in the stock coming from its debt profile and its exposure to the cyclical nature of the airline industry.\n\nHowever, those risks look overstated. Delta Air Lines currently has $19.2 billion in net debt, but management is focused on paying it down -- and with $3 billion to $4 billion in free cash flow expected in 2024, it will have resources to do so further this year.\n\nIn addition, investors recently received some good news on the \"cyclicality\" issue. In usual cycles, airlines have tended to build capacity as the market improves, only to overextend themselves and walk into a period of overcapacity when demand growth starts to slow. The result is usually a sharp profit slowdown, as airlines stubbornly maintain unprofitable routes while waiting for an upturn.\n\nInvestors were worried about that scenario when overcapacity reared its head in the summer. However, Delta and United Airlines' management spoke at a conference recently and confirmed that the industry had acted rationally and cut less-profitable routes. As such, Delta and United are improving their revenue per available seat miles (RASM) metric again, implying that the overcapacity issue has gone.\n\nThat's good news. With interest rates set to move lower, airlines could benefit from improved consumer discretionary spending and corporate travel. As such, Delta Air Lines looks like an excellent value stock.\n\nShould you invest $1,000 in Honeywell International right now?\n\nBefore you buy stock in Honeywell International, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Honeywell International wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $716,988!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of September 30, 2024\n\nDaniel Foelber has no position in any of the stocks mentioned. Lee Samaha has no position in any of the stocks mentioned. Scott Levine has no position in any of the stocks mentioned. The Motley Fool recommends Delta Air Lines. The Motley Fool has a disclosure policy.\n\nThese 3 Bargain-Bin Dividend Value Stocks Have Become Too Cheap to Ignore was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-bargain-bin-dividend-value-134500979.html",
        "symbols": [
            "DAL.US",
            "HON.US",
            "PSX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.064,
            "neu": 0.786,
            "pos": 0.15
        }
    },
    {
        "date": "2024-10-02T10:59:00+00:00",
        "title": "The Zacks Analyst Blog Highlights Honeywell International, Accenture, City Holding and First United",
        "content": "For Immediate Release\n\nChicago, IL – October 2, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: Honeywell International Inc. HON, Accenture plc ACN, City Holding Co. CHCO and First United Corp. FUNC.\n\nHere are highlights from Tuesday’s Analyst Blog:\n\nTime to Buy These 4 Stocks with Rising Dividend Yields\n\nWall Street is back in rally and ended September on a high after a rough start to what is historically considered the worst month for stocks. The Federal Reserve’s jumbo rate cut has also fueled the stock market rally.\n\nHowever, concerns remain about the economy's health, which saw consumer confidence decline in September. Given this situation, cautious investors looking for a steady income and preservation of their capital may want to continue holding or buying dividend-paying stocks. Four such stocks are Honeywell International Inc., Accenture plc, City Holding Co. and First United Corp.\n\nWall Steet Rallies After Rate Cuts\n\nWall Street had a choppy start to September after fears were reignited that the economy was slowing and the Federal Reserve may have delayed too long to start its easing cycle. However, stocks rebounded after fresh economic data showed that inflation declined further in August.\n\nAlso, the Federal Reserve finally announced a half-percentage point rate cut in its September policy meeting. Stocks have since been on a rally. On Monday, the rally was fueled by comments from Federal Reserve Chairman Jerome Powell, who said that more rate cuts could be coming. On Monday, the S&P 500 closed at a new record high of 5,762.48 points.\n\nSeptember has historically been the worst month for Wall Street but stock markets defied the norm this year. The S&P 500, the Dow and the Nasdaq closed higher by 2%, 1.9% and 2.7%, respectively, for the month.\n\nSinking Consumer Confidence Could Make Stock Markets Volatile\n\nAlthough stocks have been performing well, concerns remain about the economy’s health. Market participants were expecting a 25-basis-point rate cut by the Fed in September. Many have been viewing the Fed’s decision to cut rates by 50 basis points as an aggressive step to help the economy make a soft landing.\n\nConcerns over a slowing economy saw consumer confidence drop to 98.7 in September from an upwardly revised 105.6 in August to its lowest level in three years.\n\nGiven this situation, it would thus be ideal to invest in dividend stocks. These companies, with their solid operations, consistently deliver dividends and stay profitable thanks to their dependable business models. In a market with high volatility, companies that provide substantial dividend payouts often perform better than those that do not offer dividends.\n\nStory continues\n\nDividend Paying Stocks Are a Safe Bet\n\nHoneywell International Inc.\n\nHoneywell International Inc. is a global diversified technology and manufacturing company, with a wide range of products and services. HON's diversified portfolio of solutions serves customers globally with aerospace products and services, energy-efficient products and solutions for businesses, and process technology, specialty chemicals, electronic and advanced materials for refining and petrochemicals. Honeywell International has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nOn Sept. 27, Honeywell International announced that its shareholders would receive a dividend of $1.13 a share on Dec. 6, 2024. HON has a dividend yield of 2.08%. Over the past five years, Honeywell International has increased its dividend six times, and its payout ratio at present sits at 45% of earnings. Check Honeywell International’s dividend history here.\n\nHoneywell International Inc. dividend-yield-ttm | Honeywell International Inc. Quote\n\nAccenture plc\n\nAccenture plc’s years of investment in digital, cloud and security strategy have helped it evolve as a trusted and viable consulting services provider. ACN is currently one of the top consultancy firms in the world by revenues that increased 4% in fiscal 2023 with a contribution of 52% from consulting services. Accenture has a Zacks Rank #3.\n\nOn Sept. 26, Accenture declared that its shareholders would receive a dividend of $1.48 a share on Nov. 15, 2024. ACN has a dividend yield of 1.48%. Over the past five years, Accenture has increased its dividend six times, and its payout ratio at present sits at 43% of earnings. Check Accenture’s dividend history here.\n\nAccenture PLC dividend-yield-ttm | Accenture PLC Quote\n\nCity Holding Company\n\nCity Holding Company is a multi-bank holding company that provides diversified financial products and services to consumers and local businesses. CHCO carries a Zacks Rank #2 (Buy).\n\nOn Sept. 25, City Holding Company announced that its shareholders would receive a dividend of $0.79 a share on Oct. 31, 2024. CHCO has a dividend yield of 2.45%. Over the past five years, City Holding Company has increased its dividend six times, and its payout ratio at present sits at 37% of earnings. Check City Holding Company’s dividend history here.\n\nCity Holding Company dividend-yield-ttm | City Holding Company Quote\n\nFirst United Corporation\n\nFirst United Corporation is a one-bank holding company with two non-bank subsidiaries. FUNC carries a Zacks Rank #3.\n\nOn Sept. 25, First United Corporation declared that its shareholders would receive a dividend of $0.22 a share on Nov. 1, 2024. FUNC has a dividend yield of 2.69%. Over the past five years, First United Corporation has increased its dividend five times, and its payout ratio at present sits at 28% of earnings. Check First United Corporation’s dividend history here.\n\nFirst United Corporation dividend-yield-ttm | First United Corporation Quote\n\nWhy Haven't You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\n\nToday you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAccenture PLC (ACN) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nCity Holding Company (CHCO) : Free Stock Analysis Report\n\nFirst United Corporation (FUNC) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-honeywell-105900617.html",
        "symbols": [
            "0Y0Y.LSE",
            "ACN.US",
            "ACNB34.SA",
            "ACNN.MX",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "CHCO.US",
            "CSA.BE",
            "CSA.F",
            "CSA.STU",
            "GSPC.INDX",
            "HON.MX",
            "HON.NEO",
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.029,
            "neu": 0.834,
            "pos": 0.138
        }
    },
    {
        "date": "2024-10-02T00:00:00+00:00",
        "title": "These 3 Bargain-Bin Dividend Value Stocks Have Become Too Cheap to Ignore",
        "content": "Investors looking for bargains in a relatively expensive market have come to the right place.",
        "link": "https://www.fool.com/investing/2024/10/02/buy-dividend-value-stock-passive-income/",
        "symbols": [
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0,
            "neg": 0,
            "neu": 1,
            "pos": 0
        }
    }
]