[
    {
        "date": "2024-10-15T15:49:00+00:00",
        "title": "Honeywell Grabs $103M Deal From U.S. Army for Radar Altimeter System",
        "content": "Honeywell International Inc. HON recently secured a contract worth $103 million from the U.S. Army to offer its next-generation APN-209 radar altimeter (Next Gen APN-209) system for various army aircraft. The latest deal is built on a long-standing partnership where HON has served as a reliable altimeter provider to the U.S. Department of Defense, with more than 150,000 units supplied.\r\n\r\nHON’s shares inched up 0.8% yesterday, eventually closing the session at $217.60.\n\nInside the Headlines\n\nHoneywell's Next Gen APN-209 is the modified version of its APN-209 system, which has served as the primary radar altimeter on several U.S. military aircraft since 1975. The advanced technology embedded in the updated radar altimeter system boosts the safety, reliability and operational capability of army aircraft, particularly in adverse weather conditions. \r\n\r\nThe Next Gen APN-209 features HON’s common-core radar altimeter architecture similar to its civil radar altimeters that minimize risks related to component obsolescence and supply-chain disruptions. It also boasts flexible integration options that come either with an integrated altitude indicator or as a separate transceiver, thereby catering to several aircraft requirements.\n\nHON’s Zacks Rank & Price Performance\n\nHoneywell, with approximately $141.4 billion market capitalization, currently carries a Zacks Rank #4 (Sell). The company is grappling with persistent softness in its Industrial Automation segment. Weakness in the warehouse and workflow solutions businesses due to lower demand for projects has been affecting the segment's performance. \r\n\r\nHigh debt level also remains a concern. Exiting second-quarter 2024, the company’s long-term debt was $20.9 billion, higher than $16.6 billion at 2023-end. The increase in its debt level was primarily attributable to the funds raised for the Global Access Solutions acquisition. Considering its high debt level, its cash and cash equivalents of $9.6 billion do not look impressive. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nIn the past three months, the company’s shares have lost 0.4% against the industry’s 2.7% growth.\r\n\r\nThe Zacks Consensus Estimate for earnings is pegged at $10.10 per share for 2024, indicating a decrease of 0.5% from the 60-day-ago figure.\n\nStocks to Consider\n\nSome better-ranked companies from the same space are discussed below.\r\n\r\nMarkel Group Inc. MKL currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\r\n\r\nMKL delivered a trailing four-quarter average earnings surprise of 35.4%. In the past 60 days, the Zacks Consensus Estimate for Markel’s 2024 earnings has increased 3.5%. Find the latest EPS estimates and surprises on Zacks Earnings Calendar.\r\n\r\nCrane Company CR presently carries a Zacks Rank of 2. The company delivered a trailing four-quarter average earnings surprise of 11.2%.\r\n\r\nIn the past 60 days, the Zacks Consensus Estimate for CR’s 2024 earnings has increased 0.6%.\r\n\r\nParker-Hannifin Corporation PH currently carries a Zacks Rank of 2. PH delivered a trailing four-quarter average earnings surprise of 11.2%.\r\n\r\nIn the past 60 days, the consensus estimate for Parker-Hannifin’s fiscal 2025 (ending June 2025) earnings has increased 0.3%.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nParker-Hannifin Corporation (PH) : Free Stock Analysis Report\n\nMarkel Group Inc. (MKL) : Free Stock Analysis Report\n\nCrane Company (CR) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-grabs-103m-deal-u-154900544.html",
        "symbols": [
            "0JYM.LSE",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "MKL.US",
            "MKV.BE",
            "MKV.F",
            "MKV.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.983,
            "neg": 0.047,
            "neu": 0.847,
            "pos": 0.106
        }
    },
    {
        "date": "2024-10-15T12:06:34+00:00",
        "title": "Honeywell awarded $103M contract by U.S. Army",
        "content": "https://www.tipranks.com/news/the-fly/honeywell-awarded-103m-contract-by-u-s-army\n\nHoneywell has been awarded a $103M contract by the U.S. Army, through the Defense Logistics Agency, to provide its Next-Generation APN-209 Radar Altimeter system on a wide variety of Army aircraft. This contract underscores Honeywell’s ongoing commitment to delivering advanced, reliable technology to support U.S. Army missions. It also supports Honeywell’s alignment of its portfolio to three powerful megatrends, including the future of aviation.\n\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\n\nSee today’s best-performing stocks on TipRanks >>\n\nRead More on HON:\n\nHoneywell in advanced talks to sell PPE unit to Odyssey, Bloomberg says Delta reports mixed Q3, Domino’s reports earnings beat: Morning Buzz Honeywell downgraded to Neutral from Overweight at JPMorgan Honeywell, Qualcomm expand collaboration to develop AI solutions Deutsche says Honeywell spin doesn’t signal ‘imminent’ broader breakup\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-awarded-103m-contract-u-120634945.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.946,
            "neg": 0.016,
            "neu": 0.835,
            "pos": 0.149
        }
    }
]