[
    {
        "date": "2024-10-16T08:48:51+00:00",
        "title": "General Industrial Machinery Stocks Q1 Earnings: Luxfer (NYSE:LXFR) Best of the Bunch",
        "content": "General Industrial Machinery Stocks Q1 Earnings: Luxfer (NYSE:LXFR) Best of the Bunch\n\nThe end of the earnings season is always a good time to take a step back and see who shined (and who not so much). Let’s take a look at how general industrial machinery stocks fared in Q1, starting with Luxfer (NYSE:LXFR).\n\nAutomation that increases efficiency and connected equipment that collects analyzable data have been trending, creating new demand for general industrial machinery companies. Those who innovate and create digitized solutions can spur sales and speed up replacement cycles, but all general industrial machinery companies are still at the whim of economic cycles. Consumer spending and interest rates, for example, can greatly impact the industrial production that drives demand for these companies’ offerings.\n\nThe 15 general industrial machinery stocks we track reported a satisfactory Q1. As a group, revenues beat analysts’ consensus estimates by 8.5% while next quarter’s revenue guidance was 4% below.\n\nThe Fed cut its policy rate by 50bps (half a percent) in September 2024, the first in roughly four years. This marks the end of its most pointed inflation-busting campaign since the 1980s. While CPI (inflation) readings have been supportive lately, employment measures have bordered on worrisome. The markets will be assessing whether this rate cut's timing (and more potential ones in 2024 and 2025) is ideal for supporting the economy or a bit too late for a macro that has already cooled too much.\n\nIn light of this news, general industrial machinery stocks have held steady with share prices up 2% on average since the latest earnings results.\n\nBest Q1: Luxfer (NYSE:LXFR)\n\nWith its magnesium alloys used in the construction of the famous Spirit of St. Louis aircraft, Luxfer (NYSE:LXFR) offers specialized materials, components, and gas containment devices to various industries.\n\nLuxfer reported revenues of $89.4 million, down 11.7% year on year. This print exceeded analysts’ expectations by 7.8%. Overall, it was an incredible quarter for the company with an impressive beat of analysts’ earnings estimates. Luxfer Total Revenue\n\nInterestingly, the stock is up 34.3% since reporting and currently trades at $12.93.\n\nIs now the time to buy Luxfer? Access our full analysis of the earnings results here, it’s free.\n\n3M (NYSE:MMM)\n\nProducers of the first asthma inhaler, 3M Company (NYSE:MMM) is a global conglomerate known for products in industries like healthcare, safety, electronics, and consumer goods.\n\n3M reported revenues of $6.02 billion, down 24.7% year on year, outperforming analysts’ expectations by 3.3%. The business had an exceptional quarter with an impressive beat of analysts’ operating margin estimates and a solid beat of analysts’ organic revenue estimates.\n\nStory continues 3M Total Revenue\n\nThe market seems happy with the results as the stock is up 31.3% since reporting. It currently trades at $135.75.\n\nIs now the time to buy 3M? Access our full analysis of the earnings results here, it’s free.\n\nWeakest Q1: John Bean (NYSE:JBT)\n\nTracing back to its invention of the mechanical milk bottle filler in 1884, John Bean (NYSE:JBT) designs, manufactures, and sells equipment used for food processing and aviation.\n\nJohn Bean reported revenues of $402.3 million, down 5.9% year on year, falling short of analysts’ expectations by 7%. It was a softer quarter as it posted a miss of analysts’ earnings estimates.\n\nInterestingly, the stock is up 3.5% since the results and currently trades at $99.99.\n\nRead our full analysis of John Bean’s results here.\n\nHoneywell (NASDAQ:HON)\n\nOriginally founded in 1906 as a thermostat company, Honeywell (NASDAQ:HON) is an aerospace and defense manufacturing company building technologies, performance materials, and safety and productivity solutions.\n\nHoneywell reported revenues of $9.58 billion, up 4.7% year on year. This number topped analysts’ expectations by 1.7%. It was an exceptional quarter as it also recorded full-year revenue guidance exceeding analysts’ expectations and an impressive beat of analysts’ organic revenue estimates.\n\nHoneywell achieved the highest full-year guidance raise among its peers. The stock is up 1.1% since reporting and currently trades at $216.07.\n\nRead our full, actionable report on Honeywell here, it’s free.\n\nGeneral Electric (NYSE:GE)\n\nOne of the original 12 companies on the Dow Jones Industrial Average, General Electric (NYSE:GE) is a multinational conglomerate providing technologies for various sectors including aviation, power, renewable energy, and healthcare.\n\nGeneral Electric reported revenues of $18.11 billion, up 129% year on year. This result beat analysts’ expectations by 112%. More broadly, it was a mixed quarter as it also recorded an impressive beat of analysts’ earnings estimates but a miss of analysts’ organic revenue estimates.\n\nGeneral Electric pulled off the biggest analyst estimates beat and fastest revenue growth among its peers. The stock is up 16.6% since reporting and currently trades at $189.72.\n\nRead our full, actionable report on General Electric here, it’s free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/general-industrial-machinery-stocks-q1-084851453.html",
        "symbols": [
            "GCP.F",
            "GCP.XETRA",
            "GE.MX",
            "GE.US",
            "GEOO34.SA",
            "HON.US",
            "JBT.BE",
            "JBT.F",
            "JBT.STU",
            "JBT.US",
            "LXFR.US",
            "MMM.BE",
            "MMM.F",
            "MMM.HA",
            "MMM.HM",
            "MMM.MU",
            "MMM.MX",
            "MMM.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.021,
            "neu": 0.826,
            "pos": 0.153
        }
    }
]