[
    {
        "date": "2024-05-31T22:15:07+00:00",
        "title": "Honeywell International Inc. (HON) Gains But Lags Market: What You Should Know",
        "content": "The most recent trading session ended with Honeywell International Inc. (HON) standing at $202.19, reflecting a +0.64% shift from the previouse trading day's closing. This move lagged the S&P 500's daily gain of 0.8%. Meanwhile, the Dow gained 1.51%, and the Nasdaq, a tech-heavy index, lost 0.01%.\n\nShares of the company witnessed a gain of 3.75% over the previous month, beating the performance of the Conglomerates sector with its gain of 3.33% and underperforming the S&P 500's gain of 4.14%.\n\nMarket participants will be closely following the financial results of Honeywell International Inc. in its upcoming release. The company is expected to report EPS of $2.32, up 4.04% from the prior-year quarter. Alongside, our most recent consensus estimate is anticipating revenue of $9.32 billion, indicating a 1.93% upward movement from the same quarter last year.\n\nIn terms of the entire fiscal year, the Zacks Consensus Estimates predict earnings of $9.93 per share and a revenue of $38.37 billion, indicating changes of +8.41% and +4.65%, respectively, from the former year.\n\nInvestors should also pay attention to any latest changes in analyst estimates for Honeywell International Inc. These latest adjustments often mirror the shifting dynamics of short-term business patterns. Consequently, upward revisions in estimates express analysts' positivity towards the company's business operations and its ability to generate profits.\n\nEmpirical research indicates that these revisions in estimates have a direct correlation with impending stock price performance. To utilize this, we have created the Zacks Rank, a proprietary model that integrates these estimate changes and provides a functional rating system.\n\nThe Zacks Rank system, which varies between #1 (Strong Buy) and #5 (Strong Sell), carries an impressive track record of exceeding expectations, confirmed by external audits, with stocks at #1 delivering an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed a 0.05% decrease. Right now, Honeywell International Inc. possesses a Zacks Rank of #3 (Hold).\n\nLooking at its valuation, Honeywell International Inc. is holding a Forward P/E ratio of 20.23. For comparison, its industry has an average Forward P/E of 18.46, which means Honeywell International Inc. is trading at a premium to the group.\n\nIt is also worth noting that HON currently has a PEG ratio of 2.32. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The average PEG ratio for the Diversified Operations industry stood at 2.06 at the close of the market yesterday.\n\nStory continues\n\nThe Diversified Operations industry is part of the Conglomerates sector. With its current Zacks Industry Rank of 101, this industry ranks in the top 41% of all industries, numbering over 250.\n\nThe Zacks Industry Rank assesses the strength of our separate industry groups by calculating the average Zacks Rank of the individual stocks contained within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nEnsure to harness Zacks.com to stay updated with all these stock-shifting metrics, among others, in the next trading sessions.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-international-inc-hon-gains-221507024.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.015,
            "neu": 0.877,
            "pos": 0.108
        }
    },
    {
        "date": "2024-05-31T14:52:37+00:00",
        "title": "NVIDIA is a shoo-in for the Dow post stock split",
        "content": "With its latest earnings report, AI darling NVIDIA Corporation (NASDAQ:NVDA) announced a ten-for-one stock split. The split, which will be distributed at the close on June 7th, will give shareholders ten shares in exchange for each one share they own as of the June 6th record date. The stock will start trading split-adjusted at market open on Monday, June 10th. The split raises the very real possibility that NVIDIA will be added to the Dow Jones Industrial Average (DJIA), with chip-laggard Intel Corporation (NASDAQ:INTC) seen as the company it will likely replace.\n\nThe Dow is a price a price-weighted index, meaning stocks with higher prices have a bigger impact on the index. With NVIDIA’s stock over $1000 per share currently, this would give it too much of a weighting in the index. However, with the ten-for-one split, the stock price would be closer to the $100 level – making an entry into the Dow more feasible and likely.\n\nThe last change for the Dow was in August 2020, when Salesforce (NYSE:CRM), Honeywell (NASDAQ:HON), and Amgen (NASDAQ:AMGN) replaced ExxonMobil (NYSE:XOM), Raytheon (NYSE:RTN), and Pfizer (NYSE:PFE).\n\nWhen asked to comment on speculation that NVIDIA will soon be added to the Dow, S&P Dow Jones Indices, the firm behind the index, said it does not comment or speculate on index additions or deletions.\n\nHowever, reading the DJIA methodology language carefully hints that NVIDIA will, in fact, be added, and the announcement can come at any time.\n\nIt reads: “While stock selection is not governed by quantitative rules, a stock typically is added only if the company has an excellent reputation, demonstrates sustained growth and is of interest to a large number of investors. Since the indexes are price weighted, the Index Committee evaluates stock price when considering a company for inclusion. The Index Committee monitors whether the highest-priced stock in the index has a price more than 10 times that of the lowest. Maintaining adequate sector representation within the index is also a consideration in the selection process for the Dow Jones Industrial Average. Companies should be incorporated and headquartered in the U.S., and a plurality of revenues should be derived from the U.S. Changes to the indices are made on an as-needed basis. There is no annual or semi-annual reconstitution. Rather, changes in response to corporate actions and market developments can be made at any time. Constituent changes are typically announced one to five days before they are scheduled to be implemented. At any given time, the constituents of the Dow Jones Industrial Average, Dow Jones Transportation Average and Dow Jones Utility Average make up the Dow Jones Composite Average.” (bolded by Investing.com)\n\nStory continues\n\nFive reasons NVIDIA should replace Intel in the Dow\n\nNVIDIA is the third-largest company in the world, with a market value of $2.7 trillion—behind only Microsoft (NASDAQ:MSFT), which has a market value of just over $3 trillion, and Apple (NASDAQ:AAPL), which has a market value of $2.9 trillion. Apple and Microsoft are both in the Dow.\n\nIt is the leader in AI, powering applications like ChatGPT, which is expected to be bigger than the Internet.\n\nNVIDIA now dwarfs the once-mighty Intel, which has a market cap of only $128 billion. Intel is the lowest-priced stock in the Dow, and its market cap is near the bottom of the list.\n\nNVIDIA is expected to post revenue of $111.38 billion this year versus $52 billion for Intel. NVIDIA’s growth is also astonishing versus Intel’s lack of growth. NVIDIA’s revenue is expected to grow by 83% this year, while Intel’s is expected to fall by 5%.\n\nThe inclusion of NVIDIA in the Dow will also be an admission by the DJIA Index Committee that AI is the future of all industries, not just technology.\n\nRelated Articles\n\nNVIDIA is a shoo-in for the Dow post stock split\n\nBoston Beer reportedly in sale talks to Suntory: WSJ\n\nUS lawmakers ask FBI for briefing on GenScript Biotech's links to China\n\nView comments",
        "link": "https://finance.yahoo.com/news/nvidia-shoo-dow-post-stock-145237106.html",
        "symbols": [
            "1INTC.MI",
            "1NVDA.MI",
            "AAPL.US",
            "AMGN.US",
            "CRM.US",
            "DJI.INDX",
            "HON.US",
            "INL.BE",
            "INL.F",
            "INL.HM",
            "INL.MU",
            "INL.STU",
            "INL.XETRA",
            "INTC.BA",
            "INTC.MX",
            "INTC.NEO",
            "INTC.US",
            "ITLC34.SA",
            "MSFT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.98,
            "neg": 0.011,
            "neu": 0.931,
            "pos": 0.059
        }
    }
]