[
    {
        "date": "2024-06-12T22:15:08+00:00",
        "title": "Honeywell International Inc. (HON) Stock Sinks As Market Gains: Here's Why",
        "content": "Honeywell International Inc. (HON) ended the recent trading session at $208.50, demonstrating a -0.47% swing from the preceding day's closing price. This change lagged the S&P 500's daily gain of 0.85%. Meanwhile, the Dow lost 0.09%, and the Nasdaq, a tech-heavy index, added 1.53%.\n\nComing into today, shares of the company had gained 3.09% in the past month. In that same time, the Conglomerates sector gained 3.32%, while the S&P 500 gained 3.11%.\n\nThe investment community will be paying close attention to the earnings performance of Honeywell International Inc. in its upcoming release. It is anticipated that the company will report an EPS of $2.40, marking a 7.62% rise compared to the same quarter of the previous year. In the meantime, our current consensus estimate forecasts the revenue to be $9.44 billion, indicating a 3.23% growth compared to the corresponding quarter of the prior year.\n\nFor the full year, the Zacks Consensus Estimates are projecting earnings of $10.13 per share and revenue of $38.69 billion, which would represent changes of +10.59% and +5.52%, respectively, from the prior year.\n\nAny recent changes to analyst estimates for Honeywell International Inc. should also be noted by investors. Such recent modifications usually signify the changing landscape of near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.\n\nOur research reveals that these estimate alterations are directly linked with the stock price performance in the near future. To utilize this, we have created the Zacks Rank, a proprietary model that integrates these estimate changes and provides a functional rating system.\n\nThe Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has shifted 3.07% upward. Honeywell International Inc. is currently sporting a Zacks Rank of #3 (Hold).\n\nLooking at its valuation, Honeywell International Inc. is holding a Forward P/E ratio of 20.68. This denotes a premium relative to the industry's average Forward P/E of 17.52.\n\nInvestors should also note that HON has a PEG ratio of 2.25 right now. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. By the end of yesterday's trading, the Diversified Operations industry had an average PEG ratio of 1.91.\n\nStory continues\n\nThe Diversified Operations industry is part of the Conglomerates sector. At present, this industry carries a Zacks Industry Rank of 48, placing it within the top 20% of over 250 industries.\n\nThe Zacks Industry Rank evaluates the power of our distinct industry groups by determining the average Zacks Rank of the individual stocks forming the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nTo follow HON in the coming trading sessions, be sure to utilize Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-international-inc-hon-stock-221508054.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "GSPC.INDX",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.988,
            "neg": 0.006,
            "neu": 0.914,
            "pos": 0.08
        }
    }
]