[
    {
        "date": "2024-07-16T13:40:12+00:00",
        "title": "Is Danaher (DHR) Stock Outpacing Its Conglomerates Peers This Year?",
        "content": "Investors interested in Conglomerates stocks should always be looking to find the best-performing companies in the group. Has Danaher (DHR) been one of those stocks this year? Let's take a closer look at the stock's year-to-date performance to find out.\n\nDanaher is one of 24 individual stocks in the Conglomerates sector. Collectively, these companies sit at #1 in the Zacks Sector Rank. The Zacks Sector Rank includes 16 different groups and is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors.\n\nThe Zacks Rank is a successful stock-picking model that emphasizes earnings estimates and estimate revisions. The system highlights a number of different stocks that could be poised to outperform the broader market over the next one to three months. Danaher is currently sporting a Zacks Rank of #2 (Buy).\n\nThe Zacks Consensus Estimate for DHR's full-year earnings has moved 0.1% higher within the past quarter. This shows that analyst sentiment has improved and the company's earnings outlook is stronger.\n\nBased on the most recent data, DHR has returned 6.4% so far this year. Meanwhile, stocks in the Conglomerates group have lost about 3.1% on average. This shows that Danaher is outperforming its peers so far this year.\n\nAnother Conglomerates stock, which has outperformed the sector so far this year, is Honeywell International Inc. (HON). The stock has returned 2.9% year-to-date.\n\nFor Honeywell International Inc. the consensus EPS estimate for the current year has increased 2.5% over the past three months. The stock currently has a Zacks Rank #2 (Buy).\n\nTo break things down more, Danaher belongs to the Diversified Operations industry, a group that includes 24 individual companies and currently sits at #34 in the Zacks Industry Rank. Stocks in this group have lost about 3.1% so far this year, so DHR is performing better this group in terms of year-to-date returns. Honeywell International Inc. is also part of the same industry.\n\nInvestors interested in the Conglomerates sector may want to keep a close eye on Danaher and Honeywell International Inc. as they attempt to continue their solid performance.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nDanaher Corporation (DHR) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/danaher-dhr-stock-outpacing-conglomerates-134012964.html",
        "symbols": [
            "0R2B.LSE",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "DAP.DU",
            "DAP.F",
            "DAP.MU",
            "DAP.STU",
            "DAP.XETRA",
            "DHER34.SA",
            "DHR.MX",
            "DHR.US",
            "HON.MX",
            "HON.NEO",
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.984,
            "neg": 0.02,
            "neu": 0.881,
            "pos": 0.099
        }
    },
    {
        "date": "2024-07-16T07:24:14+00:00",
        "title": "Q1 Earnings Highs And Lows: John Bean (NYSE:JBT) Vs The Rest Of The General Industrial Machinery Stocks",
        "content": "Q1 Earnings Highs And Lows: John Bean (NYSE:JBT) Vs The Rest Of The General Industrial Machinery Stocks\n\nAs the Q1 earnings season wraps, let's dig into this quarter's best and worst performers in the general industrial machinery industry, including John Bean (NYSE:JBT) and its peers.\n\nAutomation that increases efficiency and connected equipment that collects analyzable data have been trending, creating new demand for general industrial machinery companies. Those who innovate and create digitized solutions can spur sales and speed up replacement cycles, but all general industrial machinery companies are still at the whim of economic cycles. Consumer spending and interest rates, for example, can greatly impact the industrial production that drives demand for these companies’ offerings.\n\nThe 14 general industrial machinery stocks we track reported an ok Q1; on average, revenues missed analyst consensus estimates by 1.4%. Stocks, especially growth stocks where cash flows further in the future are more important to the story, had a good end of 2023. But the beginning of 2024 has seen more volatile stock performance due to mixed inflation data, and general industrial machinery stocks have held roughly steady amidst all this, with share prices up 4.2% on average since the previous earnings results.\n\nJohn Bean (NYSE:JBT)\n\nTracing back to its invention of the mechanical milk bottle filler in 1884, John Bean (NYSE:JBT) designs, manufactures, and sells equipment used for food processing and aviation.\n\nJohn Bean reported revenues of $392.3 million, flat year on year, in line with analysts' expectations. Overall, it was a slower quarter for the company with a miss of analysts' organic revenue estimates.\n\n\"JBT's financial results for the first quarter, which is typically the seasonally slowest quarter, were in line with our expectations,\" said Brian Deck, President and Chief Executive Officer. John Bean Total Revenue\n\nThe stock is up 7.7% since reporting and currently trades at $95.72.\n\nRead our full report on John Bean here, it's free.\n\nBest Q1: L.B. Foster (NASDAQ:FSTR)\n\nFounded with a $2,500 loan, L.B. Foster (NASDAQ:FSTR) is a provider of products and services for the transportation and energy infrastructure sectors, including rail products, construction materials, and coating solutions.\n\nL.B. Foster reported revenues of $124.3 million, up 7.6% year on year, outperforming analysts' expectations by 12.7%. It was an incredible quarter for the company with an impressive beat of analysts' earnings estimates. L.B. Foster Total Revenue\n\nL.B. Foster delivered the biggest analyst estimates beat among its peers. Although it had a great quarter compared its peers, the market seems unhappy with the results as the stock is down 6.5% since reporting. It currently trades at $22.74.\n\nStory continues\n\nIs now the time to buy L.B. Foster? Access our full analysis of the earnings results here, it's free.\n\nSlowest Q1: Icahn Enterprises (NASDAQ:IEP)\n\nFounded in 1987, Icahn Enterprises (NASDAQ: IEP) is a diversified holding company primarily engaged in investment and asset management across various sectors.\n\nIcahn Enterprises reported revenues of $2.47 billion, down 7.7% year on year, falling short of analysts' expectations by 11.6%. It was a weak quarter for the company with a miss of analysts' earnings estimates.\n\nThe stock is flat since the results and currently trades at $17.28.\n\nRead our full analysis of Icahn Enterprises's results here.\n\nCrane Company (NYSE:CR)\n\nBased in Connecticut, Crane Company (NYSE:CR) is a diversified manufacturer of engineered industrial products, including fluid handling, and aerospace technologies.\n\nCrane Company reported revenues of $565.3 million, up 10% year on year, surpassing analysts' expectations by 3.5%. More broadly, it was a very strong quarter for the company with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates.\n\nThe stock is up 17.4% since reporting and currently trades at $153.50.\n\nRead our full, actionable report on Crane Company here, it's free.\n\nHoneywell (NASDAQ:HON)\n\nOriginally founded in 1906 as a thermostat company, Honeywell (NASDAQ:HON) is an aerospace and defense manufacturing company building technologies, performance materials, and safety and productivity solutions.\n\nHoneywell reported revenues of $9.11 billion, up 2.7% year on year, in line with analysts' expectations. Taking a step back, it was a very strong quarter for the company with a solid beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates.\n\nThe stock is up 11% since reporting and currently trades at $216.\n\nRead our full, actionable report on Honeywell here, it's free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/q1-earnings-highs-lows-john-072414744.html",
        "symbols": [
            "CR.US",
            "FSTR.US",
            "HON.US",
            "IEP.US",
            "JBT.BE",
            "JBT.F",
            "JBT.STU",
            "JBT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.028,
            "neu": 0.832,
            "pos": 0.14
        }
    }
]