[
    {
        "date": "2024-05-16T13:57:00+00:00",
        "title": "Honeywell (HON) Rides on Business Strength Amid Headwinds",
        "content": "Honeywell International Inc. HON has been benefiting from strength in its commercial aviation original equipment and aftermarket businesses, driven by solid demand in the aviation market. Also, solid momentum in the company’s defense and space business owing to stable U.S. and international defense spend volumes has been driving its Aerospace segment.\r\n\r\nThe company’s Building Automation segment has been gaining from strong demand for building solutions and a robust backlog level. Strength in advanced materials and UOP businesses bodes well for HON’s Energy & Sustainability Solutions segment.\r\n\r\nManagement remains focused on acquiring businesses to gain access to new customers, regions and product lines. In March 2024, it announced its intention to acquire Civitanavi Systems S.p.A. for about $217 million to boost its portfolio of aerospace navigation solutions.\r\n\r\nAlso, in December 2023, the company entered a deal to acquire Carrier’s Global Access Solutions business for an all-cash deal of $4.95 billion. This acquisition positions HON to become a leading provider of security solutions for the digital age. In the first quarter of 2024, buyouts boosted the Industrial Automation segment’s sales by 1%.\r\n\r\nHON remains focused on rewarding shareholders through dividend payouts and share repurchases. For instance, in the first three months of 2024, it paid out dividends of $703 million and repurchased shares worth $671 million. Also, the quarterly dividend rate was hiked by 5% in September 2023. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nIn the past three months, the Zacks Rank #3 (Hold) company has gained 4% against the industry’s decline of 0.2%.\r\n\r\nHowever, persistent softness across its warehouse and workflow solutions, and productivity solutions and services businesses has been affecting the Industrial Automation segment's performance. In first-quarter 2024, the segment’s sales declined 12% on a year-over-year basis.\r\n\r\nHigh debt levels have also been major concerns for HON as it raises financial obligations and might drain its profitability. Honeywell exited the first quarter with long-term debt of $22.2 billion, up from $16.6 billion at 2023-end. Also, interest expenses and other financial charges in the quarter remained high at $220 million. Notably, the increase in its debt level was primarily attributable to the fund raised for the Carrier acquisition.\n\nKey Picks\n\nSome better-ranked stocks from the same space are discussed below.\r\n\r\nCarlisle Companies Incorporated CSL presently sports a Zacks Rank #1 (Strong Buy). It has a trailing four-quarter average earnings surprise of 17%. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nThe Zacks Consensus Estimate for CSL’s 2024 earnings has increased 5.8% in the past 60 days.\r\n\r\nITT Inc. ITT currently carries a Zacks Rank of 2 (Buy). It delivered a trailing four-quarter average earnings surprise of 6.5%.\r\n\r\nIn the past 60 days, the Zacks Consensus Estimate for ITT’s 2024 earnings has inched up 1.2%.\r\n\r\nGriffon Corporation GFF presently carries a Zacks Rank of 2. It delivered a trailing four-quarter average earnings surprise of 33.5%.\r\n\r\nIn the past 60 days, the Zacks Consensus Estimate for GFF’s 2024 earnings has increased 4.8%.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nITT Inc. (ITT) : Free Stock Analysis Report\n\nCarlisle Companies Incorporated (CSL) : Free Stock Analysis Report\n\nGriffon Corporation (GFF) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-hon-rides-business-strength-135700113.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.02,
            "neu": 0.805,
            "pos": 0.175
        }
    },
    {
        "date": "2024-05-16T06:49:56+00:00",
        "title": "Steven Cohen's Strategic Emphasis on Broadcom Inc in Q1 2024",
        "content": "Insight into Cohen's Latest 13F Filings and Investment Adjustments\n\nSteven Cohen (Trades, Portfolio), the Chairman and CEO of Point72 Asset Management, has made significant portfolio adjustments in the first quarter of 2024, as revealed in the latest 13F filing. With a robust background in economics from The Wharton School and a deep-rooted career in investment, Cohen continues to influence the financial markets through strategic stock selections and adjustments. His firm, known for its long/short equity strategy, focuses on a fundamental, bottom-up research process to drive its investment decisions.\n\nWarning! GuruFocus has detected 8 Warning Signs with AMZN. Steven Cohen's Strategic Emphasis on Broadcom Inc in Q1 2024\n\nSummary of New Buys\n\nSteven Cohen (Trades, Portfolio)'s portfolio saw the addition of 471 new stocks in this quarter. Noteworthy new positions include:\n\nBroadcom Inc (NASDAQ:AVGO), with 470,365 shares, making up 1.53% of the portfolio and valued at $623.43 million. Edwards Lifesciences Corp (NYSE:EW), comprising 2,970,804 shares, which account for approximately 0.7% of the portfolio, with a total value of $283.89 million. Zebra Technologies Corp (NASDAQ:ZBRA), with 659,175 shares, representing 0.49% of the portfolio and a total value of $198.70 million.\n\nKey Position Increases\n\nSignificant increases were also made to existing holdings, including:\n\nFox Corp (NASDAQ:FOXA), with an additional 9,098,097 shares, bringing the total to 9,740,532 shares. This adjustment represents a 1,416.19% increase in share count and a 0.7% impact on the current portfolio, valued at $304.59 million. PayPal Holdings Inc (NASDAQ:PYPL), with an additional 4,206,495 shares, bringing the total to 4,716,280 shares. This adjustment represents an 825.15% increase in share count, valued at $315.94 million.\n\nSummary of Sold Out Positions\n\nSteven Cohen (Trades, Portfolio) completely exited 424 holdings in the first quarter of 2024, including:\n\nUnion Pacific Corp (NYSE:UNP), where all 1,184,177 shares were sold, impacting the portfolio by -0.71%. Honeywell International Inc (NASDAQ:HON), with all 1,110,232 shares liquidated, causing a -0.57% impact on the portfolio.\n\nKey Position Reductions\n\nReductions were made in several key holdings, notably:\n\nDell Technologies Inc (NYSE:DELL), reduced by 3,909,954 shares, resulting in a -96.66% decrease in shares and a -0.73% impact on the portfolio. The stock traded at an average price of $93.3 during the quarter and has returned 81.02% over the past 3 months and 96.61% year-to-date. Meta Platforms Inc (NASDAQ:META), reduced by 779,637 shares, resulting in a -78.66% reduction in shares and a -0.68% impact on the portfolio. The stock traded at an average price of $446.07 during the quarter and has returned -0.41% over the past 3 months and 36.19% year-to-date.\n\nStory continues\n\nPortfolio Overview\n\nAs of the first quarter of 2024, Steven Cohen (Trades, Portfolio)'s portfolio included 2,067 stocks. The top holdings were:\n\nAmazon.com Inc (NASDAQ:AMZN) at 1.67% Broadcom Inc (NASDAQ:AVGO) at 1.53% Microsoft Corp (NASDAQ:MSFT) at 1.06% AT&T Inc (NYSE:T) at 1.05% Coca-Cola Co (NYSE:KO) at 0.8%\n\nThe holdings are mainly concentrated across 11 industries, with significant investments in Technology and Healthcare sectors. Steven Cohen's Strategic Emphasis on Broadcom Inc in Q1 2024 Steven Cohen's Strategic Emphasis on Broadcom Inc in Q1 2024\n\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\n\nThis article first appeared on GuruFocus.\n\nView comments",
        "link": "https://finance.yahoo.com/news/steven-cohens-strategic-emphasis-broadcom-064956750.html",
        "symbols": [
            "0YXG.LSE",
            "1YD.BE",
            "1YD.DU",
            "1YD.F",
            "1YD.HA",
            "1YD.HM",
            "1YD.MU",
            "1YD.STU",
            "1YD.XETRA",
            "AMZN.US",
            "AVGO.US",
            "AVGO34.SA",
            "DELL.US",
            "EW.US",
            "FOXA.US",
            "HON.US",
            "KO.US",
            "META.US",
            "MSFT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.011,
            "neu": 0.888,
            "pos": 0.101
        }
    }
]