[
    {
        "date": "2024-09-18T16:16:00+00:00",
        "title": "Honeywell Partners With SAMSUNG E&amp;A to Offer Carbon Capture Solution",
        "content": "Honeywell International Inc. HON recently announced its partnership with SAMSUNG E&A to mutually market a solution designed for minimizing carbon emissions in the power plant sector throughout the world. The collaboration is in line with Honeywell’s commitment to expanding its portfolio to keep up with the energy transition megatrend.\r\n\r\nHON’s share price inched down 0.2% yesterday, eventually closing the session at $204.24.\n\nMore on HON’s Partnership\n\nThe collaboration will involve SAMSUNG E&A leveraging Honeywell's advanced solvent carbon capture technology to enable power plants to meet environmental regulatory compliances. The deployment of HON’s carbon capture technologies will enable SAMSUNG E&A to offer a viable and sustainable solution for reducing greenhouse gas emissions.\r\n\r\nHoneywell’s carbon capture, utilization and storage (CCUS) technologies help users to minimize carbon dioxide emissions during the transition from fossil fuels to lower-carbon energy sources. Between 2023 and 2030, HON expects its CCUS technologies to mitigate 320 million metric tons of carbon dioxide on a global basis.\n\nHON’s Zacks Rank & Price Performance\n\nHoneywell, with approximately $131.5 billion market capitalization, currently carries a Zacks Rank #3 (Hold). The company is set to gain from strength in its commercial aviation aftermarket and original equipment. However, softness in its Industrial Automation segment remains a concern. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nIn the past six months, the company’s shares have gained 2.6% against the industry’s 4.5% decline.\r\n\r\nThe Zacks Consensus Estimate for earnings is pegged at $10.14 per share for 2024, indicating a decrease of a penny from the 30-day-ago figure.\n\nStocks to Consider\n\nSome better-ranked companies from the same space are discussed below.\r\n\r\nFederal Signal Corporation FSS currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\r\n\r\nFederal Signal delivered a trailing four-quarter average earnings surprise of 12.3%. In the past 60 days, the Zacks Consensus Estimate for FSS’ 2024 earnings has increased 5.2%.\r\n\r\nVector Group Ltd. VGR presently carries a Zacks Rank of 2. The company delivered a trailing four-quarter average earnings surprise of 15.4%.\r\n\r\nIn the past 60 days, the Zacks Consensus Estimate for VGR’s 2024 earnings has increased 5.2%.\r\n\r\nParker-Hannifin Corporation PH currently carries a Zacks Rank of 2. PH delivered a trailing four-quarter average earnings surprise of 11.2%.\r\n\r\nIn the past 60 days, the consensus estimate for Parker-Hannifin’s fiscal 2025 earnings has increased 1.3%.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nParker-Hannifin Corporation (PH) : Free Stock Analysis Report\n\nFederal Signal Corporation (FSS) : Free Stock Analysis Report\n\nVector Group Ltd. (VGR) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-partners-samsung-e-offer-161600452.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "FSG.F",
            "FSS.US",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0,
            "neu": 0.866,
            "pos": 0.134
        }
    }
]