[
    {
        "date": "2024-10-12T03:31:22+00:00",
        "title": "Honeywell International Inc. (HON) Partners with Chevron to Revolutionize Oil Refining Operations with AI-Enhanced Technologies for Improved Efficiency and Safety",
        "content": "We recently compiled a list of the 35 Trending AI Stocks on Latest News and Analyst Ratings.In this article, we are going to take a look at where Honeywell International Inc. (NASDAQ:HON) stands against the other trending AI stocks.\n\nTwo years after the public debut of ChatGPT, the generative AI landscape has evolved rapidly, igniting substantial investments in artificial intelligence and lifting valuations for startups and major tech companies alike. This surge in interest has primarily centered on cloud-based AI, where services like OpenAI's models operate on extensive data infrastructures. However, as these models grow in complexity, the demand for larger and more advanced data centers intensifies, leading to a race among companies to construct expansive facilities. Significant investments are projected, with estimates suggesting that major players will collectively spend around $160 billion in capital expenditures next year, primarily for acquiring powerful GPUs and related infrastructure necessary for training AI models. Top executives have even forecasted that global data center investments could double to $2 trillion within the next few years. Nevertheless, the sustainability of this spending spree raises questions about whether the revenue generated from AI applications can match the high costs of development and infrastructure.\n\nRead more about these developments by accessing 10 Best AI Data Center Stocks and 10 Buzzing AI Stocks According to Goldman Sachs.\n\nAmid these challenges, a new trend in edge AI is emerging. This concept involves running AI algorithms directly on personal devices like smartphones and computers rather than relying on centralized cloud servers. Edge AI offers numerous benefits, including real-time response capabilities without requiring a high-speed internet connection and enhanced privacy since user data remains on personal devices. Analysts project that nearly 50% of smartphones will have generative AI capabilities by 2027, a significant increase from the current 4%. However, implementing edge AI presents technical hurdles, primarily due to existing devices lacking the necessary computing power and memory to support large AI models. For instance, running OpenAI's GPT-4 model, which contains approximately 1.8 trillion parameters, is not feasible on typical smartphones today. Nevertheless, smaller, task-specific AI models are gaining traction, as they require less training data and can outperform larger, more generalized models in certain applications. These lightweight models are often open-source and designed for specific functions, making them easier to implement on consumer devices.\n\nStory continues\n\nAs semiconductor companies continue to innovate by increasing processing power and memory in smartphones and PCs, the capacity for running AI models on these devices is expected to grow. Research indicates that the proportion of smartphones capable of supporting large AI models could rise significantly within the next few years. Major chip manufacturers are advancing technologies such as chipset designs, allowing them to create more powerful processors without needing to shrink the circuitry. For investors, the rise of edge AI could lead to new opportunities and growth within the consumer electronics market, as users are likely to upgrade their devices to take advantage of enhanced AI functionalities. UBS analysts project that combined sales of smartphones and PCs could exceed $700 billion by 2027. Ultimately, the success of edge AI hinges on the development of compelling applications that consumers find valuable enough to invest in.\n\nRead more about these developments by accessing 30Most Important AI Stocks According to BlackRock and Beyond the Tech Giants: 35 Non-Tech AI Opportunities.\n\nOur Methodology\n\nFor this article, we selected AI stocks by combing through news articles, stock analysis, and press releases. These stocks are also popular among hedge funds.\n\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\n\nA shot of a commercial plane with a blur of color in the background, representing the production of auxiliary power units in the Safety and Productivity Solutions segment.\n\nHoneywell International Inc. (NASDAQ:HON)\n\nNumber of Hedge Fund Holders: 50\n\nHoneywell International Inc. (NASDAQ:HON) operates as a diversified technology and manufacturing company worldwide. The firm recently announced that it would be partnering with energy firm Chevron to enhance oil refining operations with advanced artificial intelligence assisted technologies, including a new generation of alarm management solutions. The companies said their partnership will seek to help operators make decisions that will improve efficiency in refining processes and boost safety within the industrial automation sector. Per the deal, the operators of the latter will be able to infuse AI into the Experion distributed control system, making them future ready and more informed in the control room. Lucian Boldea, a senior executive at Honeywell, claims that advancements in AI will change the way companies like Chevron innovate, learn and solve problems at the plant level.\n\nOverall HON ranks 17th among the AI stocks that are trending right now. While we acknowledge the potential of HON as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than HON but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nREAD NEXT: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-international-inc-hon-partners-033122051.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "CHEV.NEO",
            "CHV.BE",
            "CHV.DU",
            "CHV.F",
            "CHV.HM",
            "CHV.MU",
            "CHV.STU",
            "CHV.XETRA",
            "CHVX34.SA",
            "CVX.BA",
            "CVX.MX",
            "CVX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.009,
            "neu": 0.883,
            "pos": 0.108
        }
    }
]