[
    {
        "date": "2024-07-10T21:41:20+00:00",
        "title": "Honeywell defeats fired engineer's appeal over diversity training",
        "content": "By Jonathan Stempel\n\n(Reuters) - Honeywell did not violate workplace anti-discrimination laws by firing a white engineer who refused to participate in mandatory diversity, equity and inclusion training after the Black Lives Matter movement began, a U.S. appeals court ruled on Wednesday.\n\nThe 7th U.S. Circuit Court of Appeals in Chicago found no proof that Honeywell retaliated against Charles Vavra, after he complained a video he was supposed to watch on preventing unconscious bias in the workplace contained racist content.\n\nIn a 3-0 decision, the court said Vavra had no basis to reasonably believe the video violated Title VII of the federal Civil Rights Act or an Illinois human rights law, because he never watched the video in the first place.\n\nVavra assumed the training \"would vilify white people and treat people differently based on their race,\" Circuit Judge Thomas Kirsch wrote. \"But that presumption is purely speculative and insufficient to make his belief objectively reasonable.\"\n\nThe judge also said Vavra had reason to believe Honeywell's training was not discriminatory, because his supervisor had taken the training and told him it was not racist.\n\nKirsch and the other two appeals court judges were appointed to their positions by former President Donald Trump.\n\nLawyers for Vavra did not immediately respond to requests for comment. Honeywell and lawyers for the Charlotte, North Carolina-based industrial conglomerate did not immediately respond to similar requests.\n\nThe decision came amid growing complaints by some conservative groups and shareholders about the alleged illegality of workplace initiatives to counteract bias.\n\nUnconscious bias training became more common after a Minneapolis police officer's murder of George Floyd in May 2020 sparked nationwide protests over racial injustice.\n\nVavra was fired in April 2021, and sued Honeywell eight months later. A trial judge dismissed the lawsuit in August 2023. Wednesday's decision upheld that dismissal.\n\nThe case is Vavra v. Honeywell International Inc, 7th U.S. Circuit Court of Appeals, No. 23-2823.\n\n(Reporting by Jonathan Stempel in New York; Editing by Jamie Freed)\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-defeats-fired-engineers-appeal-214120450.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.985,
            "neg": 0.127,
            "neu": 0.84,
            "pos": 0.034
        }
    },
    {
        "date": "2024-07-10T20:04:06+00:00",
        "title": "S&amp;P 500 Tops 5,600 to Notch Longest Win This Year: Markets Wrap",
        "content": "(Bloomberg) -- A rally in the world’s largest technology companies sent stocks to all-time highs, with Jerome Powell’s remarks to Congress not doing much to dissuade traders from betting on Federal Reserve rate cuts this year.\n\nMost Read from Bloomberg\n\nSaudis Warned G-7 Over Russia Seizures With Debt Sale Threat The End of the Cheap Money Era Catches Up to Chelsea FC’s Owner Distressed Property Buyers Seek Out ‘Exceptional Bargains’ Microsoft, Apple Drop OpenAI Board Plans as Scrutiny Grows NYC Penthouse Sells for $135 Million in Priciest Deal Since 2022\n\nFor the first time in its history, the S&P 500 topped 5,600. A renewed bid for megacaps drove the gauge toward its longest win since November, with Nvidia Corp. up 2.5% and Apple Inc. climbing on news it aims to ship 10% more new iPhones after a bumpy 2023. Treasuries remained fairly stable after a strong $39 billion sale of 10-year bonds. Swaps are pricing in two Fed cuts in 2024 — and higher chances the first comes in September.\n\nAs Wall Street geared up for the consumer-price index, Powell said the Fed doesn’t need inflation below 2% before cutting rates, while adding officials still have more work to do. He noted the labor market has cooled “pretty significantly.” Powell cited a “good ways to go” on the balance-sheet runoff, and said commercial real estate doesn’t threaten financial stability.\n\n“The key takeaway from his testimony is the Fed’s assessment of the balance of risks is shifting in ways that – if supported and sustained by incoming data – will deliver a rate cut in September,” said Krishna Guha at Evercore.\n\nThe S&P 500 climbed for a seventh straight day, while the Nasdaq 100 added 1%. Gold and silver mining stocks rallied on Fed easing bets. Banks underperformed. Google parent Alphabet Inc. has shelved efforts to acquire HubSpot Inc., according to people with knowledge of the matter.\n\nUS 10-year yields fell two basis points to 4.28%. Bank of England Chief Economist Huw Pill said the timing of a rate cut is still an “open question,” prompting traders to pare bets on August cut. Oil rose as a US holiday boosted demand for gasoline and jet fuel.\n\n“Markets remain remarkably calm despite the flood of data this week, including Fed Chair Powell’s testimony, CPI/PPI reports, and the beginning of earnings season,” said Mark Hackett at Nationwide.\n\nThe so-called core CPI, which excludes food and energy costs and is seen as a better measure of underlying inflation, is expected to rise 0.2% in June for a second month. That would mark the smallest back-to-back gains since August — a pace more palatable for Fed officials.\n\nStory continues\n\n“June’s CPI report looks to be another ‘very good’ report that should boost the FOMC’s confidence about the inflation trajectory,” said Anna Wong at Bloomberg Economics. “That should set the stage for the Fed to start cutting rates in September.”\n\nA survey conducted by 22V Research shows 55% of investors expect the market reaction Thursday’s CPI to be “risk-on,” 16% said “risk-off” and 29% “mixed/negligible.”\n\n“There is optimism about inflation generally,” said Dennis DeBusschere at 22V, adding that the survey also showed investors think “CPI is on a Fed-friendly glide path.”\n\nMeantime, some trading desks say investors should gear up for a potential break in the eerie calm that’s recently descended on the market.\n\nThe options market is betting the S&P 500 Index will move 0.8% in either direction after Thursday’s report on consumer prices, based on the price of that day’s at-the-money straddles, according to Stuart Kaiser, Citigroup’s head of US equity trading strategy.\n\nIf it happens, that would be the biggest move for the index since June 12, the day of the last CPI print and interest-rate decision.\n\nMarket volatility may pick up in the days and weeks ahead, amid US political uncertainty, comments from the Fed chair, and the start of the second-quarter earnings season, according to Mark Haefele at UBS Global Wealth Management.\n\nFor the first time since 2022, S&P 500 earnings may not be laser-focused on just technology, with the quarter’s success hanging on everything aside from the megacap tech heavyweights that have driven stocks to all-time highs, according to Bloomberg Intelligence strategists led by Gina Martin Adams.\n\n“While forecasts for the ‘Magnificent Seven’ remain robust, their earnings are expected to slow in the second quarter — just as the rest of the S&P 500 may finally post their first year-on-year growth in at least five quarters,” they noted.\n\nThe Magnificent Seven may have already peaked, while the remaining S&P 500 stocks may post their first earnings expansion in at least six quarters, the strategists concluded.\n\nCorporate Highlights:\n\nMicrosoft Corp. has avoided the threat of a lengthy European Union antitrust probe into its cloud business after it brokered a deal with an Amazon.com Inc.-backed trade lobby that had complained about its software license agreements. Intuit Inc. is cutting 1,800 employees, swapping out low performers and executives with fresh hires meant to sharpen the company’s focus on products that use artificial intelligence. Advanced Micro Devices Inc. agreed to buy Silo AI for $665 million in cash, adding a maker of artificial intelligence models that will help its push to close the gap on Nvidia Corp. Archer-Daniels-Midland Co. — working to put an accounting scandal behind it — hired a 3M Co. executive to oversee its finances and help restore its credibility with shareholders. The US Federal Trade Commission is preparing a lawsuit against the three largest drug middlemen over their use of rebates for insulin and other drugs, according to a person familiar with the probe. Honeywell International Inc. agreed to buy Air Products and Chemicals Inc.’s liquefied natural gas process technology and equipment business for $1.81 billion in cash.\n\nKey events this week:\n\nUS CPI, initial jobless claims, Thursday Fed’s Raphael Bostic and Alberto Musalem speak, Thursday China trade, Friday University of Michigan consumer sentiment, US PPI, Friday Citigroup, JPMorgan and Wells Fargo’s earnings, Friday\n\nSome of the main moves in markets:\n\nStocks\n\nThe S&P 500 rose 0.8% as of 2:52 p.m. New York time The Nasdaq 100 rose 1% The Dow Jones Industrial Average rose 0.6% The MSCI World Index rose 0.8%\n\nCurrencies\n\nThe Bloomberg Dollar Spot Index was little changed The euro rose 0.1% to $1.0825 The British pound rose 0.5% to $1.2844 The Japanese yen fell 0.3% to 161.76 per dollar\n\nCryptocurrencies\n\nBitcoin fell 0.6% to $57,573.71 Ether rose 1% to $3,101.74\n\nBonds\n\nThe yield on 10-year Treasuries declined two basis points to 4.28% Germany’s 10-year yield declined five basis points to 2.53% Britain’s 10-year yield declined three basis points to 4.13%\n\nCommodities\n\nWest Texas Intermediate crude rose 1% to $82.26 a barrel Spot gold rose 0.4% to $2,372.91 an ounce\n\nThis story was produced with the assistance of Bloomberg Automation.\n\n--With assistance from Cecile Gutscher, Richard Henderson, Joel Leon and Jessica Menton.\n\nMost Read from Bloomberg Businessweek\n\nAt SpaceX, Elon Musk’s Own Brand of Cancel Culture Is Thriving Looser Visa Rules for Indian Travelers Stoke a Tourism Boom Psychedelics Are Now Legal in Australia—With a Catch How to Invest During a High Interest Rate Era The First Porsche 911 Hybrid Is $165,000 Carrera GTS: Review\n\n©2024 Bloomberg L.P.\n\nView comments",
        "link": "https://finance.yahoo.com/news/p-500-tops-historic-5-185319106.html",
        "symbols": [
            "0JCT.LSE",
            "A1MD34.SA",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "AMD.BE",
            "AMD.DU",
            "AMD.F",
            "AMD.HM",
            "AMD.MU",
            "AMD.MX",
            "AMD.NEO",
            "AMD.STU",
            "AMD.US",
            "AMD.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.991,
            "neg": 0.047,
            "neu": 0.87,
            "pos": 0.083
        }
    },
    {
        "date": "2024-07-10T16:07:11+00:00",
        "title": "Correction: Top Midday Stories: TSM June Revenue Jumps 33% YoY; Honeywell to Buy Air Products' LNG Process Tech; Microsoft, Apple Abandon Seats on OpenAI Board; AMD to Acquire Silo AI",
        "content": "Correction: Top Midday Stories: TSM June Revenue Jumps 33% YoY; Honeywell to Buy Air Products' LNG Process Tech; Microsoft, Apple Abandon",
        "link": "https://finance.yahoo.com/news/correction-top-midday-stories-tsm-160711727.html",
        "symbols": [
            "0005.HK",
            "0HBH.LSE",
            "0QYP.IL",
            "1MSFT.MI",
            "2330.TW",
            "A1MD34.SA",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "AMD.BE",
            "AMD.DU",
            "AMD.F",
            "AMD.HM",
            "AMD.MU",
            "AMD.MX"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.273,
            "neg": 0.122,
            "neu": 0.802,
            "pos": 0.076
        }
    },
    {
        "date": "2024-07-10T15:51:39+00:00",
        "title": "Top Midday Stories: TSM June Revenue Jumps 33% YoY; Honeywell to Acquire CAES Systems; Microsoft, Apple Abandon Seats on OpenAI Board; AMD Acquires Silo AI",
        "content": "Top Midday Stories: TSM June Revenue Jumps 33% YoY; Honeywell to Acquire CAES Systems; Microsoft, Apple Abandon Seats on OpenAI Board; AMD",
        "link": "https://finance.yahoo.com/news/top-midday-stories-tsm-june-155139847.html",
        "symbols": [
            "0005.HK",
            "0QYP.IL",
            "1MSFT.MI",
            "2330.TW",
            "A1MD34.SA",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "AMD.BE",
            "AMD.DU",
            "AMD.F",
            "AMD.HM",
            "AMD.MU",
            "AMD.MX",
            "AMD.NEO"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.273,
            "neg": 0.117,
            "neu": 0.81,
            "pos": 0.073
        }
    },
    {
        "date": "2024-07-10T15:25:59+00:00",
        "title": "Honeywell to Buy Air Products' LNG Process Tech, Equipment Unit in $1.81 Billion Deal",
        "content": "Honeywell International (HON) agreed to buy Air Products and Chemicals' (APD) liquefied natural gas process technology and equipment business for $1.81 billion, as the industrial conglomerate seeks to expand its energy transition portfolio.\r\n\r\nThe all-cash deal, which doesn't require any financing condition, is expected to close before the end of the year following regulatory approvals, the companies said in a statement Wednesday. Honeywell expects the acquisition to be immediately accretive to sales growth and segment margins and add to adjusted earnings on a per-share basis in the first year of full ownership. \r\n\r\nAir Products and Chemicals' LNG process technology and equipment business includes design and manufacturing of coil-wound heat exchangers, which provide high natural gas throughput, according to the statement. The business is headquartered in Pennsylvania with about 475 employees and a manufacturing facility in Florida.\n\n\"This highly complementary acquisition will further strengthen our energy transition portfolio,\" Honeywell Chief Executive Vimal Kapur said. \"Air Products' (coil-wound heat exchangers) technology will immediately expand our installed base — creating new opportunities to compound growth in aftermarket services and digitalization.\" \r\n\r\nThe divestment of the business will allow Air Products to continue focusing on its core industrial gas business and related technology and equipment, as well as on delivering clean hydrogen at scale, according to Seifi Ghasemi, CEO of the industrial gases company. The LNG business will be in \"good hands to advance as part of Honeywell's related portfolio of technologies,\" Ghasemi added. \r\n\r\nThe transaction marks Honeywell's fourth acquisition of the year. In June, the company agreed to buy aerospace and defense technology company CAES Systems for $1.9 billion and completed the acquisition of Carrier Global's (CARR) global access solutions business.\r\n\r\nEarlier in the year, the company disclosed plans to buy Civitanavi Systems for about 200 million euros ($216.5 million).\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-buy-air-products-apos-152559465.html",
        "symbols": [
            "0HBH.LSE",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "AP3.BE",
            "AP3.DU",
            "AP3.F",
            "AP3.MU",
            "AP3.STU",
            "APD.US",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.987,
            "neg": 0,
            "neu": 0.865,
            "pos": 0.135
        }
    },
    {
        "date": "2024-07-10T11:00:00+00:00",
        "title": "HONEYWELL TO ACQUIRE AIR PRODUCTS' LIQUEFIED NATURAL GAS PROCESS TECHNOLOGY AND EQUIPMENT BUSINESS TO EXPAND ENERGY TRANSITION SOLUTIONS AND SERVICES",
        "content": "Acquisition will build on Honeywell's energy transition capabilities by creating an end-to-end offering for customers worldwide The combination will create new opportunities for diversified growth and innovation in aftermarket services and software Transaction is expected to be immediately accretive to Honeywell's sales growth and segment margin while also accretive to adjusted EPS in the first full year of ownership Air Products to continue its focus on its industrial gas business and related technology and equipment and driving the energy transition through clean hydrogen at scale\n\nCHARLOTTE, N.C., July 10, 2024 /PRNewswire/ -- Honeywell (Nasdaq: HON) and Air Products (NYSE:APD) jointly announced today that Honeywell has agreed to acquire Air Products' liquefied natural gas (LNG) process technology and equipment business for $1.81 billion in an all-cash transaction. This represents approximately 13x estimated 2024 EBITDA. (PRNewsfoto/Honeywell)\n\nAs a result of the acquisition, Honeywell will be able to offer customers a comprehensive, top-tier solution for managing their energy transformation journey. The new holistic offering will encompass natural gas pre-treatment and state-of-the-art liquefaction, utilizing digital automation technologies unified under the Honeywell Forge and Experion platforms. This full-service solution will enable efficient, reliable and optimized management of natural gas assets, delivering unparalleled value and support.\n\nCurrently, Honeywell provides a pre-treatment solution serving LNG customers globally. Air Products' complementary LNG process technology and equipment business consists of a comprehensive portfolio, including in-house design and manufacturing of coil-wound heat exchangers (CWHE) and related equipment. CWHEs provide the highest throughput of natural gas in a single exchanger with a small footprint and robust, reliable and safe operations both onshore and offshore.\n\n\"While the world continues to build the renewables-based energy infrastructure of the future, natural gas is a critical lower-emission and affordable transition fuel that will help meet ever-increasing and dynamic global energy demands,\" said Vimal Kapur, Chairman and CEO of Honeywell.\n\n\"This highly complementary acquisition will further strengthen our energy transition portfolio, and Air Products' CWHE technology will immediately expand our installed base - creating new opportunities to compound growth in aftermarket services and digitalization through our Honeywell Forge platform,\" Kapur added.\n\nStory continues\n\n\"The decision to divest our LNG heat exchanger technology and equipment business reflects Air Products' continued focus on its two-pillar strategy -- to grow our core industrial gas business and related technology and equipment, and to be a first-mover delivering clean hydrogen at scale to decarbonize industrial and heavy-duty transportation sectors,\" said Air Products' Chairman, President and Chief Executive Officer Seifi Ghasemi. \"The LNG business is a great business and at its strongest point in its decades-long history thanks to the outstanding work of our people, and they will be in good hands to advance as part of Honeywell's related portfolio of technologies.\"\n\nThe LNG market has quadrupled over the past 20 years and is expected to double over the next two decades, driven by demand in key end markets including power and data centers according to industry research.1\n\nKen West, President and CEO of Honeywell's Energy and Sustainability Solutions (ESS) segment, said, \"The integration of this talented team and the acquired proprietary technologies will enable Honeywell UOP to bring a full spectrum of scalable solutions and services that help our global customers navigate the complex journey to more sustainable and efficient energy practices.\"\n\nAir Products' LNG Business has approximately 475 employees with headquarters in Allentown, Pennsylvania and a 390,000-square-foot manufacturing facility in Port Manatee, Florida, where all sizes of CWHEs are made.\n\nThis is the fourth acquisition Honeywell has announced this year as part of its disciplined capital deployment strategy. The company is focused on high-return acquisitions that will drive future growth across its portfolio, which is aligned with the three compelling megatrends of automation, the future of aviation and energy transition.\n\nThis transaction, which is expected to be adjusted earnings per share accretive in the first full year of ownership is not subject to any financing conditions and is expected to close before the end of the calendar year, subject to customary closing conditions, including receipt of certain regulatory approvals.\n\nEditor's Note: Link to Photo- A completed LNG heat exchanger manufactured at Air Products' Port Manatee facility is being loaded on a carrier at the Port of Manatee for shipment to the customer.\n\n1LNG industry trends | Deloitte US\n\nAbout Honeywell\n\nHoneywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Forge IoT platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world smarter, safer and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nWe describe many of the trends and other factors that drive our business and future results in this release. Such discussions contain forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended (the Exchange Act). Forward-looking statements are those that address activities, events, or developments that management intends, expects, projects, believes, or anticipates will or may occur in the future. They are based on management's assumptions and assessments in light of past experience and trends, current economic and industry conditions, expected future developments, and other relevant factors, many of which are difficult to predict and outside of our control. They are not guarantees of future performance, and actual results, developments and business decisions may differ significantly from those envisaged by our forward-looking statements. We do not undertake to update or revise any of our forward-looking statements, except as required by applicable securities law. Our forward-looking statements are also subject to material risks and uncertainties, including ongoing macroeconomic and geopolitical risks, such as lower GDP growth or recession, capital markets volatility, inflation, and certain regional conflicts, that can affect our performance in both the near- and long-term. In addition, no assurance can be given that any plan, initiative, projection, goal, commitment, expectation, or prospect set forth in this release can or will be achieved. These forward-looking statements should be considered in light of the information included in this release, our Form 10-K and other filings with the Securities and Exchange Commission. Any forward-looking plans described herein are not final and may be modified or abandoned at any time.\n\n1 This release references certain non-GAAP measures, including:\n\nSegment margin, which is defined as segment profit divided by net sales; segment profit, on an overall Honeywell basis, is defined as operating income, excluding stock compensation expense, pension and other postretirement service costs, amortization of acquisition-related intangibles, certain acquisition-related costs, and repositioning and other charges. Adjusted earnings per share, which is defined as diluted earning per share adjusted to exclude pension mark-to-market expense, amortization of acquisition-related intangibles, certain acquisition-related costs, and other items as described in reconciliations provided when we disclose adjusted earnings per share; and EBITDA, which we define as earnings before tax, depreciation and amortization.\n\nManagement believes that, when considered together with reported amounts, these measures are useful to investors and management in understanding our ongoing operations and in the analysis of ongoing operating trends.\n\nManagement does not consider these non-GAAP measures in isolation or as an alternative to financial measures determined in accordance with GAAP. The principal limitations of these non-GAAP financial measures are that they exclude significant expenses and income that are required by GAAP to be recognized in the consolidated financials statements. In addition, they are subject to inherent limitations as they reflect the exercise of judgments by management about which expenses and income are excluded or included in determining these non-GAAP financial measures.\n\nAbout Air Products Air Products (NYSE:APD) is a world-leading industrial gases company in operation for over 80 years focused on serving energy, environmental, and emerging markets. The Company has two growth pillars driven by sustainability. Air Products' base business provides essential industrial gases, related equipment and applications expertise to customers in dozens of industries, including refining, chemicals, metals, electronics, manufacturing, and food. The Company also develops, engineers, builds, owns and operates some of the world's largest clean hydrogen projects supporting the transition to low- and zero-carbon energy in the heavy-duty transportation and industrial sectors. Additionally, Air Products is the world leader in the supply of liquefied natural gas process technology and equipment, and provides turbomachinery, membrane systems and cryogenic containers globally.\n\nThe Company had fiscal 2023 sales of $12.6 billion from operations in approximately 50 countries and has a current market capitalization of over $50 billion. Approximately 23,000 passionate, talented and committed employees from diverse backgrounds are driven by Air Products' higher purpose to create innovative solutions that benefit the environment, enhance sustainability and reimagine what's possible to address the challenges facing customers, communities, and the world. For more information, visit www.airproducts.com or follow us on LinkedIn, X, Facebook or Instagram.\n\nCautionary Note Regarding Forward-Looking Statements This release contains \"forward-looking statements\" within the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, including statements about the transaction that is the subject of this release and its expected impact and timing, and about the company's business outlook and investment opportunities. These forward-looking statements are based on management's expectations and assumptions as of the date of this release and are not guarantees of future performance. While forward-looking statements are made in good faith and based on assumptions, expectations and projections that management believes are reasonable based on currently available information, actual performance and financial results may differ materially from projections and estimates expressed in the forward-looking statements because of many factors, including the risk factors described in our Annual Report on Form 10-K for the fiscal year ended September 30, 2023 and other factors disclosed in our filings with the Securities and Exchange Commission. Except as required by law, we disclaim any obligation or undertaking to update or revise any forward-looking statements contained herein to reflect any change in the assumptions, beliefs or expectations or any change in events, conditions or circumstances upon which any such forward-looking statements are based.\n\nContacts: \r\nHoneywell Media Stacey Jones (980) 378-6258\r\nStacey.Jones@Honeywell.com\r\nInvestors Sean Meakim (704) 627-6200\r\nSean.Meakim@Honeywell.com\n\nContacts: Air Products Media Katie McDonald (610) 481-3673 mcdonace@airproducts.com\r\nInvestors Sidd Manjeshwar (610) 481-1872 manjessj@airproducts.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-to-acquire-air-products-liquefied-natural-gas-process-technology-and-equipment-business-to-expand-energy-transition-solutions-and-services-302192744.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-acquire-air-products-liquefied-110000953.html",
        "symbols": [
            "0HBH.LSE",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "AP3.BE",
            "AP3.DU",
            "AP3.F",
            "AP3.MU",
            "AP3.STU",
            "APD.US",
            "HON.MX",
            "HON.NEO",
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.023,
            "neu": 0.832,
            "pos": 0.145
        }
    },
    {
        "date": "2024-07-10T10:44:23+00:00",
        "title": "Honeywell to buy Air Products' LNG business for $1.81 billion",
        "content": "(Reuters) - Industrial giant Honeywell will buy the liquefied natural-gas process technology and equipment business from Air Products for $1.8 billion, the Wall Street Journal reported on Wednesday, citing people familiar with the matter.\n\n(Reporting by Aishwarya Jain in Bengaluru; Editing by Shilpi Majumdar)\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-buy-lng-tech-equipment-104423566.html",
        "symbols": [
            "0HBH.LSE",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "AP3.BE",
            "AP3.DU",
            "AP3.F",
            "AP3.MU",
            "AP3.STU",
            "APD.US",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.026,
            "neg": 0,
            "neu": 0.976,
            "pos": 0.024
        }
    },
    {
        "date": "2024-07-10T08:04:12+00:00",
        "title": "Microsoft, Tesla and Goodyear rise premarket; 3M and Honeywell fall",
        "content": "Investing.com -- U.S. stock futures largely edged higher Wednesday, ahead of the second round of comments from Fed chief Jerome Powell to Congress.\n\nHere are some of the biggest premarket U.S. stock movers today:\n\nMicrosoft (NASDAQ:MSFT) stock rose 0.4% following a report that the software giant was ready to give up an observation seat on the board of OpenAI amid regulatory scrutiny into generative artificial intelligence in both the U.S. and Europe.\n\nTesla (NASDAQ:TSLA) stock rose 0.5% after Goldman Sachs raised its estimates and price target for the EV manufacturer following stronger-than-expected Q2 deliveries.\n\n3M Company (NYSE:MMM) stock fell 0.7% after the manufacturing company announced that CFO Monish Patolawala would leave the firm at the end of the month to pursue another opportunity.\n\nHoneywell (NASDAQ:HON) stock fell 0.7% after the Wall Street Journal reported that the industrial giant is set to buy the liquefied natural-gas process technology and equipment business from Air Products (NYSE:APD), up 2.1%, for $1.8 billion.\n\nGoodyear (NASDAQ:GT) stock rose 1.9% after a report that Japan's Yokohama Rubber was in talks to buy its off-road tire business for at least $1 billion.\n\nTaiwan Semiconductor Manufacturing (NYSE:TSM) stock rose 2.4% after the world's largest chipmaker reported 32% year-on-year growth in second-quarter revenue.\n\nLegalZoom (NASDAQ:LZ) stock slumped 27% after the online legal firm cut its full-year revenue guidance, while also announcing that CEO Dan Wernikoff had resigned from his post, effective immediately.\n\nSmart Global (NASDAQ:SGH) stock rose 7.6% after the global leader in specialty memory solutions reported a third-quarter profit as lower operating expenses helped offset a double-digit drop in revenue.\n\nRelated Articles\n\nMicrosoft, Tesla and Goodyear rise premarket; 3M and Honeywell fall\n\nThis is when Super Micro Computer could preannounce results: Wells Fargo\n\nWarner Bros. Discovery's CNN to launch first subscription product\n\nView comments",
        "link": "https://finance.yahoo.com/news/microsoft-tesla-goodyear-rise-premarket-080412953.html",
        "symbols": [
            "1TSLA.MI",
            "APD.US",
            "GT.MX",
            "GT.US",
            "GTR.DU",
            "GTR.F",
            "GTR.STU",
            "HON.US",
            "LZ.US",
            "MMM.BE",
            "MMM.F",
            "MMM.HA",
            "MMM.HM",
            "MMM.MU",
            "MMM.MX",
            "MMM.STU",
            "MMM.US",
            "MMM.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.96,
            "neg": 0.031,
            "neu": 0.878,
            "pos": 0.092
        }
    }
]