[
    {
        "date": "2024-05-30T15:31:10+00:00",
        "title": "3M (MMM) Down 0.9% Since Last Earnings Report: Can It Rebound?",
        "content": "A month has gone by since the last earnings report for 3M (MMM). Shares have lost about 0.9% in that time frame, underperforming the S&P 500.\n\nWill the recent negative trend continue leading up to its next earnings release, or is 3M due for a breakout? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at its most recent earnings report in order to get a better handle on the important drivers.\n\n3M Q1 Earnings & Revenues Surpass Estimates, Up Y/Y\n\n3M reported first-quarter 2024 results, wherein revenues and earnings surpassed the Zacks Consensus Estimate. Both the top and bottom lines (on adjusted basis) increased on a year-over-year basis.\n\nInside the Headlines\n\n3M delivered adjusted earnings of $2.39 per share, surpassing the Zacks Consensus Estimate of $2.08. The metric increased from $1.97 reported in the year-ago quarter.\r\n\r\nThe company’s adjusted net sales of $7.72 billion outperformed the Zacks Consensus Estimate of $7.64 billion. The metric increased 0.5% year over year, driven by organic sales growth of 0.8%. Foreign currency translation had a negative impact of 0.6%, while acquisitions boosted the top line by 0.3%. On a GAAP basis, MMM’s net sales inched down 0.3% year over year to $8.0 billion.\r\n\r\nRegion-wise, organic sales in the Americas declined 0.9% year over year, while that in the Asia Pacific inched up 2.6%. Organic sales from businesses in Europe, the Middle East and Africa increased 3.3%.\n\nSegmental Results\n\nIn April 2024, 3M completed the spin off of its Health Care business into a separate public company. Notably, the company’s first-quarter results include the performance of Health Care unit, as the spin-off was completed after first-quarter-end.\r\n\r\nRevenues from Safety and Industrial totaled $2.73 billion, decreasing 1.7% year over year. This was caused by a 1.4% decrease in organic revenues and negative impact of 0.3% from foreign currency translation.\r\n\r\nRevenues from Transportation & Electronics totaled $1.82 billion, reflecting a year-over-year increase of 6.9%. The increase is attributable to a 6.7% improvement in organic sales. Acquisitions boosted segmental revenues by 1.7%, while foreign currency translation had a 1.5% negative impact.\r\n\r\nRevenues from Health Care were $2.02 billion, up 0.3% year over year. This were driven by organic sales increase of 1%. Divestitures and foreign currency translation had negative impacts of 0.3% and 0.4%, respectively.\r\n\r\nRevenues from the Consumer segment fell 4.3% year over year to $1.14 billion. Organic sales decreased 3.9%. Movements in foreign currencies had an adverse impact of 0.4%.\n\nStory continues\n\nMargin Profile\n\nIn the quarter under review, 3M’s cost of sales decreased 6.2% year over year to $4.33 billion. Selling, general and administrative expenses increased 1.8% to $1.74 billion. Research, development and related expenses decreased 7.4% year over year to $437 million.\r\n\r\nIn the first quarter, 3M reported operating income of $1.50 billion compared with $1.24 billion in the year-ago period. The upside was driven by a decline in the company’s total operational expenses.\r\n\r\nMMM’s adjusted operating income in the quarter ascended 23.7% year over year to $1.71 billion. The adjusted operating margin was 21.9% compared with 17.9% in the year-ago quarter. The adjusted tax rate in the quarter was 20.5% compared with 17.7% in the year-ago period.\n\nBalance Sheet and Cash Flow\n\nExiting the first quarter, 3M had cash and cash equivalents of $10.9 billion compared with $5.9 billion at the end of December 2023. Long-term debt was $20.6 billion at the end of the reported quarter compared with $13.1 billion at the end of December 2023.\r\n\r\nIn the quarter, 3M generated net cash of $767 million from its operating activities, reflecting a decrease of 39.8% from the year-ago quarter. Capital used for purchasing property, plant and equipment decreased 21.1% to $375 million in the quarter.\r\n\r\nAdjusted free cash flow at the end of the first quarter was $833 million, down 11.9% year over year. Adjusted free cash flow conversion was 63% at the end of the same period.\r\n\r\nIn the first three months of 2024, 3M rewarded its shareholders with $835 million in dividend payments.\n\n2024 Guidance\n\nMMM expects adjusted earnings in the range of $6.80-$7.30 per share. The mid-point of the guided range is $7.05, which reflects a decline from $9.24 reported in 2023.\r\n\r\nAdjusted total sales are expected to decline 0.25% to increase 1.75%. This implies an adjusted organic sales growth of 0-2%.\r\n3M expects its dividend payout ratio to be approximately 40% of adjusted free cash flow.\n\nHow Have Estimates Been Moving Since Then?\n\nIt turns out, estimates revision have trended downward during the past month.\n\nThe consensus estimate has shifted -25.94% due to these changes.\n\nVGM Scores\n\nAt this time, 3M has a strong Growth Score of A, though it is lagging a lot on the Momentum Score front with a D. Following the exact same course, the stock was allocated a grade of D on the value side, putting it in the bottom 40% for this investment strategy.\n\nOverall, the stock has an aggregate VGM Score of B. If you aren't focused on one strategy, this score is the one you should be interested in.\n\nOutlook\n\nEstimates have been broadly trending downward for the stock, and the magnitude of these revisions indicates a downward shift. It's no surprise 3M has a Zacks Rank #5 (Strong Sell). We expect a below average return from the stock in the next few months.\n\nPerformance of an Industry Player\n\n3M belongs to the Zacks Diversified Operations industry. Another stock from the same industry, Honeywell International Inc. (HON), has gained 0.9% over the past month. More than a month has passed since the company reported results for the quarter ended March 2024.\n\nHoneywell International reported revenues of $9.11 billion in the last reported quarter, representing a year-over-year change of +2.7%. EPS of $2.25 for the same period compares with $2.07 a year ago.\n\nHoneywell International is expected to post earnings of $2.32 per share for the current quarter, representing a year-over-year change of +4%. Over the last 30 days, the Zacks Consensus Estimate has changed +0.2%.\n\nThe overall direction and magnitude of estimate revisions translate into a Zacks Rank #3 (Hold) for Honeywell International. Also, the stock has a VGM Score of F.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/3m-mmm-down-0-9-153110872.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "MMM.BE",
            "MMM.F",
            "MMM.HA",
            "MMM.HM",
            "MMM.MU",
            "MMM.MX",
            "MMM.STU",
            "MMM.SW"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.028,
            "neu": 0.879,
            "pos": 0.093
        }
    }
]