[
    {
        "date": "2024-05-06T19:00:00+00:00",
        "title": "The 3 Most Undervalued Quantum Computing Stocks to Buy in May 2024",
        "content": "Quantum computing is a space that leverages advanced computing techniques and quantum mechanics to solve problems that trouble conventional computers. This includes a variety of optimization applications, such financial modeling, weather and climate forecasting and traffic optimization. However, quantum computing still remains highly theoretically, and it will surely be some time before their use-cases expand beyond research and laboratories.\n\nThere are a number of quantum computing start-ups, such as IonQ (NYSE:IONQ), that have developed game changing technologies in the field. Unfortunately, given the amount of uncertainty in the macroeconomic environment — elevated interest rates globally and persistent inflation pressures — investing in these pure-play quantum computing businesses is looking less and less like a viable option.\n\nBelow are three undervalued quantum computing stocks with a strong presence in the quantum computing space.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nInternational Business Machines (IBM) The IBM 5160 is a version of the IBM PC with a built-in hard drive. Released on March 8, 1983. The 5100 series are knowns as one of the first home computers.\n\nSource: Twin Design / Shutterstock.com\n\nInternational Business Machines (NYSE:IBM) has been researching quantum computing and employing the technology in cryptology since the early parts of the 21st century. In 2023, IBM continued to deliver fascinating finding. The company’s quantum computer was able to solve a complex physics question better than a conventional computer could. IBM’s Condor quantum processor reached new boundaries with 1,121 superconducting qubits, an industry achievement.\n\nIBM’s share price is now trading at 16.8x forward earnings, which is less than a number of tech giants in the space. In the past years, top-line growth has remained in the modest single digits. Investments in the quantum computing revolution could allow IBM to reap financial rewards in the future. This would, in turn, help boost revenue growth.\n\nFor investors desiring to bet on quantum computing, IBM still makes a solid choice among undervalued quantum computing stocks.\n\nAlphabet (GOOG, GOOGL) Alphabet Inc. (GOOG, GOOGL) and Google logos seen displayed on smartphones. The Google stock split is happening today.\n\nSource: IgorGolovniov / Shutterstock.com\n\nAlphabet (NASDAQ:GOOG, NASDAQ:GOOGL) is another American tech giant with sizable exposure to the quantum computing space. The tech firm has been able to cross new boundaries with its Sycamore quantum computer. These days, Alphabet is more concerned with finding viable applications for quantum computing. In early March, Alphabet announced a $5 million reward to scientists who could research and develop practical applications for quantum computing.\n\nThe key reason Alphabet could be a great long-term quantum computing investment is the company’s Google Cloud product. Google Cloud is Alphabet’s main growth engine. Moreover, the tech giant has begun deploying quantum computing pow1er through its Google Cloud service. Offering quantum computing power through cloud services will not only make quantum computing more accessible but also foment the creation of practical applications for the novel technology.\n\nStory continues\n\nAlphabet’s shares are trading at 21.6x forward earnings, which is also below tech giants like Microsoft (NASDAQ:MSFT), Amazon (NASDAQ:MSFT) and Apple (NASDAQ:AAPL).\n\nHoneywell (HON) Honeywell (HON) logo on front of glass building\n\nSource: josefkubes / Shutterstock.com\n\nHoneywell (NASDAQ:HON) is an industrial conglomerate with an advanced technological bent. The company has pursued the development of quantum computing technologies for some years now. In fact, Honeywell’s entry into the quantum computing space can be traced back to the formation of Quantinuum , which was the result of a business combination between Honeywell Quantum Solutions and Cambridge Quantum in 2021. Furthermore, Honeywell has invested $300 million into Quantinuum and owns a majority stake in the company. Quantinuum has been valued at $5 billion as of early 2024.\n\nBefore this business combination, Honeywell’s Quantum Solutions division had been breaking numerous barriers in the space. Successive breakthroughs are indeed possible. Honeywell’s stock trades at 19.4x forward earnings. For a quantum computing investment, Honeywell and its growth prospects in the space, makes it an enticing opportunity.\n\nOn the date of publication, Tyrik Torres did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nTyrik Torres has been studying and participating in financial markets since he was in college, and he has particular passion for helping people understand complex systems. His areas of expertise are semiconductor and enterprise software equities. He has work experience in both investing (public and private markets) and investment banking.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post The 3 Most Undervalued Quantum Computing Stocks to Buy in May 2024 appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-most-undervalued-quantum-computing-190000541.html",
        "symbols": [
            "AAPL.US",
            "HON.US",
            "IBM.BA",
            "IBM.BE",
            "IBM.DU",
            "IBM.F",
            "IBM.HA",
            "IBM.HM",
            "IBM.LSE",
            "IBM.MU",
            "IBM.MX",
            "IBM.NEO",
            "IBM.STU",
            "IBM.US",
            "IBM.XETRA",
            "IBM0.F",
            "IBMB34.SA",
            "IONQ.US",
            "MSFT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.012,
            "neu": 0.877,
            "pos": 0.111
        }
    },
    {
        "date": "2024-05-06T00:00:00+00:00",
        "title": "The 3 Most Undervalued Quantum Computing Stocks to Buy in May 2024",
        "content": "To find undervalued quantum computing stocks, investors need to look away from the pure-play businesses and to larger, stable companies.",
        "link": "https://investorplace.com/2024/05/the-3-most-undervalued-quantum-computing-stocks-to-buy-in-may-2024/",
        "symbols": [
            "GOOG.US",
            "GOOGL.US",
            "HON.US",
            "IBM.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.296,
            "neg": 0,
            "neu": 0.896,
            "pos": 0.104
        }
    }
]