[
    {
        "date": "2024-07-19T14:43:48+00:00",
        "title": "Stocks to watch next week: Tesla, Microsoft, Alphabet and Amazon",
        "content": "As the second-quarter earnings season approaches, key companies worldwide will provide insights into sector performance. Investors will be particularly focused on updates from some of the 'Magnificent Seven', which will reveal whether the artificial intelligence (AI) trend continues.\n\nThe Mag 7 stocks have endured a challenging period, with the S&P 500’s (^GSPC) major players—Nvidia (NVDA), Microsoft (MSFT), Google (GOOGL), Tesla (TSLA), Apple (AAPL), Meta Platforms (META), and AmazonAJa (AMZN)—experiencing a dramatic decline in market capitalisation. Over recent sessions, these tech giants have collectively shed $1.128tn in market value, marking the largest such loss since May 2022.\n\nWill the upcoming earnings reports show strong performance or a lack of momentum? Here’s what to watch for:\n\nTesla (TSLA) — Reports second-quarter results on Tuesday 23 July\n\nTesla shares have experienced a dramatic surge this month, with the company's stock price surging by 33%. This increase has propelled Tesla's market valuation by $209bn in the first eight trading days of the month alone, surpassing the combined market value of European automotive giants Mercedes-Benz, Volkswagen, and Stellantis, which stands at $198bn.\n\nThis surge cannot be attributed to Tesla’s first-quarter financial results, which revealed the lowest quarterly profits since Q2 2021, diminishing cash flow, and rising inventory levels. The second-quarter production and delivery figures, released earlier this month, indicated a 14% year-on-year decline in vehicle production and a 5% drop in unit sales, although this may have contributed to reducing some of the inventory backlog.\n\nADVERTISEMENT\n\n“Quite what inspired this romp is hard to divine, barring ongoing investor enthusiasm for companies that are perceived as AI (and autonomous driving) plays, Elon Musk’s courtroom victories at Tesla and X and ongoing hopes surrounding the Cybertruck, the supercharger network and the ride-hailing app,” Russ Mould, investment director, Danni Hewson, head of financial analysis, and Dan Coatsworth, investment analyst, all of AJ Bell, wrote.\n\nStory continues\n\nRead more: How to invest in AI as the rally continues\n\nFor the third quarter, the current consensus is sales of $25.7bn and that would signify a return to growth in the top line of some 10% year-on-year.\n\nAnalysts and investors are also paying close attention to Tesla’s revenue composition. In the first quarter of 2024, energy storage, energy generation, and other business lines contributed 19% to total revenues, up from 10% in the same period in 2022.\n\nEarnings per share (EPS) fell to $0.37 in Q1, but analysts expect a rebound to $0.62 in Q2, though this still marks a one-third decrease compared to the same period last year. The consensus EPS forecast for Q3 stands at $0.63.\n\nAJ Bell also highlighted Tesla's strong financial position, with a net cash reserve of $21.5bn. Although a few quarters of weak cash flow are not overly concerning, shareholders will be looking for improvements in this area as an indicator of higher profitability and a more streamlined balance sheet through inventory reduction.\n\nMicrosoft (MSFT) — Reports second-quarter results on Tuesday 23 July*\n\nMicrosoft Corp is set to report its fiscal fourth-quarter earnings on Tuesday, July 30, with analysts from Bank of America (BofA) forecasting potential revenue upside for the period.\n\nWall Street's consensus projects Microsoft to announce revenue of $64.2bn and earnings per share (EPS) of $2.90 for Q4. However, BofA analysts anticipate a 1% increase from their estimate of $64bn, indicating a 14% year-over-year growth, primarily driven by the robust performance of Azure, a premium mix in Office E3/E5, Copilot’s initial success, and a stabilising PC/Windows market.\n\nAzure’s growth is expected to remain balanced across sustained AI and core workloads, translating into a projected growth rate of 31.5%, slightly above the base expectation of 30.5%. The early traction of Copilot is also anticipated to bolster Office growth, maintaining its current valuation multiple.\n\nIn the more personal computing (MPC) segment, analysts foresee a $50m increase over the $15.5bn estimate, attributed to stronger-than-expected PC shipments.\n\nLooking ahead to fiscal 2025, BofA analysts predict continued double-digit revenue growth fuelled by ongoing strength in Azure and Office. However, they anticipate a 100 basis point decrease in margins due to increased capital expenditures driving higher cost of sales.\n\n“In an upside scenario, we believe the Office business could achieve 20% growth by Q1 fiscal 2026,” the analysts noted.\n\nBofA has reiterated its ‘buy’ rating for Microsoft and raised the price target to $510 from $480, citing the potential for higher Office growth in fiscal 2025. They acknowledge that the current share price reflects a considerable amount of near-term upside.\n\n\"Microsoft is set to deliver fourth quarter results at some point next week. Investors will be hoping to see another strong showing from the cloud business, Azure. Analysts are looking for top line growth of 19.5% from Azure, which looks very achievable. Back in April, management said cloud-AI demand was outstripping supply. Despite a mammoth effort to build out compute, that supply/demand imbalance is likely to help underpin Azure growth for some time yet,\" Matt Britzman, senior equity analyst at Hargreaves Lansdown, said.\n\n*Date not confirmed\n\nAlphabet (GOOG) — Reports second-quarter results on Tuesday 23 July\n\nThe parent company of Google (GOOGL), is set to announce its second-quarter earnings, with analysts predicting robust performance driven by its Android platform and continued momentum in its search and cloud businesses. The company's expanding generative AI capabilities are also anticipated to have significantly contributed to its positive results.\n\nFor Q2, the Zacks Consensus Estimate places Alphabet's revenues at $70.55bn, reflecting a 13.7% increase compared to the same quarter last year. The consensus estimate for earnings stands at $1.85 per share, marking a 28.5% rise from the previous year's reported figures. This estimate has seen a slight upward revision of 0.5% over the past week.\n\nHowever, rising litigation issues and associated expenses remain areas of concern for the tech giant.\n\nOne key risk is the US Department of Justice's so-called adtech trial, in which the government charges that Google monopolises key digital advertising technologies, collectively referred to as the adtech stack. Website publishers depend on that stack to sell ads and advertisers rely on it to buy ads.\n\n\"As Alphabet’s second quarter earnings approach, the M&A rumour mill is swirling. If reports are true and Alphabet is in talks to buy cybersecurity firm Wizz for $23bn, it would mark a major move to beef up its security offering. Wizz has successfully taken on the likes of Microsoft and Palo Alto in the cyber space, taking market share over the past couple of years. Perhaps the biggest hurdle could be a regulator that’s been a blocker for many large-scale deals – though a new team in the White House later this year could help things in that regard,\" Britzman said.\n\nRead more: How to invest in the Indian stock market\n\nBank of America Securities analyst Justin Post remains bullish on the integration of Google’s AI chatbot.\n\n“We remain positive on growing Gemini integration across [the] Google ecosystem and think [the] broader rollout of AI overviews will likely help drive higher usage, while AI integration can increase monetisation across Google,” Post said. “Moreover, with a focus on expense management, we think year-over-year margin growth in 2024 will be a bright spot and potential EPS upside driver.”\n\nPost affirmed a buy rating and $200 price target for Alphabet.\n\nBMO Capital Markets raised its their price target from $215 to $222, driven by potential gains in YouTube revenue.\n\nAmazon (AMZN) — Reports second-quarter results on Thursday 25 July*\n\nAmazon is in the spotlight with a \"positive\" near-term view, as Morgan Stanley anticipates the e-commerce giant to significantly outperform in its Q2 earnings and provide optimistic guidance for Q3.\n\nMorgan Stanley analysts project that Amazon will exceed consensus estimates for earnings before interest and taxes (EBIT) by 17% for Q2 and 10% for Q3. This optimistic forecast is driven by enhanced profitability in North America tetail and accelerating growth in Amazon Web Services (AWS).\n\n\"North America retail profitability and the accelerating growth of AWS are key factors behind our projections,\" the analysts noted.\n\nAs Amazon continues to leverage its robust retail operations and expand its cloud computing dominance, investors are looking forward to a strong financial performance in the upcoming quarters.\n\nIt is also a top pick for JPMorgan analyst Doug Anmuth both in the near and long term.\n\nHe anticipates a near-term acceleration in AWS, forecasting a 20% growth in Q4 2024. This growth is expected to be driven by easing optimisations, new workload migrations, and the ramping up of GenAI monetisation.\n\nRead more: UK to lose half a million millionaires by 2028\n\nAnmuth also projects a 190 basis point expansion in Amazon's North America operating income (OI) margin in 2024, supported by enhancements in shipping and inventory placement, increased automation, and stronger advertising revenue. Amazon's free cash flow is expected to reach $66bn in 2024 and $86bn in 2025.\n\nFor Q2, investors are looking for net sales to fall between $148bn and $150bn, with operating income ranging from $14bn to $15bn or more.\n\n\"There was also a strong showing from both the e-commerce and advertising segments over the first quarter, something investors will be keen to see continue. But markets were a little unhappy with the second quarter profit guidance of $10-14bn, anything toward the top end of that range will likely be met with a positive reaction,\" Britzman said.\n\n* Date not confirmed as the company might decide to announce results on 1 August.\n\nOther companies reporting next week include:\n\nMonday 22 July\n\nMONY (MONY.L)\n\nAscential (ASCL.L)\n\nSAP (SAP)\n\nRyanair (RYA.IR)\n\nVerizon Communications (VZ)\n\nNXP Semiconductor (NXPI)\n\nTuesday 23 July\n\nSThree (STEM.L)\n\nCompass (CPG.L)\n\nMitie (MTO.L)\n\nSK Hynix (HY9H.MU)\n\nLVMH (MC.PA)\n\nASM International (ASM.AS)\n\nThales (HO.PA)\n\nLindt (LISN.SW)\n\nAlfa Laval (ALFA.L)\n\nLogitech (LOGNE.SW)\n\nNorsk Hydro (NHY.OL)\n\nAkzo Nobel (AKZOY)\n\nRandstad (RSH.DU)\n\nVisa (V)\n\nCoca-Cola (KO)\n\nSpotify (SPOT)\n\nTexas Instruments (TXN)\n\nGE Aerospace (GE)\n\nDanaher (DHR)\n\nComcast (CMCSA)\n\nLockheed Martin (LMT)\n\nMondelez (MDLZ)\n\n3M (MMM)\n\nGeneral Motors (GM)\n\nMattel (MAT)\n\nWednesday 24 July\n\nReckitt Benckiser (RKT.L)\n\nUNITE (UTG.L)\n\nRHI Magnesita (RHIM.L)\n\nBreedon (BREE.L)\n\nAston Martin Lagonda (AML.L)\n\nPrimary Health Properties (PHP.L)\n\nFresnillo (FRES.L)\n\nEasyJet (EZJ.L)\n\nOxford Nanopore (ONT.L)\n\nIberdrola (IBE.MC)\n\nBNP Paribas (BNP.PA)\n\nEquinor (EQNR)\n\nBanco Santander (BNC.L)\n\nUniCredit (UCG.MI)\n\nKering (KER.PA)\n\nDeutsche Boerse (DB1.DE)\n\nOrange (ORA.PA)\n\nMichelin (ML.PA)\n\nRepsol (REP.MC)\n\nMoncler (MOV.F)\n\nJerónimo Martins (JMT.LS)\n\nCarrefour (CA.PA)\n\nSSAB (SSAB-A.ST)\n\nKindred (UNBA.MU)\n\nQualcomm (QCOM)\n\nIBM (IBM)\n\nLAM Research (LRCX)\n\nAT&T (T)\n\nUPS (UPS)\n\nKLA-Tencor (KLAC)\n\nFord (F)\n\nNewmont (NEM)\n\nUnited Rentals (URI)\n\nInternational Paper (IP)\n\nThursday 25 July\n\nRELX (REL.L)\n\nLloyds (LLOY.L)\n\nAnglo American (AAL.L)\n\nRentokil Initial (RTO.L)\n\nInforma (INF.L)\n\nCentrica (CNA.L)\n\nCentamin (CEY.L)\n\nHowden Joinery (HWDN.L)\n\nAirtel Africa (AAF.L)\n\nITV (ITV.L)\n\nHammerson (HMSO.L)\n\nVodafone (VOD.L)\n\nBT (BT-A.L)\n\nBritvic (BVIC.L)\n\nWorkspace (WKP.L)\n\nCVS Group (CVSG.L)\n\nNestlé (NESNE.SW)\n\nHermès (RMS.PA)\n\nRoche (ROG.SW)\n\nChristian Dior (CDI.PA)\n\nSanofi (SAN.PA)\n\nEssilorLuxxotica (EL.PA)\n\nStellantis (STLA)\n\nENI (ENI.F)\n\nSt. Gobain (GOB.MU)\n\nRenault (RNO.PA)\n\nMastercard (MA)\n\nAbbVie (ABBV)\n\nLinde (LIN)\n\nHoneywell (HON)\n\nIntel (INTC)\n\nStarbucks (SBUX)\n\nNorthrop Grumman (NOC)\n\nKeurig-Dr Pepper (KDP)\n\nBaker Hughes (BKR)\n\nSouthwest Airlines (LUV)\n\nBaxter (BAX)\n\nSkyworks (SWKS)\n\nLiberty Global (LBTYK)\n\nHarley-Davidson (HOG)\n\nFriday 26 July\n\nSEGRO (SGRO.L)\n\nIMI (IMI.L)\n\nRightmove (RMV.L)\n\nDrax (DRX.L)\n\nNEC (6701.T)\n\nKomatsu (6301.T)\n\nAir Liquide (AI.PA)\n\nMercedes Benz (MBG.HA)\n\nHolcim (HOLN.SW)\n\nBASF (BASA.BE)\n\nCapGemini (CGM.HM)\n\nAlstom (ALO.PA)\n\nVallourec (VK.PA)\n\nKone Cranes (KNCRY)\n\nExxon Mobil (XOM)\n\nBristol Meyers Squibb (BMY)\n\nConocoPhillips (COP)\n\nAON (AON)\n\nYou can read Yahoo Finance's full calendar here.\n\nDownload the Yahoo Finance app, available for Apple and Android.",
        "link": "https://uk.finance.yahoo.com/news/tesla-microsoft-alphabet-amazon-stocks-watch-144348903.html",
        "symbols": [
            "000660.KO",
            "0A00.LSE",
            "0BFA.LSE",
            "0EXG.LSE",
            "0H3T.LSE",
            "0HAU.LSE",
            "0HAZ.LSE",
            "0HB5.LSE",
            "0HV2.LSE",
            "0IW5.LSE",
            "0JCB.LSE",
            "0JPO.LSE",
            "0JT5.LSE",
            "0JZH.LSE",
            "0K92.LSE",
            "0L77.LSE",
            "0L8F.LSE",
            "0LJ9.LSE",
            "0LQQ.LSE",
            "0M2B.IL"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.015,
            "neu": 0.847,
            "pos": 0.139
        }
    },
    {
        "date": "2024-07-19T14:00:19+00:00",
        "title": "3M (MMM) Expected to Beat Earnings Estimates: What to Know Ahead of Q2 Release",
        "content": "3M (MMM) is expected to deliver a year-over-year decline in earnings on lower revenues when it reports results for the quarter ended June 2024. This widely-known consensus outlook gives a good sense of the company's earnings picture, but how the actual results compare to these estimates is a powerful factor that could impact its near-term stock price.\n\nThe stock might move higher if these key numbers top expectations in the upcoming earnings report, which is expected to be released on July 26. On the other hand, if they miss, the stock may move lower.\n\nWhile the sustainability of the immediate price change and future earnings expectations will mostly depend on management's discussion of business conditions on the earnings call, it's worth handicapping the probability of a positive EPS surprise.\n\nZacks Consensus Estimate\n\nThis maker of Post-it notes, industrial coatings and ceramics is expected to post quarterly earnings of $1.66 per share in its upcoming report, which represents a year-over-year change of -23.5%.\n\nRevenues are expected to be $5.89 billion, down 29.3% from the year-ago quarter.\n\nEstimate Revisions Trend\n\nThe consensus EPS estimate for the quarter has been revised 2.33% higher over the last 30 days to the current level. This is essentially a reflection of how the covering analysts have collectively reassessed their initial estimates over this period.\n\nInvestors should keep in mind that an aggregate change may not always reflect the direction of estimate revisions by each of the covering analysts.\n\nEarnings Whisper\n\nEstimate revisions ahead of a company's earnings release offer clues to the business conditions for the period whose results are coming out. Our proprietary surprise prediction model -- the Zacks Earnings ESP (Expected Surprise Prediction) -- has this insight at its core.\n\nThe Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a more recent version of the Zacks Consensus EPS estimate. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.\n\nThus, a positive or negative Earnings ESP reading theoretically indicates the likely deviation of the actual earnings from the consensus estimate. However, the model's predictive power is significant for positive ESP readings only.\n\nA positive Earnings ESP is a strong predictor of an earnings beat, particularly when combined with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold). Our research shows that stocks with this combination produce a positive surprise nearly 70% of the time, and a solid Zacks Rank actually increases the predictive power of Earnings ESP.\n\nStory continues\n\nPlease note that a negative Earnings ESP reading is not indicative of an earnings miss. Our research shows that it is difficult to predict an earnings beat with any degree of confidence for stocks with negative Earnings ESP readings and/or Zacks Rank of 4 (Sell) or 5 (Strong Sell).\n\nHow Have the Numbers Shaped Up for 3M?\n\nFor 3M, the Most Accurate Estimate is higher than the Zacks Consensus Estimate, suggesting that analysts have recently become bullish on the company's earnings prospects. This has resulted in an Earnings ESP of +2.85%.\n\nOn the other hand, the stock currently carries a Zacks Rank of #3.\n\nSo, this combination indicates that 3M will most likely beat the consensus EPS estimate.\n\nDoes Earnings Surprise History Hold Any Clue?\n\nAnalysts often consider to what extent a company has been able to match consensus estimates in the past while calculating their estimates for its future earnings. So, it's worth taking a look at the surprise history for gauging its influence on the upcoming number.\n\nFor the last reported quarter, it was expected that 3M would post earnings of $2.08 per share when it actually produced earnings of $2.39, delivering a surprise of +14.90%.\n\nOver the last four quarters, the company has beaten consensus EPS estimates four times.\n\nBottom Line\n\nAn earnings beat or miss may not be the sole basis for a stock moving higher or lower. Many stocks end up losing ground despite an earnings beat due to other factors that disappoint investors. Similarly, unforeseen catalysts help a number of stocks gain despite an earnings miss.\n\nThat said, betting on stocks that are expected to beat earnings expectations does increase the odds of success. This is why it's worth checking a company's Earnings ESP and Zacks Rank ahead of its quarterly release. Make sure to utilize our Earnings ESP Filter to uncover the best stocks to buy or sell before they've reported.\n\n3M appears a compelling earnings-beat candidate. However, investors should pay attention to other factors too for betting on this stock or staying away from it ahead of its earnings release.\n\nExpected Results of an Industry Player\n\nAnother stock from the Zacks Diversified Operations industry, Honeywell International Inc. (HON), is soon expected to post earnings of $2.40 per share for the quarter ended June 2024. This estimate indicates a year-over-year change of +7.6%. Revenues for the quarter are expected to be $9.4 billion, up 2.8% from the year-ago quarter.\n\nThe consensus EPS estimate for Honeywell International has been revised 0.1% higher over the last 30 days to the current level. However, a lower Most Accurate Estimate has resulted in an Earnings ESP of -0.38%.\n\nThis Earnings ESP, combined with its Zacks Rank #2 (Buy), makes it difficult to conclusively predict that Honeywell International will beat the consensus EPS estimate. Over the last four quarters, the company surpassed consensus EPS estimates three times.\n\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research",
        "link": "https://finance.yahoo.com/news/3m-mmm-expected-beat-earnings-140019860.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "MMM.BE",
            "MMM.F",
            "MMM.HA",
            "MMM.HM",
            "MMM.MU",
            "MMM.MX",
            "MMM.STU",
            "MMM.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.045,
            "neu": 0.822,
            "pos": 0.132
        }
    }
]