[
    {
        "date": "2024-07-22T15:42:00+00:00",
        "title": "Honeywell (HON) Gears Up to Post Q2 Earnings: What to Expect",
        "content": "Honeywell International Inc. HON is scheduled to release second-quarter 2024 results on Jul 25, before market open. The Zacks Consensus Estimate for revenues is pegged at $9.4 billion, which indicates growth of 2.8% from the prior-year quarter’s reported figure.\r\n\r\nThe consensus mark for earnings is pinned at $2.40 per share, which has increased 3.5% in the past 60 days. The figure indicates a jump of 7.6% from the prior-year quarter figure. The company’s bottom line beat the consensus estimate in the last reported quarter. It has a trailing four-quarter earnings surprise of 1.7%, on average.\r\n\r\nLet’s see how things have shaped up for Honeywell this earnings season.\n\nKey Factors and Estimates for Q2\n\nStrength across Honeywell’s commercial aviation aftermarket business, driven by solid demand in the air transport and business aviation markets, is likely to have supplemented the top-line performance of its Aerospace Technologies segment in the second quarter. Also, strength in the company’s commercial aviation original equipment business, backed by an improvement in build rates, is likely to have boosted the segment’s performance. Solid momentum in the defense and space business, owing to stable U.S. and international defense spend volumes, is expected to have been a tailwind as well. We expect the segment’s revenues to increase 14.6% year over year to $3.8 billion.\r\n\r\nThe Energy and Sustainability Solutions segment is expected to witness a year-over-year increase in revenues, driven by higher orders for its products and solutions within the advanced materials and UOP businesses. Our estimate for the segment’s revenues is pegged at $1.6 billion, indicating a year-over-year increase of 0.6%.\r\n\r\nAcquisitions made by HON are likely to have impacted its top line positively. In August 2023, it acquired SCADAfence, which expanded its OT cybersecurity portfolio in Tel Aviv, Israel, while simultaneously fortifying its existing capabilities in cybersecurity, thereby offering customers enhanced security, reliability and efficiency. Also, in June 2023, the company completed the acquisition of Compressor Controls Corporation, which fortified HON’s expertise in industrial control, automation and process solutions while simultaneously bolstering its sustainability portfolio with new carbon capture control solutions.\r\n\r\nHoneywell’s commercial and operational excellence initiatives, along with its pricing actions, is likely to have helped it maintain a healthy margin performance. In addition, its three transformation initiatives —Connected Enterprise, Integrated Supply Chain and Honeywell Digital — are expected to have driven profitability.\r\n\r\nWe expect the company’s total revenues to be $9.4 million for the second quarter, indicating an increase of 2.6% year over year. Adjusted earnings are expected to be $2.35 per share, indicating a 5.2% increase from the year-ago quarter’s reported number.\r\n\r\nHowever, Honeywell’s Industrial Automation segment is expected to have put up a weak show due to the low-demand environment across its warehouse and workflow solutions, and productivity solutions and services businesses. We expect the segment’s revenues to be $2.5 billion, indicating a decline of 9% year over year.\r\n\r\nThe company has been witnessing escalating costs of sales, which are likely to weigh on its bottom-line results. We expect costs to be $5.8 billion for the second quarter, indicating an increase of 2.8% year over year.\r\n\r\nHON has considerable exposure to overseas markets. Given the company’s substantial international operations, foreign currency headwinds are likely to have marred its margins and profitability.\n\nStory continues\n\nHoneywell International Inc. Price and EPS Surprise\n\nHoneywell International Inc. price-eps-surprise | Honeywell International Inc. Quote\n\nEarnings Whispers\n\nOur proven model does not conclusively predict an earnings beat for HON this time around. The combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the odds of an earnings beat, which is not the case here, as elaborated below.\r\n\r\nEarnings ESP: Honeywell has an Earnings ESP of -0.38% as the Most Accurate Estimate is pegged at $2.39 per share, which is lower than the Zacks Consensus Estimate of $2.40. You can uncover the best stocks before they’re reported with our Earnings ESP Filter.\r\n\r\nZacks Rank: Honeywell presently carries a Zacks Rank of 2.\n\nStocks to Consider\n\nHere are some companies, which according to our model, have the right combination of elements to beat on earnings in this reporting cycle.\r\n\r\nITT Inc. ITT has an Earnings ESP of +3.43% and a Zacks Rank of 3, at present. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nThe company is slated to release second-quarter 2024 results on Aug 1. ITT’s earnings have surpassed the Zacks Consensus Estimate in each of the trailing four quarters, the average surprise being 6.5%.\r\n\r\nCrane Company CR has an Earnings ESP of +0.96% and a Zacks Rank of 2. The company is slated to release second-quarter results on Jul 29.\r\n\r\nCrane Company’s earnings have surpassed the Zacks Consensus Estimate in each of the trailing four quarters, the average surprise being 15.2%.\r\n\r\n3M Company MMM has an Earnings ESP of +2.85% and a Zacks Rank of 3, at present. The company is scheduled to release second-quarter results on Jul 26.\r\n\r\n3M’s earnings have surpassed the Zacks Consensus Estimate in each of the preceding four quarters, the average surprise being 16.4%.\r\n\r\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nITT Inc. (ITT) : Free Stock Analysis Report\n\nCrane Company (CR) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research",
        "link": "https://finance.yahoo.com/news/honeywell-hon-gears-post-q2-154200861.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "CR.US",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "MMM.BE",
            "MMM.F",
            "MMM.HA",
            "MMM.HM",
            "MMM.MU",
            "MMM.MX",
            "MMM.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.007,
            "neu": 0.862,
            "pos": 0.131
        }
    },
    {
        "date": "2024-07-22T07:00:00+00:00",
        "title": "HONEYWELL SELECTED BY UNITED AIRLINES TO PROVIDE WIDE ARRAY OF COCKPIT TECHNOLOGY FOR NEW 737 MAX AIRCRAFT",
        "content": "Suite of advanced avionics includes 3D weather radar, flight recorders and advanced safety systems\n\nFARNBOROUGH, England, July 22, 2024 /PRNewswire/ -- Honeywell (NASDAQ: HON) has been selected by United Airlines to provide a wide range of avionics for new 737 MAX aircraft that will enter service over the next decade, including technologies such as the industry's only 3D weather radar, new 25-hour flight data recorders and advanced traffic avoidance systems. Honeywell x United Avionics\n\nUnited Airlines first selected a similar suite of Honeywell avionics in 2018 to equip 161 737 MAX aircraft, and this latest agreement builds on Honeywell's reliability in delivering world-class aerospace technology.\n\n\"We are proud to continue our long-standing relationship with United Airlines to provide advanced avionics for its growing 737 MAX fleet,\" said Heath Patrick, President, Americas Aftermarket, Honeywell Aerospace Technologies. \"Our technology reduces pilot workload, improves situational awareness and supports dispatch reliability.\"\n\nUnited Airlines selected the following Honeywell cockpit technologies for its 737 MAX fleet:\n\nIntuVue RDR-4000 3D Weather Radar System is the first automatic commercial radar to accurately depict weather in the flight path of an airplane. IntuVue automatically scans the sky at 17 tilt angles — the most in the industry — and delivers a 3D view of the weather through an intuitive display that pilots can quickly and easily reference. Honeywell Connected Recorder – 25 is made for commercial air transport aircraft to accommodate mandatory flight data and cockpit voice recording. It may result in the potential for better maintenance predictability and operational insight through data analytics. Honeywell's TPA100B Traffic Alert and Collision Avoidance System and TRA 100B Transponders identify the aircraft to other surrounding aircraft via an airborne collision avoidance system. Integrated Multi-Mode Receiver is the industry's leader in radio navigation and combines satellite- and ground-based navigation systems into one receiver. It helps pinpoint precise airplane locations for efficient landings, especially during difficult and new runway approaches. The ALA-52B radar altimeter assists instrument landings at hundreds of U.S. airports and filters out 5G broadband interference.\n\nAbout Honeywell\n\nProducts and services from Honeywell Aerospace Technologies are found on virtually every commercial, defense and space aircraft. The Aerospace Technologies business unit builds aircraft engines, cockpit and cabin electronics, wireless connectivity systems, mechanical components and more. Its hardware and software solutions create more fuel-efficient aircraft, more direct and on-time flights and safer skies and airports. For more information, visit www.honeywell.com/us/en or follow us at @Honeywell_Aero.\n\nStory continues\n\nHoneywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Forge IoT platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world smarter, safer and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nContacts\n\nMedia Adam Kress\r\n602-760-6252\r\nadam.kress@honeywell.com Honeywell Logo. (PRNewsFoto/Honeywell) (PRNewsfoto/Honeywell) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-selected-by-united-airlines-to-provide-wide-array-of-cockpit-technology-for-new-737-max-aircraft-302201820.html\n\nSOURCE Honeywell Aerospace",
        "link": "https://finance.yahoo.com/news/honeywell-selected-united-airlines-wide-070000336.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.03,
            "neu": 0.815,
            "pos": 0.155
        }
    }
]