[
    {
        "date": "2024-07-11T22:15:19+00:00",
        "title": "Honeywell International Inc. (HON) Advances While Market Declines: Some Information for Investors",
        "content": "The most recent trading session ended with Honeywell International Inc. (HON) standing at $214.85, reflecting a +0.17% shift from the previouse trading day's closing. The stock's change was more than the S&P 500's daily loss of 0.88%. At the same time, the Dow added 0.08%, and the tech-heavy Nasdaq lost 1.95%.\n\nShares of the company have appreciated by 2.87% over the course of the past month, outperforming the Conglomerates sector's loss of 6.42% and lagging the S&P 500's gain of 5.11%.\n\nThe investment community will be paying close attention to the earnings performance of Honeywell International Inc. in its upcoming release. The company is slated to reveal its earnings on July 25, 2024. In that report, analysts expect Honeywell International Inc. to post earnings of $2.40 per share. This would mark year-over-year growth of 7.62%. Simultaneously, our latest consensus estimate expects the revenue to be $9.4 billion, showing a 2.8% escalation compared to the year-ago quarter.\n\nFor the annual period, the Zacks Consensus Estimates anticipate earnings of $10.17 per share and a revenue of $38.66 billion, signifying shifts of +11.03% and +5.45%, respectively, from the last year.\n\nInvestors should also note any recent changes to analyst estimates for Honeywell International Inc. Such recent modifications usually signify the changing landscape of near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.\n\nOur research reveals that these estimate alterations are directly linked with the stock price performance in the near future. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.\n\nThe Zacks Rank system, running from #1 (Strong Buy) to #5 (Strong Sell), holds an admirable track record of superior performance, independently audited, with #1 stocks contributing an average annual return of +25% since 1988. Over the past month, there's been a 0.09% rise in the Zacks Consensus EPS estimate. Honeywell International Inc. is currently sporting a Zacks Rank of #3 (Hold).\n\nLooking at valuation, Honeywell International Inc. is presently trading at a Forward P/E ratio of 21.1. For comparison, its industry has an average Forward P/E of 18.43, which means Honeywell International Inc. is trading at a premium to the group.\n\nInvestors should also note that HON has a PEG ratio of 2.23 right now. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. As the market closed yesterday, the Diversified Operations industry was having an average PEG ratio of 1.69.\n\nStory continues\n\nThe Diversified Operations industry is part of the Conglomerates sector. At present, this industry carries a Zacks Industry Rank of 67, placing it within the top 27% of over 250 industries.\n\nThe Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nRemember to apply Zacks.com to follow these and more stock-moving metrics during the upcoming trading sessions.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-international-inc-hon-advances-221519072.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.989,
            "neg": 0.011,
            "neu": 0.908,
            "pos": 0.081
        }
    },
    {
        "date": "2024-07-11T14:40:00+00:00",
        "title": "Honeywell (HON) to Acquire Air Products' LNG Process Business",
        "content": "Honeywell International Inc. HON has inked a deal to acquire Air Products and Chemicals, Inc.’s APD liquefied natural gas (LNG) process technology and equipment business for $1.81 billion in cash. This marks Honeywell’s fourth acquisition announcement so far this year.\r\n\r\nHON’s shares gained 1.9% yesterday to eventually close the trading session at $214.49.\r\n\r\nBased in Pennsylvania, Air Products is engaged in producing atmospheric gases, process gases and specialty gases for customers in various industries, including refining, chemical, manufacturing, electronics, energy production, medical, food and metals. Its LNG technology and equipment business is based in Allentown, PA, and currently employs about 475 people.\n\nAcquisition Rationale\n\nThe latest buyout is in sync with Honeywell’s policy of acquiring businesses to strengthen its business and expand its market share. The inclusion of LNG process technology and equipment business expertise in in-house design and manufacturing of coil-wound heat exchangers and related equipment portfolio will boost HON’s energy transition portfolio. This acquisition will enable Honeywell to offer a comprehensive solution for its customers’ energy transformation needs.\r\n\r\nHON's energy transition solution will include natural gas pre-treatment and advanced liquefaction that leverages advanced digital automation technologies within the Honeywell Forge and Experion platforms. This all-in-one solution will facilitate its customers in managing natural gas assets easily and efficiently.\r\n\r\nSubject to regulatory approvals and customary closing conditions, the acquisition is expected to close before the end of 2024. The company expects the buyout to be accretive to its revenue growth and adjusted earnings per share in the first full year of possession.\n\nOther Notable Buyouts\n\nAcquisitions are an essential aspect of Honeywell's growth strategy. In June 2024, the company inked a deal to acquire CAES Systems Holdings LLC from private equity firm Advent International for about $1.9 billion in cash. The transaction will augment HON's defense technology offerings across various domains, including land, sea, air and space.\r\n\r\nIn the same month, HON acquired Carrier’s Global Access Solutions business for an all-cash deal of $4.95 billion. The inclusion of Global Access Solutions’ expertise in advanced access and security solutions, coupled with its impressive growth and margin profile, will enable Honeywell to expand its security products portfolio and boost its building automation segment. In March 2024, HON announced its plan to purchase Civitanavi Systems S.p.A. for about €200 million ($217 million) to boost its portfolio of aerospace navigation solutions.\n\nStory continues\n\nZacks Rank and Price Performance\n\nHoneywell currently carries a Zacks Rank #3 (Hold). The stock has risen 2.7% in the past year compared with the industry’s 10.6% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nStrength in the commercial aviation, building automation and UOP businesses augurs well for Honeywell. A strong commercial aftermarket and solid commercial aviation demand led by strength in the air transport aftermarket are aiding the Aerospace segment.\r\n\r\nHowever, HON’s Industrial Automation segment remains notably weak due to lower volumes in the warehouse and workflow solutions business. High costs and expenses, owing to an increase in material and labor costs, may affect its margins and profitability.\n\nStocks to Consider\n\nSome better-ranked companies from the Conglomerates sector are discussed below:\r\n\r\nCarlisle Companies Incorporated CSL presently carries a Zacks Rank #2 (Buy). It has a trailing four-quarter average earnings surprise of 17%. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\r\n\r\nThe Zacks Consensus Estimate for CSL’s 2024 earnings has increased 2.2% in the past 60 days. Shares of Carlisle have gained 57.9% in the past year.\r\n\r\nGriffon Corporation GFF presently carries a Zacks Rank of 2. It delivered a trailing four-quarter average earnings surprise of 33.5%.\r\n\r\nIn the past 60 days, the Zacks Consensus Estimate for GFF’s 2024 earnings has increased 4.2%. The stock has risen 52.6% in the past year.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAir Products and Chemicals, Inc. (APD) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nCarlisle Companies Incorporated (CSL) : Free Stock Analysis Report\n\nGriffon Corporation (GFF) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-hon-acquire-air-products-144000778.html",
        "symbols": [
            "0HBH.LSE",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "AP3.BE",
            "AP3.DU",
            "AP3.F",
            "AP3.MU",
            "AP3.STU",
            "APD.US",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.009,
            "neu": 0.808,
            "pos": 0.184
        }
    },
    {
        "date": "2024-07-11T13:44:00+00:00",
        "title": "Air Products (APD) Sells LNG Business to Honeywell for $1.81B",
        "content": "Air Products and Chemicals, Inc. APD announced that Honeywell International Inc. HON will acquire APD's liquefied natural gas (LNG) process technology and equipment business for $1.81 billion in an all-cash transaction. This represents approximately 13 times the estimated 2024 EBITDA.\n\nThis acquisition will enable Honeywell to provide a comprehensive, top-tier solution for managing energy transformation. The new offering will include natural gas pre-treatment and advanced liquefaction, integrated with Honeywell's Forge and Experion digital automation platforms. This holistic solution aims to deliver efficient, reliable and optimized management of natural gas assets, offering significant value and support.\n\nCurrently, Honeywell supplies a pre-treatment solution for LNG customers worldwide. Air Products' LNG process technology and equipment business will add a broad portfolio, including the design and manufacture of coil-wound heat exchangers (CWHE) and related equipment. CWHEs offer high throughput of natural gas with a compact footprint and reliable, safe operations both onshore and offshore.\n\nHON stated that natural gas is a crucial lower-emission, affordable transition fuel as the world builds a renewables-based energy infrastructure. This complementary acquisition strengthens Honeywell's energy transition portfolio and Air Products' CWHE technology expands its installed base, creating new opportunities for growth in aftermarket services and digitalization through Honeywell Forge.\n\nAir Products noted that divesting the LNG heat exchanger technology and equipment business aligns with its strategy to grow its core industrial gas business and deliver clean hydrogen at scale to decarbonize industrial and heavy-duty transportation sectors. The LNG business is at its peak, thanks to a dedicated team, and will thrive under Honeywell's portfolio.\n\nThe LNG market has quadrupled in the past 20 years and is projected to double over the next two decades, driven by demand in key sectors like power and data centers, according to industry research.\n\nHoneywell mentioned that integrating this talented team and proprietary technologies will allow Honeywell UOP to offer scalable solutions and services to help global customers transition to more sustainable and efficient energy practices.\n\nAir Products' LNG business has about 475 employees, headquartered in Allentown, PA, with a 390,000-square-foot manufacturing facility in Port Manatee, FL, where CWHEs of all sizes are produced.\n\nThis acquisition is Honeywell's fourth this year as part of its capital deployment strategy, focusing on high-return acquisitions aligned with the megatrends of automation, aviation, and energy transition. The transaction is expected to be accretive to adjusted earnings per share in the first full year of ownership, with no financing conditions. It is anticipated to close by the end of the year, pending customary closing conditions and regulatory approvals.\n\nStory continues\n\nAPD’s shares have lost 13.1% in the past year compared with a 13.5% fall in the industry. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank & Key Picks\n\nAPD currently carries a Zacks Rank #3 (Hold).\n\nSome better-ranked stocks in the Basic Materials space are Carpenter Technology Corporation CRS, Eldorado Gold Corporation EGO,and Axalta Coating Systems Ltd. AXTA. Carpenter Technology and Eldorado Gold sport a Zacks Rank #1 (Strong Buy), and Axalta carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nThe Zacks Consensus Estimate for CRS’s current-year earnings is pegged at $4.35, indicating a year-over-year rise of 282%. CRS’ earnings beat the Zacks Consensus Estimate in three of the last four quarters while matching it once, the average earnings surprise being 15.1%. The company’s shares have soared 89.2% in the past year.\n\nThe Zacks Consensus Estimate for EGO’s current-year earnings is pegged at $1.09, indicating a year-over-year rise of 91.2%. EGO’s earnings estimates have gone up 10% in the past 60 days. EGO beat the consensus estimate in each of the last four quarters, the average earnings surprise being 430.7%. The stock has rallied 47.4% in the past year.\n\nThe Zacks Consensus Estimate for Axalta's current-year earnings is pegged at $1.99, indicating a rise of 26.8% from the year-ago levels. AXTA beat the consensus in three of the last four quarters while missing it once, the average earnings surprise being 7%. The stock has rallied nearly 2.8% in the past year.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAir Products and Chemicals, Inc. (APD) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nCarpenter Technology Corporation (CRS) : Free Stock Analysis Report\n\nAxalta Coating Systems Ltd. (AXTA) : Free Stock Analysis Report\n\nEldorado Gold Corporation (EGO) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/air-products-apd-sells-lng-134400723.html",
        "symbols": [
            "0HBH.LSE",
            "9AX.F",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "AP3.BE",
            "AP3.DU",
            "AP3.F",
            "AP3.MU",
            "AP3.STU",
            "APD.US",
            "AXTA.US",
            "EGO.US",
            "ELD.TO",
            "ELO1.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.01,
            "neu": 0.844,
            "pos": 0.146
        }
    },
    {
        "date": "2024-07-11T10:09:24+00:00",
        "title": "Honeywell CEO’s $1.8 billion LNG deal is his fourth acquisition in eight months",
        "content": "Good morning.\n\nThe energy transition is a battle fought through electrons and molecules. We want green electrons, electricity generated by wind, sun, or waves instead of, say, coal. And we want to store energy in green molecules such as ethanol, hydrogen, or ones made from food waste. I recently boarded a Japan Airlines flight that was powered by sustainable aviation fuel (SAF) created from used cooking oil. Fry to fly!\n\nHoneywell CEO and chairman Vimal Kapur thinks a lot about green molecules. His company is a pioneer in the technology that produces SAF. As Kapur recently told me: “You can’t run a plane on electricity.” (Not yet, perhaps, although Germany’s H2FLY conducted the world’s first piloted flight of an electric aircraft powered by liquid hydrogen.) That’s why he has Honeywell focused on creating SAF and carbon-free molecules like green hydrogen as part of the solution in achieving the energy transition.\n\nIt's not the only area where Honeywell plays. Since taking the top job last year, Kapur has aligned the industrial giant’s portfolio around automation, the future of aviation, and the energy transition. Yesterday, Honeywell announced the acquisition of Air Products’ liquefied natural gas (LNG) process technology and equipment business for $1.8 billion. It’s his fourth major acquisition in eight months. While LNG isn’t what you’d call clean energy, it produces fewer carbon dioxide emissions than coal and oil, which makes it an important bridge in what Kapur calls the decarbonization journey.\n\nHoneywell can also use LNG to produce hydrogen and carbon dioxide, the latter of which it can capture, liquefy, and ship to oil companies that can reuse it. The issue isn’t just the technology but the cost: making it feasible for others to do the right thing. “The energy transition is not easy and it’s not cheap,” said Kapur. “We are solving economic problems.”\n\nCreating a business case around the move to a low-carbon economy is the essence of sustainability. If you’re looking to share your approach and learn from others, consider joining the Fortune Impact Initiative, held in conjunction with our partners at EVERFI from Blackbaud. We will meet on Oct. 8 and 9 in Atlanta for conversations led by Kristin Stoller and my other newsroom colleagues. You can learn more here.\n\nMore news below.\n\nDiane Brady\r\ndiane.brady@fortune.com\r\nFollow on LinkedIn\n\nThis story was originally featured on Fortune.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-ceo-1-8-billion-100924705.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.967,
            "neg": 0.018,
            "neu": 0.883,
            "pos": 0.099
        }
    },
    {
        "date": "2024-07-11T00:00:00+00:00",
        "title": "The 3 Smartest Quantum Computing Stocks to Buy With $5K Right Now",
        "content": "These quantum computing stocks are well-positioned to provide significant returns to investors due to their high growth potential.",
        "link": "https://investorplace.com/2024/07/the-3-smartest-quantum-computing-stocks-to-buy-with-5k-right-now/",
        "symbols": [
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.527,
            "neg": 0,
            "neu": 0.784,
            "pos": 0.216
        }
    }
]