[
    {
        "date": "2024-07-03T23:01:17+00:00",
        "title": "Exclusive: Indian officials visit Foxconn iPhone plant, question executives about hiring",
        "content": "Indian labour officials visited a Foxconn factory in the country's south this week and questioned executives about the company's hiring practices, an official said, after Reuters reported that the major Apple supplier has been rejecting married women from iPhone assembly jobs.",
        "link": "https://www.reuters.com/technology/indian-officials-visit-foxconn-iphone-plant-question-executives-about-hiring-2024-07-03/",
        "symbols": [
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.527,
            "neg": 0.104,
            "neu": 0.896,
            "pos": 0
        }
    },
    {
        "date": "2024-07-03T10:00:00+00:00",
        "title": "7 Cutting-Edge Tech Stocks to Supercharge Your Profits",
        "content": "Fundamentally, the bullish narrative for targeting cutting-edge tech stocks is rather straightforward. Outside of extraordinary circumstances, the innovation ecosystem always attempts to push society forward. Therefore, should you pick viable enterprises, you stand a better chance of accruing significant profits over the long run.\n\nEssentially, the concept undergirding cutting-edge tech stocks is permanently relevant. That doesn’t mean that every idea selected from the broad tech umbrella will perform well. There are zero guarantees in the market and even robust and celebrated enterprises can always fail. That said, the unique backdrop of the current juncture makes individual innovators compelling.\n\nWith the advancement of artificial intelligence and related innovations, a surge of demand has entered the tech environment. Further, the resounding upside of names like Nvidia (NASDAQ:NVDA) have galvanized support among investors. Now, the focus has shifted toward alternative entities that can deliver the goods. On that note, below are cutting-edge tech stocks to consider.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nMicrosoft (MSFT) Wide angle view of a Microsoft sign at the headquarters for personal computer and cloud computing company, with office building in the background.. MSFT stock\n\nSource: VDB Photos / Shutterstock.com\n\nOne of the biggest names among cutting-edge tech stocks, Microsoft (NASDAQ:MSFT) plays a key role in multiple arenas. A significant money maker is the company’s Azure platform, which is a leader in cloud-computing services. Further, Microsoft has invested heavily in AI, integrating digital intelligence across its products. It’s also a huge name in the gig economy thanks to its Office 365 suite of business programs.\n\nWhat makes MSFT a particularly powerful player among cutting-edge tech stocks is predictability. Between the second quarter of 2023 and Q1 2024, the company’s average earnings per share hit $2.82. This print translated to an average earnings surprise of 7%. Notably, it beat every bottom-line target for each of the past four quarters.\n\nDuring the trailing 12 months (TTM), Microsoft posted net income of $86.18 billion or $11.53 per share. Revenue reached $236.58 billion. For fiscal 2024, experts anticipate over 20% expansion in EPS to $11.80. On the top line, they’re targeting 15.6% growth to sales of $244.92 billion.\n\nASML (ASML) Closeup of mobile phone screen with ASML logo on computer keyboard\n\nSource: Ralf Liebhold / Shutterstock\n\nOne of the top semiconductor manufacturing specialists, ASML (NASDAQ:ASML) focuses on extreme ultraviolet (EUV) lithography machines. These pieces of equipment are crucial for developing the most advanced computer chips. Essentially, the underlying technology enables operators to print intricate patterns on silicon wafers. Plus, ASML is unique – it’s a one-of-a-kind enterprise, making it one of the top cutting-edge tech stocks.\n\nStory continues\n\nAs with Microsoft, ASML represents a predictable business. That’s no surprise given its unique nature. In the past four quarters, the company posted an average EPS of $4.85. This print translated into an average earnings surprise of 8.2%. The company beat bottom-line targets in each of the past four quarters.\n\nDuring the TTM period, ASML posted net income of $7.11 billion or $19.25 per share. Revenue during the cycle hit $26.1 billion. For fiscal 2024, analysts see mixed results, anticipating a slight dip in EPS and a very modest rise in revenue. However, fiscal 2025 could see a 56.5% leap in EPS to $32.21. Sales could soar 32.4% to hit $39.57 billion.\n\nHoneywell (HON) top Tech stocks to watch : Double exposure of man's hands holding and using a phone and financial graph drawing. tech stocks\n\nSource: Peshkova / Shutterstock\n\nWhile I wouldn’t technically call Honeywell (NASDAQ:HON) a pure-play example of cutting-edge tech stocks, the industrial conglomerate does feature a building controls business unit. Under this unit, Honeywell offers charging solutions for electric vehicles. Specifically, it markets its services to commercial real-estate operators looking to integrated EV charging to their properties.\n\nThat’s compelling due to recent deals in the EV space. Basically, more automakers are focusing on securing demand from middle-income customers as opposed to affluent buyers. Well, long story short, a direct correlation exists between income and homeownership. And that means modest-income buyers will likely require public charging solutions. That’s a huge plus for HON stock over the long run.\n\nPlus, Honeywell is a consistent player, beating its bottom-line targets in the past four quarters. Its average earnings surprise came out to 2.85%. For fiscal 2024, covering experts are looking for EPS to expand by 12.2% to reach $10.28. On the top line, they anticipate sales to rise by 5.6% to hit $38.7 billion.\n\nIt’s not much growth but Honeywell also offers a forward yield of 2.02%.\n\nIntuitive Surgical (ISRG) An image of a white, grey, and orange sign with the \"Intuitive Surgical\" logo and number \"1020\" on a patch of grass in front of a white, grey, and orange building on a sunny day.\n\nSource: michelmond / Shutterstock.com\n\nAnother name that’s not quite a pure-play candidate for cutting-edge tech stocks, Intuitive Surgical (NASDAQ:ISRG) nevertheless deserves some consideration. Yes, it’s more aligned with the healthcare sector. Intuitive develops and manufactures robotic products for minimally invasive surgeries. Ultimately, the underlying innovation should help improve patient outcomes. And that down the line benefits the broader economy.\n\nIndeed, society suffers when individuals – especially highly skilled and educated workers – must exit the assembly line (for lack of a better phrase) to take care of their health needs. So, minimizing the downtime is beneficial for the patient and society’s bottom line. It’s no surprise that Intuitive has been a consistent performer. In the past four quarters, its average EPS came out to nearly $1.50.\n\nFor the above print, the average earnings surprise was 6.2%. In the TTM period, Intuitive posted net income of $1.99 billion or $5.52 per share. Revenue reached $7.32 billion. For fiscal 2024, analysts are looking for 10% EPS expansion to $6.29. On the top line, sales could hit $8.02 billion, up 12.6% from last year.\n\nCrowdStrike (CRWD) Person holding smartphone with logo of US software company CrowdStrike Holdings Inc. (CRWD) on screen in front of website. Focus on phone display. Unmodified photo.\n\nSource: T. Schneider / Shutterstock.com\n\nOne of the top names in cybersecurity, CrowdStrike (NASDAQ:CRWD) is vital to the wider economy. That’s an easy statement to make because so much of business is conducted online and through cloud networks. It’s critical to provide next-generation endpoint protection, which is CrowdStrike’s specialty. It also offers threat intelligence and proactive threat hunting.\n\nWhile enterprises may be looking for costs to cut, cybersecurity may survive the budgeting axe. That’s because an ounce of prevention is worth a pound of cure, especially in the digital age. Not surprisingly, CrowdStrike has been a stellar performer over the past four quarters, generating an average EPS of 86 cents. This print translated to an earnings surprise of 15.83%.\n\nIn the TTM period, the cybersecurity specialist posted net income of $131.66 million or 54 cents per share. Revenue reached $3.28 billion. For the current fiscal year, experts are seeking 29.4% growth in EPS to $4. On the top line, sales may see a 30.8% boost to $4 billion. It’s easily one of the cutting-edge tech stocks to consider.\n\nC3.ai (AI) C3.ai (AI) logo on a smartphone with computer screen showing graph in background, symbolizing AI stock\n\nSource: shutterstock.com/Below the Sky\n\nMoving over to the riskier side of cutting-edge tech stocks, C3.ai (NYSE:AI) specializes in enterprise-level AI. It develops software applications for multiple industries along with government agencies. One of its main attributes is that it provides mechanisms for predictive maintenance. That can be especially crucial for both civilian and military uses, impacting safety and operational integrity.\n\nFurther, what makes C3.ai appealing to speculators is that the underlying innovation enables practical uses of AI to foster productivity. Still, it’s a risky idea, with shares in red ink over a 52-week basis. Further, the company isn’t profitable, producing a loss per share of 11.5 cents in the past four quarters. That said, the quarterly surprise during this period came out to just under 48%.\n\nDuring the TTM period, C3.ai posted a net loss of $279.7 million or $2.34 per share in the red. Revenue in the cycle reached $310.58 million. For the current fiscal year, analysts believe the loss per share may unfavorably widen by nearly 15% to 54 cents. However, sales could see a 23.4% jump to $383.39 million.\n\nVeritone (VERI) AI stocks to buy now, Graphic of letters \"AI\" in bold font surrounded by circle of tech symbols in purple and blue against a dark background. ai stocks to buy\n\nSource: shutterstock.com/Tex vector\n\nBased in Irvine, California, Veritone (NASDAQ:VERI) is an AI technology firm. Its main call to fame is its platform called aiWARE, which integrates AI solutions to process, transform and analyze audio, video and text data in real-time. In particular, media and entertainment agencies utilize Veritone’s services for content creation, management and monetization.\n\nWith so much material moving to online platforms, Veritone could be able to carve out a powerful niche. However, the problem is volatility. After soaring to blistering heights in April this year, VERI stock has plunged badly. Therefore, it’s undoubtedly a speculative entity. It’s not profitable either, producing a loss per share of 23 cents over the past four quarters.\n\nIn the TTM period, Veritone incurred a net loss of $60.86 million or $1.63 per share. Revenue during the period reached $128.93 million. For fiscal 2024, experts do see a significant improvement in the loss per share to 35 cents. That’s a far cry from $1.01 in the red. Also, revenue may pop 8.1% to hit $137.9 million.\n\nOn the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nA former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 7 Cutting-Edge Tech Stocks to Supercharge Your Profits appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/7-cutting-edge-tech-stocks-100000502.html",
        "symbols": [
            "0R29.LSE",
            "1ASML.MI",
            "724.F",
            "AI.US",
            "ASME.F",
            "ASME.XETRA",
            "ASMF.F",
            "ASML.AS",
            "ASML.US",
            "ASML34.SA",
            "ASMLF.US",
            "CRWD.US",
            "HON.US",
            "I1SR34.SA",
            "ISRG.US",
            "IUI1.BE",
            "IUI1.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.043,
            "neu": 0.832,
            "pos": 0.125
        }
    },
    {
        "date": "2024-07-03T00:00:00+00:00",
        "title": "7 Cutting-Edge Tech Stocks to Supercharge Your Profits",
        "content": "With innovation moving in only one direction, investors may do well to consider these cutting-edge tech stocks to buy.",
        "link": "https://investorplace.com/2024/07/7-cutting-edge-tech-stocks-to-supercharge-your-profits/",
        "symbols": [
            "AI.US",
            "ASML.US",
            "CRWD.US",
            "HON.US",
            "ISRG.US",
            "MSFT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.572,
            "neg": 0,
            "neu": 0.783,
            "pos": 0.217
        }
    }
]