[
    {
        "date": "2024-06-21T16:48:00+00:00",
        "title": "Honeywell (HON) to Boost Product Portfolio With CAES Buyout",
        "content": "Honeywell International Inc. HON has inked a deal to acquire CAES Systems Holdings LLC (“CAES”) from private equity firm Advent International for about $1.9 billion in cash. The transaction will augment HON's defense technology offerings across various domains, including land, sea, air and space.\r\n\r\nBased in Arlington, VA, CAES is engaged in offering RF, microwave and millimeter wave solutions for missile defense radars, missile seekers and electronic warfare systems. The company has 13 facilities in North America.\n\nAcquisition Rationale\n\nThe latest buyout is in sync with Honeywell’s policy of acquiring businesses to expand its market share and customer base. The inclusion of CAES’ expertise in scalable solutions with the company’s defense and space portfolio will enable HON to boost its established production. It will also help Honeywell expand its positions in critical platforms like F-35, EA-18G, AMRAAM and GMLRS as well as new technologies such as Navy Radar (SPY-6), unmanned aerial systems (“UAS”) and counter-UAS technologies. The acquisition will expand the company’s aerospace business.\r\n\r\nSubject to regulatory approvals and customary closing conditions, the acquisition is expected to close by the second half of 2024. This transaction is not subject to any financing conditions. The company expects the buyout to be cash-earnings per share accretive in the first full year of possession.\r\n\r\nAcquisitions are an essential aspect of Honeywell's growth strategy. In June 2024, the company acquired Carrier’s Global Access Solutions business for an all-cash deal of $4.95 billion. The inclusion of Global Access Solutions’ expertise in advanced access and security solutions, coupled with its impressive growth and margin profile, will enable Honeywell to expand its security products portfolio and boost its building automation segment.\r\n\r\nThe acquisition of SCADAfence, in August 2023, expanded the company’s OT cybersecurity portfolio in Tel Aviv, Israel, while simultaneously fortifying its existing capabilities in cybersecurity. SCADAfence has been integrated into the Honeywell Forge Cybersecurity+ suite within Honeywell Connected Enterprise.\n\nZacks Rank and Price Performance\n\nHoneywell currently carries a Zacks Rank #2 (Buy). The stock has risen 6.9% in the past year compared with the industry’s 15.2% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nStrength in the commercial aviation, building automation and UOP businesses augurs well for Honeywell. A strong commercial aftermarket and solid commercial aviation demand led by strength in the air transport aftermarket are aiding the Aerospace segment.\n\nStory continues\n\nOther Stocks to Consider\n\nSome other top-ranked companies from the Conglomerates sector are discussed below:\r\n\r\nCarlisle Companies Incorporated CSL presently sports a Zacks Rank #1 (Strong Buy). It has a trailing four-quarter average earnings surprise of 17%. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nThe Zacks Consensus Estimate for CSL’s 2024 earnings has increased 6.5% in the past 60 days. Shares of Carlisle have gained 74.4% in the past year.\r\n\r\nGriffon Corporation GFF presently sports a Zacks Rank of 1. It delivered a trailing four-quarter average earnings surprise of 33.5%, on average.\r\n\r\nIn the past 60 days, the Zacks Consensus Estimate for GFF’s 2024 earnings has increased 10.6%. The stock has risen 71.4% in the past year.\r\n\r\nITT Inc. ITT currently carries a Zacks Rank of 2. It delivered a trailing four-quarter average earnings surprise of 6.5%.\r\n\r\nIn the past 60 days, the consensus estimate for ITT’s 2024 earnings has inched up 0.9%. Shares of ITT have gained 48.8% in the past year.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nITT Inc. (ITT) : Free Stock Analysis Report\n\nCarlisle Companies Incorporated (CSL) : Free Stock Analysis Report\n\nGriffon Corporation (GFF) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-hon-boost-product-portfolio-164800379.html",
        "symbols": [
            "2II.F",
            "2II.STU",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "ITT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.009,
            "neu": 0.829,
            "pos": 0.162
        }
    },
    {
        "date": "2024-06-21T16:29:37+00:00",
        "title": "Sarepta Stock Surges On FDA News; Industrial Stock In Buy Zone",
        "content": "This biotech stock surged after one of its gene therapies was approved by the Food and Drug Administration.\n\nContinue reading\n\nView comments",
        "link": "https://finance.yahoo.com/m/6338e2f2-edc9-3d7f-943c-da592e70e578/sarepta-stock-surges-on-fda.html",
        "symbols": [
            "0L35.LSE",
            "AB3A.BE",
            "AB3A.F",
            "AB3A.MU",
            "AB3A.STU",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "S1RP34.SA",
            "SRPT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.422,
            "neg": 0,
            "neu": 0.882,
            "pos": 0.118
        }
    },
    {
        "date": "2024-06-21T16:00:07+00:00",
        "title": "Honeywell International (HON) Upgraded to Buy: What Does It Mean for the Stock?",
        "content": "Honeywell International Inc. (HON) could be a solid choice for investors given its recent upgrade to a Zacks Rank #2 (Buy). This rating change essentially reflects an upward trend in earnings estimates -- one of the most powerful forces impacting stock prices.\n\nA company's changing earnings picture is at the core of the Zacks rating. The system tracks the Zacks Consensus Estimate -- the consensus measure of EPS estimates from the sell-side analysts covering the stock -- for the current and following years.\n\nIndividual investors often find it hard to make decisions based on rating upgrades by Wall Street analysts, since these are mostly driven by subjective factors that are hard to see and measure in real time. In these situations, the Zacks rating system comes in handy because of the power of a changing earnings picture in determining near-term stock price movements.\n\nAs such, the Zacks rating upgrade for Honeywell International is essentially a positive comment on its earnings outlook that could have a favorable impact on its stock price.\n\nMost Powerful Force Impacting Stock Prices\n\nThe change in a company's future earnings potential, as reflected in earnings estimate revisions, and the near-term price movement of its stock are proven to be strongly correlated. That's partly because of the influence of institutional investors that use earnings and earnings estimates for calculating the fair value of a company's shares. An increase or decrease in earnings estimates in their valuation models simply results in higher or lower fair value for a stock, and institutional investors typically buy or sell it. Their bulk investment action then leads to price movement for the stock.\n\nFundamentally speaking, rising earnings estimates and the consequent rating upgrade for Honeywell International imply an improvement in the company's underlying business. Investors should show their appreciation for this improving business trend by pushing the stock higher.\n\nHarnessing the Power of Earnings Estimate Revisions\n\nEmpirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock movements, so it could be truly rewarding if such revisions are tracked for making an investment decision. Here is where the tried-and-tested Zacks Rank stock-rating system plays an important role, as it effectively harnesses the power of earnings estimate revisions.\n\nThe Zacks Rank stock-rating system, which uses four factors related to earnings estimates to classify stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), has an impressive externally-audited track record, with Zacks Rank #1 stocks generating an average annual return of +25% since 1988. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here >>>>.\n\nStory continues\n\nEarnings Estimate Revisions for Honeywell International\n\nFor the fiscal year ending December 2024, this company is expected to earn $10.16 per share, which is a change of 10.9% from the year-ago reported number.\n\nAnalysts have been steadily raising their estimates for Honeywell International. Over the past three months, the Zacks Consensus Estimate for the company has increased 2.7%.\n\nBottom Line\n\nUnlike the overly optimistic Wall Street analysts whose rating systems tend to be weighted toward favorable recommendations, the Zacks rating system maintains an equal proportion of 'buy' and 'sell' ratings for its entire universe of more than 4000 stocks at any point in time. Irrespective of market conditions, only the top 5% of the Zacks-covered stocks get a 'Strong Buy' rating and the next 15% get a 'Buy' rating. So, the placement of a stock in the top 20% of the Zacks-covered stocks indicates its superior earnings estimate revision feature, making it a solid candidate for producing market-beating returns in the near term.\n\nYou can learn more about the Zacks Rank here >>>\n\nThe upgrade of Honeywell International to a Zacks Rank #2 positions it in the top 20% of the Zacks-covered stocks in terms of estimate revisions, implying that the stock might move higher in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-international-hon-upgraded-buy-160007911.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.007,
            "neu": 0.871,
            "pos": 0.122
        }
    },
    {
        "date": "2024-06-21T13:30:09+00:00",
        "title": "Is Honeywell International (HON) a Buy as Wall Street Analysts Look Optimistic?",
        "content": "Investors often turn to recommendations made by Wall Street analysts before making a Buy, Sell, or Hold decision about a stock. While media reports about rating changes by these brokerage-firm employed (or sell-side) analysts often affect a stock's price, do they really matter?\n\nBefore we discuss the reliability of brokerage recommendations and how to use them to your advantage, let's see what these Wall Street heavyweights think about Honeywell International Inc. (HON).\n\nHoneywell International currently has an average brokerage recommendation (ABR) of 1.81, on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell, etc.) made by 16 brokerage firms. An ABR of 1.81 approximates between Strong Buy and Buy.\n\nOf the 16 recommendations that derive the current ABR, nine are Strong Buy and one is Buy. Strong Buy and Buy respectively account for 56.3% and 6.3% of all recommendations.\n\nBrokerage Recommendation Trends for HON Broker Rating Breakdown Chart for HON\n\nCheck price target & stock forecast for Honeywell International here>>>\r\n\r\nThe ABR suggests buying Honeywell International, but making an investment decision solely on the basis of this information might not be a good idea. According to several studies, brokerage recommendations have little to no success guiding investors to choose stocks with the most potential for price appreciation.\n\nDo you wonder why? As a result of the vested interest of brokerage firms in a stock they cover, their analysts tend to rate it with a strong positive bias. According to our research, brokerage firms assign five \"Strong Buy\" recommendations for every \"Strong Sell\" recommendation.\n\nThis means that the interests of these institutions are not always aligned with those of retail investors, giving little insight into the direction of a stock's future price movement. It would therefore be best to use this information to validate your own analysis or a tool that has proven to be highly effective at predicting stock price movements.\n\nWith an impressive externally audited track record, our proprietary stock rating tool, the Zacks Rank, which classifies stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), is a reliable indicator of a stock's near -term price performance. So, validating the Zacks Rank with ABR could go a long way in making a profitable investment decision.\n\nZacks Rank Should Not Be Confused With ABR\n\nIn spite of the fact that Zacks Rank and ABR both appear on a scale from 1 to 5, they are two completely different measures.\n\nStory continues\n\nThe ABR is calculated solely based on brokerage recommendations and is typically displayed with decimals (example: 1.28). In contrast, the Zacks Rank is a quantitative model allowing investors to harness the power of earnings estimate revisions. It is displayed in whole numbers -- 1 to 5.\n\nAnalysts employed by brokerage firms have been and continue to be overly optimistic with their recommendations. Since the ratings issued by these analysts are more favorable than their research would support because of the vested interest of their employers, they mislead investors far more often than they guide.\n\nOn the other hand, earnings estimate revisions are at the core of the Zacks Rank. And empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nFurthermore, the different grades of the Zacks Rank are applied proportionately across all stocks for which brokerage analysts provide earnings estimates for the current year. In other words, at all times, this tool maintains a balance among the five ranks it assigns.\n\nThere is also a key difference between the ABR and Zacks Rank when it comes to freshness. When you look at the ABR, it may not be up-to-date. Nonetheless, since brokerage analysts constantly revise their earnings estimates to reflect changing business trends, and their actions get reflected in the Zacks Rank quickly enough, it is always timely in predicting future stock prices.\n\nIs HON Worth Investing In?\n\nIn terms of earnings estimate revisions for Honeywell International, the Zacks Consensus Estimate for the current year has increased 3% over the past month to $10.16.\n\nAnalysts' growing optimism over the company's earnings prospects, as indicated by strong agreement among them in revising EPS estimates higher, could be a legitimate reason for the stock to soar in the near term.\n\nThe size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #2 (Buy) for Honeywell International. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\n\nTherefore, the Buy-equivalent ABR for Honeywell International may serve as a useful guide for investors.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-international-hon-buy-wall-133009292.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.012,
            "neu": 0.829,
            "pos": 0.16
        }
    },
    {
        "date": "2024-06-21T12:55:00+00:00",
        "title": "Is Honeywell (HON) Stock a Solid Choice Right Now?",
        "content": "One stock that might be an intriguing choice for investors right now is Honeywell International Inc. HON. This is because this security in the Diversified Operations space is seeing solid earnings estimate revision activity, and is in great company from a Zacks Industry Rank perspective.\n\nThis is important because, often times, a rising tide will lift all boats in an industry, as there can be broad trends taking place in a segment that are boosting securities across the board. This is arguably taking place in the Diversified Operations space as it currently has a Zacks Industry Rank of 33 out of more than 250 industries, suggesting it is well-positioned from this perspective, especially when compared to other segments out there.\n\nMeanwhile, Honeywell is actually looking pretty good on its own too. The firm has seen solid earnings estimate revision activity over the past month, suggesting analysts are becoming a bit more bullish on the firm’s prospects in both the short and long term.\n\nHoneywell International Inc. Price and Consensus Honeywell International Inc. Price and Consensus\n\nHoneywell International Inc. price-consensus-chart | Honeywell International Inc. Quote\n\nIn fact, over the past month, current quarter estimates have risen from $2.32 per share to $2.40 per share, while current year estimates have risen from $9.93 per share to $10.15 per share. This has helped HON to earn a Zacks Rank #2 (Buy), further underscoring the company’s solid position. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nSo, if you are looking for a decent pick in a strong industry, consider Honeywell. Not only is its industry currently in the top third, but it is seeing solid estimate revisions as of late, suggesting it could be a very interesting choice for investors seeking a name in this great industry segment.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-hon-stock-solid-choice-125500115.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.986,
            "neg": 0.004,
            "neu": 0.873,
            "pos": 0.123
        }
    }
]