[
    {
        "date": "2024-09-08T01:15:30+00:00",
        "title": "Honeywell International Inc. (HON): Among The Best Autonomous Driving Stock Now?",
        "content": "We recently compiled a list of the 10 Best Autonomous Driving Stocks To Buy According To Short Sellers.In this article, we are going to take a look at where Honeywell International Inc. (NASDAQ:HON) stands against the other autonomous driving stocks.\n\nREAD ALSO 13 Best Tech Stocks to Buy According to Short Sellers and 8 Best EV Stocks According to Short Seller Sentiment\n\n2024 is the year of artificial intelligence. The revolutionary new technology that has disrupted the status quo on Wall Street has managed to shift investor attention away from economic turmoil to a specific set of firms that can benefit from the massive expected enterprise spending on accelerated computing and the associated industries needed to enable this shift. This has meant that despite the fact that interest rates have been at a 23 year high, the flagship S&P index is up by almost 44% since the close of 2022 while the tech heavy broader NASDAQ index has gained 63% during the same time period.\n\nOne technology that is part of artificial intelligence is autonomous driving. Autonomous driving, in its simplest form, is built on machine learning. Machine learning is a subset of artificial intelligence, so, autonomous driving is also artificial intelligence - a fact that is often left underappreciated by the broader media and analyst coverage. Autonomous driving uses neural nets to assimilate existing data and predict the behavior of pedestrians and other drivers. This ability offers the potential to create new industries, particularly where car owners provide their vehicles for autonomous ride sharing to earn money when they don't need their vehicles.\n\nAccording to McKinsey, consumer willingness to rely on shared autonomous vehicles for their trips over trips taken on existing private vehicles has only grown. As an example, its 2022 research showed that 56% of consumers surveyed were willing to use shared autonomous vehicles provided that they did not increase travel time and were at least 20% cheaper compared to their private counterparts. Additionally, 34% of those surveyed wanted level 4 (L4) autonomy in their next vehicle purchase. Autonomous driving is categorized across five levels, with level 1 being simple features such as cruise control and level 5 being a fully autonomous system that does not require any human attention or interaction.\n\nMcKinsey estimates that revenue from autonomous ride sharing fleet vehicles such as robotaxis and robo-shuttles could touch $400 billion by 2030, based on statistics such as the German passenger car fleet of 50 million vehicles being parked 95% of the time and offering 250 million seats to meet the entire population's mobility needs.\n\nStory continues\n\nBuilding on this, while we'll get to the strides made by Elon Musk's car company on this front later, other car companies have also jumped into the fray. For instance, the second best automotive stock to buy according to hedge funds has teamed up with Goldman Sachs' eighth best hedge fund stock pick through its Cruise business to offer autonomous ride sharing services to customers next year. This will be one of the first robotaxi projects of its kind, and its announcement came months after the Autonomous Vehicle Industry Association (AVIA) had shared its first ever State of AV report. It shared that autonomous vehicles have driven nearly 70 million miles on American roads, with most of these being recent as the number of miles driven had marked a 59% growth since July 2023.\n\nWhile big ticket car brands typically dominate the autonomous driving conversation, there are several private and small companies that are also 'driving' the mileage for autonomous vehicles so to speak. One such firm is Nuro, which aims to develop L4 logistics vehicles capable of making deliveries. It tests its products in a closed track in Las Vegas, and the firm has driven one million autonomous miles to date. Another firm is Gatik, which has partnered up with the second best hedge fund eCommerce stock pick and also the biggest brick and mortar retailer in the world. It offers autonomous transportation as a service (ATaaS) by operating box trucks that autonomously ship goods within different supply chain nodes such as fulfillment and distribution centers, stores, and warehouses.\n\nComing back to Elon Musk's car company, autonomous driving and robotaxis are at the center of its valuation, at least as far as RBC Capital and Cathie Wood's Ark Invest are concerned. According to RBC, Robotaxi's revenue can sit at $120 billion in 2040, with the autonomous ride sharing business accounting for 52% of the firm's valuation. Ark, as expected, is more optimistic. Its expected value for the car company's share price is $2,600 in 2029, which will be driven by $8.2 trillion in enterprise value, $1.2 trillion in revenue, and $440 billion in operating income. As per the hedge fund's research, 88%, 63%, and 86% of these values will be driven by Robotaxi.\n\nSince autonomous vehicles require GPUs to train neural networks, and big tech firms' insatiable PGU demand for non-autonomy related AI use cases has made these chips one of the hottest commodities in the world, a shortage in GPUs could impact the projected growth in autonomy. For instance, emails obtained by CNBC in June revealed that Musk had asked his GPU supplier to divert supplies intended for his car company to the social media firm X and AI company xAI. These shipments were worth roughly $500 million, and the latest earnings saw him share that he had no choice but to compete with the world's largest GPU maker.\n\nDuring the call, Musk outlined that since it was hard to procure the \"state-of-the-art\" GPUs, \" when we want them. And I think this therefore requires that we put a lot more effort on Dojo in order to have — in order to ensure that we’ve got the training capability that we need. So we are going to double down on Dojo, and we do see a path to being competitive with \" the GPU company.\n\nOur Methodology\n\nTo make our list of the best autonomous driving stocks, we ranked the holdings of Global X's autonomy ETF that are focused on autonomous driving by the percentage of shares outstanding that were sold short and selected the stocks with the lowest percentage.\n\nFor these stocks, we also mentioned the number of hedge fund investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\n\nA shot of a commercial plane with a blur of color in the background, representing the production of auxiliary power units in the Safety and Productivity Solutions segment.\n\nHoneywell International Inc. (NASDAQ:HON)\n\nShort Interest as % of  Shares Outstanding: 0.85%\n\nNumber of Hedge Fund Investors In Q2 2024: 50\n\nHoneywell International Inc. (NASDAQ:HON) is one of the biggest industrial conglomerates in the world. It caters to the needs of the aerospace, construction, pharmaceutical, information technology, and other industries. On the autonomy front, Honeywell International Inc. (NASDAQ:HON) operates in a specific part of the autonomous hardware industry that enables self driving cars to determine their position, orientation, and velocity even when not connected to the Internet. These products are called inertial measurement units (IMUs), and these are already being used by Minnesota based self driving research company VSI Labs. Honeywell International Inc. (NASDAQ:HON) is also aiming to close its $216 million acquisition of an Italian company to further bolster its IMU portfolio. On a broader level, the firm's different businesses offer it the benefits of diversification. The aerospace sector, which is typically funded through government projects, is resilient to cyclical downturns, which helps Honeywell International Inc. (NASDAQ:HON) to hedge against other sectors such as construction and electronics. The same benefits apply to pharmaceuticals, However, $5.6 billion of Honeywell International Inc. (NASDAQ:HON)'s roughly $9.4 billion in revenue during Q2 2024 came from cyclical businesses, which creates vulnerability for the stock.\n\nThis vulnerability was also on the mind of Mar Vista Investment Partners' Q1 2024 commentary for Honeywell International Inc. (NASDAQ:HON):\n\n\"After nearly 14 years of owning shares in Honeywell, we decided to sell our investment during the quarter. This decision was based on a combination of issues that threatened our investment thesis for the company. The main challenges were related to organic growth and capital deployment. Specifically, we have concerns about Honeywell's future organic growth and its indecisive approach to capital deployment. Even with a strong balance sheet, cash surplus, and low leverage, its capital deployment process lacks direction. Additionally, Honeywell is heavily invested in cyclical and short-cycle businesses which can be volatile. For these reasons, we sold our investment in Honeywell.\"\n\nOverall HON ranks 4th on our list of the best autonomous driving stocks to buy according to short sellers. While we acknowledge the potential of HON as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than HON but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nREAD NEXT:$30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-international-inc-hon-among-011530180.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.021,
            "neu": 0.873,
            "pos": 0.106
        }
    }
]