[
    {
        "date": "2024-06-26T15:40:12+00:00",
        "title": "MARUY vs. HON: Which Stock Is the Better Value Option?",
        "content": "Investors interested in stocks from the Diversified Operations sector have probably already heard of Marubeni Corp. (MARUY) and Honeywell International Inc. (HON). But which of these two companies is the best option for those looking for undervalued stocks? Let's take a closer look.\n\nThere are plenty of strategies for discovering value stocks, but we have found that pairing a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system produces the best returns. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits.\n\nRight now, Marubeni Corp. is sporting a Zacks Rank of #1 (Strong Buy), while Honeywell International Inc. has a Zacks Rank of #2 (Buy). This means that MARUY's earnings estimate revision activity has been more impressive, so investors should feel comfortable with its improving analyst outlook. However, value investors will care about much more than just this.\n\nValue investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels.\n\nThe Value category of the Style Scores system identifies undervalued companies by looking at a number of key metrics. These include the long-favored P/E ratio, P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that help us determine a company's fair value.\n\nMARUY currently has a forward P/E ratio of 9.56, while HON has a forward P/E of 21.10. We also note that MARUY has a PEG ratio of 1.53. This figure is similar to the commonly-used P/E ratio, with the PEG ratio also factoring in a company's expected earnings growth rate. HON currently has a PEG ratio of 2.24.\n\nAnother notable valuation metric for MARUY is its P/B ratio of 1.41. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. For comparison, HON has a P/B of 8.19.\n\nBased on these metrics and many more, MARUY holds a Value grade of B, while HON has a Value grade of D.\n\nMARUY stands above HON thanks to its solid earnings outlook, and based on these valuation figures, we also feel that MARUY is the superior value option right now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nMarubeni Corp. (MARUY) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nStory continues\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/maruy-vs-hon-stock-better-154012550.html",
        "symbols": [
            "8002.TSE",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "MARA.BE",
            "MARA.DU",
            "MARA.F",
            "MARA.MU",
            "MARA.STU",
            "MARUF.US",
            "MARUY.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.004,
            "neu": 0.75,
            "pos": 0.245
        }
    }
]