[
    {
        "date": "2024-06-17T19:15:13+00:00",
        "title": "7 Automation Stocks to Propel Your Portfolio to Profits",
        "content": "Automation stocks can be a tricky subject fundamentally speaking. With advances in artificial intelligence combined with enhanced connectivity – as in the Internet of Things or IoT – machines can end up taking over human jobs. It’s not an insignificant dilemma. I mean, historically, the underlying disparity sparked a massive ideological divide between socialism and free-market capitalism.\n\nHowever, the concept underlying automation stocks doesn’t have to be all doom and gloom. Rather, by accepting that technology constantly moves forward, we can embrace this new era of innovation. Yes, certain sectors and jobs face disruption risks, there’s no doubt about it. Nevertheless, over time, smart machines and algorithms should help accelerate productivity.\n\nFor investors, the situation is far more straightforward. Ultimately, you care about the bottom line. With the tech ecosystem crafting new methodologies and protocols, a renaissance of productivity awaits us. Your job is to get in before the wave hits. With that, let’s go the hands-free approach with automation stocks to buy.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nHoneywell (HON) Close up of phone with creative forex chart on blue background. Trade, finance, technology and communication concept. 3D Rendering. Tech Stocks to Buy Before the Bull Market Returns. Tech Stocks to buy\n\nSource: Golden Dayz / Shutterstock.com\n\nHoneywell (NASDAQ:HON) represents an industrial conglomerate, specializing in myriad applied-science specialties. But regarding automation stocks, it arguably plays the biggest role in the industrial automation subsector. According to Fortune Business Insights, the global arena can expand at a compound annual growth rate (CAGR) of 9.8% to 2029. Here’s why that’s important.\n\nCovering experts believe that in fiscal 2024, Honeywell may reach $38.66 billion on the top line, translating to year-over-year growth of 5.5%. In fiscal 2025, sales could hit $41.05 billion, implying 6.2% growth. Granted, the CAGR here is conspicuously below that of the expected expansion rate of the industrial automation category.\n\nNevertheless, HON stock again represents an investment into a conglomerate. It covers myriad sectors, which means it’s not going to be a pure-play idea on automation stocks. However, this wide breadth also gives you an advantage in the form of a predictable business. Predictable businesses typically pay dividends.\n\nIn this case, Honeywell offers a forward yield of 2.07% with a sustainably low payout ratio of 48.9%. It’s not exciting but don’t overlook it.\n\nRockwell Automation (ROK) Rockwell Automation sign is seen in Cambridge, On, Canada. ROK stock.\n\nSource: JHVEPhoto / Shutterstock\n\nRockwell Automation (NYSE:ROK) falls more in line with a direct play on industrial automation stocks. Admittedly, the company represents a higher-risk profile than Honeywell. Currently, analysts peg ROK stock as a consensus hold. Further, the average price target comes in at only $276.67, implying 9% upside. That said, the most optimistic target calls for $316 per share.\n\nStory continues\n\nPart of the hesitation in Rockwell centers on poor projections for its fiscal 2024 top line. Sales might land at only $8.6 billion, which would be 5.1% down from the prior year. However, it should be noted that the high-side revenue target calls for $9.33 billion. What’s more, Rockwell’s first quarter of 2024 earnings was strong: an earnings surprise of 15.7% while beating the consensus sales forecast.\n\nThat tells me that Rockwell may be due for a stronger-than-expected year in fiscal 2024. Further, analysts either way expect a recovery in fiscal 2025, with sales rising to $9.08 billion. Here, the blue-sky target calls for $9.79 billion.\n\nRight now, ROK stock trades for 3.27X trailing-year revenue. That’s much lower than the 4.57X multiple that we saw a year ago.\n\nStryker (SYK) The Stryker (SYK) office in Fremont, California.\n\nSource: Sundry Photography / Shutterstock.com\n\nStryker (NYSE:SYK) offers significant relevancies for the healthcare segment of automation stocks. According to Grand View Research, the medical automation market reached a valuation of $44.44 billion in 2022. Between 2023 to 2030, the sector could expand at a CAGR of 9.04%. At the forecast culmination point, the industry could be worth $88.11 billion.\n\nWhen it comes to projections, Stryker is right there. For fiscal 2024, analysts anticipate that earnings per share will hit $11.96, up 12.8% from the prior year’s print of $10.60. On the top line, sales may reach $22.31 billion, That would be up 8.8%. Further, the high-side target calls for sales of $22.43 billion, up 9.41%. Again, it’s riding the expectation for the market.\n\nIt’s also possible that even the most optimistic analysts could be undercutting the expected potential of Stryker. Between Q2 2023 and Q1 2024, the company posted an average EPS of $2.74. This performance translated to an earnings surprise of 5.03%. While not exciting per say, the enterprise is consistently beating expectations.\n\nWhile you’re holding SYK, you’re also getting a forward yield of just under 1%. It’s one of the automation stocks to consider.\n\nIntuitive Surgical (ISRG) An image of a white, grey, and orange sign with the \"Intuitive Surgical\" logo and number \"1020\" on a patch of grass in front of a white, grey, and orange building on a sunny day.\n\nSource: michelmond / Shutterstock.com\n\nIntuitive Surgical (NASDAQ:ISRG) is one of the strongest and most popular ideas among medial automation stocks. The chart tells the story, with ISRG stock gaining almost 29% of equity value since the January opener. Of course, whenever you’re dealing with enterprises that are swinging higher, some concerns exist about holding the bag.\n\nHere’s the thing – do you trust the analysts? At the moment, they’re rating ISRG a consensus strong buy. The average price target of $432.73 isn’t good at all but the high side of $500 gets one thinking. But the most important point for me is the forward projection. In fiscal 2024, experts believe that Intuitive can generate $8.02 billion on the top line. That’s a 12.6% growth rate from last year.\n\nLet’s move onto fiscal 2025. Here, the experts are calling for sales of $9.29 billion. That would be up almost 16% from projected 2024 sales. Of course, the issue with ISRG is that it runs a hot revenue multiple of 20.86X.\n\nBut when you’re handily beating the sector? I think it’s one of the automation stocks to consider.\n\nAlphabet (GOOG, GOOGL) Alphabet Inc. (GOOG, GOOGL) and Google logos seen displayed on smartphones. The Google stock split is happening today.\n\nSource: IgorGolovniov / Shutterstock.com\n\nTechnology juggernaut Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL) is a jack of all trades and a master of most of them. However, for the purposes of discussing automation stocks, it offers significant relevance for the mobility sector. Of course, I’m referring to Waymo but it’s more than just that. With the company being a data-mining powerhouse, it can go far in the self-driving space.\n\nAccording to Fortune Business Insights, the autonomous vehicle market size may expand from $1.92 trillion in 2023 to $13.63 trillion by 2030. If so, that would represent a CAGR of 32.3%. Now, you’re probably not going to see a growth rate like that from Alphabet at this stage of the game. Still, let’s look at some numbers.\n\nIn fiscal 2024, experts believe that Alphabet will post EPS of $7.57, up 30.5% from the prior year. That’s massive. On the top line, revenue could clock in at $346.6 billion, up 12.8% from 2023’s tally of $307.39 billion. That’s impressive given that Alphabet is much more mature.\n\nGOOGL stock trades at a hot premium of 7.03X trailing-year revenue. Still, it’s well worth it given the expansion of the top and bottom lines.\n\nMobileye (MBLY) Person holding cellphone with website of Israeli autonomous driving company Mobileye (MBLY) on screen in front of logo. Focus on center of phone display. Unmodified photo.\n\nSource: T. Schneider / Shutterstock.com\n\nFor those that want to take a higher-risk wager on mobility-related automation stocks, Mobileye (NASDAQ:MBLY) offers a compelling take. According to MarketsandMarkets, the burgeoning Mobility as a Service sector could reach a valuation of $40.1 billion by 2030. If so, that would imply a CAGR of 32.2%. I mention this because even the mobility subsectors are signaling CAGRs of 30%-plus.\n\nDown the line, this could be a huge opportunity for stakeholders of MBLY stock. Let’s get the bad news out of the way first. Shares have been volatile this year, down nearly 32% year-to-date. Some of the bearish sentiment may be tied to fiscal 2024 sales projections. The consensus target calls for a print of $1.89 billion. That implies a 9.1% decrease from the prior year – not good.\n\nOkay, here’s the good news. By the end of fiscal 2025, sales could soar to $2.62 billion. That would imply a 38.6% growth rate (admittedly from the lowered expectation of fiscal 2024). Further, the blue-sky target calls for $2.76 billion.\n\nIn terms of risk reward, MBLY stock trades at 12.23X trailing-year sales. That’s well below the year-ago quarter’s print of 15.94X. It’s something to think about.\n\niRobot (IRBT) iRobot (IRBT) Roomba vacuum cleaner robots powerful cleaning system with intelligent sensors to clean Pet hair, crumbs, dirt, and daily dust\n\nSource: Karolis Kavolelis / Shutterstock.com\n\nPerhaps the riskiest idea on this list of automation stocks to buy, iRobot (NASDAQ:IRBT) falls under the consumer tech segment of the hands-free ecosystem. What’s more, the sector appears to be enticing. According to Grand View Research, the global robotic vacuum cleaner market size reached a valuation of $4.48 billion in 2021. Between 2022 to 2030, the sector could expand at a CAGR of 23.4%, resulting in industry sales of $29.82 billion.\n\nThat’s the good news. However, the not-so-pleasant side of the coin is iRobot’s projected sales for fiscal 2024. Covering experts anticipate that the top line will slip to $836.64 million, down 6.1% from last year’s haul of $890.58 million. Sure, the most optimistic target calls for $839.82 million but that’s not much better. Not only that, fiscal 2025 sales is only projected to hit $848.31 million. So, the trend isn’t great.\n\nUnsurprisingly, analysts are pensive about IRBT, rating shares a consensus hold. However, the most recent price target calls for $14, which implies 52% upside potential. It’s not impossible for iRobot to get there, considering the brand awareness and the projected growth of the sector.\n\nStill, I’d save IRBT as a speculation only type of play.\n\nOn the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nA former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 7 Automation Stocks to Propel Your Portfolio to Profits appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/7-automation-stocks-propel-portfolio-191513177.html",
        "symbols": [
            "0KXA.LSE",
            "0R29.LSE",
            "HON.US",
            "I1SR34.SA",
            "I8R.BE",
            "I8R.MU",
            "I8R.STU",
            "IRBT.US",
            "ISRG.US",
            "IUI1.BE",
            "IUI1.DU",
            "IUI1.F",
            "IUI1.HM",
            "IUI1.MU",
            "IUI1.STU",
            "MBLY.US",
            "ROK.US",
            "RWL.BE"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.033,
            "neu": 0.84,
            "pos": 0.128
        }
    },
    {
        "date": "2024-06-17T11:54:16+00:00",
        "title": "Reasons Why Mar Vista Sold Honeywell International (HON)",
        "content": "Mar Vista Investment Partners, LLC, an investment management company, released the “Mar Vista Focus strategy” first quarter 2024 investor letter. A copy of the letter can be downloaded here. The S&P 500 index had the best first-quarter performance since 2019—enthusiasm over AI, robust corporate earnings, and anticipation of rate cuts fueling the rise in stock prices. The strategy returned +5.53% net-of-fees in the first quarter compared to +11.41% and +10.56% returns of the Russell 1000 Growth Index and the S&P 500 indexes. Kindly check the top 5 stocks of the strategy to know its best picks in 2024.\n\nMar Vista Focus strategy highlighted stocks like Honeywell International Inc. (NASDAQ:HON), in the first quarter 2024 investor letter. Honeywell International Inc. (NASDAQ:HON) engages in aerospace technologies, building automation, energy and sustainable solutions, and industrial automation businesses. The one-month return of Honeywell International Inc. (NASDAQ:HON) was 1.91%, and its shares gained 2.74% of their value over the last 52 weeks. On June 14, 2024, Honeywell International Inc. (NASDAQ:HON) stock closed at $208.53 per share with a market capitalization of $135.792 billion.\n\nMar Vista Focus strategy stated the following regarding Honeywell International Inc. (NASDAQ:HON) in its first quarter 2024 investor letter:\n\n\"After nearly 14 years of owning shares in Honeywell International Inc. (NASDAQ:HON), we decided to sell our investment during the quarter. This decision was based on a combination of issues that threatened our investment thesis for the company. The main challenges were related to organic growth and capital deployment. Specifically, we have concerns about Honeywell's future organic growth and its indecisive approach to capital deployment. Even with a strong balance sheet, cash surplus, and low leverage, its capital deployment process lacks direction. Additionally, Honeywell is heavily invested in cyclical and short-cycle businesses which can be volatile. For these reasons, we sold our investment in Honeywell.\" aero vehicle\n\nCopyright: chalabala / 123RF Stock Photo\n\nHoneywell International Inc. (NASDAQ:HON) is not on our list of 31 Most Popular Stocks Among Hedge Funds. As per our database, 52 hedge fund portfolios held Honeywell International Inc. (NASDAQ:HON) at the end of the first quarter which was 55 in the previous quarter. While we acknowledge the potential of Honeywell International Inc. (NASDAQ:HON) as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is as promising as NVIDIA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nStory continues\n\nIn addition, please check out our hedge fund investor letters Q1 2024 page for more investor letters from hedge funds and other leading investors.\n\nREAD NEXT: Michael Burry Is Selling These Stocks and A New Dawn Is Coming to US Stocks.\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/reasons-why-mar-vista-sold-115416629.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.973,
            "neg": 0.017,
            "neu": 0.891,
            "pos": 0.092
        }
    },
    {
        "date": "2024-06-17T00:00:00+00:00",
        "title": "7 Automation Stocks to Propel Your Portfolio to Profits",
        "content": "Automation stocks can be a tricky subject fundamentally speaking. With advances in artificial intelligence combined with enhanced connectivity – as in the Internet of Things or IoT – machines can end up taking over human jobs. It’s not an insignificant dilemma. I mean, historically, the underlying disparity sparked a massive ideological divide between socialism and&hellip;",
        "link": "https://investorplace.com/2024/06/7-automation-stocks-to-propel-your-portfolio-to-profits/",
        "symbols": [
            "GOOG.US",
            "GOOGL.US",
            "HON.US",
            "ISRG.US",
            "MBLY.US",
            "ROK.US",
            "SYK.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.479,
            "neg": 0.029,
            "neu": 0.868,
            "pos": 0.103
        }
    }
]