[
    {
        "date": "2024-07-24T21:22:00+00:00",
        "title": "Investors Hope Honeywell Results Signal End to Manufacturing’s Inventory Pain",
        "content": "The company reports second-quarter numbers on Thursday morning. Wall Street is looking for earnings per share of $2.42 from sales of $9.4 billion.\n\nContinue reading\n\nView comments()",
        "link": "https://finance.yahoo.com/m/37aed39e-6a69-3c82-ac62-8bc26631a9cf/investors-hope-honeywell.html",
        "symbols": [
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.296,
            "neg": 0,
            "neu": 0.922,
            "pos": 0.078
        }
    },
    {
        "date": "2024-07-24T13:02:00+00:00",
        "title": "The Zacks Analyst Blog Highlights S&amp;P Global, Honeywell International, Elevance Health and Sypris Solutions",
        "content": "For Immediate Release\n\nChicago, IL – July 24, 2024 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: S&P Global Inc. SPGI, Honeywell International Inc. HON, Elevance Health, Inc. ELV and Sypris Solutions, Inc. SYPR.\n\nHere are highlights from Tuesday’s Analyst Blog:\n\nQ2 Earnings Scorecard and Today's Analyst Reports for SPGI, HON, ELV & More\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features a real-time update on the Q2 earnings season and new research reports on 16 major stocks, including S&P Global Inc., Honeywell International Inc. and Elevance Health, Inc., as well a micro-cap stock Sypris Solutions, Inc.. The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\r\n\r\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\r\n\r\nYou can see all of today's research reports here >>>\r\n\r\nQ2 Earnings Season Scorecard\n\nIncluding this morning's releases from Coke, UPS, GM and others, we now have Q2 results from 103 S&P 500 members or 20.6% of the index's total membership. Total earnings for these companies are up +6.8% from the same period last year on +3.5% higher revenues, with 82.5% beating EPS estimates and 59.2% beating revenue estimates.\n\nComparing the Q2 results from these companies relative to what we had seen from the same group of 103 companies in other recent periods, we find\n\n- The Q2 EPS beats percentage of 82.5% compares to 79.6% in each of the preceding two periods and the average for the preceding 20-quarters (5 years) of 79.8%.\n\n- The Q2 revenue beats percentage of 59.2% compares to 66% and 68% for this group of 103 index members in 2024 Q1 and 2023 Q4, respectively. The 20-quarter average for this group of companies is 70.6%. This means that companies continue to struggle to beat revenue estimates.\n\n- With respect to the growth rates, the earnings growth rate of +6.8% for this group of 103 companies is up from +6.3% in 2024 Q1, -0.7% in 2023 Q4, +2.5% in 2023 Q3, +0.4% in 2023 Q2 and so on. In other words, an accelerating growth trend on the earnings front.\n\n- With respect to revenues, the Q2 revenue growth rate of +3.5% is down from +4% in 2024 Q1, +3.1% in 2023 Q4, +4.5% in 2023 Q3 and so on.\n\nStory continues\n\nLooking at Q2 as a whole, combining the actuals that have come out with estimates for the still-to-come companies, total earnings are expected to be up +9.2% from the same period last year on +4.9% higher revenues, which will be the highest earnings growth pace since the +10% earnings growth rate in 2022 Q1.\n\nToday's Featured Analyst Reports\n\nS&P Global shares have outperformed the Zacks Business - Information Services industry over the past year (+15.3% vs. +12.8%). The company remains well-poised to gain from the growing demand for business information services. Buyouts help innovate, increase differentiated content and develop new products.\r\n\r\nNew service launches have been aiding the company's growth. Dividend payments and share buybacks boost investors' confidence and positively impact earnings per share.\r\n\r\nHowever, S&P Global remains vulnerable to proceedings, investigations and inquiries concerning the ratings provided, leading to legal charges, damages or fines. Growth initiatives, higher compensations and incentives raise the company's expenses.\r\n\r\n(You can read the full research report on S&P Global here >>>)\r\n\r\nShares of Honeywell have outperformed the Zacks Diversified Operations industry over the year-to-date period (+3.3% vs. -4.4%). The company's strength in the commercial aviation, building automation and UOP businesses augurs well. The Aerospace segment is particularly strong, driven by robust demand in the aviation aftermarket.\r\n\r\nA strong commercial aftermarket and solid commercial aviation demand, led by strength in the air transport aftermarket, are aiding the Aerospace segment. Handsome rewards to shareholders add to the stock's appeal. The ability to generate strong free cash flow supports its shareholder-friendly activities.\r\n\r\nThe company's commercial and operational excellence initiatives, along with its pricing actions, enable it to maintain a healthy margin performance. While acquisitions have expanded its product range and geographic reach, they have increased Honeywell's balance sheet debt as well. Foreign currency translation remains an overhang.\r\n\r\n(You can read the full research report on Honeywell here >>>)\r\n\r\nElevance Health shares have outperformed the Zacks Medical Services industry over the past year (+7.0% vs. +2.0%). The company beat earnings estimates by 1.3% in the second quarter. Its revenue growth, fueled by premium rate increases and rising memberships, contributes to its positive trajectory.\r\n\r\nStrategic acquisitions and partnerships have fortified its business portfolio. A robust Medicare Advantage segment, combined with successful contract acquisitions, is poised to drive future memberships. It reaffirmed the 2024 earnings guidance to $37.20 per share. The Carelon business is a key contributor to its success. ELV utilizes excess capital to boost shareholder value.\r\n\r\nHowever, its rising expenses continue to put pressure on margins. Its high balance sheet debt is reducing financial flexibility. Also, its declining free cash flow is a concern. As such, the stock warrants a cautious stance.\r\n\r\n(You can read the full research report on Elevance Health here >>>)\r\n\r\nShares of Sypris Solutions have outperformed the Zacks Electronics - Miscellaneous Services industry over the past year (+3.8% vs. -8.8%). This microcap company with market capitalization of $42.81 million has secured a long-term, sole-source contract extension with a major commercial vehicle manufacturer for Ultra Axle Shafts, ensuring stable revenues and reinforcing its industry reputation.\r\n\r\nSypris Solutions' Sypris Electronics unit is also expanding in the electronic warfare market with additional U.S. Navy contracts, enhancing defense capabilities against threats. Sypris' strong position in the growing aerospace and defense electronics markets supports sustained revenue growth. Financial stability is bolstered by an improved cash balance. A significant backlog provides revenue visibility and supports financial planning.\r\n\r\nHowever, the company faces challenges with net losses widening to $2.2 million in Q1 2024 and reduced profit margins. Rising operating expenses, high debt levels and competitive pressures also pose risks.\r\n\r\n(You can read the full research report on Sypris Solutions here >>>)\n\nWhy Haven't You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.0 average gain per year. Amazingly, they soared with average gains of +44.9%, +48.4% and +55.2% per year.\n\nToday you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nS&P Global Inc. (SPGI) : Free Stock Analysis Report\n\nSypris Solutions, Inc. (SYPR) : Free Stock Analysis Report\n\nElevance Health, Inc. (ELV) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments()",
        "link": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-p-130200131.html",
        "symbols": [
            "0HG8.LSE",
            "0KYY.LSE",
            "A58.F",
            "A58.STU",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "ELV.US",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "MHL.BE",
            "MHL.DU",
            "MHL.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.034,
            "neu": 0.802,
            "pos": 0.164
        }
    },
    {
        "date": "2024-07-24T09:31:30+00:00",
        "title": "Foxconn to invest $138 million for new business headquarters in China",
        "content": "Taiwan's Foxconn, the world's largest contract electronics maker and Apple's biggest iPhone assembler, said on Wednesday it plans to invest 1 billion yuan ($137.5 million) to construct a new business headquarters in Zhengzhou, China.",
        "link": "https://www.reuters.com/technology/foxconn-invest-1-bln-yuan-new-business-headquarters-china-2024-07-24/",
        "symbols": [
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0,
            "neg": 0,
            "neu": 1,
            "pos": 0
        }
    },
    {
        "date": "2024-07-24T07:25:44+00:00",
        "title": "Honeywell (HON) To Report Earnings Tomorrow: Here Is What To Expect",
        "content": "Honeywell (HON) To Report Earnings Tomorrow: Here Is What To Expect\n\nIndustrial conglomerate Honeywell (NASDAQ:HON) will be reporting earnings tomorrow before market hours. Here's what to look for.\n\nHoneywell met analysts' revenue expectations last quarter, reporting revenues of $9.11 billion, up 2.7% year on year. It was a very strong quarter for the company, with a solid beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates.\n\nIs Honeywell a buy or sell going into earnings? Read our full analysis here, it's free.\n\nThis quarter, analysts are expecting Honeywell's revenue to grow 3% year on year to $9.42 billion, in line with the 2.2% increase it recorded in the same quarter last year. Adjusted earnings are expected to come in at $2.42 per share. Honeywell Total Revenue\n\nAnalysts covering the company have generally reconfirmed their estimates over the last 30 days, suggesting they anticipate the business to stay the course heading into earnings. Honeywell has missed Wall Street's revenue estimates five times over the last two years.\n\nLooking at Honeywell's peers in the industrial machinery segment, some have already reported their Q2 results, giving us a hint as to what we can expect. General Electric's revenues decreased 42.6% year on year, beating analysts' expectations by 6.4%, and Worthington reported a revenue decline of 13.6%, falling short of estimates by 9.6%. Worthington traded down 3.4% following the results.\n\nRead our full analysis of General Electric's results here and Worthington's results here.\n\nThere has been positive sentiment among investors in the industrial machinery segment, with share prices up 8.3% on average over the last month. Honeywell is up 1.4% during the same time and is heading into earnings with an average analyst price target of $230.2 (compared to the current share price of $217.38).\n\nWhen a company has more cash than it knows what to do with, buying back its own shares can make a lot of sense–as long as the price is right. Luckily, we’ve found one, a low-priced stock that is gushing free cash flow AND buying back shares. Click here to claim your Special Free Report on a fallen angel growth story that is already recovering from a setback.\n\nView comments()",
        "link": "https://finance.yahoo.com/news/honeywell-hon-report-earnings-tomorrow-072544586.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "GCP.F",
            "GCP.XETRA",
            "GE.MX",
            "GE.US",
            "GEC.LSE",
            "GEOO34.SA",
            "GNE.PA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.984,
            "neg": 0.024,
            "neu": 0.865,
            "pos": 0.111
        }
    }
]