[
    {
        "date": "2024-09-17T22:15:19+00:00",
        "title": "Honeywell International Inc. (HON) Stock Falls Amid Market Uptick: What Investors Need to Know",
        "content": "In the latest market close, Honeywell International Inc. (HON) reached $204.24, with a -0.21% movement compared to the previous day. The stock fell short of the S&P 500, which registered a gain of 0.03% for the day. At the same time, the Dow lost 0.04%, and the tech-heavy Nasdaq gained 0.2%.\n\nThe the stock of company has risen by 2.83% in the past month, leading the Conglomerates sector's loss of 8.79% and the S&P 500's gain of 1.54%.\n\nThe upcoming earnings release of Honeywell International Inc. will be of great interest to investors. On that day, Honeywell International Inc. is projected to report earnings of $2.52 per share, which would represent year-over-year growth of 11.01%. In the meantime, our current consensus estimate forecasts the revenue to be $9.9 billion, indicating a 7.51% growth compared to the corresponding quarter of the prior year.\n\nLooking at the full year, the Zacks Consensus Estimates suggest analysts are expecting earnings of $10.14 per share and revenue of $39.11 billion. These totals would mark changes of +10.7% and +6.69%, respectively, from last year.\n\nFurthermore, it would be beneficial for investors to monitor any recent shifts in analyst projections for Honeywell International Inc. These revisions help to show the ever-changing nature of near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.\n\nResearch indicates that these estimate revisions are directly correlated with near-term share price momentum. To exploit this, we've formed the Zacks Rank, a quantitative model that includes these estimate changes and presents a viable rating system.\n\nThe Zacks Rank system, which varies between #1 (Strong Buy) and #5 (Strong Sell), carries an impressive track record of exceeding expectations, confirmed by external audits, with stocks at #1 delivering an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed a 0.14% decrease. Honeywell International Inc. presently features a Zacks Rank of #3 (Hold).\n\nLooking at valuation, Honeywell International Inc. is presently trading at a Forward P/E ratio of 20.19. This expresses a premium compared to the average Forward P/E of 18.69 of its industry.\n\nWe can also see that HON currently has a PEG ratio of 2.33. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The Diversified Operations industry had an average PEG ratio of 1.76 as trading concluded yesterday.\n\nStory continues\n\nThe Diversified Operations industry is part of the Conglomerates sector. This group has a Zacks Industry Rank of 40, putting it in the top 16% of all 250+ industries.\n\nThe Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nRemember to apply Zacks.com to follow these and more stock-moving metrics during the upcoming trading sessions.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-international-inc-hon-stock-221519275.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "GSPC.INDX",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.01,
            "neu": 0.872,
            "pos": 0.117
        }
    },
    {
        "date": "2024-09-17T12:00:00+00:00",
        "title": "HONEYWELL AND SAMSUNG E&amp;A PLAN COLLABORATION TO HELP REDUCE POWER PLANT EMISSIONS",
        "content": "Agreement aims to provide customers a carbon capture solution for power plants from \r\ntwo leading energy solution providers\n\nCHARLOTTE, N.C., Sept. 17, 2024 /PRNewswire/ -- Honeywell (Nasdaq: HON) announced today a collaborative endeavor with SAMSUNG E&A to jointly market solutions aimed at the hard-to-abate power plant sector globally. The initiative seeks to reduce carbon emissions and contribute to the fight against climate change. It also supports Honeywell's alignment of its portfolio to three powerful megatrends, including the energy transition. Honeywell Sensing and Productivity Solutions logo (PRNewsFoto/Honeywell) (PRNewsfoto/Honeywell)\n\nSAMSUNG E&A, a total solutions provider for the global energy industry, will leverage Honeywell's industry-leading carbon capture technologies to help power plants reduce carbon emissions and meet environmental goals. Together, the companies will offer customers access to a carbon capture solution by jointly marketing Honeywell's advanced solvent carbon capture (ASCC) technology.\n\n\"As two carbon capture leaders, our collaboration highlights the importance of cooperative approaches in reducing greenhouse gas emissions,\" said Hong Namkoong, president and CEO of SAMSUNG E&A. \"Deploying Honeywell's carbon capture technologies allows SAMSUNG E&A to offer viable, more sustainable solutions for global clients during this energy transition.\"\n\nCarbon capture, utilization, and storage (CCUS) can significantly reduce carbon dioxide (CO2) emissions, acting as a crucial stopgap during the expected transition from fossil fuels to lower-carbon energy sources. These technologies help to mitigate the environmental impact of various industries responsible for greenhouse gas emissions.\n\n\"Honeywell has long been a global leader in carbon capture technologies and our collaboration with SAMSUNG E&A only further highlights our commitment to reducing emissions and tackling climate challenges,\" said Ken West, president and CEO of Honeywell Energy and Sustainability Solutions. \"With decades of experience and a broad portfolio of carbon capture solutions, we are ready to help businesses meet growing carbon mitigation expectations and increasingly stringent environment goals by abating emissions from existing sources.\"\n\nHoneywell's CCUS technologies have been developed and deployed in numerous applications globally. Between 2023 and 2030, Honeywell estimates that the company's CCUS technologies will have a cumulative impact of mitigating 320 million metric tons of CO2e.1\n\nFor more information on Honeywell's CCUS technologies, visit https://uop.honeywell.com/en/energy-transition/carbon-capture.\n\nStory continues\n\nAbout Honeywell\n\nHoneywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Forge IoT platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world smarter, safer and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nAbout SAMSUNG E&A\n\nSAMSUNG E&A is a total solutions provider, offers comprehensive solutions in areas ranging from project development, engineering, procurement, construction and commissioning to O&M, taking the lead in the global energy industry such as energy transition, oil-gas processing, refinery, petrochemical, environmental, industrial and bio. SAMSUNG E&A has delivered exceptional customer-oriented services, completing over 1,500 projects worldwide in regions such as the Middle East, Asia, Americas and Europe. For more news and information on SAMSUNG E&A, please visit https://www.samsungena.com/en/index.\n\n1 Methodology for estimating GHG mitigation impact is available at investor.honeywell.com (see \"ESG/ESG Information/GHG Mitigation Impact of Honeywell Technologies\"). This estimate is based on current and projected licenses of Honeywell UOP Separex, ASCC and Blue hydrogen technologies for capture of carbon dioxide from process gases and waste gas streams and expected plant start-up dates. Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-and-samsung-ea-plan-collaboration-to-help-reduce-power-plant-emissions-302250037.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-samsung-e-plan-collaboration-120000404.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.01,
            "neu": 0.831,
            "pos": 0.159
        }
    }
]