[
    {
        "date": "2024-10-10T07:55:54+00:00",
        "title": "General Industrial Machinery Stocks Q2 Recap: Benchmarking Honeywell (NASDAQ:HON)",
        "content": "General Industrial Machinery Stocks Q2 Recap: Benchmarking Honeywell (NASDAQ:HON)\n\nQuarterly earnings results are a good time to check in on a company’s progress, especially compared to its peers in the same sector. Today we are looking at Honeywell (NASDAQ:HON) and the best and worst performers in the general industrial machinery industry.\n\nAutomation that increases efficiency and connected equipment that collects analyzable data have been trending, creating new demand for general industrial machinery companies. Those who innovate and create digitized solutions can spur sales and speed up replacement cycles, but all general industrial machinery companies are still at the whim of economic cycles. Consumer spending and interest rates, for example, can greatly impact the industrial production that drives demand for these companies’ offerings.\n\nThe 14 general industrial machinery stocks we track reported a mixed Q2. As a group, revenues beat analysts’ consensus estimates by 9.3% while next quarter’s revenue guidance was 4% below.\n\nInflation progressed towards the Fed's 2% goal recently, leading the Fed to reduce its policy rate by 50bps (half a percent or 0.5%) in September 2024. This is the first cut in four years. While CPI (inflation) readings have been supportive lately, employment measures have bordered on worrisome. The markets will be debating whether this rate cut's timing (and more potential ones in 2024 and 2025) is ideal for supporting the economy or a bit too late for a macro that has already cooled too much.\n\nWhile some general industrial machinery stocks have fared somewhat better than others, they have collectively declined. On average, share prices are down 2.3% since the latest earnings results.\n\nHoneywell (NASDAQ:HON)\n\nOriginally founded in 1906 as a thermostat company, Honeywell (NASDAQ:HON) is an aerospace and defense manufacturing company building technologies, performance materials, and safety and productivity solutions.\n\nHoneywell reported revenues of $9.58 billion, up 4.7% year on year. This print exceeded analysts’ expectations by 1.7%. Overall, it was a very strong quarter for the company with an impressive beat of analysts’ organic revenue and operating margin estimates.\n\n\"Honeywell delivered a strong second quarter, once again meeting or exceeding guidance across all metrics while maneuvering through a dynamic operating environment,\" said Vimal Kapur, chairman and chief executive officer of Honeywell. Honeywell Total Revenue\n\nHoneywell achieved the highest full-year guidance raise of the whole group. Investor expectations, however, were likely higher than Wall Street’s published projections, leaving some wishing for even better results (analysts’ consensus estimates are those published by big banks and advisory firms, not the investors who make buy and sell decisions). The stock is down 2.7% since reporting and currently trades at $207.95.\n\nStory continues\n\nIs now the time to buy Honeywell? Access our full analysis of the earnings results here, it’s free.\n\nBest Q2: 3M (NYSE:MMM)\n\nProducers of the first asthma inhaler, 3M Company (NYSE:MMM) is a global conglomerate known for products in industries like healthcare, safety, electronics, and consumer goods.\n\n3M reported revenues of $6.02 billion, down 24.7% year on year, outperforming analysts’ expectations by 3.3%. The business had an exceptional quarter with an impressive beat of analysts’ operating margin estimates and a solid beat of analysts’ organic revenue estimates. 3M Total Revenue\n\nThe market seems happy with the results as the stock is up 30% since reporting. It currently trades at $134.38.\n\nIs now the time to buy 3M? Access our full analysis of the earnings results here, it’s free.\n\nWeakest Q2: Hillenbrand (NYSE:HI)\n\nHillenbrand, Inc. (NYSE: HI) is an industrial company that designs, manufactures, and sells highly engineered processing equipment and solutions for various industries.\n\nHillenbrand reported revenues of $786.6 million, up 9.8% year on year, falling short of analysts’ expectations by 3.9%. It was a disappointing quarter as it posted full-year revenue guidance missing analysts’ expectations and a miss of analysts’ earnings estimates.\n\nHillenbrand delivered the weakest full-year guidance update in the group. As expected, the stock is down 27.2% since the results and currently trades at $27.69.\n\nRead our full analysis of Hillenbrand’s results here.\n\nDover (NYSE:DOV)\n\nA company who manufactured critical equipment for the United States military during World War II, Dover (NYSE:DOV) manufactures engineered components and specialized equipment for numerous industries.\n\nDover reported revenues of $2.18 billion, up 3.7% year on year. This number surpassed analysts’ expectations by 1.4%. Overall, it was a very strong quarter as it also recorded an impressive beat of analysts’ operating margin estimates and a solid beat of analysts’ organic revenue estimates.\n\nThe stock is up 5% since reporting and currently trades at $185.20.\n\nRead our full, actionable report on Dover here, it’s free.\n\nCrane Company (NYSE:CR)\n\nBased in Connecticut, Crane Company (NYSE:CR) is a diversified manufacturer of engineered industrial products, including fluid handling, and aerospace technologies.\n\nCrane Company reported revenues of $581.2 million, up 14.1% year on year. This print topped analysts’ expectations by 2.3%. Overall, it was a very strong quarter as it also produced a solid beat of analysts’ organic revenue estimates and a decent beat of analysts’ operating margin estimates.\n\nThe stock is down 2% since reporting and currently trades at $156.41.\n\nRead our full, actionable report on Crane Company here, it’s free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/general-industrial-machinery-stocks-q2-075554153.html",
        "symbols": [
            "9HI.F",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "CR.US",
            "DOV.US",
            "HI.US",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "MMM.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.04,
            "neu": 0.803,
            "pos": 0.157
        }
    }
]