[
    {
        "date": "2024-10-01T22:15:19+00:00",
        "title": "Honeywell International Inc. (HON) Stock Moves -0.31%: What You Should Know",
        "content": "The most recent trading session ended with Honeywell International Inc. (HON) standing at $206.07, reflecting a -0.31% shift from the previouse trading day's closing. The stock's performance was ahead of the S&P 500's daily loss of 0.93%. At the same time, the Dow lost 0.41%, and the tech-heavy Nasdaq lost 1.53%.\n\nComing into today, shares of the company had lost 0.58% in the past month. In that same time, the Conglomerates sector gained 9.85%, while the S&P 500 gained 2.17%.\n\nInvestors will be eagerly watching for the performance of Honeywell International Inc. in its upcoming earnings disclosure. The company's earnings report is set to be unveiled on October 24, 2024. The company is expected to report EPS of $2.52, up 11.01% from the prior-year quarter. Simultaneously, our latest consensus estimate expects the revenue to be $9.9 billion, showing a 7.51% escalation compared to the year-ago quarter.\n\nFor the annual period, the Zacks Consensus Estimates anticipate earnings of $10.14 per share and a revenue of $39.1 billion, signifying shifts of +10.7% and +6.66%, respectively, from the last year.\n\nAny recent changes to analyst estimates for Honeywell International Inc. should also be noted by investors. These revisions typically reflect the latest short-term business trends, which can change frequently. Therefore, positive revisions in estimates convey analysts' confidence in the company's business performance and profit potential.\n\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. To benefit from this, we have developed the Zacks Rank, a proprietary model which takes these estimate changes into account and provides an actionable rating system.\n\nThe Zacks Rank system, stretching from #1 (Strong Buy) to #5 (Strong Sell), has a noteworthy track record of outperforming, validated by third-party audits, with stocks rated #1 producing an average annual return of +25% since the year 1988. Over the last 30 days, the Zacks Consensus EPS estimate has moved 0.14% lower. Honeywell International Inc. is holding a Zacks Rank of #3 (Hold) right now.\n\nIn terms of valuation, Honeywell International Inc. is currently trading at a Forward P/E ratio of 20.39. This expresses a premium compared to the average Forward P/E of 18.94 of its industry.\n\nIt's also important to note that HON currently trades at a PEG ratio of 2.35. The PEG ratio bears resemblance to the frequently used P/E ratio, but this parameter also includes the company's expected earnings growth trajectory. As the market closed yesterday, the Diversified Operations industry was having an average PEG ratio of 1.92.\n\nStory continues\n\nThe Diversified Operations industry is part of the Conglomerates sector. This group has a Zacks Industry Rank of 53, putting it in the top 22% of all 250+ industries.\n\nThe Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nTo follow HON in the coming trading sessions, be sure to utilize Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-international-inc-hon-stock-221519506.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "GSPC.INDX",
            "HON.MX",
            "HON.NEO",
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.988,
            "neg": 0.014,
            "neu": 0.901,
            "pos": 0.085
        }
    },
    {
        "date": "2024-10-01T18:00:00+00:00",
        "title": "Time to Buy These 4 Stocks With Risking Dividend Yields?",
        "content": "Wall Street is back in rally and ended September on a high after a rough start to what is historically considered the worst month for stocks. The Federal Reserve’s jumbo rate cut has also fueled the stock market rally.\n\nHowever, concerns remain about the economy's health, which saw consumer confidence decline in September. Given this situation, cautious investors looking for a steady income and preservation of their capital may want to continue holding or buying dividend-paying stocks. Four such stocks are Honeywell International Inc. HON, Accenture plc ACN, City Holding Company CHCO and First United Corporation FUNC.\n\nWall Steet Rallies After Rate Cuts\n\nWall Street had a choppy start to September after fears were reignited that the economy was slowing and the Federal Reserve may have delayed too long to start its easing cycle. However, stocks rebounded after fresh economic data showed that inflation declined further in August.\n\nAlso, the Federal Reserve finally announced a half-percentage point rate cut in its September policy meeting. Stocks have since been on a rally. On Monday, the rally was fueled by comments from Federal Reserve Chairman Jerome Powell, who said that more rate cuts could be coming. On Monday, the S&P 500 closed at a new record high of 5,762.48 points.\n\nSeptember has historically been the worst month for Wall Street but stock markets defied the norm this year. The S&P 500, the Dow and the Nasdaq closed higher by 2%, 1.9% and 2.7%, respectively, for the month.\n\nSinking Consumer Confidence Could Make Stock Markets Volatile\n\nAlthough stocks have been performing well, concerns remain about the economy’s health. Market participants were expecting a 25-basis-point rate cut by the Fed in September. Many have been viewing the Fed’s decision to cut rates by 50 basis points as an aggressive step to help the economy make a soft landing.\n\nConcerns over a slowing economy saw consumer confidence drop to 98.7 in September from an upwardly revised 105.6 in August to its lowest level in three years.\n\nGiven this situation, it would thus be ideal to invest in dividend stocks. These companies, with their solid operations, consistently deliver dividends and stay profitable thanks to their dependable business models. In a market with high volatility, companies that provide substantial dividend payouts often perform better than those that do not offer dividends.\n\nDividend Paying Stocks Are a Safe Bet\n\nHoneywell International Inc.\n\nHoneywell International Inc. is a global diversified technology and manufacturing company, with a wide range of products and services. HON's diversified portfolio of solutions serves customers globally with aerospace products and services, energy-efficient products and solutions for businesses, and process technology, specialty chemicals, electronic and advanced materials for refining and petrochemicals. Honeywell International has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nOn Sept. 27, Honeywell International announced that its shareholders would receive a dividend of $1.13 a share on Dec. 6, 2024. HON has a dividend yield of 2.08%. Over the past five years, Honeywell International has increased its dividend six times, and its payout ratio at present sits at 45% of earnings. Check Honeywell International’s dividend history here.\n\nHoneywell International Inc. Dividend Yield (TTM) Honeywell International Inc. Dividend Yield (TTM)\n\nHoneywell International Inc. dividend-yield-ttm | Honeywell International Inc. Quote\n\nAccenture plc\n\nAccenture plc’s years of investment in digital, cloud and security strategy have helped it evolve as a trusted and viable consulting services provider. ACN is currently one of the top consultancy firms in the world by revenues that increased 4% in fiscal 2023 with a contribution of 52% from consulting services. Accenture has a Zacks Rank #3.\n\nOn Sept. 26, Accenture declared that its shareholders would receive a dividend of $1.48 a share on Nov. 15, 2024. ACN has a dividend yield of 1.48%. Over the past five years, Accenture has increased its dividend six times, and its payout ratio at present sits at 43% of earnings. Check Accenture’s dividend history here.\n\nAccenture PLC Dividend Yield (TTM) Accenture PLC Dividend Yield (TTM)\n\nAccenture PLC dividend-yield-ttm | Accenture PLC Quote\n\nCity Holding Company\n\nCity Holding Company is a multi-bank holding company that provides diversified financial products and services to consumers and local businesses. CHCO carries a Zacks Rank #2 (Buy).\n\nOn Sept. 25, City Holding Company announced that its shareholders would receive a dividend of $0.79 a share on Oct. 31, 2024. CHCO has a dividend yield of 2.45%. Over the past five years, City Holding Company has increased its dividend six times, and its payout ratio at present sits at 37% of earnings. Check City Holding Company’s dividend history here.\n\nCity Holding Company Dividend Yield (TTM) City Holding Company Dividend Yield (TTM)\n\nCity Holding Company dividend-yield-ttm | City Holding Company Quote\n\nFirst United Corporation\n\nFirst United Corporation is a one-bank holding company with two non-bank subsidiaries. FUNC carries a Zacks Rank #3.\n\nOn Sept. 25, First United Corporation declared that its shareholders would receive a dividend of $0.22 a share on Nov. 1, 2024. FUNC has a dividend yield of 2.69%. Over the past five years, First United Corporation has increased its dividend five times, and its payout ratio at present sits at 28% of earnings. Check First United Corporation’s dividend history here.\n\nFirst United Corporation Dividend Yield (TTM) First United Corporation Dividend Yield (TTM)\n\nFirst United Corporation dividend-yield-ttm | First United Corporation Quote\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAccenture PLC (ACN) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nCity Holding Company (CHCO) : Free Stock Analysis Report\n\nFirst United Corporation (FUNC) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/time-buy-4-stocks-risking-180000932.html",
        "symbols": [
            "0Y0Y.LSE",
            "ACN.US",
            "ACNB34.SA",
            "ACNN.MX",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "CHCO.US",
            "CSA.BE",
            "CSA.F",
            "CSA.STU",
            "GSPC.INDX",
            "HON.MX",
            "HON.NEO",
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.027,
            "neu": 0.826,
            "pos": 0.147
        }
    },
    {
        "date": "2024-10-01T16:32:58+00:00",
        "title": "Chevron, Honeywell Join Forces For AI Breakthrough: Details",
        "content": "Chevron, Honeywell Join Forces For AI Breakthrough: Details\n\nChevron Corporation (NYSE:CVX) announced a strategic collaboration with Honeywell International Inc. (NASDAQ:HON) to develop advanced artificial intelligence (AI)-assisted solutions.\n\nThe solution aims at enhancing decision-making for operators, improving efficiency in refining processes, and boosting safety within the industrial automation sector.\n\nThis partnership represents a major advancement in AI-assisted solutions for plant operators.\n\nThe two companies are collaborating to create a new generation of AI-assisted alarm management solutions that enhance the efficiency, safety, and reliability of process operations and industrial assets.\n\nThe Alarm Guidance application will provide operators with guided actions for responding to alarms and operational events, reducing lost profits and safety incidents.\n\nUsing AI, the system will analyze historical data to identify patterns between alarms and effective operator responses that restore normal operations.\n\nThrough this collaboration, Chevron’s operators will integrate AI into Honeywell’s Experion distributed control system (DCS), enhancing decision-making and optimizing operations for improved efficiency and workforce upskilling, in line with Honeywell’s focus on automation.\n\nAlso Read: John Hess Blocked From Joining Chevron Board As Part Of FTC Deal For Antitrust Approval Of $53B Chevron-Hess Merger: Report\n\nLucian Boldea President and CEO of Honeywell Industrial Automation said, “AI-Assisted automation is key to helping improve industrial plant performance while also addressing industry’s workforce shortage through institutional knowledge capture, workflow digitalization, and accelerating the learning curve for the next generation.”\n\nInvestors can gain exposure to the stock via EA Series Trust Strive U.S. Energy ETF (NYSE:DRLL) and SPDR Select Sector Fund – Energy Select Sector (NYSE:XLE).\n\nPrice Action: CVX shares are up 1.83% at $149.96 at the last check Tuesday.\n\nPhoto by Jonathan Weiss on Shutterstock\n\nRead Next:\n\nFTC Clears Chevron’s $53B Hess Merger, Sets Restriction For John Hess\n\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools. Click now to access unique insights that can set you ahead in today's competitive market.\n\nGet the latest stock analysis from Benzinga?\n\nCHEVRON (CVX): Free Stock Analysis Report\n\nThis article Chevron, Honeywell Join Forces For AI Breakthrough: Details originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nView comments",
        "link": "https://finance.yahoo.com/news/chevron-honeywell-join-forces-ai-163258191.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "CHEV.NEO",
            "CHV.BE",
            "CHV.DU",
            "CHV.F",
            "CHV.HM",
            "CHV.MU",
            "CHV.STU",
            "CHV.XETRA",
            "CHVX34.SA",
            "CVX.BA",
            "CVX.MX",
            "CVX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.043,
            "neu": 0.754,
            "pos": 0.204
        }
    },
    {
        "date": "2024-10-01T14:36:00+00:00",
        "title": "Honeywell Acquires Air Products' LNG Process Business for $1.81B",
        "content": "Honeywell International Inc. HON has completed the acquisition of Air Products and Chemicals, Inc.’s APD liquefied natural gas (LNG) process technology and equipment business for $1.81 billion in cash. This marks Honeywell’s fourth acquisition so far this year.\r\n\r\nHON’s shares lost 0.44% yesterday to eventually close the trading session at $206.71.\r\n\r\nHeadquartered in Pennsylvania, Air Products produces atmospheric, process and specialty gases for various industries, such as refining, chemicals and healthcare. Its LNG technology and equipment division is located in Allentown, PA. This division currently employs around 475 people.\n\nAcquisition Rationale of Honeywell\n\nThe recent acquisition aligns with Honeywell’s strategy of acquiring businesses to enhance its operations and expand its market presence. The inclusion of LNG process technology and equipment business expertise in in-house design and manufacturing of coil-wound heat exchangers and related equipment portfolio will boost its energy transition portfolio. This buyout will allow Honeywell to provide a more comprehensive solution for its customers’ energy transformation requirements.\r\n\r\nHoneywell’s energy transition solution will feature natural gas pre-treatment and advanced liquefaction, utilizing cutting-edge digital automation technologies from the Honeywell Forge and Experion platforms. This integrated solution will help customers manage their natural gas assets more easily and efficiently.\n\nOther Notable Buyouts of Honeywell\n\nHoneywell has been strengthening its business through acquisitions. In September 2024, HON acquired CAES Systems Holdings LLC (“CAES”) from private equity firm Advent. The transaction will augment its defense technology offerings across various domains, including land, sea, air and space.\r\n\r\nIn June 2024, the company acquired Carrier’s Global Access Solutions business for an all-cash deal of $4.95 billion. The inclusion of Global Access Solutions’ expertise in advanced access and security solutions, coupled with its impressive growth and margin profile, will enable Honeywell to expand its security products portfolio and boost its building automation segment. In March 2024, HON announced its plan to purchase Civitanavi Systems S.p.A. for about €200 million ($217 million) to boost its portfolio of aerospace navigation solutions.\n\nHON’s Zacks Rank\n\nStrength in the commercial aviation and building automation businesses augurs well for Honeywell. The Aerospace segment is particularly strong, driven by robust demand in the aviation aftermarket.\r\n\r\nIn the past year, this Zacks Rank #3 (Hold) company’s shares have gained 13.2% compared with the industry’s 21.3% growth.\n\nStory continues Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nHowever, weakness in the Industrial Automation segment due to lower demand for projects is worrisome. The weakened demand for personal protective equipment within the sensing and safety technologies business is also concerning.\n\nStocks to Consider\n\nSome better-ranked companies are discussed below.\r\n\r\nCarlisle Companies Incorporated CSL currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\r\n\r\nCSL delivered a trailing four-quarter average earnings surprise of 16.3%. In the past 60 days, the Zacks Consensus Estimate for Carlisle’s 2024 earnings has increased 1.7%.\r\n\r\nCrane Company CR presently carries a Zacks Rank of 2. The company delivered a trailing four-quarter average earnings surprise of 11.2%.\r\n\r\nIn the past 60 days, the Zacks Consensus Estimate for CR’s 2024 earnings has increased 2%.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAir Products and Chemicals, Inc. (APD) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nCarlisle Companies Incorporated (CSL) : Free Stock Analysis Report\n\nCrane Company (CR) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-acquires-air-products-lng-143600524.html",
        "symbols": [
            "0HBH.LSE",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "AP3.BE",
            "AP3.DU",
            "AP3.F",
            "AP3.MU",
            "AP3.STU",
            "APD.US",
            "HON.MX",
            "HON.NEO",
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.025,
            "neu": 0.788,
            "pos": 0.187
        }
    },
    {
        "date": "2024-10-01T12:12:03+00:00",
        "title": "Honeywell completes acquisition of Air Products’ LNG process tech for $1.81B",
        "content": "Honeywell announced the completion of its acquisition of Air Products’ liquefied natural gas, LNG, process technology and equipment business for $1.81 billion in an all-cash transaction. This further expands the comprehensive suite of top-tier solutions Honeywell offers its customers for managing their energy transformation journey. “The acquisition of Air Products’ LNG process technology and equipment business strengthens Honeywell’s energy transition portfolio and will enable our customers to manage their liquefied natural gas assets with greater efficiency and reliability,” said Ken West, President and CEO of Honeywell’s Energy and Sustainability Solutions segment. “With the integration of the LNG business, we will be able to provide a greater level of energy transition management from beginning to end through a full spectrum of scalable solutions.”\n\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\n\nSee the top stocks recommended by analysts >>\n\nRead More on HON:\n\nHoneywell boosts annual dividend to $4.52 from $4.32 per share SPX Technologies appoints Carpenter as CHRO Honeywell to develop AI-enabled agent powered by Qualcomm Honeywell and Samsung E&A partnering to reduce power plant emissions Honeywell initiated with an Equal Weight at Morgan Stanley\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-completes-acquisition-air-products-121203622.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.984,
            "neg": 0,
            "neu": 0.811,
            "pos": 0.189
        }
    },
    {
        "date": "2024-10-01T12:02:00+00:00",
        "title": "HONEYWELL AND CHEVRON COLLABORATE ON AI-ASSISTED SOLUTIONS FOR REFINING PROCESSES",
        "content": "Collaboration aims to enhance refining operations and workforce with advanced AI-Assisted technologies, including a new generation of alarm management solutions\n\nHOUSTON, Oct. 1, 2024 /PRNewswire/ -- Honeywell (NASDAQ: HON) today announced a strategic collaboration with Chevron (NYSE: CVX) to develop advanced artificial intelligence (AI)-Assisted solutions to help operators make decisions to enhance efficiency for refining processes and improve safety within the industrial automation space. (PRNewsfoto/Honeywell)\n\nThese are among the new AI solutions Honeywell launched today to assist and help improve operator performance, optimize productivity and increase reliability as companies continue their journey to autonomous operations.\n\nTogether, the two companies are leveraging their deep domain knowledge and industry expertise to create a new generation of AI-Assisted alarm management solutions that will help operators make decisions to increase the efficiency, safety and reliability of process operations and industrial assets. The new solutions will include an Alarm Guidance application that provides operators with guided and specific actions to effectively respond to alarms and operational events, helping to reduce lost profit opportunities and process safety incidents. Using AI technology, the system will mine historical data on past actions to identify patterns of alarms and the corresponding operator actions that successfully return the process to normal operation.\n\n\"Advancements in AI will change the way companies like Chevron innovate, learn and solve problems at the plant level,\" said Lucian Boldea President and CEO of Honeywell Industrial Automation. \"AI-Assisted automation is key to helping improve industrial plant performance while also addressing industry's workforce shortage through institutional knowledge capture, workflow digitalization, and accelerating the learning curve for the next generation.\"\n\nThrough this collaboration, Chevron's operators will also be able to infuse AI into Honeywell's Experion® distributed control system (DCS), making them future ready and more informed in the control room.  The integration of AI to optimize operations to improve efficiency and upskill the workforce also supports Honeywell's alignment of its portfolio to three powerful megatrends, including automation.\n\nThe partnership between Chevron and Honeywell marks a significant advancement in the development of solutions that enable AI to assist human operators in plants. By co-innovating AI-enabled operational guidance solutions, both companies are setting new benchmarks for efficiency, safety, and reliability in refining processes. The collaboration is poised to not only address current industry challenges but also to pave the way for future advancements, ensuring that both Chevron and Honeywell remain at the forefront of innovation.\n\nFor more information on Honeywell's suite of AI solutions for industrials, including Honeywell Field Process Knowledge System, Experion Operations Assistant and Honeywell Production Intelligence, please visit Honeywell.com.\n\nAbout Honeywell: Honeywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Forge IoT platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world smarter, safer and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nMedia Contact: Tyler Sumrall \r\n+1 (713) 203-0992 \r\nTyler.Sumrall@honeywell.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-and-chevron-collaborate-on-ai-assisted-solutions-for-refining-processes-302263203.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-chevron-collaborate-ai-assisted-120200360.html",
        "symbols": [
            "0R2Q.LSE",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "CHEV.NEO",
            "CHV.BE",
            "CHV.DU",
            "CHV.F",
            "CHV.HM",
            "CHV.MU",
            "CHV.STU",
            "CHV.XETRA",
            "CHVX34.SA",
            "CVX.BA",
            "CVX.MX"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.024,
            "neu": 0.754,
            "pos": 0.223
        }
    },
    {
        "date": "2024-10-01T09:56:43+00:00",
        "title": "Unpacking Q2 Earnings: Otis (NYSE:OTIS) In The Context Of Other General Industrial Machinery Stocks",
        "content": "Unpacking Q2 Earnings: Otis (NYSE:OTIS) In The Context Of Other General Industrial Machinery Stocks\n\nThe end of the earnings season is always a good time to take a step back and see who shined (and who not so much). Let’s take a look at how general industrial machinery stocks fared in Q2, starting with Otis (NYSE:OTIS).\n\nAutomation that increases efficiency and connected equipment that collects analyzable data have been trending, creating new demand for general industrial machinery companies. Those who innovate and create digitized solutions can spur sales and speed up replacement cycles, but all general industrial machinery companies are still at the whim of economic cycles. Consumer spending and interest rates, for example, can greatly impact the industrial production that drives demand for these companies’ offerings.\n\nThe 14 general industrial machinery stocks we track reported a mixed Q2. As a group, revenues beat analysts’ consensus estimates by 1.8% while next quarter’s revenue guidance was 4% below.\n\nAfter much suspense, the Federal Reserve cut its policy rate by 50bps (half a percent) in September 2024. This marks the central bank’s first easing of monetary policy since 2020 and the end of its most pointed inflation-busting campaign since the 1980s. Inflation had begun to run hot in 2021 post-COVID due to a confluence of factors such as supply chain disruptions, labor shortages, and stimulus spending. While CPI (inflation) readings have been supportive lately, employment measures have prompted some concern. Going forward, the markets will debate whether this rate cut (and more potential ones in 2024 and 2025) is perfect timing to support the economy or a bit too late for a macro that has already cooled too much.\n\nGeneral industrial machinery stocks have held steady amidst all this with average share prices relatively unchanged since the latest earnings results.\n\nOtis (NYSE:OTIS)\n\nCredited with inventing the first hydraulic passenger elevator, Otis Worldwide (NYSE:OTIS) is an elevator and escalator manufacturing, installation and service company.\n\nOtis reported revenues of $3.60 billion, down 3.2% year on year. This print fell short of analysts’ expectations by 3.4%. Overall, it was a softer quarter for the company with a miss of analysts’ organic revenue estimates and full-year revenue guidance missing analysts’ expectations. Otis Total Revenue\n\nInterestingly, the stock is up 5.6% since reporting and currently trades at $104.\n\nRead our full report on Otis here, it’s free.\n\nBest Q2: 3M (NYSE:MMM)\n\nProducers of the first asthma inhaler, 3M Company (NYSE:MMM) is a global conglomerate known for products in industries like healthcare, safety, electronics, and consumer goods.\n\nStory continues\n\n3M reported revenues of $6.02 billion, down 24.7% year on year, outperforming analysts’ expectations by 3.3%. The business had an exceptional quarter with an impressive beat of analysts’ operating margin estimates and a solid beat of analysts’ organic revenue estimates. 3M Total Revenue\n\nThe market seems happy with the results as the stock is up 32.7% since reporting. It currently trades at $137.18.\n\nIs now the time to buy 3M? Access our full analysis of the earnings results here, it’s free.\n\nWeakest Q2: Hillenbrand (NYSE:HI)\n\nHillenbrand, Inc. (NYSE: HI) is an industrial company that designs, manufactures, and sells highly engineered processing equipment and solutions for various industries.\n\nHillenbrand reported revenues of $786.6 million, up 9.8% year on year, falling short of analysts’ expectations by 3.9%. It was a disappointing quarter as it posted full-year revenue guidance missing analysts’ expectations and a miss of analysts’ earnings estimates.\n\nHillenbrand delivered the weakest full-year guidance update in the group. As expected, the stock is down 25.6% since the results and currently trades at $28.30.\n\nRead our full analysis of Hillenbrand’s results here.\n\nL.B. Foster (NASDAQ:FSTR)\n\nFounded with a $2,500 loan, L.B. Foster (NASDAQ:FSTR) is a provider of products and services for the transportation and energy infrastructure sectors, including rail products, construction materials, and coating solutions.\n\nL.B. Foster reported revenues of $140.8 million, down 4.9% year on year. This result surpassed analysts’ expectations by 2.5%. Zooming out, it was a softer quarter as it produced a miss of analysts’ earnings estimates and full-year revenue guidance missing analysts’ expectations.\n\nThe stock is down 1.5% since reporting and currently trades at $20.43.\n\nRead our full, actionable report on L.B. Foster here, it’s free.\n\nHoneywell (NASDAQ:HON)\n\nOriginally founded in 1906 as a thermostat company, Honeywell (NASDAQ:HON) is an aerospace and defense manufacturing company building technologies, performance materials, and safety and productivity solutions.\n\nHoneywell reported revenues of $9.58 billion, up 4.7% year on year. This print surpassed analysts’ expectations by 1.7%. It was a very strong quarter as it also put up an impressive beat of analysts’ organic revenue estimates.\n\nHoneywell scored the highest full-year guidance raise among its peers. The stock is down 2.6% since reporting and currently trades at $207.99.\n\nRead our full, actionable report on Honeywell here, it’s free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/unpacking-q2-earnings-otis-nyse-095643009.html",
        "symbols": [
            "4PG.F",
            "9HI.F",
            "FSTR.US",
            "HI.US",
            "HON.US",
            "MMM.US",
            "O1TI34.SA",
            "OTIS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.043,
            "neu": 0.82,
            "pos": 0.137
        }
    }
]