[
    {
        "date": "2024-06-20T19:05:42+00:00",
        "title": "Honeywell to Acquire CAES Systems for $1.9 Billion in Cash",
        "content": "Honeywell to Acquire CAES Systems for $1.9 Billion in Cash",
        "link": "https://finance.yahoo.com/news/honeywell-acquire-caes-systems-1-190542702.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0,
            "neg": 0,
            "neu": 1,
            "pos": 0
        }
    },
    {
        "date": "2024-06-20T16:08:16+00:00",
        "title": "Top Midday Stories: SCOTUS Upholds 2017 Foreign Business Income Tax; Dell, Super Micro Supplying xAI for Supercomputer; Honeywell Acquires CAES Systems for $1.9 Billion",
        "content": "Top Midday Stories: SCOTUS Upholds 2017 Foreign Business Income Tax; Dell, Super Micro Supplying xAI for Supercomputer; Honeywell Acquires",
        "link": "https://finance.yahoo.com/news/top-midday-stories-scotus-upholds-160816491.html",
        "symbols": [
            "12DA.F",
            "12DA.STU",
            "12DA.XETRA",
            "7203.TSE",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "AZK0.F",
            "D1EL34.SA",
            "DELL.US",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "HTZ.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.691,
            "neg": 0,
            "neu": 0.749,
            "pos": 0.251
        }
    },
    {
        "date": "2024-06-20T11:36:13+00:00",
        "title": "Honeywell to Buy CAES From Advent in $1.9 Billion Cash Deal",
        "content": "(Bloomberg) -- Honeywell International Inc. agreed to buy aerospace and defense company CAES Systems from private equity firm Advent International for $1.9 billion.\n\nMost Read from Bloomberg\n\nCar Dealerships Across US Halt Services After Cyberattack Putin’s Hybrid War Opens a Second Front on NATO’s Eastern Border Car Dealers Across US Are Crippled by a Second Cyberattack Hedge Fund Talent Schools Are Looking for the Perfect Trader What to Know About the Deadly Flesh-Eating Bacteria Spreading in Japan\n\nThe all-cash deal is expected to close in the second half of this year, Honeywell said Thursday in a statement. CAES, which develops electronic systems for aerospace and military use, is expected to bolster Honeywell’s positions on key defense programs including the F-35 fighter jet.\n\nBloomberg News reported in March that Advent was weighing a sale of CAES. The company generated roughly $110 million in earnings before interest, taxes, depreciation and amortization last year. The deal will add about 2,200 employees to Honeywell’s ranks.\n\nCAES was formerly known as Cobham Advanced Electronic Solutions. Advent acquired the business as part of its purchase of UK-based defense firm Cobham Plc, which was completed in 2020. The buyout firm subsequently established CAES as a standalone entity.\n\nHoneywell shares were little changed before US markets opened.\n\n(Updates with confirmation of terms)\n\nMost Read from Bloomberg Businessweek\n\nIlya Sutskever Has a New Plan for Safe Superintelligence JPMorgan Ignites $40 Billion Rush Into Indian Bonds Documents Show How Musk’s X Plans to Become the Next Venmo Coke—and Dozens of Others—Pledged to Quit Russia. They’re Still There Google DeepMind Shifts From Research Lab to AI Product Factory\n\n©2024 Bloomberg L.P.\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-buy-caes-advent-1-113613185.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.953,
            "neg": 0.014,
            "neu": 0.887,
            "pos": 0.099
        }
    },
    {
        "date": "2024-06-20T11:30:00+00:00",
        "title": "HONEYWELL HELPS BUILDINGS SOLVE FOR ENERGY WASTE AND PROTECT CRITICAL ASSETS",
        "content": "Honeywell's new Connected Power solution allows buildings to control energy usage at the plug level Much of the energy consumed in commercial buildings comes from devices plugged into outlets, with fewer than 1-in-5 employees unplugging unused devices  Solution can be easily installed to upgrade existing electrical outlets\n\nATLANTA, June 20, 2024 /PRNewswire/ -- Honeywell (NASDAQ: HON) today introduced Connected Power, a groundbreaking solution that helps monitor, manage and automate buildings' power usage at the plug level. The solution offers insights into where energy is being used – and wasted – across North America. Honeywell logo\n\nBuildings' energy usage and related processes account for approximately 37% of global CO2 emissions, which places pressure on building owners and managers to reduce energy consumption. Today, common devices – including vending, copy and coffee machines – continuously consume energy. In many commercial buildings, much of this power is consumed even when no one is working in the area, which has become more common due to hybrid work schedules. Depending on the type of building, plug loads can account for between 25% and 50% of energy consumption.\n\nAccording to a recent Honeywell survey, the majority of employees either never unplug their devices or only do so for reasons including troubleshooting or going on vacation. The survey found that fewer than 1-in-5 employees unplug devices when they are not using them, and more than 80% of employees say their employer is equally as responsible as they are for controlling power usage on devices.\n\nWith Connected Power, building managers across North America can autonomously power down unused outlets based on space usage schedules or occupancy data, while also improving safety. The solution's connected outlets use existing wiring infrastructure and link to a digital dashboard, making it possible for building managers to monitor and control the energy consumption of each power outlet, or an entire area, from one screen with a few clicks.\n\n\"Unplugging a modern electronic device is different from simply turning it off. Many people do not realize how much energy is being wasted by devices that are plugged in and then forgotten. For buildings, this energy waste adds up quickly,\" said Billal Hammoud, President and CEO of Honeywell's Building Automation. \"With Connected Power, Honeywell is empowering building decision makers to address the invisible energy waste at the device level by helping to ensure energy is only used when it is really needed.\"\n\nStory continues\n\nAccu-Temp, a building automation contractor based in Ontario, began using Connected Power in early May 2024 to enhance its energy savings. \"Our installation was seamless, and the anticipated energy savings were realized immediately,\" said Alex Voll, Accu-Temp's president. \"Efficient energy management is a critical focus for building owners today, and having a system that allows centralized scheduling and control of power at the outlet level helps take our efficiency to the next level.\"\n\nConnected Power can be integrated into most existing building management systems (BMS) using open standards to provide centralized site scheduling and control, while also creating a more detailed view of total energy use. It can also be used as a stand-alone portal that will directly manage and control up to 2,500 outlets.\n\nThe solution also addresses workplace safety by helping ensure that equipment is powered down when not needed, and by detecting elevated outlet temperatures to identify potential issues that could interrupt power for an entire work area. With Connected Power, users can receive remote alerts if a business-critical device, such as equipment used in a research laboratory, shuts off unexpectedly, enabling immediate action to be taken.\n\nConnected Power offers optional cloud-based integration using the Honeywell Forge Suite, including Remote Building Manager. This integration allows monitoring and managing multiple properties from anywhere and creating a complete view of energy use and carbon emissions across the portfolio.\n\nThis launch follows the introduction of Honeywell's Advance Control for Buildings, the Company's most substantial leap in building controls innovation to date. Together, the solutions provide the data, insight and control to allow buildings to improve their operations and energy efficiency. They also support Honeywell's alignment of its portfolio around three compelling megatrends, including automation and energy transition.\n\nMethodology \r\nThe Honeywell Connected Power Survey, conducted by Wakefield Research, gathered responses from 1,000 US office professionals working in office buildings with a minimum capacity of 50 employees. The survey took place between May 30th and June 5th, 2024, and was administered via an e-mail invitation and an online questionnaire.\n\nAbout Honeywell  \r\nHoneywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Connected Enterprise integrated software platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world smarter, safer and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nMedia Contacts: Honeywell Finn Partners  Dawn Wotapka Danielle Beer (631) 943-3782 (269) 501-0469 dawn.wotapka@honeywell.com danielle.beer@finnpartners.com  Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-helps-buildings-solve-for-energy-waste-and-protect-critical-assets-302177129.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-helps-buildings-solve-energy-113000784.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.023,
            "neu": 0.832,
            "pos": 0.145
        }
    },
    {
        "date": "2024-06-20T11:00:00+00:00",
        "title": "HONEYWELL TO ACQUIRE CAES TO ENHANCE DEFENSE TECHNOLOGIES ACROSS LAND, SEA, AIR AND SPACE",
        "content": "CAES' high-reliability radio frequency technologies will help drive long-term growth and further diversify revenue streams on leading defense platforms  Additional highly skilled engineers and automated facilities will deepen Honeywell's aerospace expertise and operations, strengthen offerings for customers  CAES' established positions across leading U.S. military platforms provide significant opportunities for international growth\n\nCHARLOTTE, N.C., June 20, 2024 /PRNewswire/ -- Honeywell (Nasdaq: HON) announced today that it has agreed to acquire CAES Systems Holdings LLC (CAES) from private equity firm Advent International for approximately $1.9 billion in an all-cash transaction. This represents approximately 14x estimated 2024 EBITDA on a tax-adjusted basis. (PRNewsfoto/Honeywell)\n\nThis acquisition will enhance Honeywell's defense technology solutions across land, sea, air and space, including new electromagnetic defense solutions for end-to-end radio frequency (RF) signal management. With CAES' scalable offerings and Honeywell's current defense and space portfolio, the combined company will grow Honeywell's established production and upgrade positions on critical platforms that include F-35, EA-18G, AMRAAM and GMLRS, while also introducing offerings on new platforms like Navy Radar (SPY-6) and UAS and C-UAS technologies. Based on current and anticipated demand, these programs are expected to grow significantly in the years to come, creating a favorable tailwind for revenue growth of Honeywell's Aerospace Technologies business.\n\n\"This acquisition further positions Honeywell at the forefront of the defense industry's most dynamic sectors and sets the tempo for continued growth across our aerospace business,\" said Vimal Kapur, Chairman and CEO of Honeywell. \"With the integration of CAES' solutions and capabilities, we will fortify our existing defense offerings, while also expanding our capabilities in pivotal areas like RF, radar and sensing technologies, to ensure a market-leading position in areas that are critical for global security.\"\n\nHeadquartered in Arlington, Va., CAES (formerly known as Cobham Advanced Electronic Solutions) has 13 facilities in North America, including highly automated manufacturing facilities with fully automated test and tuning processes. The acquisition will add approximately 2,200 employees and a deep bench of RF engineering talent.\n\n\"The combination of our talented teams will diversify and deepen our expertise and specialized capabilities that enable us to scale current offerings and innovate new ones across critical military platforms,\" said Honeywell Aerospace Technologies President and CEO Jim Currier. \"CAES' trusted position with top U.S. defense customers strengthens our existing relationships as we shape the future of the defense industry together.\"\n\nStory continues\n\nLooking ahead, Honeywell sees attractive opportunities to expand the combined solutions internationally, capitalizing on accretive growth spaces with select defense customers.\n\n\"As a trusted supplier and mission partner to our customers across advanced RF capabilities, I couldn't be more excited to see CAES join the Honeywell team and work together to build on the outstanding expertise of both companies,\" said Mike Kahn, President and CEO of CAES. \"Our extraordinary talent, RF breadth and world-class manufacturing facilities will offer new opportunities and further drive innovation for our industry.\"\n\n\"This transaction marks a significant milestone for both parties, and we are confident that the business will continue to thrive and grow,\" said Shonnel Malani, Managing Partner at Advent International. \"Under Advent International's ownership, we have invested significantly in R&D, capital and capability enhancement, all of which has been pursued to drive growth and the development of cutting-edge capabilities. We believe this sale to a strong strategic home will secure its long-term future.\"\n\nThis is the third acquisition Honeywell announced this year as part of its disciplined capital deployment strategy. The company is focused on high-return acquisitions that will drive future growth across its portfolio, which is aligned with the three compelling megatrends of automation, the future of aviation and energy transition.\n\nThe CAES transaction, which is expected to be adjusted earnings per share1 accretive in the first full year of ownership, is not subject to any financing conditions and is expected to close in the second half of 2024, subject to customary closing conditions, including receipt of certain regulatory approvals.\n\nAbout Honeywell\n\nHoneywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Forge IoT platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world smarter, safer and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nWe describe many of the trends and other factors that drive our business and future results in this release. Such discussions contain forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended (the Exchange Act). Forward-looking statements are those that address activities, events, or developments that management intends, expects, projects, believes, or anticipates will or may occur in the future. They are based on management's assumptions and assessments in light of past experience and trends, current economic and industry conditions, expected future developments, and other relevant factors, many of which are difficult to predict and outside of our control. They are not guarantees of future performance, and actual results, developments and business decisions may differ significantly from those envisaged by our forward-looking statements. We do not undertake to update or revise any of our forward-looking statements, except as required by applicable securities law. Our forward-looking statements are also subject to material risks and uncertainties, including ongoing macroeconomic and geopolitical risks, such as lower GDP growth or recession, capital markets volatility, inflation, and certain regional conflicts, that can affect our performance in both the near- and long-term. In addition, no assurance can be given that any plan, initiative, projection, goal, commitment, expectation, or prospect set forth in this release can or will be achieved. These forward-looking statements should be considered in light of the information included in this release, our Form 10-K and other filings with the Securities and Exchange Commission. Any forward-looking plans described herein are not final and may be modified or abandoned at any time.\n\n1 This release references certain non-GAAP measures, including:\n\nAdjusted earnings per share, which is defined as diluted earnings per share adjusted to exclude pension mark-to-market expense, amortization of acquisition-related intangibles, acquisition-related costs, and other items as described in reconciliations provided when we disclose adjusted earnings per share; and EBITDA, which we define as earnings before tax, depreciation and amortization.\n\nManagement believes that, when considered together with reported amounts, these measures are useful to investors and management in understanding our ongoing operations and in the analysis of ongoing operating trends.\n\nManagement does not consider these non-GAAP measures in isolation or as an alternative to financial measures determined in accordance with GAAP. The principal limitations of these non-GAAP financial measures are that they exclude significant expenses and income that are required by GAAP to be recognized in the consolidated financial statements. In addition, they are subject to inherent limitations as they reflect the exercise of judgments by management about which expenses and income are excluded or included in determining these non-GAAP financial measures.\n\nContacts: Media  Investors Stacey Jones Sean Meakim  Stacey.Jones@Honeywell.com  Sean.Meakim@Honeywell.com  Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-to-acquire-caes-to-enhance-defense-technologies-across-land-sea-air-and-space-302177482.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-acquire-caes-enhance-defense-110000474.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.032,
            "neu": 0.815,
            "pos": 0.153
        }
    },
    {
        "date": "2024-06-20T07:52:29+00:00",
        "title": "Nvidia, Accenture and KB Home rise premarket;  Trump Media, Winnebago fall",
        "content": "Investing.com -- U.S. stock futures rose Thursday, boosted by strength in the tech sector ahead of the release of employment and housing data.\n\nHere are some of the biggest premarket U.S. stock movers today:\n\nNvidia (NASDAQ:NVDA) stock rose 3.2%, adding to the previous session’s gains which resulted in the chipmaker becoming the most valuable company in the world.\n\nTrump Media & Technology Group (NASDAQ:DJT) stock fell over 11% after the SEC allowed investors in the firm’s derivatives, known as warrants, to swap their holdings for shares in the company which can dilute long-time investors.\n\nAccenture (NYSE:ACN) stock rose 7.2% after the IT services provider forecast annual revenue growth above estimates, as growing adoption of artificial intelligence offsets sluggish growth in enterprise spending.\n\nHoneywell (NASDAQ:HON) stock fell 0.9% after the conglomerate agreed to buy aerospace and defense technology company CAES Systems for $1.9 billion from private equity firm Advent International.\n\nHewlett Packard Enterprise (NYSE:HPE) was up 2.2% after Britain's competition regulator announced it was investigating whether the company's planned $14 billion acquisition of Juniper Networks (NYSE:JNPR), up 1.3%, would result in competition concerns.\n\nDell Technologies (NYSE:DELL) stock climbed 3.2% and Super Micro Computer (NASDAQ:SMCI) rose 4.6% after Elon Musk said on social media platform X that these companies would provide server racks for the supercomputer that his startup xAI is building.\n\nWinnebago (NYSE:WGO) stock fell 5.6% after the recreational vehicle maker’s fiscal third-quarter earnings disappointed, with elevated interest rates deterring buyers.\n\nKB Home (NYSE:KBH) stock rose 1.9% after the home construction company reported a robust second quarter, with net orders and order value growing year-over-year.\n\nRelated Articles\n\nNvidia, Accenture and KB Home rise premarket; Trump Media, Winnebago fall\n\nPayPal hires Walmart exec as chief technology officer in AI push\n\nKroger beats first-quarter same-store sales estimates on steady grocery demand\n\nView comments",
        "link": "https://finance.yahoo.com/news/nvidia-accenture-kb-home-rise-075229512.html",
        "symbols": [
            "0Y0Y.LSE",
            "12DA.F",
            "12DA.STU",
            "12DA.XETRA",
            "ACN.US",
            "ACNB34.SA",
            "ACNN.MX",
            "CSA.BE",
            "CSA.F",
            "CSA.STU",
            "D1EL34.SA",
            "DELL.US",
            "DJT.US",
            "HON.US",
            "HPE.US",
            "JNPR.US",
            "KBH.DU",
            "KBH.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.982,
            "neg": 0.022,
            "neu": 0.853,
            "pos": 0.125
        }
    }
]