[
    {
        "date": "2024-08-15T13:15:00+00:00",
        "title": "Repsol (REPYY) Taps Honeywell to Boost Biofuels Production",
        "content": "Repsol S.A. REPYY, a Spanish multi-energy company, has entered into a ground-breaking partnership with Honeywell International HON to create new, innovative pathways for the production of biofuels and circular materials. As part of the collaboration, the companies will focus on leveraging Honeywell’s advanced technologies to transform waste materials like fats, oils, greases, biomass and solids into biofuels and advanced chemicals at Repsol’s refineries, with a possibility of incorporating these methods into Repsol’s facilities.\n\nThe collaboration is aimed at commercializing Honeywell’s innovative technologies at Repsol’s refineries to produce a wide variety of biofuels, including sustainable aviation fuel (SAF) and renewable diesel. The existing assets of the refineries will be utilized for the process. This strategic partnership aligns with Honeywell’s commitment to reducing carbon emissions and contributes to the global energy transition process. The company plans to achieve carbon neutrality at its facilities by 2035.\n\nRepsol is also considering the implementation of Honeywell’s UpCycle Process Technology, which can convert waste plastic into Honeywell Recycled Polymer Feedstock. The Honeywell Recycled Polymer Feedstock can be further used for developing new plastic. The technology is versatile and capable of recycling a diverse range of plastics, including flexible, multilayered packaging and polystyrene. When combined with other recycling techniques, this technology has the potential to aid in recycling nearly 90% of waste plastics.\n\nREPYY is committed to achieving the net-zero emissions target by 2050. The company emphasized that renewable fuels and recycling of plastics are important components of its strategy to achieve its net-zero emission targets. The management believes that its collaboration with Honeywell and adoption of its cutting-edge technologies should enable Repsol to reduce its carbon footprint. The partnership should also help Repsol to establish itself as a leading firm in the production of renewable fuels and hydrogen by 2030.\n\nHoneywell has highlighted that it seeks to foster collaborations to render impactful solutions aimed at reducing greenhouse gas emissions through biofuel production. Its collaboration with Repsol should enable the application of new technologies for the production of biofuels and advanced materials, while also lowering carbon emissions.\n\nEarlier in 2024, Repsol had partnered with Bunge Global BG to meet the growing demand of low-carbon feedstock, which is used in the production of renewable fuels. REPYY acquired 40% stake in three of Bunge’s oil and biofuels plantin the Iberian Peninsula. The three plants are located in Bilbao, Barcelona and Cartagena, which lie close to Repsol’s refineries.\n\nStory continues\n\nThe acquisition was in line with Repsol’s strategy to reduce emissions from the transportation sector. The company plans to provide 100% renewable fuel pumps across its service station network in Spain. At present, 120 stations offer 100% renewable fuel, and Repsol plans to increase the count to 600 by the end of 2024.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nBunge Global SA (BG) : Free Stock Analysis Report\n\nRepsol SA (REPYY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/repsol-repyy-taps-honeywell-boost-131500245.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "REP.BE",
            "REP.DU",
            "REP.F",
            "REP.HM",
            "REP.MC",
            "REP.MU",
            "REP.XETRA",
            "REPA.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.988,
            "neg": 0.022,
            "neu": 0.878,
            "pos": 0.101
        }
    },
    {
        "date": "2024-08-15T10:59:34+00:00",
        "title": "Honeywell International Inc. (HON): An Undervalued Aerospace to Buy According to Analysts?",
        "content": "We recently compiled a list of the 10 Undervalued Aerospace Stocks To Buy According to Analysts.In this article, we are going to take a look at where Honeywell International Inc. (NASDAQ:HON) stands against the other undervalued aerospace stocks.\n\nThe International Aerospace and Defense industry\n\nThe aerospace and defense industry is a fast-growing industry, mainly because of the increased global travel after the pandemic and increased geopolitical tensions, which has led to increased government spending on defense. According to Research and Markets, the global aerospace and defense industry was valued at $884 billion in 2023. The industry is expected to grow at a compound annual growth rate of 5.8% to reach $1.23 trillion by 2028. Growth in the sector pertains to the rise in military modernization and increased defense spending. Whereas, increased spending on air travel is contributing to the growth in the commercial aerospace industry.\n\nGeopolitics and Increased Spending on Defense\n\nThe world has been in a straight of turmoil, with geopolitical tensions leading to wars. While war and geo-political tensions are a dealbreaker for many industries,  for the aerospace and defense companies the story is different. One of the key drivers of revenue for such companies is government contracts for military-grade aircraft, weapons, and defense systems. Thereby, with increased risks of war, defense spending goes up and aerospace and defense companies land more contracts.\n\nAccording to a report by CNBC on April 22, global military spending hit an all-time high in 2023 after a 7% ramp-up. The global military spending was at a record high of $2.4 trillion last year. One of the key drivers of increased defense spending has been the prolonged Russia-Ukraine conflict and the recent tensions between Israel and Palestine. During the previous year the United States, China, and Russia were noted to be the biggest military spenders.\n\nAccording to the U.S. Department of Defense, the government has $2.09 trillion in budgetary resources and plans to spend $972.88 Billion during 2024, out of which $229.80 billion is designated for award obligations. This indicates increased business opportunities for aerospace and defense companies during the year.\n\nUpcoming Trends in the Aerospace Industry\n\nAccording to a survey conducted by McKinsey & Company, AI-powered advancements can reshape aircraft maintenance, repair, and overhaul, however, companies need to accept the digital transformation.\n\nAircraft fleet management is a challenging sector. In the US alone, airline companies have witnessed a 15% increase in maintenance costs during the past 5 years. Moreover, there has been a 14% increase in flight delays due to maintenance.\n\nThe maintenance, repair, and overhaul (MRO) can be optimized using AI-powered solutions that allow better performance and improve efficiency. For Instance, AI-powered MRO can predict proper maintenance needs for an aircraft and the labor, material, and time needed for the maintenance. However, to leverage the power of AI, maintenance companies would have to become comfortable with adapting to new technologies and deal with the status quo disruption. The survey by McKinsey & Company found that only 33% of their respondents believed digital adoption to be critically important in achieving organizational objectives. Whereas 70% believed it could become critically important in the next 3 to 5 years, indicating hesitation towards immediate adoption of AI-powered solutions in the MRO sector.\n\nOur Methodology\n\nTo compile the list of 10 undervalued aerospace stocks to buy according to analysts we used the Finviz stock screener and iShares U.S. Aerospace & Defense ETF. We aggregated a list of stocks that operated in the aerospace and defense industry and filtered stocks that had a forward P/E ratio of less than 22 and a positive earnings growth rate. These stocks are cheaper than the market, which currently has a forward P/E of 22 (according to data from WSJ).\n\nOnce we had our filtered list, we ranked these stocks based on the average price target upside as per Wall Street analysts. The stocks are ranked in ascending order of the average price target upside as of August 15, 2024.\n\nAt Insider Monkey we are obsessed with the stocks that hedge funds pile into. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\n\nA shot of a commercial plane with a blur of color in the background, representing the production of auxiliary power units in the Safety and Productivity Solutions segment.\n\nHoneywell International Inc. (NASDAQ:HON)\n\nAverage Price Target Upside as of August 15: 14.37%\n\nForward P/E as of August 15: 19\n\nHoneywell International Inc. (NASDAQ:HON) is one of the undervalued aerospace stocks to buy according to analysts. It operates as a diversified technology company that manufactures and sells Aerospace, Performance Material, Building Technologies, and Safety and Productivity technologies in the United States and internationally.\n\nThe Aerospace segment of the company provides aircraft engines, avionic technologies, auxiliary power units, and other related products for commercial and defense purposes. It also provides a wide range of sensors used in developing sophisticated aircraft systems. The competitive edge of the company lies in its ability to generate record revenues from a diverse portfolio of products catering to a range of industries.\n\nHoneywell International Inc. (NASDAQ:HON) exceeded analyst expectations by posting a robust second quarter of 2024. The company grew its sales by 4% year-over-year to reach $9.6 billion in revenue, ahead of analyst expectations of $9.4 billion. The Commercial Aerospace, Defense, and Space segment of the company was a strong contender and delivered the 13th consecutive year of double-digit growth. The segment grew 16% year-over-year delivering $3.9 billion in organic sales.\n\nNot only did the company improve its order backlog by 5% to reach a record high of $32 billion, but it was also able to complete strategic acquisitions to boost its technologies and offerings across the board. Some of the notable acquisitions include Air Products LNG and CAES, a pioneer in advanced electronics.\n\nShould you invest in Honeywell International Inc. (NASDAQ:HON)?\n\nHoneywell International Inc. (NASDAQ:HON) can be a good investment and we don’t say this based on a single-quarter performance. If you look at the company’s past 3 year’s performance, you will find it has been able to grow its revenue by 3.21% and net income by 6.09% indicating robust fundamentals. Moreover, despite acquiring two companies, recently, it was able to maintain its free cash low flat at $1.1 billion.\n\nThe company is trading at 19 times its forward earnings, while the market average sits at 22. Moreover, its earnings are expected to grow by 8% during the year to reach $2.81. 26 analysts have a consensus buy opinion on the stock with their 12-month median price target of $226 presenting an upside of 14.37% from the current level.\n\nOverall HON ranks 6th on our list of the best undervalued aerospace stocks to buy. While we acknowledge the potential of HON as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than HON but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nREAD NEXT: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-international-inc-hon-undervalued-105934232.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.029,
            "neu": 0.856,
            "pos": 0.115
        }
    }
]