[
    {
        "date": "2024-07-23T16:42:00+00:00",
        "title": "Q2 Earnings Season Scorecard and Today's Analyst Reports for Honeywell, Elevance Health &amp; Others",
        "content": "Tuesday, July 23, 2024\r\n\r\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features a real-time update on the Q2 earnings season and new research reports on 16 major stocks, including S&P Global Inc. (SPGI), Honeywell International Inc. (HON) and Elevance Health, Inc. (ELV), as well a micro-cap stock Sypris Solutions, Inc. (SYPR). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\r\n\r\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\r\n\r\nYou can see all of today’s research reports here >>>\r\n\r\nQ2 Earnings Season Scorecard\n\nIncluding this morning's releases from Coke, UPS, GM and others, we now have Q2 results from 103 S&P 500 members or 20.6% of the index's total membership. Total earnings for these companies are up +6.8% from the same period last year on +3.5% higher revenues, with 82.5% beating EPS estimates and 59.2% beating revenue estimates.\n\nComparing the Q2 results from these companies relative to what we had seen from the same group of 103 companies in other recent periods, we find\n\n- The Q2 EPS beats percentage of 82.5% compares to 79.6% in each of the preceding two periods and the average for the preceding 20-quarters (5 years) of 79.8%.\n\n- The Q2 revenue beats percentage of 59.2% compares to 66% and 68% for this group of 103 index members in 2024 Q1 and 2023 Q4, respectively. The 20-quarter average for this group of companies is 70.6%. This means that companies continue to struggle to beat revenue estimates.\n\n- With respect to the growth rates, the earnings growth rate of +6.8% for this group of 103 companies is up from +6.3% in 2024 Q1, -0.7% in 2023 Q4, +2.5% in 2023 Q3, +0.4% in 2023 Q2 and so on. In other words, an accelerating growth trend on the earnings front.\n\n- With respect to revenues, the Q2 revenue growth rate of +3.5% is down from +4% in 2024 Q1, +3.1% in 2023 Q4, +4.5% in 2023 Q3 and so on.\n\nLooking at Q2 as a whole, combining the actuals that have come out with estimates for the still-to-come companies, total earnings are expected to be up +9.2% from the same period last year on +4.9% higher revenues, which will be the highest earnings growth pace since the +10% earnings growth rate in 2022 Q1.\n\nToday's Featured Analyst Reports\n\nS&P Global shares have outperformed the Zacks Business - Information Services industry over the past year (+15.3% vs. +12.8%). The company remains well-poised to gain from the growing demand for business information services. Buyouts help innovate, increase differentiated content and develop new products. \r\n\r\nNew service launches have been aiding the company's growth. Dividend payments and share buybacks boost investors' confidence and positively impact earnings per share.\r\n\r\nHowever, S&P Global remains vulnerable to proceedings, investigations and inquiries concerning the ratings provided, leading to legal charges, damages or fines. Growth initiatives, higher compensations and incentives raise the company's expenses.t\r\n\r\n(You can read the full research report on S&P Global here >>>)\r\n\r\nShares of Honeywell have outperformed the Zacks Diversified Operations industry over the year-to-date period (+3.3% vs. -4.4%). The company’s strength in the commercial aviation, building automation and UOP businesses augurs well. The Aerospace segment is particularly strong, driven by robust demand in the aviation aftermarket. \r\n\r\nA strong commercial aftermarket and solid commercial aviation demand, led by strength in the air transport aftermarket, are aiding the Aerospace segment. Handsome rewards to shareholders add to the stock’s appeal. The ability to generate strong free cash flow supports its shareholder-friendly activities.\r\n\r\nThe company’s commercial and operational excellence initiatives, along with its pricing actions, enable it to maintain a healthy margin performance. While acquisitions have expanded its product range and geographic reach, they have increased Honeywell’s balance sheet debt as well. Foreign currency translation remains an overhang.t\r\n\r\n(You can read the full research report on Honeywell here >>>)\r\n\r\nElevance Health shares have outperformed the Zacks Medical Services industry over the past year (+7.0% vs. +2.0%). The company beat earnings estimate by 1.3% in the second quarter. Its revenue growth, fueled by premium rate increases and rising memberships, contributes to its positive trajectory. \r\n\r\nStrategic acquisitions and partnerships have fortified its business portfolio. A robust Medicare Advantage segment, combined with successful contract acquisitions, is poised to drive future memberships. It reaffirmed the 2024 earnings guidance to $37.20 per share. The Carelon business is a key contributor to its success. ELV utilizes excess capital to boost shareholder value. \r\n\r\nHowever, its rising expenses continue to put pressure on margins. Its high balance sheet debt is reducing financial flexibility. Also, its declining free cash flow is a concern. As such, the stock warrants a cautious stance.\r\n\r\n(You can read the full research report on Elevance Health here >>>)\r\n\r\nShares of Sypris Solutions have outperformed the Zacks Electronics - Miscellaneous Services industry over the past year (+3.8% vs. -8.8%). This microcap company with market capitalization of $42.81 million has secured a long-term, sole-source contract extension with a major commercial vehicle manufacturer for Ultra Axle Shafts, ensuring stable revenues and reinforcing its industry reputation. \r\n\r\nSypris Solutions’ Sypris Electronics unit is also expanding in the electronic warfare market with additional U.S. Navy contracts, enhancing defense capabilities against threats. Sypris' strong position in the growing aerospace and defense electronics markets supports sustained revenue growth. Financial stability is bolstered by an improved cash balance. A significant backlog provides revenue visibility and supports financial planning. \r\n\r\nHowever, the company faces challenges with net losses widening to $2.2 million in Q1 2024 and reduced profit margins. Rising operating expenses, high debt levels and competitive pressures also pose risks.\r\n\r\n(You can read the full research report on Sypris Solutions here >>>)\r\nOther noteworthy reports we are featuring today include American Tower Corporation (AMT), Cintas Corporation (CTAS) and TC Energy Corporation (TRP).\r\n\r\nSheraz Mian\n\nStory continues\n\nDirector of Research\r\n\r\nNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\n\nToday's Must Read\n\nMarket Scan & ChartIQ Buyouts Benefit S&P Global (SPGI)\n\nHoneywell (HON) Benefits from Strength in Aerospace Segment\n\nStrategic Buyouts Aid Elevance Health (ELV), Cost Woes Stay\n\nFeatured Reports\n\nSteady Tower Demand Aid American Tower (AMT), High Rates Ail\r\nPer the Zacks analyst, American Tower is expected to gain from the network investments by wireless carriers amid steady growth in wireless data consumption despite a high interest rate environment.\n\nUniform Rental Unit Aids Cintas (CTAS) Amid Rising Costs \r\nPer the Zacks analyst, Cintas' Uniform Rental and Facility Services unit is driven by the penetration of additional products and services into existing customers. High costs remain a concern.\n\nTC Energy's (TRP) C$34B Growth Projects to Boost Earnings\r\nThe Zacks analyst believes that TC Energy's C$34 billion of growth projects should support its earnings and dividend payouts but is worried over the massive debt of C$50 billion.\n\nlululemon (LULU) Tracks Well on Solid e-commerce Growth\r\nPer the Zacks analyst, lululemon expects to capture the growing online demand and enhance shopping experience via accelerated e-commerce investments. Digital sales contributed 41% to net sales in Q1.\n\nPublic Sector Demand to Aid Vulcan (VMC) Amid Weather Woes\r\nPer the Zacks Analyst, Vulcan is likely to benefit from robust public sector demand and strong aggregate-led business performance. However, price fluctuations and weather-related risks are a concern.\n\nVeeva Systems (VEEV) Benefits from Strong Product Portfolio\r\nPer the Zacks analyst, Veeva Systems is likely to benefit from its robust product portfolio and continued focus on research and development. However, data security threats persist.\n\nBadger Meter (BMI) Rides on Favorable Customer Demand Trends\r\nPer the Zacks analyst, Badger Meter's performance is gaining from solid order trends for its innovative smart water solutions. The introduction of BlueEdge is creating a tailwind.\n\nNew Upgrades\n\nBeam Therapeutics' (BEAM) Gene-Therapy Pipeline Holds Promise\r\nPer the Zacks analyst, Beam Therapeutics' lead candidate, BEAM-101, a base-editing therapy being developed to treat two rare diseases holds promise. Other pipeline candidates are also progressing well\n\nClean Harbors (CLH) Gains From Thompson Industrial Buyout\r\nPer the Zacks analyst, the Thompson Industrial Services acquisition expanded Clean Harbors' Environmental Services segment's industrial service operations in the Southeastern United States.\n\nGap's (GPS) Cost-Cutting Plans & Low Airfreight Aid Margins\r\nPer the Zacks analyst, Gap is making efforts to simplify and optimize its operating model and structure. Also, lower airfreight and improved promotional activity have been boosting margins.\n\nNew Downgrades\n\nSupply Chain Vulnerability to Effect Emeren (SOL) Growth\r\nPer the Zacks analyst, the vulnerable supply chain condition in the global solar market may hurt Emeren. Trade tensions between the United States and China also pose a risk for the stock.\n\nPaylocity Holding (PCTY) Hurt By Rising Stiff Competition \r\nPer the Zacks Analyst, Paylocity Holding is suffering from rising stiff competition in the HCM software market from players like Oracle, Paychex, etc. Higher interest rates also remain a concern.\n\nHigh Expenses, Cat Loss Concern Selective Insurance (SIGI)\r\nPer the Zacks analyst, Selective Insurance is exposed to catastrophes loss, which results in volatility in its earnings. Also, rising expenses due to higher losses weigh on margin expansion.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAmerican Tower Corporation (AMT) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nCintas Corporation (CTAS) : Free Stock Analysis Report\n\nTC Energy Corporation (TRP) : Free Stock Analysis Report\n\nS&P Global Inc. (SPGI) : Free Stock Analysis Report\n\nSypris Solutions, Inc. (SYPR) : Free Stock Analysis Report\n\nElevance Health, Inc. (ELV) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research",
        "link": "https://finance.yahoo.com/news/q2-earnings-season-scorecard-todays-164200175.html",
        "symbols": [
            "0HEU.LSE",
            "0HG8.LSE",
            "A0T.F",
            "A0T.STU",
            "A58.F",
            "A58.STU",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "AMT.US",
            "ELV.US",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.053,
            "neu": 0.777,
            "pos": 0.169
        }
    },
    {
        "date": "2024-07-23T10:00:00+00:00",
        "title": "INDUSTRIAL AI UPTAKE IS JUST GETTING STARTED BUT MAJORITY OF SECTOR IS UNCOVERING NEW USE CASES, FINDS HONEYWELL RESEARCH",
        "content": "Workforce productivity, flexibility, and safety are cited as key gains from AI applications along with its potential to address the industrial skills shortage\n\nCHARLOTTE, N.C., July 23, 2024 /PRNewswire/ -- Honeywell (Nasdaq: HON) today released the findings of its IndustrialAI Insights global research study, which captures the state of Artificial Intelligence (AI) in the sector. While only 17% of AI decision makers around the world have fully implemented their initial AI plans, more than 9 in 10 say they are uncovering unexpected new use cases whether they are in the prototyping, launch, or scaling stages of AI implementation.\n\nThe research also finds AI leaders are \"sold\" on AI for industrial applications. The enthusiasm for a deeper commitment to AI investment is nearly universal, with 94% of those surveyed saying they have plans to expand their utilization of AI.\n\n\"There is no question that AI is currently at a pivotal moment,\" said Kevin Dehoff, Honeywell's Chief Strategy Officer. \"With the advent of Gen AI and more sources of data from advanced analytics, Industrial AI is poised to grow exponentially, and the possibilities are endless for revenue growth and employee satisfaction.\"\n\nAI Unlocks Workplace Benefits When asked for their thoughts on the impact of AI on industrials, nearly two-thirds (64%) of AI leaders cited efficiency and productivity gains among the most promising benefits. Sixty percent say improved cybersecurity and threat detection result from AI and 59% report better decision making due to real-time data generation. Top benefits cited by AI leaders of industrial AI\n\nSeveral other benefits of AI for workers were also cited by respondents, including:\n\nIncreased work flexibility (49%) Greater job satisfaction (45%) More time for skills development and creative thinking (44%) Increased workplace safety (39%)\n\nSkills development is crucial in today's economy with baby boomers retiring and fewer replacements entering the workforce. Through AI, employers can more quickly upskill and reskill workers. AI will transform industrials as it enables workers to perform jobs at higher levels, providing greater job satisfaction while increasing productivity and addressing the skills shortage.\n\nLucian Boldea, President and CEO of Honeywell Industrial Automation, offered one direct example: \"There can be tens of thousands of instruments, equipment, and valves needed to process and manufacture a product and many of the parts we supply manufacturers require highly experienced technicians for operation and maintenance – and there are fewer and fewer of those experienced technicians available. With AI training and AI as a \"co-pilot\" the skills of a less experienced technicians can more quickly be upgraded, turning them into more elite experts that perform tasks based on enterprise knowledge and best practices. In turn, plants' operations can run more safely and reliably by dramatically reducing human error.\"\n\nStory continues\n\nWhat's Next for AI While the enthusiasm for AI to expand is palpable, there are still some challenges in the way of full adoption. More than a third of survey respondents (37%) feel that their C-Suite fully doesn't understand how AI works and almost half (48%) say they are having to continually justify or request resources needed to implement AI plans.\n\n\"Businesses of all types recognize that AI is transforming our world and creating new possibilities. For building operations – such as hospitals, campuses, and offices – it is clearly the future. As AI orchestrates controls that regulate HVAC, lighting and electricity usage, it helps to improve safety, operational and sustainability outcomes,\" said Billal Hammoud, President and CEO of Honeywell Building Automation.\n\nAll of this suggests the pace of change will be driven by compelling use cases that can be measured in terms of improved business performance. As new solutions demonstrate clear benefits to workforce productivity, safety, and reliability, AI adoption will dramatically increase with the potential to transform industrial operations.\n\nTo learn more about the survey results and Honeywell's work in AI and automation, please visit www.honeywell.com/us/en/ai/research.\n\nMethodology Honeywell commissioned Wakefield Research to survey AI leaders around the world. The online survey, which was conducted from April 22 through May 2, 2024, involved 1,600 executives in 12 global markets (US, Brazil, Canada, China, France, Germany, India, Japan, Mexico, United Kingdom, Kingdom of Saudi Arabia and United Arab Emirates). Each respondent works at a company with at least 1,000 employees that is currently using AI to automate processes and tasks. All respondents are influencers or decision makers related to the use of AI within their departments or across their organizations.\n\nAbout Honeywell Honeywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Forge IoT platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world smarter, safer and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nMedia Contacts: Mary-Ellen Harn\r\n+1 (704) 816-0713 \r\nMaryEllen.Harn@honeywell.com\n\nDawn Wotapka\r\n+1 (631) 943-3782 \r\nDawn.Wotapka@Honeywell.com Honeywell Sensing and Productivity Solutions logo (PRNewsFoto/Honeywell) (PRNewsfoto/Honeywell) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/industrial-ai-uptake-is-just-getting-started-but-majority-of-sector-is-uncovering-new-use-cases-finds-honeywell-research-302203180.html\n\nSOURCE Honeywell",
        "link": "https://finance.yahoo.com/news/industrial-ai-uptake-just-getting-100000937.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.011,
            "neu": 0.819,
            "pos": 0.169
        }
    }
]