[
    {
        "date": "2024-10-08T15:25:06+00:00",
        "title": "Honeywell to Spin Off Advanced Materials Business in Portfolio Optimization Push",
        "content": "Honeywell to Spin Off Advanced Materials Business in Portfolio Optimization Push",
        "link": "https://finance.yahoo.com/news/honeywell-spin-off-advanced-materials-152506573.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.557,
            "neg": 0,
            "neu": 0.662,
            "pos": 0.338
        }
    },
    {
        "date": "2024-10-08T15:01:00+00:00",
        "title": "Honeywell Is Spinning Off a Piece of Itself. What It Means for the Stock.",
        "content": "Industrial firm Honeywell plans to spin off its advanced-materials business to shareholders. The separation should be complete by the end of 2025 or early 2026.\n\nContinue reading\n\nView comments",
        "link": "https://finance.yahoo.com/m/86c91df4-4616-3bf5-bb0a-e2fdc02f0a1f/honeywell-is-spinning-off-a.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0,
            "neg": 0,
            "neu": 1,
            "pos": 0
        }
    },
    {
        "date": "2024-10-08T12:46:18+00:00",
        "title": "Dow Jones Giant Eyes Possible $10 Billion Spinoff; Is It The Next GE?",
        "content": "Honeywell announced plans to spin off its advanced materials business into a separate firm, which could be worth billions. HON stock surges.\n\nContinue reading\n\nView comments",
        "link": "https://finance.yahoo.com/m/12695c22-8eae-373e-8049-b3e4640bfb0b/dow-jones-giant-eyes-possible.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "GCP.F",
            "GCP.XETRA",
            "GE.MX",
            "GE.US",
            "GEHC.US",
            "GEOO34.SA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "L0T.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.44,
            "neg": 0,
            "neu": 0.855,
            "pos": 0.145
        }
    },
    {
        "date": "2024-10-08T10:38:37+00:00",
        "title": "Honeywell Plans to Spin Off Its Advanced Materials Division",
        "content": "(Bloomberg) -- Honeywell International Inc. plans to spin off its advanced materials division as the industrial conglomerate looks to streamline its holdings.\n\nMost Read from Bloomberg\n\nUrban Heat Stress Is Another Disparity in the World’s Most Unequal Nation Singapore Ends 181 Years of Horse Racing to Make Way for Homes From Cleveland to Chicago, NFL Teams Dream of Domed Stadiums What Do US Vehicle Regulators Have Against Tiny Cars? For a Master of Brutalist Provocations, a Modest Museum Appraisal\n\nThe company intends to separate the unit on a tax-free basis into a separately listed business by early 2026 at the latest, Honeywell said in a statement Tuesday.\n\nThe move would correspond with Chief Executive Officer Vimal Kapur’s plan to simplify Honeywell’s business around its three main segments of aviation, automation and the energy transition. The advanced materials business could be worth more than $10 billion as a standalone company, according to the Wall Street Journal, which first reported on the deal.\n\nShares of the Charlotte, North Carolina-based firm rose 2.9% before the market opened in New York on Tuesday. The stock fell about 3% this year through Monday, giving Honeywell a market value of $132 billion.\n\nThe materials business is on track for 2024 revenue of around $3.8 billion, or about 10% of Honeywell’s total. The division’s products range from Solstice brand refrigerants to industrial solvents and additives used in adhesives and asphalt.\n\nThe spinoff would come after a string of acquisitions by the group over the past several months, including the almost $5 billion purchase of Carrier Global Corp.’s security business, the $1.9 billion deal for defense technology company CAES Systems Holdings and the $1.8 billion acquisition of Air Products and Chemicals Inc.’s liquefied natural-gas process technology and equipment business.\n\nBy spinning off the advanced materials division, Honeywell would aim to create greater financial flexibility for dealmaking.\n\nMost Read from Bloomberg Businessweek\n\nHamas Struck Israel to Spark a Wider Conflict. A Year Later, It’s Got One Rotting Rice in India Fuels Discontent About Modi’s Food Policy Tax Cuts Pay for Themselves and Other Fairy Tales Adam Neumann’s Latest Project Is a WeWork Competitor How a Short Seller’s Attack Threatens This Spanish Family Company\n\n©2024 Bloomberg L.P.\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-plans-spin-off-advanced-103837549.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.829,
            "neg": 0.05,
            "neu": 0.868,
            "pos": 0.083
        }
    },
    {
        "date": "2024-10-08T10:32:29+00:00",
        "title": "Honeywell planning to spin off advanced materials division - WSJ",
        "content": "Investing.com -- Honeywell (NASDAQ:HON) is expected to announce plans to spin off its advanced materials unit in a tax-free separation, The Wall Street Journal has reported, citing people familiar with the matter.\n\nThe division could be worth over $10 billion as a separately traded public company, the paper reported. It is on pace to register around 10%, or approximately $3.8 billion, of Honeywell's total sales this year, the WSJ said.\n\nThe materials business specializes in everything from polymers to performance fluids and employs over 3,000 people, according to Honeywell's website. By separating it, Honeywell hopes that both it and the remaining entity will have greater financial flexibility to pursue other opportunities, the WSJ reported.\n\nNorth Carolina-based Honeywell, a sprawling industrial conglomerate whose operations range from aerospace to building automation, currently has a market capitalization of about $132.4 billion.\n\nShares in the firm rose by more than 2% in premarket US trading.\n\nChief Executive Officer Vimal Kapur, who took over at the helm of the company in June 2023, has been pushing to streamline Honeywell's portfolio to focus on its aviation, automation and energy divisions.\n\nKapur has overseen a raft of recent acquisitions, including an about $5 billion deal to purchase Carrier Global (NYSE:CARR)'s security business, a $2 billion agreement for defense technology firm CAES Systems and a $1.8 billion purchase of liquefied natural gas process technology group Air Products (NYSE:APD).\n\nIn July, Honeywell slashed its annual profit forecast due to weaker demand at its industrial automation segment, which was hit by softer volumes following a drive to offload existing inventory prior to ordering new products.\n\nThe company said it now projects a full-year adjusted profit of $10.05 to $10.25 per share, compared to its prior outlook of $10.15 to $10.45 a share.\n\n(Reuters contributed reporting.)\n\nRelated Articles\n\nHoneywell planning to spin off advanced materials division - WSJ\n\nIndia stocks higher at close of trade; Nifty 50 up 0.88%\n\nHoneywell to spin off advanced materials business\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-planning-spin-off-advanced-103229301.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "APD.US",
            "CARR.US",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.986,
            "neg": 0.018,
            "neu": 0.848,
            "pos": 0.133
        }
    },
    {
        "date": "2024-10-08T10:00:00+00:00",
        "title": "HONEYWELL ANNOUNCES PLAN TO SPIN OFF ADVANCED MATERIALS BUSINESS TO SHAREOWNERS",
        "content": "Independent company to be a leading provider of sustainability-focused specialty chemicals and materials with approximately $3.8 billion of revenue and an EBITDA margin greater than 25% expected in FY24 Advanced Materials portfolio includes leading brands such as Solstice®, Spectra®, Hydranal® and Aclar®, among others Honeywell continues to simplify and optimize its portfolio around three compelling megatrends: automation, the future of aviation and energy transition Tax-free spin to shareowners targeted to be completed by the end of 2025 or early 2026\n\nCHARLOTTE, N.C., Oct. 8, 2024 /PRNewswire/ -- Honeywell (Nasdaq: HON) today announced a plan to spin off its Advanced Materials business into an independent, U.S. publicly traded company, which is targeted to be completed by the end of 2025 or early 2026. Honeywell expects to execute the planned spin in a tax-free manner to its shareowners. (PRNewsfoto/Honeywell)\n\nAs a leading global provider of sustainability-focused specialty chemicals and materials, this pure-play business will be well-positioned to benefit from an enhanced strategic focus and the financial flexibility to pursue innovation and growth opportunities through investment cycles. Further, the planned spin-off will enable Honeywell to progress its strategic priorities of accelerating organic growth, evolving its Accelerator operating system, and optimizing its portfolio.\n\n\"Given the sustained market demand for advanced specialty chemicals and materials around the globe, we are confident now is the right time for this business to grow independently, leveraging its leading technologies and deep customer relationships. As a sector leader, this new company will have a greater strategic focus on innovation, enabling it to develop new, more sustainable solutions and products with next-generation chemistry to create further value for shareowners,\" said Vimal Kapur, Chairman and CEO of Honeywell.\n\nKapur added, \"Today's announcement is the latest step in the optimization of the Honeywell portfolio, a key priority I laid out in my first year leading the company. Through the powerful combination of strategic bolt-on acquisitions and subtractions of high quality but non-core business lines, we continue to enhance our portfolio mix and further tighten Honeywell's alignment to three compelling megatrends: automation, the future of aviation, and energy transition—underpinned by our Accelerator business models.\"\n\nThe planned spin-off is expected to create value for all stakeholders as both Honeywell and the Advanced Materials business will benefit from:\n\nStory continues\n\nA simplified strategic focus; A greater financial flexibility to pursue prioritized organic growth opportunities throughout investment cycles; An improved ability to customize capital allocation priorities in alignment with strategic focus; and Distinct investment profiles that position each company to unlock greater long-term value for shareowners.\n\nHoneywell's Continued Simplification and Portfolio Optimization\n\nThe planned spin-off of the Advanced Materials business follows four recent acquisitions Honeywell announced as part of its disciplined capital deployment strategy. The company is focused on high-return acquisitions that will drive future growth across its portfolio in alignment with the three powerful megatrends. In the past 12 months, Honeywell completed the acquisitions of: Carrier Access Solutions, Civitanavi, CAES and Air Products' liquified natural gas (LNG) business.\n\nHoneywell is currently on pace to exceed its commitment to deploy at least $25 billion toward high-return capital expenditures, dividends, opportunistic share purchases and accretive acquisitions through 2025, with approximately $9 billion deployed towards acquisitions to date in 2024.\n\nFollowing the completion of the planned spin of the Advanced Materials business, Honeywell will be positioned to further improve its organic sales growth, lower capital intensity, reduce cyclicality of sales and enhance free cash flow generation capability.\n\nAdvanced Materials\n\nUpon completion of the spin-off, the Advanced Materials business will be a sustainability-focused specialty chemicals and materials pure play with leading positions across fluorine products, electronic materials, industrial grade fibers, and healthcare packaging solutions. The business offers technologies that include the breakthrough low global warming Solstice® hydrofluoro-olefin (HFO) technology, which has helped avoid the potential release of the equivalent of more than 326 million metric tons of carbon dioxide into the atmosphere.[1] Additionally, the business manufactures a wide variety of high-performance specialty materials technologies ranging from Spectra®, a fiber used in high-end armor technology to protect in law enforcement and military applications, to Hydranal®, the most trusted brand in Karl Fischer titration, to Aclar®, a high-performance pharmaceutical packaging material critical to preserving prescription drugs and keeping them safe.\n\nAdvanced Materials is expected to have FY24 estimated revenue of between $3.7 billion and $3.9 billion with an EBITDA margin greater than 25%. As a standalone company with a large-scale domestic manufacturing base, it will be positioned to benefit from a compelling investment profile and a more flexible and optimized capital allocation strategy.\n\nTransaction Details\n\nThe planned spin-off transaction is targeted for completion by the end of 2025 or early 2026, subject to certain customary conditions, including, among others, the filing and effectiveness of applicable filings (including a Form 10 registration statement) with the U.S. Securities and Exchange Commission, assurance that the spin-off of the Advanced Materials business will be tax-free to Honeywell's shareowners, receipt of applicable regulatory approvals and final approval by Honeywell's board of directors. Approval by Honeywell's shareowners is not required.\n\nThe spin transaction will not impact Honeywell's FY24 guidance.\n\nAs the process progresses, Honeywell intends to provide additional information regarding the future management team and board of directors for the independent Advanced Materials company.\n\nGoldman Sachs & Co. LLC is serving as financial advisor to Honeywell. Skadden, Arps, Slate, Meagher & Flom LLP is providing external legal counsel.\n\nConference Call Details\n\nHoneywell will discuss the transaction during an investor conference call starting at 8:30 a.m. Eastern Time today. A live webcast of the investor call as well as related presentation materials will be available through the Investor Relations section of the company's website (www.honeywell.com/investor). A replay of the webcast will be available for 30 days following the presentation.\n\nAbout Honeywell\n\nHoneywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Forge IoT platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world smarter, safer and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nNon-GAAP Measure\n\nThis release references EBITDA, a non-GAAP measure which we define as earnings before tax, depreciation and amortization. Management believes that, when considered together with reported amounts, this measure is useful to investors and management in understanding ongoing operations and in the analysis of ongoing operating trends.\n\nManagement does not consider this non-GAAP measure in isolation or as an alternative to financial measures determined in accordance with GAAP. The principal limitation of this non-GAAP financial measure is that it excludes significant expenses that are required by GAAP to be recognized in the consolidated financial statements. In addition, it is subject to inherent limitations as it reflects the exercise of judgments by management about which expenses are excluded or included in determining this non-GAAP financial measure.\n\nForward-Looking Statements\n\nWe describe many of the trends and other factors that drive our business and future results in this release. Such discussions contain forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended (the Exchange Act). Forward-looking statements are those that address activities, events, or developments that management intends, expects, projects, believes, or anticipates will or may occur in the future. They are based on management's assumptions and assessments in light of past experience and trends, current economic and industry conditions, expected future developments, and other relevant factors, many of which are difficult to predict and outside of our control. They are not guarantees of future performance, and actual results, developments and business decisions may differ significantly from those envisaged by our forward-looking statements. We do not undertake to update or revise any of our forward-looking statements, except as required by applicable securities law. Our forward-looking statements are also subject to material risks and uncertainties, including ongoing macroeconomic and geopolitical risks, such as lower GDP growth or recession, capital markets volatility, inflation, and certain regional conflicts, that can affect our performance in both the near- and long-term. In addition, no assurance can be given that any plan, initiative, projection, goal, commitment, expectation, or prospect set forth in this release can or will be achieved. Some of the important factors that could cause Honeywell's actual results to differ materially from those projected in any such forward-looking statements include, but are not limited to: (i) the ability of Honeywell to effect the spin-off transaction described above and to meet the conditions related thereto; (ii) the possibility that the spin-off transaction will not be completed within the anticipated time period or at all; (iii) the possibility that the spin-off transaction will not achieve its intended benefits; (iv) the impact of the spin-off transaction on Honeywell's businesses and the risk that the spin-off transaction may be more difficult, time-consuming or costly than expected, including the impact on Honeywell's resources, systems, procedures and controls, diversion of management's attention and the impact and possible disruption of existing relationships with regulators, customers, suppliers, employees and other business counterparties; (v) the possibility of disruption, including disputes, litigation or unanticipated costs, in connection with the spin-off transaction; (vi) the uncertainty of the expected financial performance of Honeywell or the new company following completion of the spin-off transaction; (vii) negative effects of the announcement or pendency of the spin-off transaction on the market price of Honeywell's securities and/or on the financial performance of Honeywell; (viii) the ability to achieve anticipated capital structures in connection with the spin-off transaction, including the future availability of credit ad factors that may affect such availability; (ix) the ability to achieve anticipated credit ratings in connection with the spin-off transaction; (x) the ability to achieve anticipated tax treatments in connection with the spin-off transaction and future, if any, divestitures, mergers, acquisitions and other portfolio changes and the impact of changes in relevant tax and other laws; (xi) the failure to realize expected benefits and effectively manage and achieve anticipated synergies and operational efficiencies in connection with the spin-off transaction and completed and future, if any, divestitures, mergers, acquisitions, and other portfolio management, productivity and infrastructure actions; (xii) the risks and uncertainties, including increased costs and the ability to obtain raw materials and meet customer needs from, among other events, pandemics and responsive actions; (xiii) adverse changes in worldwide economic, political, regulatory, international trade, geopolitical, capital markets and other external conditions; and other factors beyond Honeywell's control, including inflation, recession, military conflicts, natural and other disasters or weather-related events, that impact the operations of the company, its customers and/or its suppliers; (xiv) the ability to offset increases in cost of inputs, including raw materials, energy and logistics; (xv) the risks, including ability to achieve, and costs associated with Honeywell's sustainability strategy, including the actual conduct of the company's activities and results thereof, and the development, implementation, achievement or continuation of any goal, program, policy or initiative discussed or expected; (xvi) other risks to Honeywell's business and operations, including the risk of impairment; and (xvii) other risk factors discussed in Honeywell's most recent annual report and subsequent current and periodic reports filed with the U.S. Securities and Exchange Commission (the \"SEC\"). Unlisted factors may present significant additional obstacles to the realization of forward-looking statements. Consequences of material differences in results as compared with those anticipated in the forward-looking statements could include, among other things, business or supply chain disruption, operational problems, financial loss, legal liability to third parties and similar risks, any of which could have a material adverse effect on Honeywell's consolidated financial condition, results of operations, credit rating or liquidity. You should not place undue reliance on forward-looking statements, which speak only as of the date they are made. Honeywell assumes no obligation to publicly provide revisions or updates to any forward-looking statements whether as a result of new information, future developments or otherwise, should circumstances change, except as otherwise required by securities and other applicable laws. These forward-looking statements should be considered in light of the information included in this release and our other filings with the SEC. Any forward-looking plans described herein are not final and may be modified or abandoned at any time.\n\n1 Calculations are based on actual sales of Solstice products (in lbs) from January 2010 through December 2022.\n\nContacts: Media  Investors Stacey Jones  Sean Meakim Stacey.Jones@Honeywell.com Sean.Meakim@Honeywell.com  (980) 378-6258 (980) 316-9388 Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-announces-plan-to-spin-off-advanced-materials-business-to-shareowners-302269425.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-announces-plan-spin-off-100000368.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.059,
            "neu": 0.797,
            "pos": 0.145
        }
    },
    {
        "date": "2024-10-08T09:09:40+00:00",
        "title": "Honeywell to spin off advanced materials unit in CEO's growth push",
        "content": "(Reuters) -Honeywell will spin off its advanced materials unit into a publicly traded company, the U.S. conglomerate said on Tuesday, simplifying its business to sharpen its focus on aviation, automation and energy transition.\n\nThe division, valued at $11 billion by Barclays, supplies to industries that make bullet-resistant armor to pharmaceutical packaging.\n\n\"Given the sustained market demand for advanced specialty chemicals and materials ..., we are confident now is the right time for this business to grow independently,\" CEO Vimal Kapur said.\n\nSince taking the helm last year, Kapur has pivoted the company to the so-called mega trends of automation, the future of aviation and energy transition.\n\nHoneywell has bought Carrier's security business for $4.95 billion and aerospace and defense firm CAES Systems for $1.9 billion as part of that shift.\n\nThe spin-off, expected to be tax-free to its shareholders, is likely to be completed by the end of next year or early 2026.\n\nHoneywell plans to name a management team and a board for the independent company later.\n\nIt expects the advanced materials business to generate revenue of $3.7 billion to $3.9 billion in fiscal 2024 and have an operating margin of more than 25%.\n\nHoneywell trimmed its annual profit forecast in July due to weak demand in its industrial automation business.\n\nThe company's shares were up 2% in premarket trading. They are down about 3% for the year.\n\n(Reporting by Nathan Gomes and Aatreyee Dasgupta in Bengaluru; Editing by Mrigank Dhaniwala, Sriraj Kalluvila and Shilpi Majumdar)",
        "link": "https://ca.finance.yahoo.com/news/honeywell-spin-off-advanced-materials-090940246.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.947,
            "neg": 0.023,
            "neu": 0.881,
            "pos": 0.097
        }
    },
    {
        "date": "2024-10-08T00:00:00+00:00",
        "title": "Why Honeywell Stock Topped the Market on Tuesday",
        "content": "The company is forging ahead with its long-term goal of becoming leaner and more focused.",
        "link": "https://www.fool.com/investing/2024/10/08/why-honeywell-stock-topped-the-market-on-tuesday/",
        "symbols": [
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.434,
            "neg": 0,
            "neu": 0.83,
            "pos": 0.17
        }
    }
]