[
    {
        "date": "2024-09-23T15:40:12+00:00",
        "title": "MARUY or HON: Which Is the Better Value Stock Right Now?",
        "content": "Investors looking for stocks in the Diversified Operations sector might want to consider either Marubeni Corp. (MARUY) or Honeywell International Inc. (HON). But which of these two stocks is more attractive to value investors? We'll need to take a closer look to find out.\n\nWe have found that the best way to discover great value opportunities is to pair a strong Zacks Rank with a great grade in the Value category of our Style Scores system. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits.\n\nMarubeni Corp. has a Zacks Rank of #2 (Buy), while Honeywell International Inc. has a Zacks Rank of #3 (Hold) right now. The Zacks Rank favors stocks that have recently seen positive revisions to their earnings estimates, so investors should rest assured that MARUY has an improving earnings outlook. But this is only part of the picture for value investors.\n\nValue investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels.\n\nThe Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors.\n\nMARUY currently has a forward P/E ratio of 7.69, while HON has a forward P/E of 20.06. We also note that MARUY has a PEG ratio of 1.15. This popular figure is similar to the widely-used P/E ratio, but the PEG ratio also considers a company's expected EPS growth rate. HON currently has a PEG ratio of 2.31.\n\nAnother notable valuation metric for MARUY is its P/B ratio of 1.10. The P/B ratio pits a stock's market value against its book value, which is defined as total assets minus total liabilities. For comparison, HON has a P/B of 7.54.\n\nThese metrics, and several others, help MARUY earn a Value grade of A, while HON has been given a Value grade of D.\n\nMARUY sticks out from HON in both our Zacks Rank and Style Scores models, so value investors will likely feel that MARUY is the better option right now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nMarubeni Corp. (MARUY) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/maruy-hon-better-value-stock-154012833.html",
        "symbols": [
            "8002.TSE",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "MARA.BE",
            "MARA.DU",
            "MARA.F",
            "MARA.MU",
            "MARA.STU",
            "MARUF.US",
            "MARUY.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.005,
            "neu": 0.808,
            "pos": 0.187
        }
    },
    {
        "date": "2024-09-23T12:04:00+00:00",
        "title": "Honeywell to Develop Artificial Intelligence-Enabled Agent Powered by Qualcomm",
        "content": "Advanced mobile assistant intended to amplify business operations and customer engagements powered by multi-modal AI workflows\n\nCHARLOTTE, N.C., Sept. 23, 2024 /PRNewswire/ -- Honeywell (Nasdaq: HON) today announced that it is working to develop an artificial intelligence (AI)-enabled Multi-Modal Intelligent Agent for Honeywell mobile devices powered by Qualcomm Technologies, Inc. The agent will allow workers and customers in the distribution center and retail industries to interact naturally with their handheld devices through voice, pictures, and barcodes. Honeywell working with Qualcomm Technologies, Inc. to develop an AI-enabled intelligent agent for workers' mobile devices.\n\nThis AI-powered solution is built to function as a digital resource for the modern labor force and designed to enable today's stretched workforce to quickly tap into answers and outcomes, helping result in time savings, greater accuracy, and interactive results. The design and development of the Multi-Modal Intelligent Agent also supports Honeywell's alignment of its portfolio to three compelling megatrends, including automation.\n\nWorkers will be able to enter data into the technology and then receive practical answers to queries like, \"Do we have the gluten-free variant of this product in stock?\" or \"Where can I find this particular item in the store?\" Depending on the question, users will receive responses in the form of an image, video, spoken response, text answer, or a combination of several modalities. This functionality is designed to enable workers to more efficiently complete their work while simultaneously navigating other ongoing tasks, such as assisting customers in a retail setting or performing multi-step workflows in a distribution center. The solution will be available to users through a software development kit that can integrate with an organization's existing applications and systems.\n\n\"Utilizing our strengths in on-device generative AI, high-performance and low power computing, this collaboration with Honeywell underscores our commitment to pioneering innovative solutions that will propel the expansion of the connected intelligent edge,\" said Nakul Duggal, group general manager, of automotive, industrial and embedded IoT, and cloud computing, Qualcomm Technologies, Inc. \"Honeywell's new Multi-Modal Intelligent Agent represents a significant step forward in utilizing advanced edge AI to streamline operations and elevate customer interactions across industries. This initiative enables us to drive digital transformation, enhancing how businesses interact with their environments through intelligent and responsive technology.\"\n\nStory continues\n\n\"By pairing Honeywell's easy-to-use mobile devices and intelligent software with Qualcomm Technologies' industry-leading edge AI processors, Honeywell is creating solutions to make workers' jobs easier while also helping businesses produce the stellar experience they want for their customers,\" said Jason Urso, Honeywell Industrial Automation chief technology officer. \"With AI, Honeywell is amplifying what's possible for businesses with mobile workers today.\"\n\nThe Multi-Modal Intelligent Agent is expected to be available in early 2025. To learn more about how Honeywell is leveraging AI across key industries, visit: https://automation.honeywell.com/us/en/solutions/productivity.\n\nAbout Honeywell Honeywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Forge IoT platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world smarter and safer as well as more secure and sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nQualcomm is a trademark or registered trademark of Qualcomm Incorporated.\n\nMedia Contact: Carly Ingersoll\r\n+1 (704) 626-1374\r\ncarling.ingersoll@honeywell.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-to-develop-artificial-intelligence-enabled-agent-powered-by-qualcomm-302254568.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-develop-artificial-intelligence-enabled-120400545.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.005,
            "neu": 0.822,
            "pos": 0.172
        }
    }
]