[
    {
        "date": "2024-08-29T13:00:00+00:00",
        "title": "HONEYWELL ANNOUNCES PARTICIPATION AT UPCOMING INVESTOR CONFERENCES",
        "content": "CHARLOTTE, N.C., Aug. 29, 2024 /PRNewswire/ -- Honeywell (NASDAQ: HON) today announced its participation at upcoming investor conferences in September. (PRNewsfoto/Honeywell)\n\nJim Currier, President and Chief Executive Officer of Honeywell Aerospace, will present at the Jefferies Industrials Conference in New York City on Thursday, September 5, 2024, from 8:05 a.m. - 8:35 a.m. EDT. Greg Lewis, Senior Vice President and Chief Financial Officer of Honeywell, will attend the Vertical Research Partners Global Industrials Conference in Westbrook, Connecticut, on Friday, September 6, 2024. Mr. Lewis will also attend the J.P. Morgan U.S. All Stars Conference in London, England, on Tuesday, September 17, 2024. Vimal Kapur, Chief Executive Officer of Honeywell, will present at the Morgan Stanley Laguna Conference in Dana Point, California, on Wednesday, September 11, 2024, from 7:35 a.m. - 8:05 a.m. PDT (10:35 a.m. – 11:05 a.m. EDT).\n\nReal-time audio webcasts of the presentations can be accessed at http://www.honeywell.com/investor, where related materials will be posted prior to the presentations and replays of the webcasts will be available for 30 days following the presentations.\n\nHoneywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation, and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Connected Enterprise integrated software platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations that help make the world smarter, safer, and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nHoneywell uses our Investor Relations website, www.honeywell.com/investor, as a means of disclosing information which may be of interest or material to our investors and for complying with disclosure obligations under Regulation FD. Accordingly, investors should monitor our Investor Relations website, in addition to following our press releases, SEC filings, public conference calls, webcasts, and social media.\n\nContacts: Media Investor Relations Stacey Jones Sean Meakim (980) 378-6258 (704) 627-6200 stacey.jones@honeywell.com  sean.meakim@honeywell.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-announces-participation-at-upcoming-investor-conferences-302234034.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-announces-participation-upcoming-investor-130000101.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.979,
            "neg": 0.004,
            "neu": 0.907,
            "pos": 0.09
        }
    },
    {
        "date": "2024-08-29T12:00:00+00:00",
        "title": "HONEYWELL AND CISCO LEVERAGE AI AND AUTOMATION TO HELP REDUCE BUILDING ENERGY CONSUMPTION",
        "content": "Expanded collaboration uses real-time occupancy data to help manage environmental impact of buildings\n\nATLANTA, Aug. 29, 2024 /PRNewswire/ -- Honeywell (NASDAQ: HON) announced today a collaboration with Cisco on an AI-powered solution that automatically adapts building systems based on fluctuating usage levels, reducing energy consumption and optimizing the environment for worker productivity and comfort. HONEYWELL AND CISCO LEVERAGE AI AND AUTOMATION TO HELP REDUCE BUILDING ENERGY CONSUMPTION\n\nBy combining Honeywell Forge Sustainability+ for Buildings and Cisco Spaces, the joint effort uses AI and machine learning to help monitor assets to adjust heating, ventilation and air conditioning (HVAC) systems based on real-time occupancy for a single building or an entire campus.\n\nCisco Spaces collects occupancy and environmental data from Cisco network infrastructure, environmental sensors, collaboration devices and third-party IoT devices without the need to add additional hardware. Honeywell Forge Sustainability+ for Buildings then uses this information to help improve energy efficiency and provide insights on building utilization. Together with Honeywell's latest Optimizer Advanced Controller for Buildings, this real-time occupancy data can help further improve energy efficiency for greater resiliency.\n\nRoom temperatures, lighting and ventilation are autonomously adjusted based on where people are in the building and customer selected controls. This ultimately helps automate daily building operations, optimize energy use and drive employee comfort while monitoring GHG emissions.\n\n\"Buildings have historically been a substantial contributor to overall carbon emissions, but with the rise of hybrid work, operators now have the opportunity to take a fresh look at addressing their environmental impact by moving their HVAC systems away from consistent 9-to-5 schedules,\" said Greg Turner, Chief Technology Officer of Honeywell's Building Automation segment. \"By tapping into a building's existing technology infrastructure and harnessing the power of AI to fine-tune heating and cooling according to zone occupancy levels, our collaboration with Cisco empowers building owners to gain control of their environment and significantly curb emissions.\"\n\nThe collaboration is part of Honeywell's broader effort to help companies reduce their buildings' environmental footprint and supports Honeywell's alignment of its portfolio to three compelling megatrends, including automation and energy transition. It is also enabled by Cisco's Country Digital Acceleration program, a global initiative that collaborates with government and private sector leaders to build sustainable, secure and inclusive communities powered by ethical and innovative technology solutions.\n\n\"The convergence of IT and OT infrastructures, seamlessly interoperable with leading building management system (BMS) platforms, ushers in an era of real-time data insights that can optimize energy usage, regardless of building age or retrofit status,\" said Wes Sylvester, Vice President of Cisco's Industry Solutions Group. \"By working closely with Honeywell, we're enabling building operators with enhanced visibility and control over operational data, setting a new standard for energy efficiency and reduced environmental impact.\"\n\n\"Energy management is firmly at the forefront of building owners' minds,\" said Harry Wilson, analyst at Verdantix. \"The continued presence of hybrid working policies and lower office utilization, coupled with new asset-specific realities, has put owners under substantial financial and environmental pressure to ensure they are operating facilities efficiently and not wasting resources.\"\n\nAbout Honeywell  \r\nHoneywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Forge IoT platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world smarter, safer and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nContacts:  Honeywell  Cisco  Dawn Wotapka  Andrew Fletcher Cole (631) 943-3782  (647) 612-2653 dawn.wotapka@honeywell.com  andrcole@cisco.com  Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-and-cisco-leverage-ai-and-automation-to-help-reduce-building-energy-consumption-302233339.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-cisco-leverage-ai-automation-120000277.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.01,
            "neu": 0.777,
            "pos": 0.213
        }
    },
    {
        "date": "2024-08-29T07:49:48+00:00",
        "title": "Q2 General Industrial Machinery Earnings Review: First Prize Goes to 3M (NYSE:MMM)",
        "content": "Q2 General Industrial Machinery Earnings Review: First Prize Goes to 3M (NYSE:MMM)\n\nAs the craze of earnings season draws to a close, here’s a look back at some of the most exciting (and some less so) results from Q2. Today, we are looking at general industrial machinery stocks, starting with 3M (NYSE:MMM).\n\nAutomation that increases efficiency and connected equipment that collects analyzable data have been trending, creating new demand for general industrial machinery companies. Those who innovate and create digitized solutions can spur sales and speed up replacement cycles, but all general industrial machinery companies are still at the whim of economic cycles. Consumer spending and interest rates, for example, can greatly impact the industrial production that drives demand for these companies’ offerings.\n\nThe 14 general industrial machinery stocks we track reported a mixed Q2. As a group, revenues beat analysts’ consensus estimates by 1.8% while next quarter’s revenue guidance was 4% below.\n\nStocks, especially growth stocks with cash flows further into the future, had a good end of 2023. On the other hand, this year has seen more volatile stock market swings due to mixed inflation data, and while some general industrial machinery stocks have fared somewhat better than others, they have collectively declined. On average, share prices are down 3.3% since the latest earnings results.\n\nBest Q2: 3M (NYSE:MMM)\n\nProducers of the first asthma inhaler, 3M Company (NYSE:MMM) is a global conglomerate known for products in industries like healthcare, safety, electronics, and consumer goods.\n\n3M reported revenues of $6.02 billion, down 24.7% year on year. This print exceeded analysts’ expectations by 3.3%. Overall, it was a strong quarter for the company with an impressive beat of analysts’ operating margin estimates and a solid beat of analysts’ organic revenue estimates. 3M Total Revenue\n\nInterestingly, the stock is up 24.5% since reporting and currently trades at $128.78.\n\nIs now the time to buy 3M? Access our full analysis of the earnings results here, it’s free.\n\nHoneywell (NASDAQ:HON)\n\nOriginally founded in 1906 as a thermostat company, Honeywell (NASDAQ:HON) is an aerospace and defense manufacturing company building technologies, performance materials, and safety and productivity solutions.\n\nHoneywell reported revenues of $9.58 billion, up 4.7% year on year, outperforming analysts’ expectations by 1.7%. It was a very strong quarter for the company with an impressive beat of analysts’ organic revenue estimates. Honeywell Total Revenue\n\nHoneywell scored the highest full-year guidance raise among its peers. Although it had a fine quarter compared its peers, the market seems unhappy with the results as the stock is down 3.8% since reporting. It currently trades at $205.55.\n\nStory continues\n\nIs now the time to buy Honeywell? Access our full analysis of the earnings results here, it’s free.\n\nWeakest Q2: Hillenbrand (NYSE:HI)\n\nHillenbrand, Inc. (NYSE: HI) is an industrial company that designs, manufactures, and sells highly engineered processing equipment and solutions for various industries.\n\nHillenbrand reported revenues of $786.6 million, up 9.8% year on year, falling short of analysts’ expectations by 3.9%. It was a weak quarter for the company with full-year revenue guidance missing analysts’ expectations and a miss of analysts’ earnings estimates.\n\nHillenbrand had the weakest full-year guidance update in the group. As expected, the stock is down 13.7% since the results and currently trades at $32.81.\n\nRead our full analysis of Hillenbrand’s results here.\n\nIllinois Tool Works (NYSE:ITW)\n\nFounded by Byron Smith, an investor who held over 100 patents, Illinois Tool Works (NYSE:ITW) manufactures engineered components and specialized equipment for numerous industries.\n\nIllinois Tool Works reported revenues of $4.03 billion, down 1.2% year on year, falling short of analysts’ expectations by 1.3%. Overall, it was a slower quarter for the company with a miss of analysts’ organic revenue estimates.\n\nThe stock is down 1.1% since reporting and currently trades at $245.33.\n\nRead our full, actionable report on Illinois Tool Works here, it’s free.\n\nL.B. Foster (NASDAQ:FSTR)\n\nFounded with a $2,500 loan, L.B. Foster (NASDAQ:FSTR) is a provider of products and services for the transportation and energy infrastructure sectors, including rail products, construction materials, and coating solutions.\n\nL.B. Foster reported revenues of $140.8 million, down 4.9% year on year, surpassing analysts’ expectations by 2.5%. Revenue aside, it was a slower quarter for the company with a miss of analysts’ earnings estimates and underwhelming EBITDA guidance for the full year.\n\nThe stock is down 7.9% since reporting and currently trades at $19.11.\n\nRead our full, actionable report on L.B. Foster here, it’s free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/q2-general-industrial-machinery-earnings-074948027.html",
        "symbols": [
            "9HI.F",
            "FSTR.US",
            "HI.US",
            "HON.US",
            "ITW.US",
            "MMM.BE",
            "MMM.F",
            "MMM.HA",
            "MMM.HM",
            "MMM.MU",
            "MMM.MX",
            "MMM.STU",
            "MMM.US",
            "MMM.XETRA",
            "MMMC34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.039,
            "neu": 0.816,
            "pos": 0.145
        }
    }
]