[
    {
        "date": "2024-05-08T13:00:00+00:00",
        "title": "HONEYWELL ANNOUNCES PARTICIPATION AT UPCOMING INVESTOR CONFERENCES",
        "content": "CHARLOTTE, N.C., May 8, 2024 /PRNewswire/ -- Honeywell (NASDAQ: HON) today announced its participation at upcoming investor conferences in May. (PRNewsfoto/Honeywell)\n\nJim Currier, Chief Executive Officer of Aerospace Technologies, will present at Bank of America's 31st Annual Transportation, Airlines, and Industrials Conference in New York City on Tuesday, May 14, 2024, from 8:00 a.m. - 8:35 a.m. EDT. Dave Shilliday, Vice President and General Manager of Advanced Air Mobility, will present virtually at the 2nd Annual Jefferies eVTOL / AAM Summit on Thursday, May 30, 2024, from 1:50 p.m. - 2:20 p.m. EDT.\n\nReal-time audio webcasts of the presentations can be accessed at http://www.honeywell.com/investor, where related materials will be posted prior to the presentations and replays of the webcasts will be available for 30 days following the presentations.\n\nHoneywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation, and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Connected Enterprise integrated software platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations that help make the world smarter, safer, and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nHoneywell uses our Investor Relations website, www.honeywell.com/investor, as a means of disclosing information which may be of interest or material to our investors and for complying with disclosure obligations under Regulation FD. Accordingly, investors should monitor our Investor Relations website, in addition to following our press releases, SEC filings, public conference calls, webcasts, and social media.\n\nContacts:  Media Investor Relations Stacey Jones Sean Meakim (980) 378-6258  (704) 627-6200 stacey.jones@honeywell.com  sean.meakim@honeywell.com  Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-announces-participation-at-upcoming-investor-conferences-302139764.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-announces-participation-upcoming-investor-130000385.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.981,
            "neg": 0.004,
            "neu": 0.886,
            "pos": 0.11
        }
    }
]