[
    {
        "date": "2024-08-21T16:56:00+00:00",
        "title": "Honeywell (HON) Boasts Strong Prospects Despite Headwinds",
        "content": "Honeywell International Inc. HON is experiencing strength in its commercial aviation aftermarket business driven by solid demand in the air transport and business aviation markets. Also, strength in the company’s commercial aviation original equipment business, backed by an improvement in build rates and an increase in air transport hours, has been favorable. \r\n\r\nIn the quarters ahead, it expects the Aerospace segment to benefit from strong demand in commercial aviation, growth in air transport flight hours and higher chipset deliveries. Strength in its defense and space business, owing to stable U.S. and international defense spending volumes and sustained demand from the current geopolitical climate, is also likely to be beneficial. \r\n\r\nSolid demand for its products and solutions, led by increasing building projects, will likely be beneficial for the Building Automation segment. Strength in the advanced materials business, driven by higher demand for fluorine products, bodes well for the Energy and Sustainability Solutions segment.\r\n\r\nThe company has been strengthening its business through acquisitions. Acquisitions had a positive impact of 1% on sales growth in the second quarter. In July 2024, it inked a deal to acquire Air Products’ liquefied natural gas process technology and equipment business for $1.81 billion in cash. Subject to regulatory approvals and customary closing conditions, the acquisition is expected to close before the end of 2024. \r\n\r\nIn June 2024, Honeywell inked a deal to acquire CAES Systems Holdings LLC from private equity firm Advent. The transaction will augment its defense technology offerings across various domains, including land, sea, air and space. Subject to regulatory approvals and customary closing conditions, the acquisition is expected to close by the second half of 2024. In the same month, Honeywell acquired Carrier’s Global Access Solutions business for an all-cash deal of $4.95 billion. The inclusion of Global Access Solutions’ expertise in advanced access and security solutions, coupled with its impressive growth and margin profile, will enable Honeywell to expand its security products portfolio and boost its building automation segment.\r\n\r\nThe company inked a deal to purchase Civitanavi Systems S.p.A. for about €200 million ($217 million) to boost its portfolio of aerospace navigation solutions in March 2024. With the buyout, Honeywell expects to strengthen its foothold in the European Union. Management expects the transaction to be completed in third-quarter 2024, subject to the fulfillment of certain customary closing conditions. \r\n\r\nIn August 2023, the company acquired SCADAfence, a provider of operational technology (OT) and Internet of Things cybersecurity solutions. The acquisition will expand Honeywell's OT cybersecurity portfolio in Tel Aviv, Israel, while simultaneously fortifying its existing capabilities in cybersecurity, thus offering customers enhanced security, reliability and efficiency. SCADAfence has been integrated into the Honeywell Forge Cybersecurity+ suite within Honeywell Connected Enterprise.\r\n\r\nHoneywell remains committed to rewarding its shareholders handsomely through dividend payments and share buybacks. In September 2023, HON hiked its quarterly dividend by approximately 5% to $1.08 per share (annually: $4.32). This marks its 14th consecutive dividend hike since 2010. In the first six months of 2024, it paid out dividends of $1.4 billion and repurchased shares worth $1.2 billion. Strong free cash flow generation supports the company’s shareholder-friendly activities. Honeywell expects free cash flow to be in the range of $5.5-$5.9 billion for 2024.\r\n\r\nIn the past year, this Zacks Rank #3 (Hold) company’s shares gained 8.1% compared with the industry’s 17.6% growth.\n\nStory continues Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nHowever, Honeywell has been witnessing weakness in the Industrial Automation segment. Weakness in the warehouse and workflow solutions businesses, due to lower demand for projects, has been affecting the segment's performance. Also, the weakened demand for personal protective equipment within the sensing and safety technologies business is worrisome. Continued softness in the warehouse automation business, owing to lower investments in the market, remains a concern for the segment.\r\n\r\nHoneywell’s long-term debt in the last five years (2019-2023) witnessed a CAGR of 8.3%. At the end of the second quarter, the company’s long-term debt was $20.9 billion, higher than $16.6 billion at 2023-end. The increase in its debt level was primarily attributable to the funds raised for the Global Access Solutions acquisition. Considering its high debt level, its cash and cash equivalents of $9.6 billion do not look impressive. \r\n\r\nHoneywell stock looks more leveraged than the industry. Its debt/capital ratio is currently 0.61, higher than 0.32 of the industry.  Also, interest expenses and other financial charges in the second quarter remained high at $250 million. Exiting the second quarter, its long-term debt and current maturities totaled $23.4 billion. High debt levels can increase its financial obligations and prove detrimental to profitability in the quarters ahead.\n\nStocks to Consider\n\nSome better-ranked companies are discussed below.\r\n\r\n3M Company MMM currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\r\n\r\nMMM delivered a trailing four-quarter average earnings surprise of 12.6%. In the past 60 days, the Zacks Consensus Estimate for 3M’s 2024 earnings has increased 1.6%.\r\n\r\nFederal Signal Corporation FSS presently carries a Zacks Rank of 2. The company delivered a trailing four-quarter average earnings surprise of 12.3%.\r\n\r\nIn the past 60 days, the consensus estimate for FSS’s 2024 earnings has increased 5.2%.\r\n\r\nUnisys Corporation UIS currently sports a Zacks Rank of 1. UIS delivered a trailing four-quarter average earnings surprise of 87.7%.\r\n\r\nIn the past 60 days, the Zacks Consensus Estimate for Unisys’ 2024 earnings has increased more than 100%.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nUnisys Corporation (UIS) : Free Stock Analysis Report\n\nFederal Signal Corporation (FSS) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-hon-boasts-strong-prospects-165600689.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.041,
            "neu": 0.782,
            "pos": 0.177
        }
    },
    {
        "date": "2024-08-21T15:40:12+00:00",
        "title": "MARUY vs. HON: Which Stock Is the Better Value Option?",
        "content": "Investors looking for stocks in the Diversified Operations sector might want to consider either Marubeni Corp. (MARUY) or Honeywell International Inc. (HON). But which of these two stocks offers value investors a better bang for their buck right now? We'll need to take a closer look.\n\nThe best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits.\n\nCurrently, Marubeni Corp. has a Zacks Rank of #1 (Strong Buy), while Honeywell International Inc. has a Zacks Rank of #3 (Hold). This means that MARUY's earnings estimate revision activity has been more impressive, so investors should feel comfortable with its improving analyst outlook. But this is only part of the picture for value investors.\n\nValue investors also try to analyze a wide range of traditional figures and metrics to help determine whether a company is undervalued at its current share price levels.\n\nOur Value category grades stocks based on a number of key metrics, including the tried-and-true P/E ratio, the P/S ratio, earnings yield, and cash flow per share, as well as a variety of other fundamentals that value investors frequently use.\n\nMARUY currently has a forward P/E ratio of 8.22, while HON has a forward P/E of 19.70. We also note that MARUY has a PEG ratio of 1.23. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. HON currently has a PEG ratio of 2.27.\n\nAnother notable valuation metric for MARUY is its P/B ratio of 1.27. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. By comparison, HON has a P/B of 7.42.\n\nThese metrics, and several others, help MARUY earn a Value grade of A, while HON has been given a Value grade of D.\n\nMARUY stands above HON thanks to its solid earnings outlook, and based on these valuation figures, we also feel that MARUY is the superior value option right now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nMarubeni Corp. (MARUY) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/maruy-vs-hon-stock-better-154012398.html",
        "symbols": [
            "8002.TSE",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "MARA.BE",
            "MARA.DU",
            "MARA.F",
            "MARA.MU",
            "MARA.STU",
            "MARUF.US",
            "MARUY.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.005,
            "neu": 0.803,
            "pos": 0.192
        }
    }
]