[
    {
        "date": "2024-06-03T10:55:00+00:00",
        "title": "HONEYWELL COMPLETES ACQUISITION OF CARRIER'S GLOBAL ACCESS SOLUTIONS BUSINESS AND UPDATES 2024 OUTLOOK",
        "content": "$4.95 Billion Acquisition Bolsters Honeywell's Strategic Alignment to the Automation Megatrend, Underpinned by Digitalization Positions Honeywell as a Leading Provider of Security Solutions in a Digital Age Enhances Honeywell's Building Automation Segment, Adding an Accretive Growth and Margin Business\n\nCHARLOTTE, N.C., June 3, 2024 /PRNewswire/ -- Honeywell (NASDAQ: HON) today announced the completion of its acquisition of Carrier Global Corporation's (NYSE: CARR) Global Access Solutions business for $4.95 billion. The deal positions Honeywell as a leading provider of security solutions for the digital age with opportunities for accelerated innovation in the fast-growing, cloud-based services and solutions space. This transaction also strengthens Honeywell's alignment of its portfolio around three compelling megatrends, including automation, and complements Honeywell's Building Automation segment. (PRNewsfoto/Honeywell)\n\nThe acquisition brings differentiated software capabilities through the addition of three respected brands to Honeywell's portfolio: LenelS2, a leader in commercial and enterprise access solutions; Onity, which offers electronic locks, specifically hospitality access and mobile credentials; and Supra, which specializes in cloud-based electronic lockboxes and scheduling software. Global Access Solutions' approximately 1,200 employees are now part of Honeywell. The transaction is expected to be adjusted earnings per share1 accretive in the first full year of ownership.\n\nGlobal Access Solutions enhances Honeywell's Building Automation business model of leading with high-value products that are critical for buildings. Honeywell will also benefit from the business's attractive growth and margin profile, valuable software content, and accretive mix of recurring revenue, with forecasted annual sales in excess of $1 billion when combined with Honeywell's existing security portfolio.\n\n\"As the world's security needs evolve from a focus on protecting people to protecting both people and critical assets, we see strong growth prospects for our Access Solutions acquisition,\" said Vimal Kapur, Chief Executive Officer of Honeywell. \"By building on our strong track record of delivering high-value building automation products, solutions, and services globally, this acquisition creates an exciting opportunity for us to achieve faster growth and further margin expansion, while generating better outcomes for our Building Automation customers.\"\n\nCompany Updates 2024 Outlook, Changes Non-GAAP Reporting Metrics Beginning in the second quarter, Honeywell will exclude the impact of amortization expense for acquisition-related intangible assets and other acquisition-related costs4, including the related tax effects, from segment profit1 and adjusted earnings per share1. The company believes this change provides investors with a more meaningful measure of its performance period to period, aligns the measure to how management will evaluate performance internally, and makes it easier for investors to compare our performance to peers. Honeywell plans to provide historical non-GAAP financials under this new basis to facilitate comparability when the company reports its second quarter results in July 2024.\n\nStory continues\n\nAs a result of the acquisition closing, Honeywell has updated its full-year sales, segment margin2, and adjusted earnings per share2,3 guidance (under the amended calculation). Full-year sales are now expected to be $38.5 billion to $39.3 billion, including organic1 sales growth of 4% to 6%. Segment margin2 is expected to be in the range of 23.8% to 24.1%, with segment margin expansion2 of 30 to 60 basis points. Adjusted earnings per share2,3 is expected to be in the range of $10.15 to $10.45. Operating cash flow is expected to be in the range of $6.7 billion to $7.1 billion, with free cash flow1 of $5.6 billion to $6.0 billion. A summary of the changes to the company's full-year guidance can be found in Table 1.\n\nHoneywell also updated its second-quarter sales, segment margin2, and adjusted earnings per share2,3 guidance. Second-quarter sales are expected to be $9.3 billion to $9.6 billion, with organic1 sales growth of 1% to 4%. Segment margin2 is expected to be 22.7% to 23.1%, down 40 basis points to flat compared to the prior year period. Adjusted earnings per share2,3 is expected to be in the range of $2.35 to $2.45, up 2% to 7% compared to the prior year.\n\nTABLE 1: FULL-YEAR 2024 GUIDANCE\n\nPrevious\n\nGuidance Impact of \r\nAcquisition Guidance After the \r\nAcquisition Impact of Non-\r\nGAAP Reporting \r\nChange Updated\n\nGuidance Sales $38.1B - $38.9B ~$0.4B $38.5B - $39.3B — $38.5B - $39.3B Organic1 Growth 4% - 6% — 4% - 6% — 4% - 6% Segment Margin2 23.0% - 23.3% (0.2) % 22.8% - 23.1% 1.0 % 23.8% - 24.1% Expansion2 Up 30 - 60 bps (20 bps) Up 10 - 40 bps 20 bps Up 30 - 60 bps Adjusted Earnings Per Share2,3 $9.80 - $10.10 ($0.15) $9.65 - $9.95 $0.50 $10.15 - $10.45 Adjusted Earnings Growth2,3 7% - 10% (1 %) 6% - 9% 1 % 7% - 10% Operating Cash Flow $6.7B - $7.1B — $6.7B - $7.1B — $6.7B - $7.1B Free Cash Flow1 $5.6B - $6.0B — $5.6B - $6.0B — $5.6B - $6.0B\n\n1 See additional information at the end of this release regarding non-GAAP financial measures. 2 Segment margin and adjusted EPS are non-GAAP financial measures. Management cannot reliably predict or estimate, without unreasonable effort, the impact and timing on future operating results arising from certain items excluded from segment margin or adjusted EPS. We therefore, do not present a guidance range, or a reconciliation to, the nearest GAAP financial measures of operating margin or EPS. 3 Adjusted EPS and adjusted EPS V% guidance excludes items identified in the non-GAAP reconciliation of adjusted EPS at the end of this release, including the impact of amortization expense for acquisition-related intangible assets and other acquisition-related costs, and any potential future items that we cannot reliably predict or estimate such as pension mark-to-market. 4 Acquisition-related costs are principally comprised of third-party transaction and integration costs and acquisition-related fair value adjustments to inventory.\n\nHoneywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends - automation, the future of aviation, and energy transition - underpinned by our Honeywell Accelerator operating system and Honeywell Connected Enterprise integrated software platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations that help make the world smarter, safer, and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nHoneywell uses our Investor Relations website, www.honeywell.com/investor, as a means of disclosing information which may be of interest or material to our investors and for complying with disclosure obligations under Regulation FD. Accordingly, investors should monitor our Investor Relations website, in addition to following our press releases, SEC filings, public conference calls, webcasts, and social media.\n\nWe describe certain trends and other factors that drive our business and future results in this release. Such discussions contain forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended (the Exchange Act). Forward-looking statements are those that address activities, events, or developments that management intends, expects, projects, believes or anticipates will or may occur in the future. They are based on management's assumptions and assessments in light of past experience and trends, current economic and industry conditions, expected future developments and other relevant factors, many of which are difficult to predict and outside of our control. They are not guarantees of future performance, and actual results, developments and business decisions may differ significantly from those envisaged by our forward-looking statements. We do not undertake to update or revise any of our forward-looking statements, except as required by applicable securities law. Our forward-looking statements are also subject to material risks and uncertainties, including ongoing macroeconomic and geopolitical risks, such as lower GDP growth or recession, capital markets volatility, inflation, and certain regional conflicts, that can affect our performance in both the near- and long-term. In addition, no assurance can be given that any plan, initiative, projection, goal, commitment, expectation, or prospect set forth in this release can or will be achieved. These forward-looking statements should be considered in light of the information included in this release, our Form 10-K and other filings with the Securities and Exchange Commission. Any forward-looking plans described herein are not final and may be modified or abandoned at any time.\n\nThis release contains financial measures presented on a non-GAAP basis. Honeywell's non-GAAP financial measures used in this release are as follows:\n\nSegment profit, on an overall Honeywell basis; Segment profit margin, on an overall Honeywell basis; Organic sales growth; Free cash flow; and Adjusted earnings per share.\n\nManagement believes that, when considered together with reported amounts, these measures are useful to investors and management in understanding our ongoing operations and in the analysis of ongoing operating trends. Management believes the change to adjust for amortization of acquisition-related intangibles and acquisition-related costs provides investors with a more meaningful measure of its performance period to period, aligns the measure to how management will evaluate performance internally, and makes it easier for investors to compare our performance to peers. These measures should be considered in addition to, and not as replacements for, the most comparable GAAP measure. Certain measures presented on a non-GAAP basis represent the impact of adjusting items net of tax. The tax-effect for adjusting items is determined individually and on a case-by-case basis. Refer to the Appendix attached to this release for reconciliations of non-GAAP financial measures to the most directly comparable GAAP measures. Honeywell plans to provide historical non-GAAP financials under this new basis to facilitate comparability when the company reports its second quarter results in July 2024.\n\nAppendix\n\nNon-GAAP Financial Measures\n\nThe following information provides definitions and reconciliations of certain non-GAAP financial measures presented in this press release to which this reconciliation is attached to the most directly comparable financial measures calculated and presented in accordance with generally accepted accounting principles (GAAP). Honeywell plans to provide historical non-GAAP financials under this new basis to facilitate comparability when the company reports its second quarter results in July.\n\nManagement believes that, when considered together with reported amounts, these measures are useful to investors and management in understanding our ongoing operations and in the analysis of ongoing operating trends. Management believes the change to adjust for amortization of acquisition-related intangibles and acquisition-related costs provides investors with a more meaningful measure of its performance period to period, aligns the measure to how management will evaluate performance internally, and makes it easier for investors to compare our performance to peers. These measures should be considered in addition to, and not as replacements for, the most comparable GAAP measure. Certain measures presented on a non-GAAP basis represent the impact of adjusting items net of tax. The tax-effect for adjusting items is determined individually and on a case-by-case basis. Other companies may calculate these non-GAAP measures differently, limiting the usefulness of these measures for comparative purposes.\n\nManagement does not consider these non-GAAP measures in isolation or as an alternative to financial measures determined in accordance with GAAP. The principal limitations of these non-GAAP financial measures are that they exclude significant expenses and income that are required by GAAP to be recognized in the consolidated financial statements. In addition, they are subject to inherent limitations as they reflect the exercise of judgments by management about which expenses and income are excluded or included in determining these non-GAAP financial measures. Investors are urged to review the reconciliation of the non-GAAP financial measures to the comparable GAAP financial measures and not to rely on any single financial measure to evaluate Honeywell's business.\n\nHoneywell International Inc.\r\nDefinition of Organic Sales % Change\n\nWe define organic sales percentage as the year-over-year change in reported sales relative to the comparable period, excluding the impact on sales from foreign currency translation and acquisitions, net of divestitures, for the first 12 months following the transaction date. We believe this measure is useful to investors and management in understanding our ongoing operations and in analysis of ongoing operating trends.\n\nA quantitative reconciliation of reported sales percent change to organic sales percent change has not been provided for forward-looking measures of organic sales percent change because management cannot reliably predict or estimate, without unreasonable effort, the fluctuations in global currency markets that impact foreign currency translation, nor is it reasonable for management to predict the timing, occurrence and impact of acquisition and divestiture transactions, all of which could significantly impact our reported sales percent change.\n\nHoneywell International Inc.\r\nReconciliation of Operating Income to Segment Profit, Calculation of Operating Income and Segment Profit Margins\r\n(Unaudited)\r\n(Dollars in millions)\n\nBeginning second quarter 2024, we will exclude the impact of amortization expense for acquisition-related intangible assets and certain acquisition-related costs from segment profit. The table below reconciles historical operating income to segment profit and segment profit margin giving effect to the additional adjustments.\n\nThree Months Ended \r\nJune 30, Twelve Months Ended December 31, 2023 2023 Operating income $                        1,883 $                        7,084 Stock compensation expense1 50 202 Repositioning, Other2,3 103 952 Pension and other postretirement service costs3 16 66 Prior segment profit $                        2,052 $                        8,304 Amortization of acquisition-related intangibles 61 292 Acquisition-related costs4 — 2 Segment profit $                        2,113 $                        8,598 Operating income $                        1,883 $                        7,084 ÷ Net sales $                        9,146 $                      36,662 Operating income margin % 20.6 % 19.3 % Segment profit $                        2,113 $                        8,598 ÷ Net sales $                        9,146 $                      36,662 Segment profit margin % 23.1 % 23.5 %\n\n1 Included in Selling, general and administrative expenses. 2 Includes repositioning, asbestos, environmental expenses, equity income adjustment, and other charges. For the three months ended June 30, 2023, other charges include $2 million of benefit, due to the Russia-Ukraine conflict.  3 Included in Cost of products and services sold and Selling, general and administrative expenses. 4 Includes acquisition-related fair value adjustments to inventory.\n\nWe define segment profit, on an overall Honeywell basis, as operating income, excluding stock compensation expense, pension and other postretirement service costs, amortization of acquisition-related intangibles, certain acquisition-related costs, and repositioning and other charges. We define segment profit margin, on an overall Honeywell basis, as segment profit divided by net sales. We believe these measures are useful to investors and management in understanding our ongoing operations and in analysis of ongoing operating trends.\n\nA quantitative reconciliation of operating income to segment profit, on an overall Honeywell basis, has not been provided for all forward-looking measures of segment profit and segment profit margin included herein. Management cannot reliably predict or estimate, without unreasonable effort, the impact and timing on future operating results arising from items excluded from segment profit, particularly pension mark-to-market expense as it is dependent on macroeconomic factors, such as interest rates and the return generated on invested pension plan assets. The information that is unavailable to provide a quantitative reconciliation could have a significant impact on our reported financial results. To the extent quantitative information becomes available without unreasonable effort in the future, and closer to the period to which the forward-looking measures pertain, a reconciliation of operating income to segment profit will be included within future filings.\n\nAcquisition amortization and acquisition-related costs are significantly impacted by the timing, size, and number of acquisitions we complete and are not on a predictable cycle, and we make no comment as to when or whether any future acquisitions may occur. The Company believes excluding these costs provides investors with a more meaningful comparison of operating performance over time and with both acquisitive and other peer companies.\n\nHoneywell International Inc.\r\nReconciliation of Earnings per Share to Adjusted Earnings per Share\r\n(Unaudited)\n\nBeginning second quarter 2024, we will exclude the impact of amortization expense for acquisition-related intangible assets and acquisition-related costs, including the related tax effects, from adjusted earnings per share. The table below reconciles certain historical and expected earnings per share of common stock – diluted to adjusted earnings per share giving and forward-looking effect to the additional adjustments.\n\nThree Months Ended June 30, Twelve Months Ended December 31, 2023 2024(E) 2023 2024(E) Earnings per share of common stock - diluted1 $                  2.22 $2.21 - $2.31 $                   8.47 $9.63 - $9.93 Pension mark-to-market expense2 — — 0.19 No Forecast Russian-related charges3 — — — 0.02 Net expense related to the NARCO Buyout and HWI Sale4 0.01 — 0.01 — Adjustment to estimated future Bendix liability5 — — 0.49 — Adjusted earnings per share of common stock - diluted\n\n(before impact of non-GAAP reporting change) $                  2.23 $2.21 - $2.31 $                   9.16 $9.65 - $9.95 Amortization of acquisition-related intangibles6 0.07 0.10 0.35 0.44 Acquisition-related costs7 — 0.04 0.01 0.06 Adjusted earnings per share of common stock - diluted\n\n(after impact of non-GAAP reporting change) $                  2.30 $2.35 - $2.45 $                   9.52 $10.15 - $10.45\n\n1 For the three months ended June 30, 2023, and twelve months ended December 31, 2023, adjusted earnings per share utilizes weighted average shares of approximately 670.2 million and 668.2 million, respectively. For the three months ended June 30, 2024, and twelve months ended December 31, 2024, expected earnings per share utilizes weighted average shares of approximately 655 million and 656 million, respectively. 2 Pension mark-to-market expense uses a blended tax rate of 18%, net of tax benefit of $27 million, for 2023. 3 For the three months ended June 30, 2023, the adjustment was $1 million, without tax benefit. For the twelve months ended December 31, 2023, the adjustment was a benefit of $3 million, without tax expense. For the twelve months ended December 31, 2024, the expected adjustment is a $17 million expense, without tax benefit, due to the settlement of a contractual dispute with a Russian entity associated with the Company's suspension and wind down activities in Russia. 4 For the three months ended June 30, 2023, and the twelve months ended December 31, 2023, the adjustment was $8 million, net of tax of benefit of $3 million, due to the net expense related to the NARCO Buyout and HWI Sale. 5 Bendix Friction Materials (\"Bendix\") is a business no longer owned by the Company. In 2023, the Company changed its valuation methodology for calculating legacy Bendix liabilities. For the twelve months ended December 31, 2023, the adjustment was $330 million, net of tax benefit of $104 million (or $434 million pre-tax) due to a change in the estimated liability for resolution of asserted (claims filed as of the financial statement date) and unasserted Bendix-related asbestos claims. The Company experienced fluctuations in average resolution values year-over-year in each of the past five years with no well-established trends in either direction. In 2023, the Company observed two consecutive years of increasing average resolution values (2023 and 2022), with more volatility in the earlier years of the five-year period (2019 through 2021). Based on these observations, the Company, during its annual review in the fourth quarter of 2023, reevaluated its valuation methodology and elected to give more weight to the two most recent years by shortening the look-back period from five years to two years (2023 and 2022). The Company believes that the average resolution values in the last two consecutive years are likely more representative of expected resolution values in future periods. The $434 million pre-tax amount was attributable primarily to shortening the look-back period to the two most recent years, and to a lesser extent to increasing expected resolution values for a subset of asserted claims to adjust for higher claim values in that subset than in the modelled two-year data set.  It is not possible to predict whether such resolution values will increase, decrease, or stabilize in the future, given recent litigation trends within the tort system and the inherent uncertainty in predicting the outcome of such trends. The Company will continue to monitor Bendix claim resolution values and other trends within the tort system to assess the appropriate look-back period for determining average resolution values going forward. 6 For the three months ended June 30, 2023, and twelve months ended December 31, 2023, acquisition-related intangibles amortization includes $48 million and $231 million, net of tax benefit of approximately $13 million and $61 million, respectively. For the three months ended June 30, 2024, and twelve months ended December 31, 2024, expected acquisition-related intangibles amortization includes approximately $66 million and $292 million, net of tax benefit of approximately $17 million and $77 million, respectively. 7 For the three months ended June 30, 2023, and twelve months ended December 31, 2023, the adjustment for acquisition-related costs, which is principally comprised of third-party transaction and integration costs and acquisition-related fair value adjustments to inventory, is approximately $1 million and $7 million, net of tax benefit of approximately $0 million and $2 million, respectively. For the three months ended June 30, 2024, and twelve months ended December 31, 2024, the expected adjustment for acquisition-related costs, which is principally comprised of third-party transaction and integration costs and acquisition-related fair value adjustments to inventory, is approximately $24 million and $40 million, net of tax benefit of approximately $6 million and $11 million, respectively.\n\nWe define adjusted earnings per share as diluted earnings per share adjusted to exclude various charges as listed above. We believe adjusted earnings per share is a measure that is useful to investors and management in understanding our ongoing operations and in analysis of ongoing operating trends. For forward-looking information, management cannot reliably predict or estimate, without unreasonable effort, the pension mark-to-market expense as it is dependent on macroeconomic factors, such as interest rates and the return generated on invested pension plan assets. We therefore do not include an estimate for the pension mark-to-market expense. Based on economic and industry conditions, future developments, and other relevant factors, these assumptions are subject to change.\n\nAcquisition amortization and acquisition-related costs are significantly impacted by the timing, size, and number of acquisitions we complete and are not on a predictable cycle and we make no comment as to when or whether any future acquisitions may occur. The Company believes excluding these costs provides investors with a more meaningful comparison of operating performance over time and with both acquisitive and other peer companies.\n\nHoneywell International Inc.\r\nReconciliation of Expected Cash Provided by Operating Activities to Expected Free Cash Flow\r\n(Unaudited)\n\nTwelve Months \r\nEnded \r\nDecember 31, \r\n2024(E) ($B) Cash provided by operating activities ~$6.7 - $7.1 Capital expenditures ~(1.1) Free cash flow ~$5.6 - $6.0\n\nWe define free cash flow as cash provided by operating activities less cash for capital expenditures.\n\nWe believe that free cash flow is a non-GAAP measure that is useful to investors and management as a measure of cash generated by operations that will be used to repay scheduled debt maturities and can be used to invest in future growth through new business development activities or acquisitions, pay dividends, repurchase stock, or repay debt obligations prior to their maturities. This measure can also be used to evaluate our ability to generate cash flow from operations and the impact that this cash flow has on our liquidity.\n\nContacts: Media Investor Relations Stacey Jones Sean Meakim (980) 378-6258 (704) 627-6200 stacey.jones@honeywell.com sean.meakim@honeywell.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-completes-acquisition-of-carriers-global-access-solutions-business-and-updates-2024-outlook-302161436.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-completes-acquisition-carriers-global-105500473.html",
        "symbols": [
            "4PN.F",
            "4PN.XETRA",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "C1RR34.SA",
            "CARR.US",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.022,
            "neu": 0.864,
            "pos": 0.114
        }
    },
    {
        "date": "2024-06-03T10:55:00+00:00",
        "title": "Carrier Announces Close of $4.95B Sale of its Global Access Solutions Business",
        "content": "Advances Carrier's transformation into a focused global leader in intelligent climate and energy solutions Net proceeds of $4B expected to be used to pay down debt and help reduce net leverage to approximately 2x EBITDA Positions Carrier to resume share repurchases in 2024\n\nPALM BEACH GARDENS, Fla., June 3, 2024 /PRNewswire/ -- Carrier Global Corporation (NYSE: CARR), global leader in intelligent climate and energy solutions, today announced it has completed the sale of its security business, Global Access Solutions, to Honeywell (NASDAQ: HON) for an enterprise value of $4.95 billion. (PRNewsfoto/Carrier)\n\n\"Today marks the first completed sale as part of Carrier's portfolio transformation,\" said Carrier Chairman & CEO David Gitlin. \"Earlier this year we closed on our Viessmann Climate Solutions acquisition, which will be transformational for Carrier and the industry. We have agreements in place to sell the global Commercial Refrigeration and Industrial Fire businesses, both of which we plan to close in the third quarter. We have also initiated the sale process of our Commercial and Residential Fire businesses. Through these transactions, Carrier will transform into a more focused, higher-growth company ready to address important climate challenges. I want to personally thank the many talented Global Access Solutions employees for their contributions to the business and our customers over the years, and I look forward to watching this business continue to thrive under new ownership.\"\n\nCarrier intends to use net proceeds from the sales to pay down debt, expecting to return to ~2x net leverage by the end of 2024. The company also expects to resume share repurchases in 2024.\n\nGoldman Sachs & Co. LLC and J.P. Morgan Securities LLC are serving as financial advisor to Carrier. Paul, Weiss, Rifkind, Wharton & Garrison LLP and Linklaters LLP are providing external legal counsel.\n\nAbout Carrier \r\nCarrier Global Corporation, global leader in intelligent climate and energy solutions, is committed to creating solutions that matter for people and our planet for generations to come. From the beginning, we've led in inventing new technologies and entirely new industries. Today, we continue to lead because we have a world-class, diverse workforce that puts the customer at the center of everything we do. For more information, visit www.corporate.carrier.com or follow Carrier on social media at @Carrier.\n\nCautionary Statement\r\nThis communication contains statements which, to the extent they are not statements of historical or present fact, constitute \"forward-looking statements\" under the securities laws. These forward-looking statements are intended to provide management's current expectations or plans for Carrier's future operating and financial performance, based on assumptions currently believed to be valid. Forward-looking statements can be identified by the use of words such as \"believe,\" \"expect,\" \"expectations,\" \"plans,\" \"strategy,\" \"prospects,\" \"estimate,\" \"project,\" \"target,\" \"anticipate,\" \"will,\" \"should,\" \"see,\" \"guidance,\" \"outlook,\" \"confident,\" \"scenario\" and other words of similar meaning in connection with a discussion of future operating or financial performance. Forward-looking statements may include, among other things, statements relating to future sales, earnings, cash flow, results of operations, uses of cash, share repurchases, tax rates and other measures of financial performance or potential future plans, strategies or transactions of Carrier, our portfolio transformation and the use of the anticipated proceeds thereof, potential future investments, Carrier's plans with respect to its indebtedness and other statements that are not historical facts. All forward-looking statements involve risks, uncertainties and other factors that may cause actual results to differ materially from those expressed or implied in the forward-looking statements. For additional information on identifying factors that may cause actual results to vary materially from those stated in forward-looking statements, see Carrier's reports on Forms 10-K, 10-Q and 8-K filed with or furnished to the U.S. Securities and Exchange Commission from time to time. Any forward-looking statement speaks only as of the date on which it is made, and Carrier assumes no obligation to update or revise such statement, whether as a result of new information, future events or otherwise, except as required by applicable law.\n\nStory continues\n\nCARR-IR\n\nContact:\n\nInvestor Relations \r\nSam Pearlstein\r\n561-365-2251 \r\nSam.Pearlstein@Carrier.com\n\nMedia Inquiries \r\nAshley Barrie\r\n860-416-3657 \r\nAshley.Barrie@Carrier.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/carrier-announces-close-of-4-95b-sale-of-its-global-access-solutions-business-302161811.html\n\nSOURCE Carrier Global Corporation\n\nView comments",
        "link": "https://finance.yahoo.com/news/carrier-announces-close-4-95b-105500964.html",
        "symbols": [
            "4PN.F",
            "4PN.XETRA",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "C1RR34.SA",
            "CARR.US",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.992,
            "neg": 0.027,
            "neu": 0.867,
            "pos": 0.106
        }
    }
]