[
    {
        "date": "2024-09-30T16:07:32+00:00",
        "title": "Intel Leads 5 Worst Dow Jones Stocks Through Q3; Can These Dogs Get Their Bite Back?",
        "content": "Intel leads the worst Dow stocks so far in 2024. Investors look to the Dogs of the Dow for tasty dividends. What does this group offer?\n\nContinue reading\n\nView comments",
        "link": "https://finance.yahoo.com/m/b4f500a4-d182-336b-a284-5ed8a895a0f2/intel-leads-5-worst-dow-jones.html",
        "symbols": [
            "0BOE.LSE",
            "0R2Q.LSE",
            "1INTC.MI",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.625,
            "neg": 0.124,
            "neu": 0.876,
            "pos": 0
        }
    },
    {
        "date": "2024-09-30T15:00:00+00:00",
        "title": "Honeywell Rewards Shareholders With 5% Dividend Increase",
        "content": "In a shareholder-friendly move, Honeywell International HON recently raised its quarterly dividend by approximately 5% to $1.13 per share (annually: $4.52). The new dividend will be paid on Dec. 6, 2024, to shareholders of record as of Nov. 15.\r\n\r\nThe latest dividend hike marks Honeywell’s 15th consecutive raise since 2010. This underscores its sound financial health as it utilizes free cash flow to enhance shareholders’ returns.\r\n\r\nIn the first six months of 2024, HON rewarded shareholders with $1.45 billion in dividends and $1.20 billion in share repurchases. Also, in 2023, it paid out dividends worth $2.86 billion and repurchased shares for $3.72 billion. It’s worth noting that in the second quarter of 2024, HON generated a free cash flow of $1.11 billion. The company expects a free cash flow in the range of $5.5-$5.9 billion for 2024.\r\n\r\nApart from repurchasing shares and paying out dividends, Honeywell deploys its capital to make acquisitions. In September 2024, it acquired CAES Systems Holdings (“CAES”) from private equity firm Advent. The transaction will augment its defense technology offerings across various domains, including land, sea, air and space.\r\n\r\nAlso, in June 2024, the company acquired Carrier’s Global Access Solutions business for an all-cash deal of $4.95 billion. The inclusion of Global Access Solutions’ expertise in advanced access and security solutions, coupled with its impressive growth and margin profile, is enabling it to expand its security products portfolio and boost its building automation segment.\n\nHON’s Zacks Rank & Price Performance\n\nHoneywell, with approximately $134.9 billion market capitalization, currently carries a Zacks Rank #3 (Hold). The company is set to gain from strength in commercial aviation and defense & space markets driven by solid demand for air travel and stable U.S. and international defense spend volumes. However, softness in its Industrial Automation segment remains a concern. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nIn the past year, the company’s shares have gained 13.7% compared with the industry’s 21.3% growth.\r\n\r\nThe Zacks Consensus Estimate for earnings is pegged at $10.14 per share for 2024, indicating a decrease of a penny from the 30-day-ago figure.\n\nStocks to Consider\n\nSome better-ranked companies from the same space are discussed below.\r\n\r\nFederal Signal Corporation FSS currently sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nFederal Signal delivered a trailing four-quarter average earnings surprise of 12.3%. In the past 30 days, the Zacks Consensus Estimate for FSS’ 2024 earnings has been stable.\r\n\r\nVector Group Ltd. VGR presently carries a Zacks Rank #2 (Buy). The company delivered a trailing four-quarter average earnings surprise of 15.4%.\r\n\r\nIn the past 30 days, the Zacks Consensus Estimate for VGR’s 2024 earnings has remained unchanged.\r\n\r\nCarlisle Companies Incorporated CSL currently carries a Zacks Rank of 2. CSL delivered a trailing four-quarter average earnings surprise of 16.3%.\r\n\r\nIn the past 30 days, the consensus estimate for Carlisle’s fiscal 2025 earnings has decreased by a penny.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nCarlisle Companies Incorporated (CSL) : Free Stock Analysis Report\n\nFederal Signal Corporation (FSS) : Free Stock Analysis Report\n\nVector Group Ltd. (VGR) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-rewards-shareholders-5-dividend-150000171.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "CLE.F",
            "CLE.STU",
            "CSL.US",
            "FSG.F",
            "FSS.US",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "VGR.BE",
            "VGR.F",
            "VGR.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.002,
            "neu": 0.834,
            "pos": 0.163
        }
    },
    {
        "date": "2024-09-30T12:00:00+00:00",
        "title": "HONEYWELL COMPLETES ACQUISITION OF AIR PRODUCTS' LIQUEFIED NATURAL GAS PROCESS TECHNOLOGY AND EQUIPMENT BUSINESS",
        "content": "$1.81 billion acquisition bolsters Honeywell's energy transition capabilities through end-to-end offering for customers worldwide  Enhances Honeywell's Energy and Sustainability Solutions business with addition of ~475 skilled employees focused on driving the energy transition  Creates new opportunities for diversified growth and innovation in Honeywell's aftermarket services and software\n\nCHARLOTTE, N.C., Sept. 30, 2024 /PRNewswire/ -- Honeywell (NASDAQ: HON) today announced the completion of its acquisition of Air Products' liquefied natural gas (LNG) process technology and equipment business for $1.81 billion in an all-cash transaction. This further expands the comprehensive suite of top-tier solutions Honeywell offers its customers for managing their energy transformation journey. (PRNewsfoto/Honeywell)\n\nHoneywell's full-service solution now provides customers a holistic offering that encompasses natural gas pre-treatment, state-of-the-art liquefaction and digital automation technologies unified under the Honeywell Forge and Experion platforms, as well as the addition of Air Products' coil-wound heat exchangers (CWHE) technology.\n\n\"The acquisition of Air Products' LNG process technology and equipment business strengthens Honeywell's energy transition portfolio and will enable our customers to manage their liquefied natural gas assets with greater efficiency and reliability,\" said Ken West, President and CEO of Honeywell's Energy and Sustainability Solutions (ESS) segment. \"With the integration of the LNG business, we will be able to provide a greater level of energy transition management from beginning to end through a full spectrum of scalable solutions.\"\n\nThis is the fourth acquisition Honeywell has closed in 2024 as part of its disciplined capital deployment strategy. The company is focused on high-return acquisitions that will drive future growth across its portfolio, which is aligned with the three compelling megatrends of automation, the future of aviation and energy transition. Most recently, Honeywell completed its acquisition of CAES in August 2024, which further enhances its defense technology solutions across land, sea, air and space.\n\nHoneywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Forge IoT platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world smarter, safer and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nStory continues\n\nWe describe certain trends and other factors that drive our business and future results in this release. Such discussions contain forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended (the Exchange Act). Forward-looking statements are those that address activities, events, or developments that management intends, expects, projects, believes or anticipates will or may occur in the future. They are based on management's assumptions and assessments in light of past experience and trends, current economic and industry conditions, expected future developments and other relevant factors, many of which are difficult to predict and outside of our control. They are not guarantees of future performance, and actual results, developments and business decisions may differ significantly from those envisaged by our forward-looking statements. We do not undertake to update or revise any of our forward-looking statements, except as required by applicable securities law. Our forward-looking statements are also subject to material risks and uncertainties, including ongoing macroeconomic and geopolitical risks, such as lower GDP growth or recession, capital markets volatility, inflation, and certain regional conflicts, that can affect our performance in both the near- and long-term. In addition, no assurance can be given that any plan, initiative, projection, goal, commitment, expectation, or prospect set forth in this release can or will be achieved. These forward-looking statements should be considered in light of the information included in this release, our Form 10-K and other filings with the Securities and Exchange Commission. Any forward-looking plans described herein are not final and may be modified or abandoned at any industriatime.\n\nContacts: Media  Investor Relations Stacey Jones  Sean Meakim (980) 378-6258  (704) 627-6200 Stacey.Jones@honeywell.com  Sean.Meakim@honeywell.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-completes-acquisition-of-air-products-liquefied-natural-gas-process-technology-and-equipment-business-302262458.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-completes-acquisition-air-products-120000688.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.03,
            "neu": 0.801,
            "pos": 0.168
        }
    },
    {
        "date": "2024-09-30T09:22:08+00:00",
        "title": "General Industrial Machinery Stocks Q2 In Review: Columbus McKinnon (NASDAQ:CMCO) Vs Peers",
        "content": "General Industrial Machinery Stocks Q2 In Review: Columbus McKinnon (NASDAQ:CMCO) Vs Peers\n\nThe end of the earnings season is always a good time to take a step back and see who shined (and who not so much). Let’s take a look at how general industrial machinery stocks fared in Q2, starting with Columbus McKinnon (NASDAQ:CMCO).\n\nAutomation that increases efficiency and connected equipment that collects analyzable data have been trending, creating new demand for general industrial machinery companies. Those who innovate and create digitized solutions can spur sales and speed up replacement cycles, but all general industrial machinery companies are still at the whim of economic cycles. Consumer spending and interest rates, for example, can greatly impact the industrial production that drives demand for these companies’ offerings.\n\nThe 14 general industrial machinery stocks we track reported a mixed Q2. As a group, revenues beat analysts’ consensus estimates by 1.8% while next quarter’s revenue guidance was 4% below.\n\nThe Fed cut its policy rate by 50bps (half a percent) in September 2024, the first in roughly four years. This marks the end of its most pointed inflation-busting campaign since the 1980s. While CPI (inflation) readings have been supportive lately, employment measures have bordered on worrisome. The markets will be assessing whether this rate cut's timing (and more potential ones in 2024 and 2025) is ideal for supporting the economy or a bit too late for a macro that has already cooled too much.\n\ngeneral industrial machinery stocks have held steady amidst all this with average share prices relatively unchanged since the latest earnings results.\n\nColumbus McKinnon (NASDAQ:CMCO)\n\nWith 19 different brands across the globe, Columbus McKinnon (NASDAQ:CMCO) offers material handling equipment for the construction, manufacturing, and transportation industries.\n\nColumbus McKinnon reported revenues of $239.7 million, up 1.8% year on year. This print was in line with analysts’ expectations, and overall, it was a satisfactory quarter for the company with a solid beat of analysts’ operating margin estimates.\n\n“We executed solidly in the first quarter delivering continued sales growth and gross margin expansion while advancing our longer-term strategic objectives,” said David J. Wilson, President and Chief Executive Officer. Columbus McKinnon Total Revenue\n\nThe stock is down 9.3% since reporting and currently trades at $35.57.\n\nIs now the time to buy Columbus McKinnon? Access our full analysis of the earnings results here, it’s free.\n\nBest Q2: 3M (NYSE:MMM)\n\nProducers of the first asthma inhaler, 3M Company (NYSE:MMM) is a global conglomerate known for products in industries like healthcare, safety, electronics, and consumer goods.\n\nStory continues\n\n3M reported revenues of $6.02 billion, down 24.7% year on year, outperforming analysts’ expectations by 3.3%. The business had an exceptional quarter with an impressive beat of analysts’ operating margin estimates and a solid beat of analysts’ organic revenue estimates. 3M Total Revenue\n\nThe market seems happy with the results as the stock is up 32.7% since reporting. It currently trades at $137.18.\n\nIs now the time to buy 3M? Access our full analysis of the earnings results here, it’s free.\n\nWeakest Q2: Hillenbrand (NYSE:HI)\n\nHillenbrand, Inc. (NYSE: HI) is an industrial company that designs, manufactures, and sells highly engineered processing equipment and solutions for various industries.\n\nHillenbrand reported revenues of $786.6 million, up 9.8% year on year, falling short of analysts’ expectations by 3.9%. It was a disappointing quarter as it posted full-year revenue guidance missing analysts’ expectations.\n\nHillenbrand delivered the weakest full-year guidance update in the group. As expected, the stock is down 25.6% since the results and currently trades at $28.30.\n\nRead our full analysis of Hillenbrand’s results here.\n\nIcahn Enterprises (NASDAQ:IEP)\n\nFounded in 1987, Icahn Enterprises (NASDAQ: IEP) is a diversified holding company primarily engaged in investment and asset management across various sectors.\n\nIcahn Enterprises reported revenues of $2.55 billion, flat year on year. This result topped analysts’ expectations by 13.9%. More broadly, it was a weak quarter as it produced a miss of analysts’ earnings estimates.\n\nThe stock is down 21.6% since reporting and currently trades at $13.11.\n\nRead our full, actionable report on Icahn Enterprises here, it’s free.\n\nHoneywell (NASDAQ:HON)\n\nOriginally founded in 1906 as a thermostat company, Honeywell (NASDAQ:HON) is an aerospace and defense manufacturing company building technologies, performance materials, and safety and productivity solutions.\n\nHoneywell reported revenues of $9.58 billion, up 4.7% year on year. This result surpassed analysts’ expectations by 1.7%. Overall, it was a very strong quarter as it also produced an impressive beat of analysts’ organic revenue estimates.\n\nHoneywell achieved the highest full-year guidance raise among its peers. The stock is down 2.6% since reporting and currently trades at $207.99.\n\nRead our full, actionable report on Honeywell here, it’s free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/general-industrial-machinery-stocks-q2-092208739.html",
        "symbols": [
            "9HI.F",
            "CMCO.US",
            "HI.US",
            "HON.US",
            "IEP.US",
            "MMM.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.041,
            "neu": 0.818,
            "pos": 0.141
        }
    }
]