[
    {
        "date": "2024-08-06T11:41:04+00:00",
        "title": "7 Stocks to Buy if You Can Only Invest $100 Per Month",
        "content": "When investing in the stock market, you don’t need much money to get started. Consistently investing small amounts like $100 per month can be a smart strategy, especially if you focus on high-quality, blue-chip stocks with a history of weathering market storms and delivering compounding returns over the long term.\n\nWhile the current market sell-off may cause short-term losses, these proven businesses have the power to recover and reward patient investors who steadily build positions over time. By spreading out your investments and taking a long-term perspective, you can minimize risk and position your portfolio for growth.\n\nSo, without further ado, let’s dive into our list of the top seven stocks to buy if you can only invest $100 monthly. While investing is not guaranteed, these blue-chip names have the potential to be core holdings in your portfolio for years to come. You can buy one or more each month using fractional shares.\r\n\r\nHere are the stocks to buy with $100 per month:\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nBerkshire Hathaway (BRK-A, BRK-B) Berkshire Hathaway (BRK-A, BRK-B) logo, stock trade and chart on smartphone. Business and finance market.\n\nBerkshire Hathaway (NYSE:BRK-A, NYSE:BRK-B) is probably one of the best stocks a beginner investor can buy in the long run. By owning Berkshire, you get exposure to a collection of great blue-chip companies with high-quality businesses while benefiting from the firm’s immense flexibility to reallocate capital as market conditions change.\n\nFor instance, Berkshire has been selling stocks for seven straight quarters, including trimming its massive Apple (NASDAQ:AAPL) stake by nearly 50%. I believe it’s a prudent move by Warren Buffett to take some profits off the table ahead of a potential market correction. You simply don’t get this strategic agility with an index fund or exchange-traded fund.\n\nAnalyst Cathy Seifert notes that Buffett may be preparing for an economic downturn, and with $277 billion in cash, Berkshire is positioned to weather this storm and capitalize on potential opportunities.\n\nAflac (AFL) the Aflac (AFL) logo on an office building\n\nSource: Ken Wolter / Shutterstock.com\n\nAflac (NYSE:AFL) provides supplemental insurance in the U.S. and Japan. The company delivered solid earnings results in the first half of 2024, with adjusted earnings per share up 11.5% year-over-year to $3.49 for the six months.\n\nAflac has been one of the most consistent and stable stocks over the past many years, and its performance has only improved. While it may be in the supplemental insurance business, Aflac’s financials are incredibly sticky and have consistently improved. For the long-term investor, I think it represents an attractive place to put your money to work.\n\nStory continues\n\nAnalysts seem to agree, and management is pleased with profitable growth in both the U.S. and Japan. However, I would caution that potential near-term headwinds in the Japanese market could create some bumps for Aflac’s stock in the coming months and quarters.\n\nOverall, though, dollar-cost averaging into Aflac seems like a solid long-term strategy if you’re looking for a stable compounder to invest each month. The company’s 43-year record of consecutive dividend increases is also hard to ignore for income-oriented investors.\n\nWaste Management (WM) Image of green Waste Management (WM) branded truck in the foreground and building with Waste Management flag in the background.\n\nSource: rblfmr / Shutterstock.com\n\nWaste Management (NYSE:WM) provides environmental services for waste management. If you want a reliable company to invest in monthly, give WM a look. The company has been executing well lately, with revenue up 5.5% year-over-year in the second quarter to $5.4 billion. Adjusted operating EBITDA also grew an impressive 10.3%. I like what I’m seeing here.\n\nZacks Research analysts recently trimmed their Q3 EPS estimate slightly, but they still expect solid full-year earnings of $7.11 per share for 2024. The long-term future looks bright, too, with the Zacks consensus calling for fiscal 2025 EPS of $7.67.\n\nThere was an interesting insider transaction recently, with VP Michael J. Watson selling $859,000 worth of shares in early June. While insider selling isn’t the best sign, Watson still owns over $9 million in company stock, so he’s well-aligned with shareholders.\n\nT-Mobile (TMUS) the exterior of a T-Mobile (TMUS) branded store\n\nSource: Tupungato / Shutterstock.com\n\nT-Mobile (NASDAQ:TMUS) is a leading wireless network operator in the United States. The company has been on an absolute tear lately, delivering impressive growth and profitability while its main rivals struggle.\n\nIn Q2 2024, T-Mobile beat earnings estimates with EPS of $2.49 versus the $2.27 expected, and revenue also topped forecasts. Analysts have been raising their price targets after the strong results, with all 17 analysts covering the stock rating it a “buy.” The stock is up about 6% year-to-date compared to the S&P 500’s 4% loss.\n\nT-Mobile’s 5G network leadership, “Un-carrier” customer-centric strategy, and smart capital allocation continue to drive industry-leading growth. In Q2, it reported the highest postpaid phone net additions in company history. Cash flow is also surging, with Q2 free cash flow up 54% year-over-year.\n\nWhile some may worry about T-Mobile’s debt load, I think the company’s strong and consistent execution can continue powering the stock higher.\n\nRealty Income (O) realty income logo highlighted by a magnifying glass on a web browser\n\nSource: Shutterstock\n\nRealty Income (NYSE:O) is a real estate investment trust that owns over 15,000 commercial properties across the United States and Europe. The company has been facing some headwinds lately, with its stock price up just 1.3% year-to-date, likely due to broader concerns in the real estate sector.\n\nBut if you’re looking to invest a modest amount each month, what better stock to buy than one that pays you monthly dividends? Realty Income’s current dividend yield of nearly 5.3% is among the highest. And these dividends have been rising consistently. Stocks to Buy With $100: Realty Income dividends\n\nClick to Enlarge\n\nSource: Chart courtesy of GuruFocus.com\n\nThe Motley Fool recently posted that Realty Income’s positives outweigh its negatives and could now be a good entry point for long-term investors. The company’s 32-year track record of annual dividend increases is also hard to ignore. Realty Income looks like one of the best-positioned REITs to deliver reliable income and bounce back as the economic picture improves. For patient investors, collecting that monthly dividend could pay off. Thus, I think it is one of the top stocks to buy with $100 per month.\n\nPepsiCo (PEP) Pepsi (PEP) Factory in Samara, Russia. Pepsi logo on a blue warehouse.\n\nSource: FotograFFF / Shutterstock\n\nPepsiCo (NASDAQ:PEP) is a multinational food, snack, and beverage corporation with many iconic brands. Despite facing some challenges in the recent quarter due to declining demand in North America, PepsiCo remains one of the most consistent companies in recent decades and has continued to grow well.\n\nIn Q2 2024, PepsiCo’s revenue narrowly missed estimates at $22.5 billion, but its core EPS of $2.28 beat expectations. The company saw slower demand in its Frito-Lay North America and Quaker Foods segments, leading it to revise its full-year organic revenue growth forecast to approximately 4%. However, PepsiCo’s international business performed well, with 5.5% organic revenue growth.\n\nAnalysts have mixed opinions on PepsiCo. While some note the near-term headwinds from cautious consumer spending, others believe PepsiCo’s strong brand portfolio and global presence position it well for the long run. PepsiCo’s business is resilient and should hold up well even if the U.S. economy is in recession.\n\nIf you walk down any snack aisle, it will be hard to ignore PepsiCo’s products. It makes sense why this company has so much staying power. PEP stock has declined a bit due to the broader downturn for retailers, but I think this is a solid long-term bet you can put your money into each month. PepsiCo is hard to lose with in the long run, and you can also sit on its 3% dividend yield as you wait for it to recover.\n\nHoneywell International (HON) Honeywell (HON) logo on front of glass building\n\nSource: josefkubes / Shutterstock.com\n\nHoneywell International (NASDAQ:HON) is a diversified technology and manufacturing company serving various industries. The company has been delivering strong results lately, with Q2 2024 organic sales up 4% year-over-year and earnings per share of $2.49, beating guidance by 7 cents. I believe Honeywell is one of the most well-rounded companies, with significant contracts in the military and emerging technology sectors, providing stability and consistency. The stock also offers a solid 2.1% dividend yield.\n\nWhile some analysts have raised concerns about margin pressure from Honeywell’s mix shift towards more long-cycle businesses in the near term, the overall consensus remains bullish, with an average price target of $227, implying an 14% upside. Honeywell’s exposure to attractive long-term trends like automation and aviation makes me believe it’s a reliable bet for the long haul. It deserves a spot in your portfolio if you’re investing steadily over time.\n\nOn the date of publication, Omor Ibne Ehsan did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor held a LONG position in AAPL.\n\nOmor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals, value, and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post 7 Stocks to Buy if You Can Only Invest $100 Per Month appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/7-stocks-buy-only-invest-114104339.html",
        "symbols": [
            "0H68.LSE",
            "0KUE.LSE",
            "0LTG.LSE",
            "0R2L.LSE",
            "AAPL.US",
            "AFL.BE",
            "AFL.DU",
            "AFL.F",
            "AFL.MU",
            "AFL.US",
            "AFL.XETRA",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.04,
            "neu": 0.842,
            "pos": 0.119
        }
    },
    {
        "date": "2024-08-06T00:00:00+00:00",
        "title": "7 Stocks to Buy if You Can Only Invest $100 Per Month",
        "content": "Investing $100 per month in high-quality, blue-chip stocks can be a smart strategy for long-term portfolio growth.",
        "link": "https://investorplace.com/2024/08/7-stocks-to-buy-if-you-can-only-invest-100-per-month/",
        "symbols": [
            "AFL.US",
            "BRK-A.US",
            "BRK-B.US",
            "HON.US",
            "O.US",
            "PEP.US",
            "TMUS.US",
            "WM.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.649,
            "neg": 0,
            "neu": 0.725,
            "pos": 0.275
        }
    }
]