[
    {
        "date": "2024-07-04T10:03:00+00:00",
        "title": "The 3 Best Autonomous Vehicle Stocks to Buy in July 2024",
        "content": "Bloomberg Opinion columnist Matthew Iglesias wrote a great piece on June 30 about the far-too-cautious approach of the U.S. when it comes to robotaxis and autonomous vehicles. It got me thinking about the best autonomous vehicle stocks.\n\nThe article starts with the author talking about his first drive in a Waymo driverless car in the area around the Georgetown neighborhood in Washington, D.C. The 15-minute ride, which included the vehicle navigating fire trucks, was flawless.\n\nWhile Waymo is in a handful of U.S. cities, Baidu (NASDAQ:BIDU) operates a much larger fleet across many more cities. Essentially, the Chinese are opting for more data quickly to make autonomous driving even safer in the years ahead.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nThese observations by Iglesias are helpful for anyone looking to invest in the best autonomous vehicle stocks. They suggest investors ought to focus their investments on Chinese companies and other non-domestic industry participants.\n\nHere are the three best autonomous vehicle stocks to buy.\n\nBaidu (BIDU) Laptop computer displaying logo of Baidu (BIDU), a Chinese multinational technology company specializing in Internet-related services and products\n\nSource: monticello / Shutterstock.com\n\nThe beauty of investing in Baidu is that you get so many different revenue streams in addition to its autonomous vehicle business that you almost don’t have to worry about setbacks in the technology as you would if it were an independent pure-play.\n\nBaidu Core accounts for about 70% of its revenue, with three segments: Mobile Ecosystem, AI Cloud and Intelligent Driving & Other Growth Initiatives accounting for this revenue. The third segment includes its Apollo Go autonomous ride-hailing services and Baidu Apollo’s self-driving auto solutions that are in many of the major automaker’s vehicles.\n\nIn 2023, the company’s Apollo Go! RoboTaxis provided over three million rides to people living in more than 10 Chinese cities. Since July 2022, it has been charging customers for driverless rides.\n\nBaidu’s robotaxi business is expected to break even this year and be profitable next year. It generated $1.14 billion in adjusted EBITDA (earnings before interest, taxes, depreciation and amortization) in the first quarter alone. Autonomous driving has a while to go before it’s a big contributor to the company’s bottom line.\n\nIt’s easy to wait knowing that the company already has rock-solid financials.\n\nHonda Motor (HMC) honda logo on a sign outside a honda dealership\n\nSource: Jonathan Weiss / Shutterstock.com\n\nIn January, Honda Motor (NYSE:HMC) CEO Toshihiro Mibe told Bloomberg Television that it will actively seek collaboration with General Motors (NYSE:GM) in the years ahead to deliver EV products for its global customer base. In 2024, it’s launching both the Honda Prologue and Acura ZDX in partnership with GM.\n\nStory continues\n\nHonda sees self-driving vehicles by 2030. It really depends on how soon the technology is available. Mibe did say that its EV launches in 2026 won’t have autonomous driving technology.\n\nIn May, the company said it would launch self-driving taxis in Japan by 2026.\n\nIt is partnering with Kokusai Motorcars and Teito Motor Transportation, two existing taxi companies, to encourage the Japanese government to change the legislation to allow for this technology on its roads. Currently, Japan’s legislation does not allow outsourcing of driving-related decisions. It plans to start the project with 500 driverless vehicles to determine if 2026 is feasible.\n\nHonda’s stock is up 6% year-to-date and 24% over the past five years. Expect its collaborative process to deliver more value in the years ahead.\n\nHoneywell (HON) Quantum Computing Stocks - Honeywell (HON)\n\nHoneywell (NYSE:HON) announced in March that it would acquire Civitanavi Systems, an Italian company for 200 million euros.\n\n“Together with Civitanavi, Honeywell will be able to offer a broader set of technologies to its customers across the globe, whether they are traditional operators seeking to increase the autonomous capability of their existing fleets or are new entrants in the Advanced Air Mobility space,” stated its March press release announcing the acquisition.\n\nCivitanavi, which specializes in high-performance fiber optic gyroscope technology, fills a gap in its aerospace navigation solutions portfolio. As a result, it is better positioned to grow its business in Europe.\n\nNow, I know when investors see the words “autonomous vehicles,” they think of cars and trucks. However, automation in the aerospace industry could be equally lucrative for the early entrants.\n\nIn Q1 2024, its Aerospace Technologies segment generated organic sales of 18%, its seventh consecutive quarter of double-digit growth. Add the fact that this segment has the highest margins of its three segments, and the Italian acquisition is another reason to be happy about Honeywell’s moves in autonomous operations.\n\nOn the date of publication, Will Ashworth did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nWill Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post The 3 Best Autonomous Vehicle Stocks to Buy in July 2024 appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-best-autonomous-vehicle-stocks-100300130.html",
        "symbols": [
            "7267.TSE",
            "9888.HK",
            "B1C.F",
            "B1C.STU",
            "B1CB.F",
            "BAIDF.US",
            "BIDU.US",
            "BIDU34.SA",
            "BIDUN.MX",
            "GM.US",
            "HDMA.F",
            "HDMA.STU",
            "HMC.US",
            "HNDAF.US",
            "HON.US",
            "HOND34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.012,
            "neu": 0.898,
            "pos": 0.09
        }
    },
    {
        "date": "2024-07-04T00:00:00+00:00",
        "title": "The 3 Best Autonomous Vehicle Stocks to Buy in July 2024",
        "content": "The best autonomous vehicle stocks aren’t necessarily those operating in the automotive industry or based in the U.S.A.\n",
        "link": "https://investorplace.com/2024/07/the-3-best-autonomous-vehicle-stocks-to-buy-in-july-2024/",
        "symbols": [
            "BIDU.US",
            "HMC.US",
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.637,
            "neg": 0,
            "neu": 0.802,
            "pos": 0.198
        }
    }
]