[
    {
        "date": "2024-09-19T11:53:00+00:00",
        "title": "3 Beaten-Down Dividend Stocks to Load Up on Right Now",
        "content": "Expectations and narratives can drive stock movements. A company's failure to deliver on expectations can lead to investor disappointment and a poorly performing stock. Honeywell(NASDAQ: HON), United Parcel Service(NYSE: UPS), and Chevron(NYSE: CVX) may be industry-leading companies, but they have all disappointed investors recently, and their share prices have suffered as a result.\n\nDespite their challenges, all three of these dividend stocks are worth a closer look now. Here's why. Image source: Getty Images.\n\nHoneywell has failed to capitalize on megatrends\n\nFor several years now, Honeywell has discussed the growth potential of the Industrial Internet of Things (IIoT), which is basically the overlap of software and hardware. Instead of monitoring the performance of stand-alone machinery, IIoT can connect a fleet using sensors and electronic components. An integrated system can provide data-driven insights, allowing operators to be proactive rather than reactive to equipment performance and maintenance cycles.\n\nIn addition to its opportunities in the IIoT space, Honeywell has focused on the energy transition and a need for smarter buildings and warehouses that automate functions and consume less energy than older ones. It has a growing oil and gas, hydrogen, and liquefied natural gas business.\n\nHoneywell's largest segment is aerospace. It provides parts, components, controls, integrated solutions, and more for the commercial aerospace and defense industries. It even has a $5 billion quantum computing business.\n\nYet despite its exposure to all of these exciting themes, Honeywell's results have fallen flat. Revenue has rebounded from its pandemic lows, but is still below where it was before the crisis. Operating margins and diluted earnings per share (EPS) are also ticking higher, albeit slowly. HON Revenue (TTM) Chart\n\nManagement has implemented an aggressive capital allocation program centered around mergers and acquisitions (M&A) and share buybacks to spur EPS growth. A core strength of Honeywell has been its balance sheet, but its leverage is likely to increase as it follows its plan to deploy billions more on M&A and stock repurchases.\n\nHoneywell has increased its dividend every year since 2011 and its price-to-earnings (P/E) ratio today is below its three-, five-, and seven-year median levels. Given its growing dividend and reasonable valuation, Honeywell looks like a worthwhile turnaround play for investors who believe that its recent slew of acquisitions will help drive growth across its targeted themes.\n\nThe worst may be over for UPS\n\nUPS stock soared during the pandemic as consumers shifted from in-person shopping to home delivery. The shipping and logistics giant expanded routes, thinking that the growth in package delivery volumes would remain elevated even after the pandemic, but that forecast proved painfully inaccurate.\n\nThrow in expensive pension obligations and a messy contract negotiation process with the Teamsters Union, and it's easy to see why UPS stock fell out of favor.\n\nIn March, UPS launched a three-year plan to turn the business around. But so far, it hasn't made meaningful progress toward its goals. The company has done a lot wrong in a short period -- leading to a 45% drawdown from its all-time high. But there's reason to believe the worst could be over.\n\nIn the second quarter, UPS returned to U.S. volume growth for the first time since Q4 2021. This is a positive near-term sign. The outlook for its healthcare-related business is a medium-term positive. UPS expects healthcare to contribute half of its growth over the next three years as it focuses on temperature and time-sensitive deliveries.\n\nOver the longer term, UPS has an entrenched position in domestic and international shipping and logistics. The stock has sold off so far that its forward P/E ratio is now just 17 and its dividend yields 5.1%. UPS may appeal to investors looking for a value stock that can turn things around as well as an investment that can boost their passive income.\n\nChevron is an ultra-reliable dividend payer\n\nUnlike Honeywell and UPS, Chevron hasn't disappointed investors by falling short of expectations. But it does have a major question mark that may be holding its share price back.\n\nOn Oct. 23, 2023, Chevron announced an agreement to acquire oil and natural gas exploration and production company Hess for $53 billion. However, ExxonMobil has held up that deal, citing nuances in contractual language regarding the rights to a shared asset offshore from Guyana.\n\nMeanwhile, crude oil prices have tumbled to their lowest levels of 2024 due to lower demand expectations and elevated production levels. Chevron hasn't made the operational errors of Honeywell or UPS. Nevertheless, the uncertainty over the fate of its Hess deal and lower oil prices have pushed the stock to a 52-week low.\n\nWith a P/E ratio of just 13.9, its valuation looks dirt cheap, but that ratio could rise to a more expensive level if lower oil prices lead to lower profits. Overall, Chevron is reasonably valued and sports a streak of 37 consecutive years of dividend raises and a 4.6% dividend yield -- making it yet another passive income powerhouse to consider now.\n\n\"Loading up\" responsibly\n\nInvestors may look at Honeywell, UPS, or Chevron and be tempted to back up the truck in hopes that they will rebound. And while it could be a good idea to load up on all three stocks, it's important to maintain diversification in a balanced portfolio.\n\nGoing too heavy into just a few stocks or correlated themes can leave a portfolio at risk of outsized declines if the market slumps. A better approach is to only allocate larger shares of your portfolio to your highest conviction ideas, and to build those positions gradually over time.\n\nRushing too quickly into a stock can lead to stress, bad decision-making, and depleted buying power. No one knows when the next major stock market sell-off will happen, but when it does, it will be wise to be comfortable with your positions.\n\nThe best way to set yourself up for that is to be aware of your asset allocations and ensure that no single position becomes so large that a bad stretch for one industry can derail your portfolio's performance and hold you back from achieving your financial goals.\n\nShould you invest $1,000 in Honeywell International right now?\n\nBefore you buy stock in Honeywell International, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Honeywell International wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $708,348!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of September 16, 2024\n\nDaniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Chevron. The Motley Fool recommends United Parcel Service. The Motley Fool has a disclosure policy.\n\n3 Beaten-Down Dividend Stocks to Load Up on Right Now was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-beaten-down-dividend-stocks-115300054.html",
        "symbols": [
            "CVX.US",
            "HON.US",
            "UPS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.102,
            "neu": 0.75,
            "pos": 0.148
        }
    },
    {
        "date": "2024-09-19T00:00:00+00:00",
        "title": "3 Beaten-Down Dividend Stocks to Load Up on Right Now",
        "content": "Divide an investment equally among these three dividend stocks and you'll get an average yield of 3.9%.",
        "link": "https://www.fool.com/investing/2024/09/19/buy-dip-dividend-stocks-yield-passive-income/",
        "symbols": [
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0,
            "neg": 0,
            "neu": 1,
            "pos": 0
        }
    }
]