[
    {
        "date": "2024-10-14T12:00:00+00:00",
        "title": "HONEYWELL AWARDED $103M CONTRACT BY U.S. ARMY FOR NEXT-GENERATION RADAR ALTIMETER SYSTEM",
        "content": "PHOENIX, Oct. 14, 2024  /PRNewswire/ -- Honeywell (Nasdaq: HON) has been awarded a $103 million contract by the U.S. Army, through the Defense Logistics Agency, to provide its Next-Generation APN-209 Radar Altimeter (Next Gen APN-209) system on a wide variety of Army aircraft. This contract underscores Honeywell's ongoing commitment to delivering advanced, reliable technology to support U.S. Army missions. It also supports Honeywell's alignment of its portfolio to three powerful megatrends, including the future of aviation. (PRNewsfoto/Honeywell)\n\nHoneywell's new APN-209 Radar Altimeter system is a direct replacement for its legacy APN-209, which has been the primary radar altimeter on numerous U.S. Army aircraft since its introduction in 1975. This modernized system offers several key enhancements:\n\nHigher reliability and environmental performance: The Next Gen APN-209 is engineered to operate with greater reliability and superior performance in challenging weather conditions. Advanced common-core architecture: Utilizing Honeywell's common-core radar altimeter architecture from its civil radar altimeter portfolio, the Next Gen APN-209 addresses risks associated with supply chain disruptions, component obsolescence and long-term repair support, improving sustained operational readiness. Flexible integration options: The system is available with an integrated altitude indicator or as a standalone transceiver for aircraft that utilize separate displays, offering versatility to meet various aircraft requirements.\n\n\"We are honored to continue our support of the U.S. Army with the Next Gen APN-209 Radar Altimeter system,\" said Matt Milas, President of Defense and Space at Honeywell Aerospace Technologies. \"The introduction of our Next Gen APN-209 underscores our decades-long commitment to providing cutting-edge technology that enhances the safety, reliability, and operational capability of military aircraft. Our new advanced radar altimeter system will not only enable us to further support the Army's mission success, but it will also be a capability we intend to extend, where permissible, to our international customers in the coming years.\"\n\nHoneywell has a longstanding reputation as the primary altimeter supplier to the U.S. Department of Defense, with more than 150,000 delivered over the past 60 years. Honeywell has supplied its legacy altimeters to many international customers and expects to introduce the Next Gen APN-209 in international markets in the years to come.\n\nAbout Honeywell Products and services from Honeywell Aerospace Technologies are found on virtually every commercial, defense and space aircraft. The Aerospace Technologies business unit builds aircraft engines, cockpit and cabin electronics, wireless connectivity systems, mechanical components and more. Its hardware and software solutions create more fuel-efficient aircraft, more direct and on-time flights and safer skies and airports. For more information, visit www.honeywell.com/us/en or follow us at @Honeywell_Aero.\n\nHoneywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends — automation, the future of aviation and energy transition — underpinned by our Honeywell Accelerator operating system and Honeywell Forge IoT platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world safer and smarter as well as more secure and sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nContacts:\n\nHoneywell Adam Kress\r\n602-760-6252\r\nAdam.Kress@honeywell.com  Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-awarded-103m-contract-by-us-army-for-next-generation-radar-altimeter-system-302274289.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-awarded-103m-contract-u-120000229.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.008,
            "neu": 0.819,
            "pos": 0.173
        }
    }
]