[
    {
        "date": "2024-06-04T12:04:00+00:00",
        "title": "Honeywell Integrates Artificial Intelligence into its Guided Work Solutions to Improve Retailer Performance",
        "content": "Hands-free technology with insights from Honeywell Forge architecture empowers retail associates to increase productivity, reduce errors and create exceptional customer experiences\n\nCHARLOTTE, N.C., June 4, 2024 /PRNewswire/ -- Honeywell (Nasdaq: HON) today announced an update to incorporate artificial intelligence (AI) and machine learning into its Guided Work Solutions to help bring greater operational efficiency and better shopper experiences to retailers in today's competitive landscape. Honeywell Guided Work Solutions' AI-driven speech technology enables in-store associates to perform tasks like click-and-collect order fulfillment, shelf restocking and returns processing with speed and efficiency. The development of an AI-enhanced solution to streamline retail operations also supports Honeywell's portfolio alignment to three compelling megatrends: automation, the future of aviation and energy transition. Guided Work Solutions Integrating Artificial Intelligence\n\nBy combining headset-enabled speech direction with software that offers insights and analytics built on Honeywell Forge architecture, the updated solution walks retail associates through workflows in real-time. Associates simply talk into a hands-free headset and then receive specific directions and confirmation they are selecting the right items. With the integration of AI, the solution can understand employees' speech in more than 48 different languages, despite variations in tone, dialect and pronunciation.\n\n\"The retail landscape has undergone a significant transformation, particularly with trends like buy online, pick up in-store and the advent of highly personalized shopping experiences,\" said David Barker, president of Honeywell Productivity Solutions and Services. \"As retailers seek ways to improve their operational performance and enhance the customer experience, Guided Work Solutions is the ideal tool to accomplish these goals. It harnesses the strengths of AI technology to empower retail associates to serve in-store customers in a more efficient manner.\"\n\nHoneywell Guided Work Solutions helps retailers build a competitive advantage and optimize daily operations by increasing productivity, decreasing training time and cutting out-of-stock items on shelves, thereby facilitating potential for greater in-store sales. Since launching Honeywell Guided Work Solutions in 2018, it has enabled retailers to improve productivity by more than 30% over radiofrequency (RF) scanning and to reach upwards of 99% accuracy in product picking.* As a result, store managers can make improved use of limited labor resources by leveraging time savings to reallocate their workforce to other value-added activities or to increase the number of orders fulfilled within the same timeframe.\n\nStory continues\n\nTo learn more about Honeywell Guided Work Solutions, visit: https://automation.honeywell.com/us/en/solutions/productivity\n\n*According to Honeywell customer data regarding Guided Work Solutions overall, not solely the AI component.\n\nAbout Honeywell\n\nHoneywell is an integrated operating company serving a broad range of industries and geographies around the world.  Our business is aligned with three powerful megatrends – automation, the future of aviation and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Connected Enterprise integrated software platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world smarter, safer and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nMedia Contact: Carly Ingersoll\r\n+1 (704) 626-1374\r\ncarling.ingersoll@honeywell.com Honeywell Sensing and Productivity Solutions logo (PRNewsFoto/Honeywell) (PRNewsfoto/Honeywell) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-integrates-artificial-intelligence-into-its-guided-work-solutions-to-improve-retailer-performance-302162488.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-integrates-artificial-intelligence-guided-120400575.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.012,
            "neu": 0.769,
            "pos": 0.219
        }
    },
    {
        "date": "2024-06-04T00:00:00+00:00",
        "title": "The 3 Most Undervalued Quantum Computing Stocks to Buy in June 2024",
        "content": "As artificial intelligence becomes increasingly sophisticated, the next area of growth will involve undervalued quantum computing stocks.",
        "link": "https://investorplace.com/2024/06/the-3-most-undervalued-quantum-computing-stocks-to-buy-in-june-2024/",
        "symbols": [
            "HON.US",
            "IBM.US",
            "INTC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.852,
            "neg": 0,
            "neu": 0.601,
            "pos": 0.399
        }
    }
]