[
    {
        "date": "2024-08-05T15:40:14+00:00",
        "title": "MARUY or HON: Which Is the Better Value Stock Right Now?",
        "content": "Investors looking for stocks in the Diversified Operations sector might want to consider either Marubeni Corp. (MARUY) or Honeywell International Inc. (HON). But which of these two stocks presents investors with the better value opportunity right now? Let's take a closer look.\n\nWe have found that the best way to discover great value opportunities is to pair a strong Zacks Rank with a great grade in the Value category of our Style Scores system. The Zacks Rank is a proven strategy that targets companies with positive earnings estimate revision trends, while our Style Scores work to grade companies based on specific traits.\n\nMarubeni Corp. and Honeywell International Inc. are sporting Zacks Ranks of #1 (Strong Buy) and #2 (Buy), respectively, right now. This means that MARUY's earnings estimate revision activity has been more impressive, so investors should feel comfortable with its improving analyst outlook. But this is just one piece of the puzzle for value investors.\n\nValue investors analyze a variety of traditional, tried-and-true metrics to help find companies that they believe are undervalued at their current share price levels.\n\nThe Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors.\n\nMARUY currently has a forward P/E ratio of 7.62, while HON has a forward P/E of 20.03. We also note that MARUY has a PEG ratio of 1.14. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. HON currently has a PEG ratio of 2.31.\n\nAnother notable valuation metric for MARUY is its P/B ratio of 1.18. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. By comparison, HON has a P/B of 7.56.\n\nThese are just a few of the metrics contributing to MARUY's Value grade of A and HON's Value grade of D.\n\nMARUY is currently sporting an improving earnings outlook, which makes it stick out in our Zacks Rank model. And, based on the above valuation metrics, we feel that MARUY is likely the superior value option right now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nMarubeni Corp. (MARUY) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nStory continues\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/maruy-hon-better-value-stock-154014948.html",
        "symbols": [
            "8002.TSE",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "MARA.BE",
            "MARA.DU",
            "MARA.F",
            "MARA.MU",
            "MARA.STU",
            "MARUF.US",
            "MARUY.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.004,
            "neu": 0.781,
            "pos": 0.216
        }
    },
    {
        "date": "2024-08-05T11:00:23+00:00",
        "title": "Honeywell Automation India's Q1 profit jumps on order execution",
        "content": "BENGALURU (Reuters) - Engineering firm Honeywell Automation reported higher first-quarter profit on Monday, aided by execution of existing orders.\n\nThe Indian unit of U.S.-based Honeywell International reported a profit of 1.37 billion rupees (around $16 million), compared to 1.03 billion rupees a year ago.\n\nExecution of legacy projects and stable costs helped boost earnings of Honeywell, analysts said. The company provides building automation solutions to industrial clients and designs emission-curbing and energy transition products.\n\nIts revenue from operations advanced 3% to 9.6 billion rupees. Honeywell Automation does not provide segmental details on its earnings.\n\nTotal expenses slipped 0.7% to 8.21 billion rupees, mainly due to a 41% slump in what the company classified as \"other expenses\" without providing specific details.\n\nHoneywell Automation's stock, one of India's costliest, rose nearly 47% in the quarter, its highest in at least 10 years, as per LSEG data.\n\nIt closed 2.7% lower on the day, amid a broader market sell-off.\n\n($1 = 83.8100 Indian rupees)\n\n(Reporting by Manvi Pant in Bengaluru; Editing by Varun H K)\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-automation-indias-q1-profit-110023769.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.906,
            "neg": 0.012,
            "neu": 0.895,
            "pos": 0.093
        }
    }
]