[
    {
        "date": "2024-08-14T12:00:00+00:00",
        "title": "HONEYWELL LAUNCHES INNCOM DIRECT TO HELP MID-MARKET HOTELS REDUCE THEIR CARBON FOOTPRINT",
        "content": "Intuitive energy management system helps hotels monitor energy consumption across properties and automate energy efficiencies\n\nATLANTA, Aug. 14, 2024 /PRNewswire/ -- Honeywell (NASDAQ: HON) today announced the launch of INNCOM Direct, an easy-to-install energy management system that uses automation to help improve energy efficiency in mid-market hotel properties. The launch of INNCOM Direct supports Honeywell's alignment of its business around three compelling megatrends, including automation and the energy transition. Honeywell logo\n\nThroughout 2024 there could be more than 30% of U.S. hotel rooms possibly vacant at any time, INNCOM Direct enables a hotel to manage energy-intensive HVAC systems more efficiently during periods when guest rooms are vacant.\n\n\"As hotels become more carbon-conscious, they are taking meaningful steps to show they care about their impact on the environment,\" said Billal Hammoud, president and chief executive officer of Honeywell Building Automation. \"Until now, mid-market hotels faced fewer options when it came to better managing their HVAC systems with automation. Now, INNCOM Direct is leveling the playing field with an affordable, cloud-based energy management system.\"\n\nThe INNCOM technology was previously only accessible to high-end hotel operators. Now, this combination of hardware, software and cloud monitoring provides mid-market, also known as limited-service, hotels with quick setup and portfolio analytics that can be accessed from mobile devices or a dashboard and can be used either on a single property or across an entire portfolio.\n\nSince empty rooms and common areas do not need the same level of heating or cooling, INNCOM Direct uses a proprietary detection system to identify empty spaces and autonomously adjust the temperature without impacting consumer comfort. Similarly, unrented guest rooms can be set to a specific setting that can be heated or cooled to a more comfortable temperature once a guest checks in. If a guest leaves a room for an extended time, INNCOM Direct can change the temperature to an eco-friendlier temperature that is then automatically adjusted when the guest returns.\n\nWhen it broke ground on its fifth hotel in Spring Hill, Tenn., Halifax Hospitality wanted ways to control its HVAC use, which can consume as much as 25% of the power bill, so it signed on to use INNCOM Direct. At 92,000 square feet and 159 rooms, this hotel is double the size of what the company would have developed a decade ago, leading to higher operational costs.\n\n\"Hotel rooms are getting bigger and bigger, and we needed something that will deliver energy savings, especially when guests aren't using the room or a common area is empty,\" said Hitesh Patel, vice president of Halifax Hospitality. \"Utility costs are going up just like anything else. We're always looking to find the next big thing to cut costs where we can.\"\n\nStory continues\n\nAbout Honeywell Honeywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Forge IoT platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world smarter, safer and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nMedia Contacts:  Honeywell  Edelman  Dawn Wotapka  Media contact (631) 943-3782  dawn.wotapka@honeywell.com  HoneywellBAPress@edelman.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-launches-inncom-direct-to-help-mid-market-hotels-reduce-their-carbon-footprint-302221705.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-launches-inncom-direct-help-120000067.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.018,
            "neu": 0.842,
            "pos": 0.139
        }
    }
]