[
    {
        "date": "2024-09-05T22:15:05+00:00",
        "title": "Why Honeywell International Inc. (HON) Dipped More Than Broader Market Today",
        "content": "Honeywell International Inc. (HON) closed at $202.98 in the latest trading session, marking a -1.25% move from the prior day. This change lagged the S&P 500's daily loss of 0.3%. On the other hand, the Dow registered a loss of 0.54%, and the technology-centric Nasdaq increased by 0.25%.\n\nThe company's shares have seen an increase of 3.85% over the last month, surpassing the Conglomerates sector's loss of 8.06% and the S&P 500's gain of 3.42%.\n\nInvestors will be eagerly watching for the performance of Honeywell International Inc. in its upcoming earnings disclosure. The company's earnings per share (EPS) are projected to be $2.52, reflecting a 11.01% increase from the same quarter last year. In the meantime, our current consensus estimate forecasts the revenue to be $9.9 billion, indicating a 7.5% growth compared to the corresponding quarter of the prior year.\n\nFor the entire fiscal year, the Zacks Consensus Estimates are projecting earnings of $10.15 per share and a revenue of $39.12 billion, representing changes of +10.81% and +6.7%, respectively, from the prior year.\n\nInvestors should also take note of any recent adjustments to analyst estimates for Honeywell International Inc. These recent revisions tend to reflect the evolving nature of short-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.\n\nOur research shows that these estimate changes are directly correlated with near-term stock prices. To take advantage of this, we've established the Zacks Rank, an exclusive model that considers these estimated changes and delivers an operational rating system.\n\nThe Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.05% lower within the past month. Honeywell International Inc. is currently sporting a Zacks Rank of #3 (Hold).\n\nDigging into valuation, Honeywell International Inc. currently has a Forward P/E ratio of 20.24. This valuation marks a premium compared to its industry's average Forward P/E of 18.4.\n\nWe can additionally observe that HON currently boasts a PEG ratio of 2.33. Comparable to the widely accepted P/E ratio, the PEG ratio also accounts for the company's projected earnings growth. The Diversified Operations industry currently had an average PEG ratio of 1.9 as of yesterday's close.\n\nThe Diversified Operations industry is part of the Conglomerates sector. With its current Zacks Industry Rank of 94, this industry ranks in the top 38% of all industries, numbering over 250.\n\nStory continues\n\nThe Zacks Industry Rank is ordered from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nKeep in mind to rely on Zacks.com to watch all these stock-impacting metrics, and more, in the succeeding trading sessions.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/why-honeywell-international-inc-hon-221505704.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.027,
            "neu": 0.854,
            "pos": 0.119
        }
    },
    {
        "date": "2024-09-05T19:36:42+00:00",
        "title": "Honeywell International Inc. (HON): One of the Best Battery Stocks to Buy According to Short Sellers",
        "content": "We recently compiled a list of the 10 Best Battery Stocks To Buy Now According to Short Sellers.In this article, we are going to take a look at where Honeywell International Inc. (NASDAQ:HON) stands against the other battery stocks.\n\nElectric vehicles are the latest trend in the automotive market which is revolutionizing the whole industry. According to Grand View Research, the global electric vehicle (EV) market was valued at $1.07 trillion in 2023 and is projected to grow at a compound annual growth rate (CAGR) of 33.6% from 2024 to 2030 and reach $8.85 trillion by the end of the forecast.\n\nThe growth is driven by government policies, incentives, and advancements in battery technology, which are making EVs more affordable and appealing. The transportation and logistics sectors are increasingly adopting EVs due to their lower emissions and operational costs, with companies like Amazon integrating electric trucks into their fleets.\n\nSimilarly, Grand View Research believes that the global EV battery market was valued at $44.69 billion in 2022 and is projected to grow at a CAGR of 21.1% from 2023 to 2030. Strategic collaborations among battery manufacturers, e-mobility providers, and energy suppliers are improving battery durability and lifespan, while the increasing production of EVs in countries like China, Germany, and Japan, along with government investments in EV charging infrastructure, is further accelerating the market. However, fluctuating raw material prices, such as lithium-ion, could impact production costs.\n\nThe Growing Importance of Critical Minerals in Energy Transition\n\nAccording to BP’s Energy Outlook 2024, the transition to a low-carbon energy system will require a substantial increase in the use of critical minerals, such as copper, lithium, and nickel, essential for supporting the infrastructure and assets needed for this transition. According to the report, the rapid expansion of electric vehicles is projected to reach 1.2 billion (current trajectory) to 2.1 billion (goal to reach Net Zero) by 2050, which will significantly increase the demand for batteries and in turn, higher demand for minerals like lithium and nickel.\n\nCopper demand is expected to rise by 75-100% by 2050, mostly due to its use in EVs and the extension of electricity networks. Lithium demand could grow 8 to 14 times by 2050, mainly driven by its use in EV batteries, which will account for about 80% of total lithium demand by 2050. Lastly, nickel demand is projected to increase two to three times by 2050, with most of this growth linked to lithium-ion batteries in EVs.\n\nStory continues\n\nHow Competitive Pricing and Leasing Are Shaping the EV Market\n\nIn an interview at CNBC Power Lunch, Erin Keating, Cox Automotives executive analyst, explored the factors shaping the EV market. She noted that Tesla and Chevy initially dominated EV sales, which is why a growing supply of used cars from the former is now available. These used EVs have become more affordable, partly due to tax credits of up to $4,000. This is helping to drive sales in the used EV market and making it a more attractive option for consumers.\n\nHowever, the lease market is offering deals that compete with used EV prices. According to Keating, while this puts downward pressure on used EV prices, she emphasized the benefit of the situation and said that more leased vehicles today will enter the used market in a few years, which will ensure a steady supply of affordable used EVs in the future.\n\nKeating also addressed the issue of buyer’s remorse, as some people are frustrated with the slower development of EV infrastructure and range anxiety. Despite this, she reassured consumers that the batteries in used EVs are holding up well with minimal degradation.\n\nIt means consumers can trust the longevity of these vehicles, and automakers are committed to supporting them. Although some challenges remain, she believes that as infrastructure improves, consumer confidence and adoption of EVs will continue to grow.\n\nOur Methodology\n\nFor this article, we used stock screeners and ETFs including Amplify Lithium & Battery Technology ETF and Lithium & Battery Tech ETF to identify companies involved in the EV battery market. We then selected 10 stocks with the smallest short interest and listed them in descending order of their short interest. We also mentioned the hedge fund sentiment around each stock which was taken from Insider Monkey’s database of over 900 elite hedge funds.\n\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\n\nA shot of a commercial plane with a blur of color in the background, representing the production of auxiliary power units in the Safety and Productivity Solutions segment.\n\nHoneywell International Inc. (NASDAQ:HON)\n\nShort Interest as % of Shares Outstanding: 0.89%\n\nNumber of Hedge Fund Holders: 50\n\nHoneywell International Inc. (NASDAQ:HON) is a multinational conglomerate with a strong footing in the global market due to its broad and innovative portfolio spanning aerospace technologies, building automation, energy and sustainable solutions, and industrial automation. The company has been advancing battery technology, and its Honeywell Ionic battery energy storage system (BESS) is evidence of this focus. The system is designed to optimize energy costs while offering reliable backup power and reducing carbon emissions. Its flexibility is highlighted by its ability to support different battery chemistries and scale from around 700 kilowatt-hours (kWh) to 300 megawatt-hours (MWh).\n\nIn the EV sector, the company has made significant strides with its battery safety sensors. These sensors are essential for the early detection of thermal runaway, a critical safety feature for EVs and energy storage systems. The company’s current sensors, including the CSNV, CSHV, and CSSV series, provide accurate battery state measurements and adhere to international safety standards. Furthermore, the BAS Series and BPS Series offer advanced detection capabilities for thermal runaway and particulate matter within battery packs, which improves overall safety and dependability.\n\nIts investment in the battery technology sector is also significant. The company's $27.5 million investment in ESS Tech signals its dedication to advancing long-duration battery storage solutions. This investment aligns with the company's broader goal of supporting sustainable energy technologies and expanding its footprint in the battery market. It tops our list of the best battery stocks to buy now.\n\nIn the second quarter, 50 hedge funds had stakes in Honeywell International (NASDAQ:HON), with total positions worth $1.08 billion. Millennium Management has increased its stake in the company by 179% to 1.6 million shares worth $351.117 million and is the most significant shareholder, as of the second quarter.\n\nHoneywell International’s (NASDAQ:HON) diverse business segments contribute to its steady growth, regardless of market fluctuations. In the second quarter, it reported a 5% increase in sales, reaching $9.6 billion. Its non-GAAP adjusted EPS was $2.49. The Aerospace Technologies segment saw a 16% rise in revenue compared to the previous year, driven by increased flight hours, higher chipset deliveries, and improved supply chain conditions.\n\nSimilarly, the Building Automation segment’s revenue grew by 4% year-over-year, due to strong performance in data centers, healthcare, and energy services. The Energy and Sustainability Solutions segment also saw a 2% revenue increase, supported by strong demand for fluorine products in Advanced Materials.\n\nAdditionally, the company’s growth trajectory is supported by its strategic acquisitions, such as CAES Systems and Air Products' liquefied natural gas process technology and equipment business, which were announced in June and July, respectively. These acquisitions are expected to strengthen the company's capabilities and market position further.\n\nOverall HON ranks 1st on our list of the best battery stocks to buy. While we acknowledge the potential of HON as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than HON but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nRead Next: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-international-inc-hon-one-193642680.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.019,
            "neu": 0.85,
            "pos": 0.131
        }
    },
    {
        "date": "2024-09-05T16:56:33+00:00",
        "title": "Honeywell promotes Mike Stepniak to CFO",
        "content": "The software industrial giant Honeywell International Inc. has named a new chief financial officer.\n\nMike Stepniak, who joined Honeywell in 2020 and currently serves as VP and CFO for Honeywell Aerospace Technologies, will succeed Greg Lewis as SVP and CFO after the company announces its results for 2024. Until the CFO transition, Stepniak will take on the role of VP of corporate finance, the company announced on Thursday morning.\n\nPrior to the announcement, Stepniak served as CFO for Honeywell Building Technologies, a division of the company focused on homes. Before joining Honeywell, Stepniak spent nearly 20 years with General Electric and Baker Hughes.\n\nLewis joined Honeywell in 2006, and has held a series of finance leadership roles, becoming CFO in 2018. After stepping down as CFO, he will take on the role of SVP of Honeywell Accelerator, and serve as a senior advisor to chairman and CEO Vimal Kapur. Accelerator is Honeywell’s operating system that standardizes work across four main business models of products, aftermarket services, projects, and software, according to the company.\n\nHoneywell, a Fortune 500 company headquartered in Charlotte, operates four business segments: aerospace technologies, industrial automation, building automation, and energy and sustainability solutions.\n\nThe company's second-quarter earnings, announced on July 25, beat estimates with sales up 5% year over year, reaching $9.6 billion. Earnings per share for the quarter were $2.36, up 6% year over year, and adjusted earnings per share was $2.49, up 8%. Revenue for the quarter rose 4.7% to $9.58 billion. The company downwardly revised its full-year guidance for earnings per share, segment margin, and cash flow.\n\nStepniak brings a “strong track record of driving profitable growth across numerous industrial and technology businesses during multiple market and economic cycles,” Kapur said in a statement.\n\nDuring his time as CFO, Lewis “played an instrumental role” in leading the business, including aligning the company’s portfolio around “three powerful megatrends,” which are automation, the future of aviation, and energy transition, according to Kapur. Since taking the top job last year, Kapur has aligned the industrial giant’s portfolio around those areas. In July, Honeywell announced the acquisition of Air Products’ liquefied natural gas process technology and equipment business for $1.8 billion. It’s his fourth major acquisition in eight months, Fortune reported.\n\n\"I am proud of the transformation we have driven over my tenure at Honeywell, particularly these past eight years, and confident the company will continue progressing the strategy that Vimal and our team have laid out,\" Lewis said in a statement, adding that Stepniak has been “instrumental” in driving commercial expansion and innovation, and he expects a seamless transition.\n\nThis story was originally featured on Fortune.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-promotes-mike-stepniak-cfo-165633816.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.988,
            "neg": 0,
            "neu": 0.909,
            "pos": 0.091
        }
    },
    {
        "date": "2024-09-05T10:25:20+00:00",
        "title": "Honeywell names Mike Stepniak new CFO",
        "content": "(Reuters) - Honeywell's chief financial officer Greg Lewis will step down from his role and will be succeeded by Mike Stepniak, the company said on Thursday.\n\n(Reporting by Aishwarya Jain in Bengaluru; Editing by Shreya Biswas)\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-names-mike-stepniak-cfo-102520211.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.422,
            "neg": 0,
            "neu": 0.928,
            "pos": 0.072
        }
    },
    {
        "date": "2024-09-05T10:00:00+00:00",
        "title": "HONEYWELL ANNOUNCES CHIEF FINANCIAL OFFICER SUCCESSION",
        "content": "CHARLOTTE, N.C., Sept. 5, 2024  /PRNewswire/ -- Honeywell International Inc. (NASDAQ: HON) today announced that Mike Stepniak, who currently serves as Vice President and Chief Financial Officer for Honeywell Aerospace Technologies, will succeed Greg Lewis as Senior Vice President and Chief Financial Officer following the company's announcement of its fourth quarter and full-year financial results for fiscal year 2024. Until the transition is complete, Stepniak will serve as Vice President, Corporate Finance. Upon completion of the transition, Lewis, who has been Honeywell's CFO since 2018 and served the company for nearly two decades, will become Senior Vice President of Honeywell Accelerator and serve as a Senior Advisor to Chairman and CEO Vimal Kapur.\n\nStepniak brings over two decades of deep finance experience -- across financial planning and analysis, corporate audit, business transformation and operations in the industrial sector. His background includes leading global finance, controllership and finance excellence. In addition to his current role in Aerospace Technologies, Stepniak previously served as CFO of Honeywell Building Technologies. In the coming months, Stepniak will work closely with Lewis and others across the leadership team to facilitate a seamless transition.\n\n\"We're extremely excited about Mike adding his deep experience in finance and operations to our leadership team. He brings a strong track record of driving profitable growth across numerous industrial and technology businesses during multiple market and economic cycles. Mike has an extensive understanding of our business, customers and shareholders that positions him well to lead our global finance organization and makes him the right leader to help us advance our capital deployment commitment and further accelerate growth,\" said Vimal Kapur, Chairman and CEO of Honeywell.\n\n\"I also want to take the opportunity to thank Greg for his partnership and significant contributions as CFO and as a champion of Honeywell's foundational principles and digital transformation,\" Kapur continued. \"Greg has played an instrumental role in leading our business during his time as Honeywell CFO – helping us create compelling value for shareholders, align our portfolio to focus on three powerful megatrends and set a course for sustained future growth.\"\n\n\"I am proud of the transformation we have driven over my tenure at Honeywell, particularly these past eight years, and confident the company will continue progressing the strategy that Vimal and our team have laid out,\" said Lewis. \"Mike has been instrumental in driving commercial expansion and innovation in our business, and I am confident that his strong financial acumen, combined with his passion for operational excellence, will enable a seamless transition as we continue to deliver value for shareholders.\"\n\nStory continues\n\nHoneywell does not expect any changes to its performance or outlook as a result of the transition, which reflects the Board and leadership's commitment to ongoing succession planning.\n\nMike Stepniak Mike Stepniak is an experienced global finance leader with a track record of driving financial performance, international growth and business development in the industrial industry. He joined Honeywell in 2020 and currently serves as Vice President and Chief Financial Officer of Honeywell Aerospace Technologies where he leads global finance, controllership and finance excellence, serving as a key member of the Aerospace Leadership Team. Stepniak was previously CFO for Honeywell Building Technologies.\n\nPrior to joining Honeywell, Stepniak spent nearly 20 years with General Electric (GE) and Baker Hughes, progressing through various global finance leadership roles. He most recently served as CFO of the Oilfield Equipment division at Baker Hughes international, a GE company. Stepniak started his career in the Financial Management and Corporate Audit programs at GE.\n\nStepniak holds an MBA in international business from the University of Memphis and a Bachelor of Science in business administration from Edinboro University in Pennsylvania.\n\nAbout Honeywell Honeywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends – automation, the future of aviation and energy transition – underpinned by our Honeywell Accelerator operating system and Honeywell Forge IoT platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations through our Aerospace Technologies, Industrial Automation, Building Automation and Energy and Sustainability Solutions business segments that help make the world smarter, safer and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nWe describe certain trends and other factors that drive our business and future results in this release. Such discussions contain forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended (the Exchange Act). Forward-looking statements are those that address activities, events, or developments that management intends, expects, projects, believes or anticipates will or may occur in the future. They are based on management's assumptions and assessments in light of past experience and trends, current economic and industry conditions, expected future developments and other relevant factors, many of which are difficult to predict and outside of our control. They are not guarantees of future performance, and actual results, developments and business decisions may differ significantly from those envisaged by our forward-looking statements. We do not undertake to update or revise any of our forward-looking statements, except as required by applicable securities law. Our forward-looking statements are also subject to material risks and uncertainties, including ongoing macroeconomic and geopolitical risks, such as lower GDP growth or recession, capital markets volatility, inflation, and certain regional conflicts, that can affect our performance in both the near- and long-term. In addition, no assurance can be given that any plan, initiative, projection, goal, commitment, expectation, or prospect set forth in this release can or will be achieved. These forward-looking statements should be considered in light of the information included in this release, our Form 10-K and other filings with the Securities and Exchange Commission. Any forward-looking plans described herein are not final and may be modified or abandoned at any time.\n\nContacts: Media  Investors  Stacey Jones  Sean Meakim  Stacey.Jones@Honeywell.com  Sean.Meakim@Honeywell.com (PRNewsfoto/Honeywell) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-announces-chief-financial-officer-succession-302238709.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-announces-chief-financial-officer-100000674.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.022,
            "neu": 0.847,
            "pos": 0.131
        }
    }
]