[
    {
        "date": "2024-06-15T11:00:00+00:00",
        "title": "Electric Avenue: 3 EV Stocks That Will Electrify Your Investment Returns",
        "content": "Electric vehicle sales are accelerating again, creating an opportunity for some of the top EV stocks to buy.\n\nIn California, for example, about 24% of all new cars sold were electric in the first quarter, according to the California Energy Commission. The state recently approved about $1.9 billion to build 40,000 new public EV chargers to help fuel adoption.\n\nAs for the rest of the country, “Six of the 10 biggest EV makers in the US saw sales grow at a scorching pace compared to a year ago,” says Bloomberg. Even better, “For the rest of 2024, GM appears to be on the brink of becoming the biggest driver of EV growth in the US. The Detroit automaker has committed to electrifying some of its biggest brands, which arefinally reaching production after years of delays.”\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nThe International Energy Agency also expects US deliveries to top 2.5 million by 2025 from about 1.1 million in 2024. In short, demand is on the run.\n\nWith that, here are some of the top EV stocks to buy that should accelerate with better sales.\n\nTesla (TSLA) Tesla (TSLA) Service Center. Tesla designs and manufactures the Model S electric sedan IV. Tesla layoffs\n\nSource: Jonathan Weiss / Shutterstock.com\n\nThe last time I mentioned Tesla (NASDAQ:TSLA), I said, “It’s time to buy the fear. Granted, sales have slipped but it’s still dominating the market.”\n\nThat was on May 20, as Tesla traded at about $175. Today, it’s up to $191.08, which is still an attractive buy, especially with EV sales regaining momentum. From that last traded price, I’d like to see Tesla initially retest $205.\n\nHelping, Wedbush analysts say the $56 billion Elon Musk compensation removes a $20 to $25 overhang on the TSLA stock. That’s because the award now dispels fears Musk will focus on other projects outside of Tesla, including a generative artificial intelligence project. With this, Wedbush has a $275 price target on TSLA shares.\n\nPlus, Tesla’s market dominance is only expected to become stronger.\n\nAs noted by QZ.com, “While Tesla was out selling 50,000 new EVs, Ford was struggling to hit 10,000 EVs sold in second place. Behind it was Hyundai, which shifted 5,686 electric cars in March and BMW sold 4,246 electric models.”\n\nBYD Co. (BYDDF) Close-up of BYD (BYDDY) logo on red car, symbolizing BYDDY stock\n\nSource: shutterstock.com/Trygve Finkelsen\n\nThe last time I mentioned BYD Co. (OTCMKTS:BYDDF), it traded at $24 on May 22.\n\nAt the time I noted, “From its last traded price of $28, I’d like to see it break above prior resistance at $32 a share. The company noted passenger vehicle sales were up 23.64% YTD to 936,446, with electric sales up about 18% to 434,579.”\n\nStory continues\n\nNow up to $29.05, it’s still a buy.\n\nAnalysts at Citi just opened a 30-day upside catalyst watch on the BYD stock with lower-than-feared European Union tariffs and stronger domestic demand.\n\n“The lower tariff bodes well for BYD’s market share gain in the EU, Citibank analysts said. They also forecast that BYD’s exports to the EU will account for one-fourth to one-third of its overall sales in 2024,” added Investint.com. “The brokerage also flagged strength in domestic sales, with BYD seeing strong order intake in recent weeks, which heralds stronger sales in the second and third quarter.”\n\nGlobal X Autonomous & Electric Vehicles ETF (DRIV) White electric car connected to power station charger on green background 3D Rendering. Electric vehicles, EVs, EV stocks.\n\nSource: Ilija Erceg / Shutterstock\n\nOr, if you want greater exposure to autonomous and other top EV stocks to buy at less cost, there’s the Global X Autonomous & Electric Vehicles ETF (NASDAQ:DRIV).\n\nThe last time I highlighted an opportunity in the DRIV ETF, it traded at $23.22 in April. Now at $24.08, it’s still a buy.\n\nFrom here, if EV sales momentum can improve, if we see more charging stations installed, and if the Federal Reserve does cut interest rates, electric vehicle stocks and ETFs, like DRIV, could accelerate to higher highs. In addition, with an expense ratio of 0.68%, the ETF currently invests in 45 stocks involved in the development of autonomous vehicle technology, electric vehicles and EV components and materials.\n\nSome of its top 75 fund holdings include Nvidia (NASDAQ:NVDA), Toyota(NYSE:TM), Microsoft (NASDAQ:MSFT), Tesla, Apple (NASDAQ:AAPL),Honeywell (NASDAQ:HON), Stellantis(NYSE:STLA) and Honda Motor (NYSE:HMC) to name a few.\n\nOn the date of publication, Ian Cooper did not have (either directly or indirectly) any positions in the securities mentioned. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nIan Cooper, a contributor to InvestorPlace.com, has been analyzing stocks and options for web-based advisories since 1999.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post Electric Avenue: 3 EV Stocks That Will Electrify Your Investment Returns appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/electric-avenue-3-ev-stocks-110000879.html",
        "symbols": [
            "002594.SHE",
            "1211.HK",
            "AAPL.US",
            "BY6.F",
            "BY6A.F",
            "BYDDF.US",
            "BYDDY.US",
            "DRIV.US",
            "HMC.US",
            "HON.US",
            "MSFT.US",
            "NVDA.US",
            "STLA.US",
            "TM.US",
            "TSLA.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.024,
            "neu": 0.859,
            "pos": 0.117
        }
    }
]