[
    {
        "date": "2024-06-19T14:00:00+00:00",
        "title": "3 AI Supply Chain Stocks You Need to Own Now",
        "content": "As the global economy increases in complexity, the role of artificial intelligence in supply chain management has transformed from a luxury to a necessity. AI-driven supply chain solutions are revolutionizing how companies forecast demand, manage inventories and coordinate logistics. The adoption of AI technologies allows businesses to leverage big data analytics, enhance automation and improve service delivery. This is boosting many AI supply chain stocks that investors should buy now.\n\nThe supply chain market’s AI usage is predicted to reach $58.55 billion by 2031 — an annual growth rate of 40.4%. This growth will be driven by AI integration into supply chain operations to help automate tasks, forecast demand, optimize logistics and efficiently manage inventory.\n\nAI’s importance in the supply chain sector will only increase moving forward, making it a critical area for technological innovation. Here are three AI supply chain stocks to buy now.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nC3.ai (AI) AI stocks to Buy, Close-up of letters \"AI\" written on a computer chip, symbolizing artificial intelligence and AI stocks. ai chip stocks\n\nSource: shutterstock.com/YAKOBCHUK V\n\nC3.ai (NYSE:AI) is a notable player in the AI-driven digital transformation space. The company is known for its innovative approach to enterprise artificial intelligence applications. C3.ai leverages its extensive portfolio of AI applications to address various challenges within the supply chain industry. The company’s services include predictive maintenance, demand forecasting, inventory management and logistics optimization.\n\nDespite challenges, C3.ai reported a revenue increase of 20% year-over-year in the fourth quarter, amounting to $86.6 million. This growth is primarily driven by robust subscription revenue, which now accounts for 92% of the total revenue.\n\nAs of FY 2024, the company launched 30 new Generative AI products, bringing its portfolio to a total of 90 enterprise-level applications. This expansion is critical as it demonstrates C3.ai’s commitment to staying at the forefront of AI technology.\n\nC3.ai’s stock experienced significant volatility in 2024. Despite this, recent adjustments in stock prices and market sentiment suggest a recovery, with C3.ai’s share showing signs of stabilization and modest upward trends.\n\nHoneywell (HON) Illustration of robot hand reaching for the letters \"AI\" with tech symbols around it. AI tech stock predictions. best artificial intelligence stocks. tech stocks. AI stocks. stocks to benefit from AI growth. AI Stocks\n\nSource: shutterstock.com/Allies Interactive\n\nHoneywell (NASDAQ:HON) is a conglomerate with a diversified business model spanning aerospace, building technologies and productivity solutions. In recent years, the company has notably advanced its operational efficiency and responsiveness through the strategic integration of artificial intelligence into its supply chain management.\n\nStory continues\n\nDespite the global economic fluctuations, the company has maintained strong revenue growth, supported by a solid $32 billion backlog exiting Q1 2024. This backlog is indicative of Honeywell’s effective market strategies and its ability to secure large-scale projects across its operating segments.\n\nThe company’s strategic divestitures and acquisitions, such as the acquisition of Intelligrated in 2016, have optimized its business portfolio and bolstered its market position in logistics and automation.\n\nLooking ahead, Honeywell positions itself well for continued growth, expecting an annual EPS growth of 7-10%. The company’s strategic initiatives in megatrends such as the Internet of Things, artificial intelligence and sustainability bolster this outlook.\n\nJ.B. Hunt (JBHT) logistics stocks. supply chain stocks\n\nSource: Travel mania / Shutterstock.com\n\nJ.B. Hunt (NASDAQ:JBHT) operates in the logistics and transportation sector, where agility and strategic foresight are paramount. J.B. Hunt utilizes AI to optimize its routing and scheduling processes. The AI algorithms analyze historical data and real-time traffic conditions to determine the most efficient routes for deliveries.\n\nDespite the challenges in the freight industry, J.B. Hunt has not been passive. The company’s strategic expansion of its intermodal container fleet signifies a long-term optimistic outlook on the sector’s recovery. Furthermore, management’s proactive adjustments in customer engagement and contract strategies indicate a responsive approach aimed at retaining competitiveness and market share. This is crucial as the company navigates through an environment where pricing pressures show no immediate signs of easing.\n\nJ.B. Hunt’s financial results from the first quarter of 2024 reflect the industry’s tribulations. A revenue of approximately $2.9 billion and an operating expense ratio of 93.4% resulted in an operating income of $194 million. The resulting income reveals a robust performance in dedicated segments but struggles in integrated capacity solutions, highlighting the mixed impacts of current market conditions on different facets of the business.\n\nOn the date of publication, Mohammed Saqib did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nMohammed Saqib is a research analyst with experience in equity research and financial modeling. He has extensively covered stocks listed in the tech sector using fundamental analysis as the cornerstone of his approach. Currently pursuing a master’s degree in finance, Saqib is dedicated to obtaining the CFA charter to augment his expertise in the field further.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 3 AI Supply Chain Stocks You Need to Own Now appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-ai-supply-chain-stocks-140000292.html",
        "symbols": [
            "0J71.LSE",
            "724.F",
            "AI.US",
            "HON.US",
            "JB1.BE",
            "JB1.DU",
            "JB1.MU",
            "JB1.STU",
            "JBHT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.018,
            "neu": 0.861,
            "pos": 0.12
        }
    },
    {
        "date": "2024-06-19T00:00:00+00:00",
        "title": "3 AI Supply Chain Stocks You Need to Own Now",
        "content": "These AI supply chain stocks to buy now are poised for significant growth as market expansion is driven by strong automation demand.",
        "link": "https://investorplace.com/2024/06/3-ai-supply-chain-stocks-you-need-to-own-now/",
        "symbols": [
            "AI.US",
            "HON.US",
            "JBHT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.802,
            "neg": 0.053,
            "neu": 0.603,
            "pos": 0.344
        }
    }
]