[
    {
        "date": "2024-09-06T15:40:08+00:00",
        "title": "MARUY or HON: Which Is the Better Value Stock Right Now?",
        "content": "Investors interested in Diversified Operations stocks are likely familiar with Marubeni Corp. (MARUY) and Honeywell International Inc. (HON). But which of these two stocks presents investors with the better value opportunity right now? Let's take a closer look.\n\nThe best way to find great value stocks is to pair a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system. The proven Zacks Rank emphasizes companies with positive estimate revision trends, and our Style Scores highlight stocks with specific traits.\n\nMarubeni Corp. and Honeywell International Inc. are sporting Zacks Ranks of #2 (Buy) and #3 (Hold), respectively, right now. This system places an emphasis on companies that have seen positive earnings estimate revisions, so investors should feel comfortable knowing that MARUY is likely seeing its earnings outlook improve to a greater extent. But this is just one piece of the puzzle for value investors.\n\nValue investors also tend to look at a number of traditional, tried-and-true figures to help them find stocks that they believe are undervalued at their current share price levels.\n\nThe Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors.\n\nMARUY currently has a forward P/E ratio of 8.04, while HON has a forward P/E of 19.99. We also note that MARUY has a PEG ratio of 1.21. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. HON currently has a PEG ratio of 2.30.\n\nAnother notable valuation metric for MARUY is its P/B ratio of 1.12. The P/B ratio is used to compare a stock's market value with its book value, which is defined as total assets minus total liabilities. For comparison, HON has a P/B of 7.53.\n\nThese metrics, and several others, help MARUY earn a Value grade of A, while HON has been given a Value grade of D.\n\nMARUY is currently sporting an improving earnings outlook, which makes it stick out in our Zacks Rank model. And, based on the above valuation metrics, we feel that MARUY is likely the superior value option right now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nMarubeni Corp. (MARUY) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nStory continues\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/maruy-hon-better-value-stock-154008146.html",
        "symbols": [
            "8002.TSE",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "MARA.BE",
            "MARA.DU",
            "MARA.F",
            "MARA.MU",
            "MARA.STU",
            "MARUF.US",
            "MARUY.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.004,
            "neu": 0.769,
            "pos": 0.227
        }
    },
    {
        "date": "2024-09-06T11:15:33+00:00",
        "title": "Honeywell’s CFO is stepping down to take on a new role at the company",
        "content": "Good morning. CFO transitions continue this year with one of the latest moves happening at Honeywell International Inc.\n\nMike Stepniak, who currently serves as VP and CFO for Honeywell Aerospace Technologies, was promoted to CFO of Honeywell, the company announced on Thursday. Stepniak will succeed Greg Lewis as SVP and chief financial officer after Honeywell announces its final financial results for 2024. From Oct. 7 until the CFO transition, Stepniak will serve as VP of corporate finance, according to an SEC filing.\n\nStepniak joined Honeywell in 2020 and was previously CFO for Honeywell Building Technologies. Before coming to the company he spent nearly 20 years with General Electric and Baker Hughes.\n\nThe software industrial giant, a Fortune 500 company, is headquartered in Charlotte. It operates four business segments: aerospace technologies, industrial automation, building automation, and energy and sustainability solutions.\n\nLewis joined Honeywell in 2006 and has held a series of finance leadership roles, before becoming CFO in 2018. After stepping down as finance chief, he will take on the role of SVP of Honeywell Accelerator, and serve as a senior advisor to chairman and CEO Vimal Kapur. Accelerator is Honeywell’s operating system that standardizes work across its four main business units: products, aftermarket services, projects, and software, according to the company.\n\n“We are transforming how we run Honeywell through the latest version of our Honeywell Accelerator operating system,” Kapur said during the company’s second-quarter earnings call on July 25. The tool is proving to be “a powerful source of profitable growth\" across its businesses in areas like M&A integration, he said.\n\n\"I'm proud of the transformation we have driven over my tenure at Honeywell, particularly these past eight years,” Lewis said in a statement. His taking on a new role at the company reflects a trend of greater CFO turnover.\n\nThe rate of finance chiefs retiring, changing companies for a CFO role, or moving into new executive positions increased in the first half of 2024, according to leadership advisory firm Russell Reynolds Associates' Global CFO Turnover index. Taking a look at H1, from Jan. 1 to June 30, CFO turnover reached 8.9% globally, outpacing levels in 2022 and 2023. In H1 2023, turnover reached 8.3%, while the number for the same period in 2022 was 8.5%. Another finding is that more than half (54%) of companies on the S&P 500 had outgoing CFOs retire or move to new roles, according to the findings.\n\nStory continues\n\nDuring his time as CFO, Lewis “played an instrumental role” in leading the business, including aligning the company’s portfolio around “three powerful megatrends,” which are automation, the future of aviation, and energy transition, according to Kapur. Since becoming CEO last year, Kapur has aligned Honeywell’s portfolio around those areas. In July, Honeywell announced the acquisition of Air Products’ liquefied natural gas process technology and equipment business for $1.8 billion. It’s his fourth major acquisition in eight months, Fortune reported.\n\nGenerative AI has cascaded across Honeywell internally. But the real strategic benefits of AI will come from integrating the technology into Honeywell’s offerings to its customers, Kapur recently told my Fortune colleague Jeremy Kahn.\n\nHoneywell’s earnings for its second-quarter beat estimates with sales up 5% year over year, reaching $9.6 billion. Earnings per share for the quarter were $2.36, up 6% year over year, and adjusted earnings per share was $2.49, up 8%. Revenue for the quarter rose 4.7% to $9.58 billion. The company downwardly revised its full-year guidance for earnings per share, segment margin, and cash flow.\n\nStepniak brings a \"strong track record of driving profitable growth,\" Kapur said in a statement.\n\nHave a good weekend.\n\nSheryl Estrada\r\nsheryl.estrada@fortune.com\n\nUpcoming Event: The Fortune CFO collaborative will meet on Sept. 26 in Washington, D.C. from 6:15–9 p.m. The topic of the event, held in collaboration with Workday and Deloitte, is “Strengthening the CFO-CISO Alliance.” Join me and Fortune Executive Editorial Director Diane Brady who will interview J. Michael Daniel, President and CEO of Cyber Threat Alliance and Former Cybersecurity Coordinator, White House Executive Office. In this conversation, Daniel will discuss how CFOs and CISOs can collaborate more effectively to educate their organizations on the changing threat environment, build internal alliances, and enhance existing cybersecurity models to mitigate risk and maintain financial security.\n\nTo apply, please send an email to: CFOcollaborative@fortune.com\n\nThe following sections of CFO Daily were curated by Greg McKenna\n\nThis story was originally featured on Fortune.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-cfo-stepping-down-role-111533601.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.012,
            "neu": 0.891,
            "pos": 0.097
        }
    }
]