[
    {
        "date": "2024-10-20T12:21:00+00:00",
        "title": "1 Stock to Buy, 1 Stock to Sell This Week: GE Aerospace, UPS",
        "content": "Jobless claims, Fed speakers, Q3 earnings will be in focus this week. GE Aerospace is a buy with upbeat profit and sales growth expected. UPS is a sell with weak earnings, soft guidance on deck. Looking for more actionable trade ideas to navigate the current market volatility?Unlock access to InvestingPro for less than $8 a month!\n\nU.S. stocks closed higher on Friday to cap off their sixth winning week in a row, with the S&P 500 and Dow Jones Industrial Average rallying to new records.\n\nFor the week, the benchmark S&P 500 rose 0.9%, the blue-chip Dow climbed 1%, and the tech-heavy Nasdaq Composite gained 0.8%.\n\nSource: Investing.com\n\nThe week ahead is expected to be an eventful one as investors assess the outlook for the economy, inflation, interest rates and corporate earnings.\n\nMost important on the economic calendar will be Thursday morning's release of initial jobless claims figures at 8:30AM ET, as well as a pair of flash PMI surveys.\n\nThat will be accompanied by a heavy slate of Fed speakers, with the likes of district governors Neel Kashkari, Lorie Logan, Mary Daly, and Patrick Harker all set to make public appearances during the week. Weekly Economic Events\n\nSource: Investing.com\n\nSome 88% of market participants expect the Federal Open Market Committee to cut its benchmark interest rate by 25 basis points at its November 7 policy meeting, while nearly 12% expect no change, according to Investing.com’s Fed Monitor Tool.\n\nMeanwhile, third-quarter earnings season shifts into high gear, with reports expected from several high-profile companies, including Tesla (NASDAQ:TSLA), IBM (NYSE:IBM), and Boeing (NYSE:BA).\n\nSome of the other notable reporters include United Parcel Service (NYSE:UPS), Coca-Cola (NYSE:KO), General Motors (NYSE:GM), AT&T (NYSE:T), Verizon (NYSE:VZ), GE Aerospace (NYSE:GE), 3M (NYSE:MMM), Honeywell (NASDAQ:HON), Lockheed Martin (NYSE:LMT), American Airlines (NASDAQ:AAL), and Southwest Airlines (NYSE:LUV).\n\nRegardless of which direction the market goes, below I highlight one stock likely to be in demand and another which could see fresh downside. Remember though, my timeframe is just for the week ahead, Monday, October 21 - Friday, October 25.\n\nStock To Buy: GE Aerospace\n\nI foresee a strong performance for GE Aerospace stock this week, with a potential breakout to a fresh multi-year high on the horizon.\n\nThe primary catalyst for GE Aerospace is its third-quarter earnings report, set to be released before the market opens on Tuesday at 6:30AM ET.\n\nMarket participants expect a sizable swing in GE stock after the print drops, according to the options market, with a possible implied move of 5.3% in either direction.\n\nStory continues\n\nWall Street analysts are optimistic about the company’s performance, with consensus estimates predicting earnings of $1.14 per share on revenue of $9.05 billion. GE Aerospace Earnings Forecast\n\nSource: Investing.com\n\nSeveral key factors are expected to drive GE Aerospace’s earnings and sales growth. First, the company is benefiting from a surge in demand for aftermarket services, which includes maintenance, repair, and spare parts. This is a high-margin business for the company and should provide a strong boost to its profitability.\n\nAdditionally, there is strong demand for new plane engines, particularly for narrow-body aircraft. GE Aerospace, which manufactures the LEAP engine used in many of these aircraft, stands to benefit as airlines continue to replace older fleets with more fuel-efficient models.\n\nGE Aerospace stock ended at $192.61 on Friday, not far from a recent peak of $194.80, which was the highest level since May 2008. At current levels, the Evendale, Ohio-based company has a market cap of $210.7 billion. GE Aerospace Chart\n\nSource: Investing.com\n\nSince its spinoff in April, GE has been on a strong upward trajectory, with its stock up 40%. General Electric (NYSE:GE) split into three separate companies between November 2021 and April 2024, adopting the trade name GE Aerospace after divesting its healthcare and energy divisions.\n\nInvestingPro highlights GE Aerospace’s promising outlook, emphasizing its favorable positioning in the Aerospace & Defense industry, which has allowed it to leverage a resilient business model and strong profit growth.\n\nBe sure to check out InvestingPro to stay in sync with the market trend and what it means for your trading. Subscribe now with an exclusive 10% discountand position your portfolio one step ahead of everyone else!\n\nStock to Sell: UPS\n\nOn the flip side, United Parcel Service is facing a more challenging outlook, making it a strong sell this week due to a worrying combination of rising costs and weakening demand.\n\nUPS is scheduled to release its third-quarter earnings report before the market opens at 6:00AM ET on Thursday, but the forecast is not promising.\n\nSeveral headwinds are weighing on UPS’s performance. One of the most significant challenges is the slowing global economy. As inflation persists and interest rates remain elevated, consumer and business spending has slowed, leading to a drop in package volumes for UPS.\n\nAccording to the options market, traders are pricing in a swing of 4.9% in either direction for UPS stock following the print.\n\nEarnings have been catalysts for outsized swings in shares this year, as per data from InvestingPro, with UPS stock gapping down 11.5% when the company last reported quarterly numbers in July.\n\nAnalysts have been steadily revising their estimates downward in recent weeks, with all 21 analysts surveyed by InvestingPro cutting their profit forecasts by roughly 35% from initial expectations. UPS Earnings Page\n\nSource: InvestingPro\n\nWall Street sees UPS earning $1.63 per share, up 3.8% compared to EPS of $1.57 in the year-ago period. Meanwhile, revenue is forecast to tick up 5% year-over-year to $22.1 billion.\n\nThe company’s heavy reliance on global trade and shipping means it is particularly vulnerable to these macroeconomic pressures, which have been impacting revenue.\n\nIn addition to weaker demand, UPS is facing rising costs, particularly in fuel and labor. These rising expenses are squeezing margins and making it more difficult for UPS to maintain profitability.\n\nGiven these challenges, UPS is expected to issue weak guidance for the upcoming quarters, further dampening investor sentiment.\n\nUPS stock closed Friday’s session at $135.93, not far from a recent low of $123.12, which was the weakest level since July 2020. At its current valuation, the Sandy Springs, Georgia-based shipping giant has a market cap of $116.4 billion. UPS Chart\n\nSource: Investing.com\n\nShares are down 13.5% in the year to date.\n\nNot surprisingly, UPS has a below-average InvestingPro ‘Financial Health’ score of 2.3 out of 5.0 due to mounting concerns over its near-term profit and sales growth outlook.\n\nWhether you're a novice investor or a seasoned trader, leveraging InvestingPro can unlock a world of investment opportunities while minimizing risks amid the challenging market backdrop.\n\nSubscribe now to get an additional 10% off the final price and instantly unlock access to several market-beating features, including:\n\nAI ProPicks: AI-selected stock winners with proven track record. InvestingPro Fair Value: Instantly find out if a stock is underpriced or overvalued. Advanced Stock Screener: Search for the best stocks based on hundreds of selected filters, and criteria. Top Ideas: See what stocks billionaire investors such as Warren Buffett, Michael Burry, and George Soros are buying. InvestingPro 10% Discount Offer\n\nDisclosure: At the time of writing, I am long on the S&P 500, and the Nasdaq 100 via the SPDR® S&P 500 ETF, and the Invesco QQQ Trust ETF. I am also long on the Technology Select Sector SPDR ETF (NYSE:XLK).\n\nI regularly rebalance my portfolio of individual stocks and ETFs based on ongoing risk assessment of both the macroeconomic environment and companies' financials.\n\nThe views discussed in this article are solely the opinion of the author and should not be taken as investment advice.\n\nFollow Jesse Cohen on X/Twitter @JesseCohenInv for more stock market analysis and insight.\n\nRelated Articles\n\n1 Stock to Buy, 1 Stock to Sell This Week: GE Aerospace, UPS\n\nHere's How to Rebalance Your Portfolio With S&P 500 Valuations at 20-Year Highs\n\nShould We Care If Volatility Stays Elevated as Markets Climb?\n\nView comments",
        "link": "https://finance.yahoo.com/news/1-stock-buy-1-stock-122100871.html",
        "symbols": [
            "0R08.LSE",
            "91D.F",
            "AAL.US",
            "BA.US",
            "COMP.US",
            "DJI.INDX",
            "GCP.F",
            "GCP.XETRA",
            "GE.MX",
            "GE.US",
            "GEOO34.SA",
            "GM.US",
            "GSPC.INDX",
            "HON.US",
            "IBM.US",
            "IXIC.INDX",
            "KO.US",
            "LMT.US",
            "LUV.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.039,
            "neu": 0.865,
            "pos": 0.096
        }
    }
]