[
    {
        "date": "2024-06-05T14:23:00+00:00",
        "title": "Honeywell (HON) Acquires Carrier's Global Access Solutions Unit",
        "content": "Honeywell International Inc. HON recently completed the acquisition of Carrier Global Corporation’s CARR Global Access Solutions business for an all-cash deal of $4.95 billion. This acquisition is expected to strengthen HON’s foothold in the security solutions market.\r\n\r\nFlorida-based Carrier is a provider of advanced heating, ventilation, refrigeration, air conditioning, fire, security and building automation technologies. Its Global Access Solutions business provides advanced access and security solutions, electronic locking systems and contactless mobile key solutions to residential and industrial markets.\n\nAcquisition Rationale\n\nThe latest buyout is in sync with Honeywell’s policy of acquiring businesses to expand its market share and customer base. The inclusion of Global Access Solutions’ expertise in advanced access and security solutions, coupled with its impressive growth and margin profile, will enable HON to expand its security products portfolio and boost its building automation segment.\r\n\r\nThis acquisition will enable Honeywell to add three Global Access Solutions brands to its portfolio, namely, LenelS2 (which offers products like OnGuard and NetBox that are used by many Fortune 100 clients), Onity (provides electronic locks, including hospitality access, mobile credentials and self-storage access) and Supra (offers cloud-based electronic lockboxes and scheduling software).\r\n\r\nThis move is strategic as it includes both hardware and software solutions to support the company’s plan to align its portfolio to three megatrends comprising automation, the future of aviation and energy transition. Management expects the buyout to be accretive to its earnings per share in the first full year of possession.\r\n\r\nWith regard to this buyout, Honeywell also updated its 2024 outlook for sales, segment margin and adjusted earnings per share.\r\n\r\nFor the year, the company expects sales in the range of $38.5-$39.3 billion, higher than $38.1-$38.9 billion anticipated earlier. Organic sales are expected to increase in the 4-6% band. HON expects segmental margin in the band of 23.8-24.1% compared with 23-23.3% projected previously. Adjusted earnings per share are expected to be between $10.15 and $10.45, higher than $9.80-$10.10 anticipated earlier.\n\nZacks Rank, Price Performance and Estimate Revisions\n\nHoneywell, with approximately $134.9 billion market capitalization, currently carries a Zacks Rank #3 (Hold). The company is set to gain from strength in its commercial aviation aftermarket and original equipment. However, softness in its Industrial Automation segment remains a concern.\n\nStory continues Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nIn the past six months, the company’s shares have gained 4.8% compared with the industry’s growth of 2.5%.\r\n\r\nThe Zacks Consensus Estimate for its earnings is pegged at $9.93 for 2024, suggesting a decrease of a penny from the 30-day-ago figure.\n\nStocks to Consider\n\nA couple of better-ranked companies from the Zacks Conglomerates sector are discussed below.\r\n\r\nCarlisle Companies Incorporated CSL presently sports a Zacks Rank #1 (Strong Buy). It has a trailing four-quarter average earnings surprise of 17%. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nThe Zacks Consensus Estimate for CSL’s 2024 earnings has increased 6.5% in the past 60 days.\r\n\r\nGriffon Corporation GFF presently flaunts a Zacks Rank of 1. It delivered a trailing four-quarter average earnings surprise of 33.5%.\r\n\r\nIn the past 60 days, the Zacks Consensus Estimate for GFF’s 2024 earnings has risen 4.8%.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nCarlisle Companies Incorporated (CSL) : Free Stock Analysis Report\n\nGriffon Corporation (GFF) : Free Stock Analysis Report\n\nCarrier Global Corporation (CARR) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-hon-acquires-carriers-global-142300326.html",
        "symbols": [
            "4PN.F",
            "4PN.XETRA",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "C1RR34.SA",
            "CARR.US",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.004,
            "neu": 0.831,
            "pos": 0.166
        }
    },
    {
        "date": "2024-06-05T01:47:06+00:00",
        "title": "The 3 Most Undervalued Quantum Computing Stocks to Buy in June 2024",
        "content": "The Nasdaq Composite, which holds a number of big-name tech stocks, experienced a bit of selling pressure last week. In particular, the index fell nearly 2%. This potentially creates an opening for savvy investors to buy up shares of stocks that appear undervalued. One growth sector worth looking into would be quantum computing. Most people by now are familiar with generative artificial intelligence (AI) technologies, such as OpenAI’s ChatGPT. This led us to creating this list of undervalued quantum computing stocks.\n\nGenerative AI has already begun to change the way people work and consumer information. In a similar vein, quantum computing could very well usher in a similar era of technological innovation. This kind of computing technology relies on quantum mechanics – that is, properties of subatomic to particles – to calculate complex problems that classical computers have a hard time solving. Some of these problems include weather prediction and optimization problems. While quantum computing remains in its nascent phases, there are a number of public companies that have made significant contributions to field and are also trading at attractive valuations.\n\nBelow are three of them.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nUndervalued Quantum Computing Stocks: International Business Machines (IBM) The IBM 5160 is a version of the IBM PC with a built-in hard drive. Released on March 8, 1983. The 5100 series are knowns as one of the first home computers.\n\nSource: Twin Design / Shutterstock.com\n\nInternational Business Machines (NYSE:IBM) is a legacy technology behemoth that started working on quantum computers in the early 2000s. The company has continued to innovate in the field since then. In 2019, IBM released the Q System One, which was a fully-integrated quantum computing system that the company had said was ready for both commercial and scientific use. Though the “commercial use” of the quantum computing system may had been an overstatement, the Q System One definitely served as a stepping-stone for the entire sector.\n\nTowards the end of 2023, IBM unveiled the Q System Two, the firm’s “first modular quantum computer” that operate with three IBM Heron processors. Each of these processors are innovations in their own right, relying on 133 qubits. Outside of the hardware realm of quantum computing, IBM has also contributed to the software side of the space. The software stack Qiskit Patterns will allow quantum developers to easily create code for quantum computing purposes, while “watsonx” will leverage generative AI to facilitate the writing of quantum computer programs.\n\nIBM’s stock trades at 16.9x forward earnings, making it cheaper than a lot of the tech giants out there. More achievements in the field of quantum computing could create opportunities for multiple expansion for investors who decide to buy in now.\n\nStory continues\n\nIntel (INTC) Close up of Intel (INTC) sign at their San Jose campus in Silicon Valley\n\nSource: Sundry Photography / Shutterstock.com\n\nIntel (NASDAQ:INTC) has received much scrutiny over the years. Once a crown-jewel of the American semiconductor industry, the chipmaker has fallen behind rivals Nvidia (NASDAQ:NVDA) and Advanced Micro Devices (NASDAQ:AMD) in both the CPU and GPU computing chip verticals. Intel does, however, appear to have an innovative edge in terms of quantum computing. At the beginning of May, Intel unveiled cutting-edge research that could lead to the “scaling of silicon-based quantum processors,” which would be a major step in developing “fault-tolerant” quantum computers. These computational systems would be able to perform calculations with very low error rates.\n\nIntel’s Tunnel Falls chip is also an important achievement in the broader space. Released to the research community, Tunnel Falls and its advanced silicon features will help edge the chipmaker further to developing a viable and commercial quantum computer.\n\nIntel’s share price trades at around 24.4x forward earnings, which makes it relatively cheaper to its chip competitors, Nvidia and AMD. As Intel ramps up its manufacturing capabilities, it will definitely be a stock to watch in terms of AI and quantum computing innovations. This is easily one of the most undervalued quantum computing stocks.\n\nHoneywell (HON) Honeywell (HON) logo on front of glass building\n\nSource: josefkubes / Shutterstock.com\n\nHoneywell (NASDAQ:HON) is an industrial conglomerate that operates in the aerospace and defense industry. The firm’s “Aerospace” division, for example, develops power units, propulsion engines, electric power systems as well as engine controls, flight safety and navigation hardware. What is lesser known is Honeywell’s investments into the quantum computing space. As I have written in a previous article, Honeywell’s serious entry into the quantum computing space came through the formation of Quantinuum , which had been a merger between Honeywell Quantum Solutions and Cambridge Quantum in 2021.\n\nHoneywell maintains majority ownership of Quantinuum and through this new business, Honeywell has been able to continue innovating in the space. Quantinuum’s System Model H1 is the startup’s first-generation quantum computing system. Leveraging Honeywell’s proprietary technology and research, the quantum system features 20 qubits. Similar to other quantum computing systems, researchers can harness its power via a cloud environment like Azure Quantum.\n\nHoneywell’s share price trades at 20.0x forward earnings. As quantum computing becomes commercially viable, there’s not much doubt in my mind that Honeywell will be able to reap the benefits. If you are looking for undervalued quantum computing stocks, start here.\n\nOn the date of publication, Tyrik Torres did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nTyrik Torres has been studying and participating in financial markets since he was in college, and he has particular passion for helping people understand complex systems. His areas of expertise are semiconductor and enterprise software equities. He has work experience in both investing (public and private markets) and investment banking.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post The 3 Most Undervalued Quantum Computing Stocks to Buy in June 2024 appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-most-undervalued-quantum-computing-014706497.html",
        "symbols": [
            "AMD.US",
            "HON.US",
            "IBM.BA",
            "IBM.BE",
            "IBM.DU",
            "IBM.F",
            "IBM.HA",
            "IBM.HM",
            "IBM.LSE",
            "IBM.MU",
            "IBM.MX",
            "IBM.NEO",
            "IBM.STU",
            "IBM.US",
            "IBM.XETRA",
            "IBM0.F",
            "IBMB34.SA",
            "INTC.US",
            "NVDA.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.023,
            "neu": 0.887,
            "pos": 0.09
        }
    }
]