[
    {
        "date": "2024-07-25T16:57:00+00:00",
        "title": "Honeywell (HON) Q2 Earnings Beat, Aerospace Sales Rise Y/Y",
        "content": "Honeywell International Inc. HON reported second-quarter 2024 adjusted earnings of $2.49 per share, which surpassed the Zacks Consensus Estimate of $2.42. The bottom line inched up 8% year over year on an adjusted basis. On a reported basis, the company’s earnings were $2.36 per share, indicating an increase of 6%.\r\n\r\nTotal revenues of $9.1 billion beat the consensus estimate of $9.4 billion. The top line inched up 5% from the year-ago quarter driven by strength in the Aerospace Technologies segment. Organic sales also increased 4% year over year.\n\nSegmental Details\n\nIn October 2023, HON planned to realign its business segments to three megatrends, which were automation, the future of aviation and energy transition. Beginning in the second quarter of 2024, the company started operating under the segments discussed below.\r\n\r\nAerospace Technologies’ quarterly revenues were $3.9 billion, up 16% year over year. Growth in both commercial aviation and defense and space markets drove revenues. Our estimate for Aerospace Technologies’ revenues was $3.8 billion.\r\n\r\nIndustrial Automation revenues fell 8% year over year to $2.5 billion due to volume softness in warehouse and workflow solutions. Our estimate for segmental revenues was pegged at $2.5 billion.\r\n\r\nBuilding Automation revenues totaled $1.6 billion, up 4% year over year. Its revenues increased due to ongoing strength in the building solutions business. Our estimate for the segment’s revenues was $1.5 billion.\r\n\r\nEnergy and Sustainability Solutions’ revenues increased 2% to $1.6 billion due to strength in the advanced materials business and increased demand for fluorine products. Our estimate for the segment’s revenues was $1.6 billion.\n\nHoneywell International Inc. Price, Consensus and EPS Surprise\n\nHoneywell International Inc. price-consensus-eps-surprise-chart | Honeywell International Inc. Quote\n\nCosts/Margins\n\nThe company’s total cost of sales (cost of products and services) was $5.9 billion, up 4.2% year over year. Selling, general and administrative expenses were $1.4 billion, up 7.8%. Interest expenses and other financial charges were $250 million compared with $187 million a year ago.\r\n\r\nOperating income was $2 billion, up 5.1% year over year. The operating income margin was 20.7% compared with 20.6% in the year-ago period.\n\nBalance Sheet/Cash Flow\n\nHoneywell had cash and cash equivalents of $9.6 billion compared with $7.9 billion at the end of December 2023. Long-term debt was $20.9 billion, higher than $16.6 billion in 2023 end.\r\n\r\nIn the second quarter, it generated net cash of $1.37 billion from operating activities compared with $1.36 billion in the prior year. Capital expenditure totaled $259 million in the second quarter  compared with $233 million in the previous year.\r\n\r\nFree cash flow was $1.11 billion in the second quarter compared with $1.13 billion cash flow in the year-ago period.\n\nStory continues\n\n2024 Guidance Raised\n\nFor 2024, Honeywell expects sales of $39.1-$39.7 billion compared with the prior expected range of $38.1-$38.9 billion, whereas it reported sales of $36.7 billion in 2023. The Zacks Consensus Estimate for revenues is pegged at $38.66 billion. Organic sales are expected to increase 5-6%.\r\n\r\nHON expects a segment margin in the band of 23.3-23.5% compared with 22.7% in 2023. Adjusted earnings per share are expected to be between $10.05 and $10.25, higher than $9.16 in 2023. The consensus estimate for earnings is pegged at $10.23 per share. Free cash flow is expected to be around $5.5-$5.9 billion.\n\nZacks Rank\n\nThe company currently sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nPerformance of Other Companies\n\nPentair plc PNR reported second-quarter adjusted earnings per share of $1.22, which beat the Zacks Consensus Estimate of $1.15. The reported figure also improved 18% from the year-ago quarter.\r\n\r\nNet revenues rose 1.6% year over year to $1.1 billion. PNR’s top line outpaced the consensus estimate of $1.09 billion. \r\n\r\nCrown Holdings, Inc. CCK reported second-quarter adjusted earnings per share of $1.81, which beat the Zacks Consensus Estimate of $1.59. The bottom line improved 8% year over year.\r\n\r\nNet revenues totaled $3.04 billion, down 2.2% from the year-ago quarter. The top line missed the consensus estimate of $3.06 billion.\r\n\r\nA. O. Smith Corporation’s AOS second-quarter adjusted earnings of $1.06 per share missed the Zacks Consensus Estimate of $1.07. However, the bottom line increased 5% on a year-over-year basis.\r\n\r\nNet revenues of $1.02 billion surpassed the consensus estimate of $992 million. The top line increased 7% year over year, driven by strong demand for residential and commercial water heaters in North America.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nA. O. Smith Corporation (AOS) : Free Stock Analysis Report\n\nCrown Holdings, Inc. (CCK) : Free Stock Analysis Report\n\nPentair plc (PNR) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-hon-q2-earnings-beat-165700549.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.014,
            "neu": 0.866,
            "pos": 0.12
        }
    },
    {
        "date": "2024-07-25T15:30:03+00:00",
        "title": "Compared to Estimates, Honeywell International (HON) Q2 Earnings: A Look at Key Metrics",
        "content": "Honeywell International Inc. (HON) reported $9.58 billion in revenue for the quarter ended June 2024, representing a year-over-year increase of 4.7%. EPS of $2.49 for the same period compares to $2.23 a year ago.\n\nThe reported revenue compares to the Zacks Consensus Estimate of $9.4 billion, representing a surprise of +1.86%. The company delivered an EPS surprise of +2.89%, with the consensus EPS estimate being $2.42.\n\nWhile investors scrutinize revenue and earnings changes year-over-year and how they compare with Wall Street expectations to determine their next move, some key metrics always offer a more accurate picture of a company's financial health.\n\nSince these metrics play a crucial role in driving the top- and bottom-line numbers, comparing them with the year-ago numbers and what analysts estimated about them helps investors better project a stock's price performance.\n\nHere is how Honeywell International performed in the just reported quarter in terms of the metrics most widely monitored and projected by Wall Street analysts:\n\nNet Industrial Automation sales: $2.51 billion versus the three-analyst average estimate of $2.50 billion. Net Sales- Aerospace Technologies: $3.89 billion versus $3.80 billion estimated by three analysts on average. Compared to the year-ago quarter, this number represents a +16.5% change. Net Sales- Building Automation: $1.57 billion compared to the $1.54 billion average estimate based on three analysts. The reported number represents a change of +4% year over year. Net Energy and Sustainability Solutions sales: $1.60 billion versus $1.58 billion estimated by three analysts on average. Net Industrial Automation sales- Productivity Solutions and Services: $298 million compared to the $293.21 million average estimate based on two analysts. Net Industrial Automation sales- Process Solutions: $1.51 billion versus $1.34 billion estimated by two analysts on average. Net Industrial Automation sales- Warehouse and Workflow Solutions: $233 million compared to the $211.59 million average estimate based on two analysts. Energy and Sustainability Solutions sales- UOP: $599 million versus the two-analyst average estimate of $618.43 million. Energy and Sustainability Solutions sales- Advanced Materials: $1.01 billion compared to the $953.67 million average estimate based on two analysts. Aerospace Technologies- Defense and Space: $1.43 billion versus $1.34 billion estimated by two analysts on average. Compared to the year-ago quarter, this number represents a +18.7% change. Aerospace Technologies- Commercial Aviation Original Equipment: $668 million compared to the $718.09 million average estimate based on two analysts. The reported number represents a change of +10.1% year over year. Net Industrial Automation sales- Sensing and Safety Technologies: $466 million compared to the $650.80 million average estimate based on two analysts.\n\nStory continues\n\nView all Key Company Metrics for Honeywell International here>>>\r\n\r\nShares of Honeywell International have returned +0.1% over the past month versus the Zacks S&P 500 composite's -0.3% change. The stock currently has a Zacks Rank #1 (Strong Buy), indicating that it could outperform the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/compared-estimates-honeywell-international-hon-153003390.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.991,
            "neg": 0,
            "neu": 0.897,
            "pos": 0.103
        }
    },
    {
        "date": "2024-07-25T15:01:29+00:00",
        "title": "Honeywell International Updates Full-Year Outlook as Quarterly Results Top Views",
        "content": "Honeywell International Updates Full-Year Outlook as Quarterly Results Top Views",
        "link": "https://finance.yahoo.com/news/honeywell-international-updates-full-outlook-150129187.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.202,
            "neg": 0,
            "neu": 0.833,
            "pos": 0.167
        }
    },
    {
        "date": "2024-07-25T12:00:30+00:00",
        "title": "Honeywell trims annual profit forecast on muted industrial automation demand",
        "content": "(Reuters) - Honeywell International Inc on Thursday lowered its annual profit forecast, due to lower demand in its industrial automation business, sending shares of the diversified industrial firm down 4.5% in premarket trade.\n\nSales in Honeywell's industrial automation business were hit by volume softness in warehouse and workflow solutions as the company looks to offload existing inventory before ordering new products amid an uncertain economic outlook.\n\nThe company also said that sales in its mask-making safety and productivity solutions declined year over year.\n\nThe unit's organic sales fell 8% in the second quarter ended June 30, from a year ago.\n\nHowever, sales from the company's aerospace unit, which makes parts such as engines and navigation radios for planes produced by Boeing Co and Airbus SE, boosted overall sales by 5% to $9.58 billion.\n\nThe Charlotte, North Carolina-based company now expects an annual adjusted profit of $10.05 to $10.25 per share, down from its previous forecast of between $10.15 and $10.45 per share.\n\nOn an adjusted basis, quarterly profit came in at $2.49 per share, compared with estimates of $2.42 per share.\n\n(Reporting by Anandita Mehrotra in Bengaluru; Editing by Shailesh Kuber)\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-trims-annual-profit-forecast-120030979.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.958,
            "neg": 0.035,
            "neu": 0.83,
            "pos": 0.135
        }
    },
    {
        "date": "2024-07-25T11:30:00+00:00",
        "title": "3 Flying Car Stocks to Capitalize on the Coming Trillion-Dollar Market",
        "content": "Growing up, I was fascinated by the “The Jetsons” and their futuristic gadgets. One that caught my eye was their flying cars. Today, that idea no longer seems like a pipe dream. Several new companies have the vision to dedicate their capital and time to building these flying cars. However, the big names are also tossing their hats into the ring, racing to be the first to achieve commercial viability. So, it’s natural that investors might want to start looking into flying car stocks before everybody else gets in on the action.\n\nJust as you wouldn’t buy any old stock, you wouldn’t want to buy any old flying car stock — at least without doing a little research first. Investors need to look for companies with a combination of good cash flow, great industry connections, excellent prospects and a promising product line. And since the industry is still in its infancy, it might be difficult to find candidates that match those criteria. Difficult—but not impossible.\n\nSo, in this article, I’ll cover three quality companies that could be the next high-flying flying car stocks – ones with the potential to lead the way in making air taxis the next trillion-dollar market opportunity. To compile my list, I used the criteria below to screen the market:\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nPositive latest full-year earnings and revenue, Minimum of a buy rating rating from analysts.\n\nI then sorted the list based on the highest to lowest earnings growth in the latest fiscal year and took the top three.\n\nEmbraer SA (ERJ) The Embraer Logo\n\nSource: testing / Shutterstock.com\n\nBrazil’s largest aircraft manufacturer, Embraer SA (NYSE:ERJ), has extensive experience in building eVTOLs through its subsidiary, Eve Air Mobility. Embraer’s expertise and strong brand recognition is expected to bolster Eve’s reputation as a potential major player in the flying taxi market. Leveraging its parent company’s infrastructure, assets, and industry connections, Eve Air benefits from reduced skepticism associated with high-risk pioneering technologies. After all, brand-name trust is a proven way to improve recognition—and sales.\n\nWall Street recognizes the potential of ERJ stock, giving it a consensus strong buy rating and making it one of the most attractive flying car stocks today. This confidence seems justified, as the company’s 2023 revenue grew by 16% year-over-year, and its 2022 net loss of $1.01 per share turned into an 89-cent profit—representing an impressive 188% improvement.\n\nThe Boeing Company (BA) image of a Boeing (BA) 737 max aircraft. stocks to buy and sell related to Boeing\n\nSource: Marco Menezes / Shutterstock.com\n\nStory continues\n\nThe Boeing Company (NYSE:BA) has been known as a premier manufacturer of commercial airplanes for decades. So, to no one’s surprise, it has recently ventured into the urban air space. Initially a joint venture with the advanced mobility startup Kitty Hawk, Boeing eventually acquired Wisk in 2023, marking its first step into the eVTOL market.\n\nThis acquisition is a significant advantage for Wisk, allowing the subsidiary to fully utilize Boeing’s expertise in testing, product development, experience, and certification. The company’s latest eVTOL, named Generation 6, is a four-seat air taxi designed to transport up to four passengers, with additional room for luggage. It is also the first operational air taxi to offer autonomous travel with human oversight.\n\nAdditionally, Wisk recently acquired Verocel, a software validation and verification company, which will enhance its autonomous features’ testing and development.\n\nMeanwhile, the company’s overall performance hasn’t been all that bad this last year. In 2023, Boeing reported a 17% increase in revenue YOY. Further, net losses narrowed from $8.30 to $3.67 per share, marking a 56% improvement in bringing the bottom line back closer to profitability. So, if you want exposure to flying car stocks without going all-in on an air taxi company, then BA stock may be right for you.\n\nHoneywell International (HON) Honeywell (HON) logo on front of glass building\n\nSource: josefkubes / Shutterstock.com\n\nHoneywell International (NASDAQ:HON) operates in various industries, including software, safety and productivity solutions, and aerospace. The company has also entered the urban air mobility (UAM) market—not as a participant, but a facilitator.\n\nAlthough Honeywell is not an eVTOL manufacturer, it plays a significant role in the industry. So far, the company has secured $10 billion in revenue from eVTOL-related contracts.\n\nHoneywell engineers are developing aviation technologies tailored to the needs of UAM aircraft. Among these innovations is their fly-by-wire system, a compact control computer customized for UAM aircraft, approximately the size of a paperback book. In addition, its cloud-linked avionics system has been chosen by Vertical Aerospace and Lilium Jet as their main system of choice.\n\nThe company also parterns with eVTOL manufacturers such as Lilium, Pipistrel, Vertical Aerospace, and Hyundai’s Supernal. Infact, earlier this year, Eve Air also selected Honeywell as its supplier for sensor and navigation systems.\n\nIn terms of Honeywell’s financials, the company reported a 3% YOY increase in sales for 2023. This led to basic EPS increasing 16% from $7.33 to $8.53. So, it’s no surprise why Wall Street continues to rate it as a strong buy.\n\nOn the date of publication, Rick Orford did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nRick Orford is a Wall Street Journal best-selling author, investor, influencer, and mentor. His work has appeared in the most authoritative publications, including Good Morning America, Washington Post, Yahoo Finance, MSN, Business Insider, NBC, FOX, CBS, and ABC News.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post 3 Flying Car Stocks to Capitalize on the Coming Trillion-Dollar Market appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-flying-car-stocks-capitalize-113000385.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "BA.US",
            "EMBR3.SA",
            "EMY.F",
            "ERJ.US",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.017,
            "neu": 0.88,
            "pos": 0.103
        }
    },
    {
        "date": "2024-07-25T11:10:06+00:00",
        "title": "Honeywell International Inc. (HON) Tops Q2 Earnings and Revenue Estimates",
        "content": "Honeywell International Inc. (HON) came out with quarterly earnings of $2.49 per share, beating the Zacks Consensus Estimate of $2.42 per share. This compares to earnings of $2.23 per share a year ago. These figures are adjusted for non-recurring items.\n\nThis quarterly report represents an earnings surprise of 2.89%. A quarter ago, it was expected that this company would post earnings of $2.18 per share when it actually produced earnings of $2.25, delivering a surprise of 3.21%.\n\nOver the last four quarters, the company has surpassed consensus EPS estimates three times.\n\nHoneywell International , which belongs to the Zacks Diversified Operations industry, posted revenues of $9.58 billion for the quarter ended June 2024, surpassing the Zacks Consensus Estimate by 1.86%. This compares to year-ago revenues of $9.15 billion. The company has topped consensus revenue estimates three times over the last four quarters.\n\nThe sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the earnings call.\n\nHoneywell International shares have added about 1.9% since the beginning of the year versus the S&P 500's gain of 13.8%.\n\nWhat's Next for Honeywell International?\n\nWhile Honeywell International has underperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?\n\nThere are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.\n\nEmpirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power of earnings estimate revisions.\n\nAhead of this earnings release, the estimate revisions trend for Honeywell International: favorable. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #1 (Strong Buy) for the stock. So, the shares are expected to outperform the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\n\nIt will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is $2.55 on $9.76 billion in revenues for the coming quarter and $10.23 on $38.66 billion in revenues for the current fiscal year.\n\nStory continues\n\nInvestors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Diversified Operations is currently in the top 28% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.\n\nOne other stock from the same industry, 3M (MMM), is yet to report results for the quarter ended June 2024. The results are expected to be released on July 26.\n\nThis maker of Post-it notes, industrial coatings and ceramics is expected to post quarterly earnings of $1.66 per share in its upcoming report, which represents a year-over-year change of -23.5%. The consensus EPS estimate for the quarter has been revised 2.3% higher over the last 30 days to the current level.\n\n3M's revenues are expected to be $5.89 billion, down 29.3% from the year-ago quarter.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-international-inc-hon-tops-111006992.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.005,
            "neu": 0.895,
            "pos": 0.1
        }
    },
    {
        "date": "2024-07-25T10:22:45+00:00",
        "title": "Honeywell (NASDAQ:HON) Exceeds Q2 Expectations But Stock Drops",
        "content": "Honeywell (NASDAQ:HON) Exceeds Q2 Expectations But Stock Drops\n\nIndustrial conglomerate Honeywell (NASDAQ:HON) beat analysts' expectations in Q2 CY2024, with revenue up 4.7% year on year to $9.58 billion. The company's full-year revenue guidance of $39.4 billion at the midpoint also came in 1.6% above analysts' estimates. It made a non-GAAP profit of $2.49 per share, improving from its profit of $2.30 per share in the same quarter last year.\n\nIs now the time to buy Honeywell? Find out in our full research report.\n\nHoneywell (HON) Q2 CY2024 Highlights:\n\nRevenue: $9.58 billion vs analyst estimates of $9.42 billion (1.7% beat) EPS (non-GAAP): $2.49 vs analyst estimates of $2.42 (3.1% beat) The company lifted its revenue guidance for the full year from $38.5 billion to $39.4 billion at the midpoint, a 2.3% increase Gross Margin (GAAP): 38.9%, in line with the same quarter last year Free Cash Flow of $1.11 billion, up from $215 million in the previous quarter Organic Revenue rose 4% year on year (3% in the same quarter last year) Market Capitalization: $139.1 billion\n\n\"Honeywell delivered a strong second quarter, once again meeting or exceeding guidance across all metrics while maneuvering through a dynamic operating environment,\" said Vimal Kapur, Chairman and Chief Executive Officer of Honeywell.\n\nOriginally founded in 1906 as a thermostat company, Honeywell (NASDAQ:HON) is an aerospace and defense manufacturing company building technologies, performance materials, and safety and productivity solutions.\n\nGeneral Industrial Machinery\n\nAutomation that increases efficiency and connected equipment that collects analyzable data have been trending, creating new demand for general industrial machinery companies. Those who innovate and create digitized solutions can spur sales and speed up replacement cycles, but all general industrial machinery companies are still at the whim of economic cycles. Consumer spending and interest rates, for example, can greatly impact the industrial production that drives demand for these companies’ offerings.\n\nSales Growth\n\nExamining a company's long-term performance can provide clues about its business quality. Any business can put up a good quarter or two, but the best consistently grow over the long haul. Over the last five years, Honeywell's sales were flat. This shows demand was soft and is a tough starting point for our analysis. Honeywell Total Revenue\n\nWe at StockStory place the most emphasis on long-term growth, but within industrials, a half-decade historical view may miss cycles, industry trends, or a company capitalizing on catalysts such as a new contract win or a successful product line. Honeywell's annualized revenue growth of 4.1% over the last two years is above its five-year trend, but we were still disappointed by the results.\n\nStory continues\n\nWe can dig further into the company's sales dynamics by analyzing its organic revenue, which strips out one-time events like acquisitions and currency fluctuations because they don't accurately reflect its fundamentals. Over the last two years, Honeywell's organic revenue averaged 5% year-on-year growth. Because this number aligns with its normal revenue growth, we can see the company's core operations (not M&A) drove most of its performance. Honeywell Year-On-Year Organic Revenue Growth\n\nThis quarter, Honeywell reported reasonable year-on-year revenue growth of 4.7%, and its $9.58 billion of revenue topped Wall Street's estimates by 1.7%. Looking ahead, Wall Street expects sales to grow 7.3% over the next 12 months, an acceleration from this quarter.\n\nWhen a company has more cash than it knows what to do with, buying back its own shares can make a lot of sense–as long as the price is right. Luckily, we’ve found one, a low-priced stock that is gushing free cash flow AND buying back shares. Click here to claim your Special Free Report on a fallen angel growth story that is already recovering from a setback.\n\nOperating Margin\n\nOperating margin is a key measure of profitability. Think of it as net income–the bottom line–excluding the impact of taxes and interest on debt, which are less connected to business fundamentals.\n\nHoneywell has been a well-oiled machine over the last five years. It demonstrated elite profitability for an industrials business, boasting an average operating margin of 20.8%. This isn't too surprising as its gross margin gives it a favorable starting point.\n\nAnalyzing the trend in its profitability, Honeywell's annual operating margin might have seen some fluctuations but has generally stayed the same over the last five years, highlighting the long-term consistency of its business. Honeywell Operating Margin (GAAP)\n\nIn Q2, Honeywell generated an operating profit margin of 20.7%, down 2.2 percentage points year on year. Since Honeywell's operating margin decreased more than its gross margin, we can assume the company was recently less efficient because its general expenses like sales, marketing, and administrative overhead increased.\n\nEPS\n\nAnalyzing long-term revenue trends tells us about a company's historical growth, but the long-term change in its earnings per share (EPS) points to the profitability of that growth–for example, a company could inflate its sales through excessive spending on advertising and promotions.\n\nHoneywell's EPS grew at an unimpressive 4.4% compounded annual growth rate over the last five years. This performance was better than its flat revenue but doesn't tell us much about its day-to-day operations because its operating margin didn't expand. Honeywell EPS (Adjusted)\n\nDiving into the nuances of Honeywell's earnings can give us a better understanding of its performance. A five-year view shows that Honeywell has repurchased its stock, shrinking its share count by 8.6%. This tells us its EPS outperformed its revenue not because of increased operational efficiency but financial engineering, as buybacks boost per share earnings. Honeywell Diluted Shares Outstanding\n\nLike with revenue, we also analyze EPS over a more recent period because it can give insight into an emerging theme or development for the business. For Honeywell, its two-year annual EPS growth of 10.4% was higher than its five-year trend. This acceleration made it one of the faster-growing industrials companies in recent history.\n\nIn Q2, Honeywell reported EPS at $2.49, up from $2.30 in the same quarter last year. This print beat analysts' estimates by 3.1%. Over the next 12 months, Wall Street expects Honeywell to grow its earnings. Analysts are projecting its EPS of $9.89 in the last year to climb by 8.3% to $10.72.\n\nKey Takeaways from Honeywell's Q2 Results\n\nWe were impressed by how significantly Honeywell blew past analysts' organic revenue expectations this quarter. We were also glad its full-year revenue guidance came in higher than Wall Street's estimates. On the other hand, its full-year EPS forecast was underwhelming, implying its incremental revenue will be less profitable than expected. Overall, we think this was a good quarter, but the market was likely hoping for better profitability. The stock traded down 5.9% to $201 immediately after reporting.\n\nSo should you invest in Honeywell right now? When making that decision, it's important to consider its valuation, business qualities, as well as what has happened in the latest quarter. We cover that in our actionable full research report which you can read here, it's free.\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-nasdaq-hon-exceeds-q2-102245558.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.029,
            "neu": 0.799,
            "pos": 0.172
        }
    },
    {
        "date": "2024-07-25T10:00:00+00:00",
        "title": "HONEYWELL DELIVERS STRONG SECOND QUARTER RESULTS AND BEATS EARNINGS GUIDANCE; UPDATES 2024 OUTLOOK",
        "content": "Sales of $9.6 Billion, Reported Sales Up 5%, Organic1 Sales Up 4%, Achieving the High End of Previous Guidance Earnings Per Share of $2.36 and Adjusted Earnings Per Share1 of $2.49, Above High End of Previous Guidance Orders Up 4%, Led by Strength in Our Building Automation and Energy and Sustainability Solutions Businesses Deployed $6.4 Billion of Capital to M&A, Dividends, Share Repurchases, and Capital Expenditures, Including Closing the $5 Billion Acquisition of Access Solutions, and Announcing the $1.9 Billion Acquisition of CAES Systems Holdings and the $1.8 Billion Acquisition of Air Products' LNG Business\n\nCHARLOTTE, N.C., July 25, 2024 /PRNewswire/ -- Honeywell (NASDAQ: HON) today announced results for the second quarter that met or exceeded the company's guidance. The company also updated its full-year sales, segment margin2, adjusted earnings per share2,3, and cash flow guidance ranges. (PRNewsfoto/Honeywell)\n\nThe company reported second-quarter year-over-year sales growth of 5% and organic1 sales growth of 4%, led by double digit organic1 sales growth in defense and space, commercial aviation, and building solutions. Operating income grew 5% and operating margin expanded 10 basis points to 20.7%, while segment profit1 grew 4% led by Aerospace Technologies. Segment margin1 contraction of 10 basis points was above the midpoint of our guidance range. Earnings per share for the second quarter was $2.36, up 6% year over year, and adjusted earnings per share1 was $2.49, up 8% year over year, above the high end of our guidance range. Operating cash flow was $1.4 billion and free cash flow1 was $1.1 billion, approximately flat year over year.\n\n\"Honeywell delivered a strong second quarter, once again meeting or exceeding guidance across all metrics while maneuvering through a dynamic operating environment,\" said Vimal Kapur, chairman and chief executive officer of Honeywell. \"While Aerospace continues to lead our growth, we are seeing broader participation across our portfolio, with three of our four segments contributing positive growth for the quarter. All four segments grew sequentially in the quarter as well, giving us further confidence in our expectation of a second half organic growth acceleration.\"\n\nKapur continued, \"We also made significant progress in our capital deployment strategy, deploying $6.4 billion to M&A, dividends, share repurchases, and capex, highlighted by the closing of our $5 billion acquisition of Access Solutions. We also recently announced two additional deals - the $1.9 billion acquisition of CAES Systems and the $1.8 billion acquisition of Air Products' LNG process technology and equipment business. We continue to make significant progress on my key priorities for Honeywell as we accelerate our alignment to three powerful megatrends - automation, the future of aviation, and energy transition, all underpinned by digitalization. Together, our technologically differentiated portfolio and world-class Honeywell Accelerator operating system are poised to further unlock incremental value and enable us to achieve our long-term financial framework.\"\n\nStory continues\n\nAs a result of the company's second-quarter performance and management's outlook for the remainder of the year, including the impact of recently announced acquisitions, Honeywell updated its full-year sales, segment margin2, adjusted earnings per share2,3, and cash flow1 guidance. Full-year sales are now expected to be $39.1 billion to $39.7 billion with organic1 sales growth in the range of 5% to 6%. Segment margin2 is now expected to be in the range of 23.3% to 23.5% with segment margin contraction2 of 20 basis points to flat year over year. Adjusted earnings per share2,3 is now expected to be in the range of $10.05 to $10.25, up 6% to 8% year over year. Operating cash flow is now expected to be in the range of $6.6 billion to $7.0 billion, with free cash flow1 of $5.5 billion to $5.9 billion. A summary of the company's full-year guidance can be found in Table 1.\n\nSecond-Quarter Performance\n\nHoneywell sales for the second quarter were up 5% year over year on a reported basis and 4% on an organic1 basis year over year. The second-quarter financial results can be found in Tables 2 and 3.\n\nAerospace Technologies sales for the second quarter increased 16% on an organic1 basis year over year, the eighth consecutive quarter of double-digit organic growth, on sustained strength in both commercial aviation and defense and space. Commercial aviation was led by 17% growth in aftermarket sales as global flight activity continued to rise. Commercial original equipment sales once again grew double digits on increased shipset deliveries, particularly in air transport. Defense and space grew 19% year over year as sustained demand from the current geopolitical climate and further supply chain improvements enabled us to convert on our robust backlog. Segment margin contracted 60 basis points year over year to 27.2%, driven by mix pressure in original equipment, partially offset by commercial excellence net of inflation.\n\nIndustrial Automation sales for the second quarter decreased 8% on an organic1 basis year over year. Sales declines were primarily driven by volume softness in warehouse and workflow solutions. While sales declined in productivity solutions and services overall, they were up year over year and sequentially excluding the impact of payments under the license and settlement agreement that ended in the first quarter. Process solutions sales grew 1% in the second quarter as continued double-digit growth in aftermarket services was partially offset by softness in thermal solutions and smart energy. Sales in our sensing and safety technologies business declined year over year, but both orders and sales improved sequentially. Segment margin contracted 90 basis points to 19.0% due to lower volume leverage and the end of payments under the license and settlement agreement.\n\nBuilding Automation sales for the second quarter increased 1% on an organic1 basis year over year and increased 10% sequentially including one month of benefit from the acquisition of our access solutions business. Building solutions delivered another solid quarter, growing 14% organically, as both projects and services grew double digits. The ongoing strength in building solutions was mostly offset by declines in building products, primarily driven by lower year over year volumes in fire and building management systems; however, both businesses saw improved sales quarter over quarter. Segment margin improved sequentially for the second consecutive quarter but contracted 60 basis points year over year to 25.3%, due to product mix headwinds and cost inflation, partially offset by productivity actions and commercial excellence.\n\nEnergy and Sustainability Solutions sales for the second quarter grew 3% on an organic1 basis year over year. Advanced materials once again led ESS with 8% sales growth, led by continued strength in fluorine products. UOP sales declined 4% in the quarter as a result of previously communicated difficult year-over-year comps from large gas processing equipment projects, partially offset by growth in refining catalysts and aftermarket services. Segment margin expanded 200 basis points to 25.2%, primarily driven by productivity actions.\n\nConference Call Details\n\nHoneywell will discuss its second-quarter results and full-year 2024 guidance during an investor conference call starting at 8:30 a.m. Eastern Time today. A live webcast of the investor call as well as related presentation materials will be available through the Investor Relations section of the company's website (www.honeywell.com/investor). A replay of the webcast will be available for 30 days following the presentation.\n\nTABLE 1: FULL-YEAR 2024 GUIDANCE2 Previous Guidance Current Guidance Sales $38.5B - $39.3B $39.1B - $39.7B Organic1 Growth 4% - 6% 5% - 6% Segment Margin 23.8% - 24.1% 23.3% - 23.5% Expansion Up 30 - 60 bps Down 20 - Flat bps Adjusted Earnings Per Share3 $10.15 - $10.45 $10.05 - $10.25 Adjusted Earnings Growth3 7% - 10% 6% - 8% Operating Cash Flow $6.7B - $7.1B $6.6B - $7.0B Free Cash Flow1 $5.6B - $6.0B $5.5B - $5.9B\n\nTABLE 2: SUMMARY OF HONEYWELL FINANCIAL RESULTS 2Q 2024 2Q 2023 Change Sales $9,577 $9,146 5 % Organic1 Growth 4 % Operating Income Margin 20.7 % 20.6 % 10 bps Segment Profit1 $2,199 $2,113 4 % Segment Margin1 23.0 % 23.1 % -10 bps Earnings Per Share $2.36 $2.22 6 % Adjusted Earnings Per Share1 $2.49 $2.30 8 % Operating Cash Flow $1,371 $1,360 1 % Free Cash Flow1 $1,112 $1,127 (1 %)\n\nTABLE 3: SUMMARY OF SEGMENT FINANCIAL RESULTS AEROSPACE TECHNOLOGIES 2Q 2024 2Q 2023 Change Sales $3,891 $3,341 16 % Organic1 Growth 16 % Segment Profit $1,060 $930 14 % Segment Margin 27.2 % 27.8 % -60 bps INDUSTRIAL AUTOMATION Sales $2,506 $2,727 (8 %) Organic1 Growth (8 %) Segment Profit $477 $544 (12 %) Segment Margin 19.0 % 19.9 % -90 bps BUILDING AUTOMATION Sales $1,571 $1,510 4 % Organic1 Growth 1 % Segment Profit $397 $391 2 % Segment Margin 25.3 % 25.9 % -60 bps ENERGY AND SUSTAINABILITY SOLUTIONS Sales $1,604 $1,567 2 % Organic1 Growth 3 % Segment Profit $405 $363 12 % Segment Margin 25.2 % 23.2 % 200 bps\n\n1 See additional information at the end of this release regarding non-GAAP financial measures. 2 Segment margin and adjusted EPS are non-GAAP financial measures. Management cannot reliably predict or estimate, without unreasonable effort, the impact and timing on future operating results arising from items excluded from segment margin or adjusted EPS. We therefore, do not present a guidance range, or a reconciliation to, the nearest GAAP financial measures of operating margin or EPS. 3 Adjusted EPS and adjusted EPS V% guidance excludes items identified in the non-GAAP reconciliation of adjusted EPS at the end of this release, and any potential future one-time items that we cannot reliably predict or estimate such as pension mark-to-market.\n\nHoneywell is an integrated operating company serving a broad range of industries and geographies around the world. Our business is aligned with three powerful megatrends - automation, the future of aviation, and energy transition - underpinned by our Honeywell Accelerator operating system and Honeywell Connected Enterprise integrated software platform. As a trusted partner, we help organizations solve the world's toughest, most complex challenges, providing actionable solutions and innovations that help make the world smarter, safer, and more sustainable. For more news and information on Honeywell, please visit www.honeywell.com/newsroom.\n\nHoneywell uses our Investor Relations website, www.honeywell.com/investor, as a means of disclosing information which may be of interest or material to our investors and for complying with disclosure obligations under Regulation FD. Accordingly, investors should monitor our Investor Relations website, in addition to following our press releases, SEC filings, public conference calls, webcasts, and social media.\n\nWe describe many of the trends and other factors that drive our business and future results in this release. Such discussions contain forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended (the Exchange Act). Forward-looking statements are those that address activities, events, or developments that management intends, expects, projects, believes or anticipates will or may occur in the future. They are based on management's assumptions and assessments in light of past experience and trends, current economic and industry conditions, expected future developments and other relevant factors, many of which are difficult to predict and outside of our control. They are not guarantees of future performance, and actual results, developments and business decisions may differ significantly from those envisaged by our forward-looking statements. We do not undertake to update or revise any of our forward-looking statements, except as required by applicable securities law. Our forward-looking statements are also subject to material risks and uncertainties, including ongoing macroeconomic and geopolitical risks, such as lower GDP growth or recession, capital markets volatility, inflation, and certain regional conflicts, that can affect our performance in both the near- and long-term. In addition, no assurance can be given that any plan, initiative, projection, goal, commitment, expectation, or prospect set forth in this release can or will be achieved. These forward-looking statements should be considered in light of the information included in this release, our Form 10-K and other filings with the Securities and Exchange Commission. Any forward-looking plans described herein are not final and may be modified or abandoned at any time.\n\nThis release contains financial measures presented on a non-GAAP basis. Honeywell's non-GAAP financial measures used in this release are as follows:\n\nSegment profit, on an overall Honeywell basis; Segment profit margin, on an overall Honeywell basis; Organic sales growth; Free cash flow; and Adjusted earnings per share.\n\nManagement believes that, when considered together with reported amounts, these measures are useful to investors and management in understanding our ongoing operations and in the analysis of ongoing operating trends. These measures should be considered in addition to, and not as replacements for, the most comparable GAAP measure. Certain measures presented on a non-GAAP basis represent the impact of adjusting items net of tax. The tax-effect for adjusting items is determined individually and on a case-by-case basis. Refer to the Appendix attached to this release for reconciliations of non-GAAP financial measures to the most directly comparable GAAP measures.\n\nHoneywell International Inc. Consolidated Statement of Operations (Unaudited) (Dollars in millions, except per share amounts) Three Months Ended \r\nJune 30, Six Months Ended \r\nJune 30, 2024 2023 2024 2023 Product sales $    6,477 $    6,441 $  12,740 $  12,751 Service sales 3,100 2,705 5,942 5,259 Net sales 9,577 9,146 18,682 18,010 Costs, expenses and other Cost of products sold1 4,247 4,133 8,282 8,201 Cost of services sold1 1,609 1,493 3,157 2,923 Total Cost of products and services sold 5,856 5,626 11,439 11,124 Research and development expenses 382 375 742 732 Selling, general and administrative expenses1 1,361 1,262 2,663 2,579 Other (income) expense (246) (208) (477) (468) Interest and other financial charges 250 187 470 357 Total costs, expenses and other 7,603 7,242 14,837 14,324 Income before taxes 1,974 1,904 3,845 3,686 Tax expense 414 403 810 777 Net income 1,560 1,501 3,035 2,909 Less: Net income attributable to the noncontrolling interest 16 14 28 28 Net income attributable to Honeywell $    1,544 $    1,487 $    3,007 $    2,881 Earnings per share of common stock - basic $      2.37 $      2.24 $      4.62 $      4.32 Earnings per share of common stock - assuming dilution $      2.36 $      2.22 $      4.59 $      4.29 Weighted average number of shares outstanding - basic 650.2 665.3 651.3 666.5 Weighted average number of shares outstanding - assuming dilution 654.2 670.2 655.5 671.9\n\n1 Cost of products and services sold and Selling, general and administrative expenses include amounts for repositioning and other charges, the service cost component of pension and other postretirement (income) expense, and stock compensation expense.\n\nHoneywell International Inc. Segment Data (Unaudited) (Dollars in millions) Three Months Ended June 30, Six Months Ended June 30, Net Sales 2024 2023 2024 2023 Aerospace Technologies $           3,891 $           3,341 $           7,560 $           6,452 Industrial Automation 2,506 2,727 4,984 5,530 Building Automation 1,571 1,510 2,997 2,997 Energy and Sustainability Solutions 1,604 1,567 3,129 3,028 Corporate and All Other 5 1 12 3 Total $           9,577 $           9,146 $         18,682 $         18,010 Reconciliation of Segment Profit to Income Before Taxes Three Months Ended June 30, Six Months Ended June 30, Segment Profit 2024 2023 2024 2023 Aerospace Technologies $           1,060 $              930 $           2,095 $           1,761 Industrial Automation 477 544 951 1,130 Building Automation 397 391 747 772 Energy and Sustainability Solutions 405 363 708 665 Corporate and All Other (140) (115) (208) (200) Total segment profit 2,199 2,113 4,293 4,128 Interest and other financial charges (250) (187) (470) (357) Interest income 110 76 215 152 Amortization of acquisition-related intangibles (85) (61) (155) (129) Stock compensation expense1 (55) (50) (108) (109) Pension ongoing income2 140 130 285 260 Other postretirement income2 4 7 10 13 Repositioning and other charges3,4 (44) (102) (137) (243) Other5 (45) (22) (88) (29) Income before taxes $           1,974 $           1,904 $           3,845 $           3,686\n\n1 Amounts included in Selling, general and administrative expenses. 2 Amounts included in Cost of products and services sold (service cost component), Selling, general and administrative expenses (service cost component), Research and development expenses (service cost component), and Other (income) expense (non-service cost component). 3 Amounts included in Cost of products and services sold, Selling, general and administrative expenses, and Other (income) expense. 4 Includes repositioning, asbestos, and environmental expenses. 5 Amounts include the other components of Other (income) expense not included within other categories in this reconciliation. Equity income of affiliated companies is included in segment profit.\n\nHoneywell International Inc. Consolidated Balance Sheet (Unaudited) (Dollars in millions) June 30, 2024 December 31, 2023 ASSETS Current assets Cash and cash equivalents $                     9,576 $                     7,925 Short-term investments 231 170 Accounts receivable, less allowances of $312 and $323, respectively 7,759 7,530 Inventories 6,324 6,178 Other current assets 1,479 1,699 Total current assets 25,369 23,502 Investments and long-term receivables 1,472 939 Property, plant and equipment—net 5,752 5,660 Goodwill 20,824 18,049 Other intangible assets—net 5,208 3,231 Insurance recoveries for asbestos-related liabilities 163 170 Deferred income taxes 374 392 Other assets 10,167 9,582 Total assets $                   69,329 $                   61,525 LIABILITIES Current liabilities Accounts payable $                     6,470 $                     6,849 Commercial paper and other short-term borrowings 4,548 2,085 Current maturities of long-term debt 2,519 1,796 Accrued liabilities 7,507 7,809 Total current liabilities 21,044 18,539 Long-term debt 20,865 16,562 Deferred income taxes 2,137 2,094 Postretirement benefit obligations other than pensions 126 134 Asbestos-related liabilities 1,444 1,490 Other liabilities 6,196 6,265 Redeemable noncontrolling interest 7 7 Shareowners' equity 17,510 16,434 Total liabilities, redeemable noncontrolling interest and shareowners' equity $                   69,329 $                   61,525\n\nHoneywell International Inc. Consolidated Statement of Cash Flows (Unaudited) (Dollars in millions) Three Months Ended \r\nJune 30, Six Months Ended \r\nJune 30, 2024 2023 2024 2023 Cash flows from operating activities Net income $    1,560 $    1,501 $    3,035 $    2,909 Less: Net income attributable to noncontrolling interest 16 14 28 28 Net income attributable to Honeywell 1,544 1,487 3,007 2,881 Adjustments to reconcile net income attributable to Honeywell to net cash provided by \r\n(used for) operating activities Depreciation 163 166 329 327 Amortization 146 118 271 240 Repositioning and other charges 44 102 137 243 Net payments for repositioning and other charges (87) (154) (211) (195) NARCO Buyout payment — — — (1,325) Pension and other postretirement income (144) (137) (295) (273) Pension and other postretirement benefit payments (7) (8) (15) (23) Stock compensation expense 55 50 108 109 Deferred income taxes (39) (29) (36) 196 Other (420) (293) (583) (643) Changes in assets and liabilities, net of the effects of acquisitions and divestitures Accounts receivable (202) (83) (149) (505) Inventories 63 (100) (77) (338) Other current assets 163 98 227 208 Accounts payable (42) — (423) 114 Accrued liabilities 134 143 (471) (440) Net cash provided by operating activities 1,371 1,360 1,819 576 Cash flows from investing activities Capital expenditures (259) (233) (492) (426) Proceeds from disposals of property, plant and equipment — 2 — 13 Increase in investments (230) (3) (468) (229) Decrease in investments 237 246 392 632 Receipts (payments) from settlements of derivative contracts 33 (31) 76 (38) Cash paid for acquisitions, net of cash acquired (4,913) (661) (4,913) (661) Net cash used for investing activities (5,132) (680) (5,405) (709) Cash flows from financing activities Proceeds from issuance of commercial paper and other short-term borrowings 4,770 3,895 6,993 8,000 Payments of commercial paper and other short-term borrowings (2,019) (4,636) (4,489) (7,930) Proceeds from issuance of common stock 165 78 309 115 Proceeds from issuance of long-term debt — 2,966 5,710 2,966 Payments of long-term debt (32) (21) (605) (1,384) Repurchases of common stock (529) (477) (1,200) (1,176) Cash dividends paid (743) (691) (1,446) (1,416) Other (10) (4) 26 (38) Net cash provided by (used for) financing activities 1,602 1,110 5,298 (863) Effect of foreign exchange rate changes on cash and cash equivalents (21) (33) (61) (5) Net increase (decrease) in cash and cash equivalents (2,180) 1,757 1,651 (1,001) Cash and cash equivalents at beginning of period 11,756 6,869 7,925 9,627 Cash and cash equivalents at end of period $    9,576 $    8,626 $    9,576 $    8,626\n\nAppendix\n\nNon-GAAP Financial Measures\n\nThe following information provides definitions and reconciliations of certain non-GAAP financial measures presented in this press release to which this reconciliation is attached to the most directly comparable financial measures calculated and presented in accordance with generally accepted accounting principles (GAAP).\n\nManagement believes that, when considered together with reported amounts, these measures are useful to investors and management in understanding our ongoing operations and in the analysis of ongoing operating trends. These measures should be considered in addition to, and not as replacements for, the most comparable GAAP measure. Certain measures presented on a non-GAAP basis represent the impact of adjusting items net of tax. The tax-effect for adjusting items is determined individually and on a case-by-case basis. Other companies may calculate these non-GAAP measures differently, limiting the usefulness of these measures for comparative purposes.\n\nManagement does not consider these non-GAAP measures in isolation or as an alternative to financial measures determined in accordance with GAAP. The principal limitations of these non-GAAP financial measures are that they exclude significant expenses and income that are required by GAAP to be recognized in the consolidated financial statements. In addition, they are subject to inherent limitations as they reflect the exercise of judgments by management about which expenses and income are excluded or included in determining these non-GAAP financial measures. Investors are urged to review the reconciliation of the non-GAAP financial measures to the comparable GAAP financial measures and not to rely on any single financial measure to evaluate Honeywell's business.\n\nHoneywell International Inc. Reconciliation of Organic Sales % Change (Unaudited) Three Months Ended \r\nJune 30, 2024 Honeywell Reported sales % change 5 % Less: Foreign currency translation — % Less: Acquisitions, divestitures and other, net 1 % Organic sales % change 4 % Aerospace Technologies Reported sales % change 16 % Less: Foreign currency translation — % Less: Acquisitions, divestitures and other, net — % Organic sales % change 16 % Industrial Automation Reported sales % change (8) % Less: Foreign currency translation (1) % Less: Acquisitions, divestitures and other, net 1 % Organic sales % change (8) % Building Automation Reported sales % change 4 % Less: Foreign currency translation (1) % Less: Acquisitions, divestitures and other, net 4 % Organic sales % change 1 % Energy and Sustainability Solutions Reported sales % change 2 % Less: Foreign currency translation (1) % Less: Acquisitions, divestitures and other, net — % Organic sales % change 3 %\n\nWe define organic sales percentage as the year-over-year change in reported sales relative to the comparable period, excluding the impact on sales from foreign currency translation and acquisitions, net of divestitures, for the first 12 months following the transaction date. We believe this measure is useful to investors and management in understanding our ongoing operations and in analysis of ongoing operating trends.\n\nA quantitative reconciliation of reported sales percent change to organic sales percent change has not been provided for forward-looking measures of organic sales percent change because management cannot reliably predict or estimate, without unreasonable effort, the fluctuations in global currency markets that impact foreign currency translation, nor is it reasonable for management to predict the timing, occurrence and impact of acquisition and divestiture transactions, all of which could significantly impact our reported sales percent change.\n\nHoneywell International Inc. Reconciliation of Operating Income to Segment Profit, Calculation of Operating Income and Segment Profit Margins (Unaudited) (Dollars in millions) Three Months Ended June 30, Twelve Months \r\nEnded December 31, 2024 2023 2023 Operating income $            1,978 $            1,883 $            7,084 Stock compensation expense1 55 50 202 Repositioning, Other2,3 58 103 952 Pension and other postretirement service costs3 16 16 66 Amortization of acquisition-related intangibles 85 61 292 Acquisition-related costs4 7 — 2 Segment profit $            2,199 $            2,113 $            8,598 Operating income $            1,978 $            1,883 $            7,084 ÷ Net sales $            9,577 $            9,146 $          36,662 Operating income margin % 20.7 % 20.6 % 19.3 % Segment profit $            2,199 $            2,113 $            8,598 ÷ Net sales $            9,577 $            9,146 $          36,662 Segment profit margin % 23.0 % 23.1 % 23.5 %\n\n1 Included in Selling, general and administrative expenses. 2 Includes repositioning, asbestos, environmental expenses, equity income adjustment, and other charges. For the three months ended June 30, 2023, other charges include $2 million of benefit due to the Russia-Ukraine conflict.  3 Included in Cost of products and services sold and Selling, general and administrative expenses. 4 Includes acquisition-related fair value adjustments to inventory.\n\nWe define operating income as net sales less total cost of products and services sold, research and development expenses, and selling, general and administrative expenses. We define segment profit, on an overall Honeywell basis, as operating income, excluding stock compensation expense, pension and other postretirement service costs, amortization of acquisition-related intangibles, certain acquisition-related costs, and repositioning and other charges. We define segment profit margin, on an overall Honeywell basis, as segment profit divided by net sales. We believe these measures are useful to investors and management in understanding our ongoing operations and in analysis of ongoing operating trends.\n\nA quantitative reconciliation of operating income to segment profit, on an overall Honeywell basis, has not been provided for all forward-looking measures of segment profit and segment profit margin included herein. Management cannot reliably predict or estimate, without unreasonable effort, the impact and timing on future operating results arising from items excluded from segment profit, particularly pension mark-to-market expense as it is dependent on macroeconomic factors, such as interest rates and the return generated on invested pension plan assets. The information that is unavailable to provide a quantitative reconciliation could have a significant impact on our reported financial results. To the extent quantitative information becomes available without unreasonable effort in the future, and closer to the period to which the forward-looking measures pertain, a reconciliation of operating income to segment profit will be included within future filings.\n\nAcquisition amortization and acquisition-related costs are significantly impacted by the timing, size, and number of acquisitions we complete and are not on a predictable cycle, and we make no comment as to when or whether any future acquisitions may occur. We believe excluding these costs provides investors with a more meaningful comparison of operating performance over time and with both acquisitive and other peer companies.\n\nHoneywell International Inc. Reconciliation of Earnings per Share to Adjusted Earnings per Share (Unaudited) Three Months Ended June 30, Twelve Months Ended December 31, 2024 2023 2023 2024(E) Earnings per share of common stock - diluted1 $                  2.36 $                  2.22 $                   8.47 $9.48 - $9.68 Pension mark-to-market expense2 — — 0.19 No Forecast Amortization of acquisition-related intangibles3 0.10 0.07 0.35 0.48 Acquisition-related costs4 0.03 — 0.01 0.07 Russian-related charges5 — — — 0.02 Net expense related to the NARCO Buyout and HWI Sale6 — 0.01 0.01 — Adjustment to estimated future Bendix liability7 — — 0.49 — Adjusted earnings per share of common stock - diluted $                  2.49 $                  2.30 $                   9.52 $10.05 - $10.25\n\n1 For the three months ended June 30, 2024, and 2023, adjusted earnings per share utilizes weighted average shares of approximately 654.2 million and 670.2 million, respectively. For the twelve months ended December 31, 2023, adjusted earnings per share utilizes weighted average shares of approximately 668.2 million. For the twelve months ended December 31, 2024, expected earnings per share utilizes weighted average shares of approximately 655 million. 2 Pension mark-to-market expense uses a blended tax rate of 18%, net of tax benefit of $27 million, for 2023. 3 For the three months ended June 30, 2024, acquisition-related intangibles amortization includes approximately $66 million, net of tax benefit of approximately $19 million. For the three months ended June 30, 2023, and twelve months ended December 31, 2023, acquisition-related intangibles amortization includes $48 million and $231 million, net of tax benefit of approximately $13 million and $61 million, respectively. For the twelve months ended December 31, 2024, expected acquisition-related intangibles amortization includes approximately $315 million, net of tax benefit of approximately $85 million. 4 For the three months ended June 30, 2024, the adjustment for acquisition-related costs, which is principally comprised of third-party transaction and integration costs and acquisition-related fair value adjustments to inventory, is approximately $22 million, net of tax benefit of approximately $7 million. For the three months ended June 30, 2023, and twelve months ended December 31, 2023, the adjustment for acquisition-related costs, which is principally comprised of third-party transaction and integration costs and acquisition-related fair value adjustments to inventory, is approximately $1 million and $7 million, net of tax benefit of approximately $0 million and $2 million, respectively. For the twelve months ended December 31, 2024, the expected adjustment for acquisition-related costs, which is principally comprised of third-party transaction and integration costs and acquisition-related fair value adjustments to inventory, is approximately $45 million, net of tax benefit of approximately $15 million. 5 For the three months ended June 30, 2023, the adjustment was $1 million, without tax benefit. For the twelve months ended December 31, 2023, the adjustment was a benefit $3 million, without tax expense. For the twelve months ended December 31, 2024, the expected adjustment is a $17 million expense, without tax benefit, due to the settlement of a contractual dispute with a Russian entity associated with the Company's suspension and wind down activities in Russia. 6 For the three months ended June 30, 2023 and the twelve months ended December 31, 2023, the adjustment was $8 million, net of tax benefit of $3 million, due to the net expense related to the NARCO Buyout and HWI Sale. 7 Bendix Friction Materials (\"Bendix\") is a business no longer owned by the Company. In 2023, the Company changed its valuation methodology for calculating legacy Bendix liabilities. For the twelve months ended December 31, 2023, the adjustment was $330 million, net of tax benefit of $104 million (or $434 million pre-tax) due to a change in the estimated liability for resolution of asserted (claims filed as of the financial statement date) and unasserted Bendix-related asbestos claims. The Company experienced fluctuations in average resolution values year-over-year in each of the past five years with no well-established trends in either direction. In 2023, the Company observed two consecutive years of increasing average resolution values (2023 and 2022), with more volatility in the earlier years of the five-year period (2019 through 2021). Based on these observations, the Company, during its annual review in the fourth quarter of 2023, reevaluated its valuation methodology and elected to give more weight to the two most recent years by shortening the look-back period from five years to two years (2023 and 2022). The Company believes that the average resolution values in the last two consecutive years are likely more representative of expected resolution values in future periods. The $434 million pre-tax amount was attributable primarily to shortening the look-back period to the two most recent years, and to a lesser extent to increasing expected resolution values for a subset of asserted claims to adjust for higher claim values in that subset than in the modelled two-year data set.  It is not possible to predict whether such resolution values will increase, decrease, or stabilize in the future, given recent litigation trends within the tort system and the inherent uncertainty in predicting the outcome of such trends. The Company will continue to monitor Bendix claim resolution values and other trends within the tort system to assess the appropriate look-back period for determining average resolution values going forward.\n\nWe define adjusted earnings per share as diluted earnings per share adjusted to exclude various charges as listed above. We believe adjusted earnings per share is a measure that is useful to investors and management in understanding our ongoing operations and in analysis of ongoing operating trends. For forward-looking information, management cannot reliably predict or estimate, without unreasonable effort, the pension mark-to-market expense as it is dependent on macroeconomic factors, such as interest rates and the return generated on invested pension plan assets. We therefore do not include an estimate for the pension mark-to-market expense. Based on economic and industry conditions, future developments, and other relevant factors, these assumptions are subject to change.\n\nAcquisition amortization and acquisition-related costs are significantly impacted by the timing, size, and number of acquisitions we complete and are not on a predictable cycle and we make no comment as to when or whether any future acquisitions may occur. We believe excluding these costs provides investors with a more meaningful comparison of operating performance over time and with both acquisitive and other peer companies.\n\nHoneywell International Inc. Reconciliation of Cash Provided by Operating Activities to Free Cash Flow (Unaudited) (Dollars in millions) Three Months Ended\n\nJune 30, 2024 Three Months Ended\n\nJune 30, 2023 Cash provided by operating activities $                     1,371 $                     1,360 Capital expenditures (259) (233) Free cash flow $                     1,112 $                     1,127\n\nWe define free cash flow as cash provided by operating activities less cash for capital expenditures.\n\nWe believe that free cash flow is a non-GAAP measure that is useful to investors and management as a measure of cash generated by operations that will be used to repay scheduled debt maturities and can be used to invest in future growth through new business development activities or acquisitions, pay dividends, repurchase stock, or repay debt obligations prior to their maturities. This measure can also be used to evaluate our ability to generate cash flow from operations and the impact that this cash flow has on our liquidity.\n\nHoneywell International Inc. Reconciliation of Expected Cash Provided by Operating Activities to Expected Free Cash Flow (Unaudited) Twelve Months Ended \r\nDecember 31, 2024(E) ($B) Cash provided by operating activities ~$6.6 - $7.0 Capital expenditures ~(1.1) Free cash flow ~$5.5 - $5.9\n\nWe define free cash flow as cash provided by operating activities less cash for capital expenditures.\n\nWe believe that free cash flow is a non-GAAP measure that is useful to investors and management as a measure of cash generated by operations that will be used to repay scheduled debt maturities and can be used to invest in future growth through new business development activities or acquisitions, pay dividends, repurchase stock, or repay debt obligations prior to their maturities. This measure can also be used to evaluate our ability to generate cash flow from operations and the impact that this cash flow has on our liquidity.\n\nContacts: Media Investor Relations Stacey Jones Sean Meakim (980) 378-6258 (704) 627-6200 stacey.jones@honeywell.com sean.meakim@honeywell.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/honeywell-delivers-strong-second-quarter-results-and-beats-earnings-guidance-updates-2024-outlook-302206009.html\n\nSOURCE Honeywell\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-delivers-strong-second-quarter-100000174.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.029,
            "neu": 0.846,
            "pos": 0.125
        }
    },
    {
        "date": "2024-07-25T04:26:54+00:00",
        "title": "Biden's speech, Ford's miss, European earnings - what's moving markets",
        "content": "Investing.com -- The tech-led selloff looks set to continue Thursday, while Ford has also disappointed with a second-quarter profit miss. Biden points to a new generation after addressing the nation, while the European earnings season presses on.\n\n1. Biden points to a new generation\n\nPresident Joe Biden addressed the nation on Wednesday for the first time since dropping his reelection bid, explaining he was stepping aside to allow a new generation to take over after weeks of concerns about his age and health.\n\nBiden is the oldest president in U.S. history, at 81, and becomes the first incumbent president not to seek reelection since 1968 when Lyndon Johnson, under fire for his handling of the Vietnam War, pulled out of his campaign.\n\n“In recent weeks, it’s become clear to me that I need to unite my party,” Biden said. “I've decided the best way forward is to pass the torch to a new generation. That's the best way to unite our nation.\"\n\nThe spotlight now falls on Vice President Kamala Harris, who is set to be formally nominated as the Democratic Party’s candidate as soon as next week, before the party's Aug. 19-22 convention in Chicago.\n\nA Reuters/Ipsos poll completed on Tuesday showed Harris with a lead of two percentage points over Republican candidate Donald Trump, 44% to 42%. A CNN poll by SSRS showed Trump leading Harris, 49% to 46%. Both findings were within the polls' margins of error.\n\n2. Futures steady ahead of growth data\n\nU.S. stock futures traded in a mixed fashion Thursday, with the previous session’s sharp tech-driven selloff continuing ahead of the release of key growth data.\n\nBy 04:15 ET (08:15 GMT), the Dow futures contract was 20 points, or 0.1%, higher, while S&P 500 futures dropped 15 points, or 0.3%, and Nasdaq 100 futures fell by 120 points, or 0.6%.\n\nThe major Wall Street indices slumped on Wednesday, driven by poorly received earnings from tech giants Alphabet (NASDAQ:GOOGL) and Tesla (NASDAQ:TSLA).\n\nThe Dow Jones Industrial Average fell over 500 points, or 1.3%, while the S&P 500 dropped 2.3% and the Nasdaq Composite plummeted 3.6%, the worst session since 2022.\n\nThere will be more earnings to digest Thursday, from the likes of American Airlines (NASDAQ:AAL), Honeywell (NASDAQ:HON) and Hasbro (NASDAQ:HAS).\n\nMore than 25% of companies in the S&P 500 have reported their second-quarter earnings, according to FactSet data, and although some major tech stocks have disappointed, the overall nature of the earnings session has been generally positive.\n\nInvestors will also study the release of preliminary second-quarter GDP data before the market open, and is expected to show annualized growth of 2.0%.\n\nStory continues\n\nThis would be above the 1.4% growth seen in the first quarter, but would remain considerably slower than the 4.2% pace seen in the second half of last year.\n\n3. Ford slumps after profit miss\n\nFord (NYSE:F) stock slumped premarket after the auto giant reported a significant profit miss for the second quarter as it continues to battle costly quality issues and an EV business that is weighing on its bottom line.\n\nFord stock fell over 11% after hours following the Detroit automaker posting an adjusted profit of 47 cents per share, significantly missing analysts' expectations of 68 cents, according to LSEG data.\n\nFord CEO Jim Farley has made fixing the automaker's quality problems a priority since he took charge in October 2020, but warranty expenses went up $800 million in the second quarter compared with the previous quarter.\n\nLegacy automakers have tended to scale down their EV ambitions amid easing demand, a shift to hybrids and stiff competition.\n\n\"Overall, the EV journey has been humbling, but it has forced us to get even more fit as a company, including applying it to our (traditional gas-engine) business, and that will pay off in the long run,\" said Farley. \"The remaking of Ford is not without growing pains.\"\n\n4. European earnings roll in\n\nA number of important European companies have released their quarterly earnings Thursday for investors to digest.\n\nLuxury giant Kering (EPA:PRTP), best known for its Gucci brand, disappointed with its second-quarter results, as overall sales fell by 11% year-on-year on a constant currency basis, a steeper decline than expected.\n\nAnglo-Swedish drugmaker AstraZeneca (NASDAQ:AZN) raised its sales and profit forecast for 2024 and topped analyst expectations for second-quarter revenue, buoyed by demand for its therapies for cancer and rare diseases.\n\nSanofi (NASDAQ:SNY)'s second-quarter profit rose on strong demand for its blockbuster asthma drug Dupixent and better-than-expected sales of new launches.\n\nNestle (SIX:NESN) reported half-year sales growth below expectations and lowered its full-year organic sales growth outlook to at least 3% from about 4% previously, as the world's biggest packaged food company said prices had come down faster than expected.\n\nUnilever (LON:ULVR) reported weaker-than-expected underlying quarterly sales after the British consumer goods giant felt the backlash from higher prices, while French oil major TotalEnergies (EPA:TTEF) reported a 6% fall in second-quarter earnings.\n\n5. Crude falls amid demand concerns\n\nCrude prices retreated Thursday, as concerns about waning demand, especially from China, the world's largest crude importer, continued to weigh.\n\nBy 04:15 ET, the U.S. crude futures (WTI) dropped 0.5% to $77.19 a barrel, while the Brent contract fell 0.5% to $81.30 a barrel.\n\nBoth benchmarks settled higher on Wednesday, snapping consecutive sessions of declines after the Energy Information Administration said U.S. crude inventories fell by 3.7 million barrels last week, more than expected.\n\nHowever, prices remained close to two-month lows as concerns over waning demand, coupled with forecasts of a potential oil market surplus in 2025 and talk of a ceasefire in the Middle East kept traders largely bearish towards crude.\n\nRelated Articles\n\nBiden's speech, Ford's miss, European earnings - what's moving markets\n\nInvestors turn long on Singapore dollar after 7 months; bearish bets on Asian FX ease - Reuters poll\n\nSouth Korea seeks to cut inheritance tax in first revision since 2000\n\nView comments",
        "link": "https://finance.yahoo.com/news/bidens-speech-fords-miss-european-042654571.html",
        "symbols": [
            "91D.F",
            "AAL.US",
            "AZN.US",
            "COMP.US",
            "F.US",
            "GOOGL.US",
            "GSPC.INDX",
            "HAS.US",
            "HON.US",
            "IXIC.INDX",
            "SNY.US",
            "TSLA.US",
            "UL.US",
            "ULEV34.SA",
            "ULVR.LSE",
            "ULVR.VI",
            "UNA.AS",
            "UNLYF.US",
            "UNVA.F",
            "UNVB.BE"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.841,
            "neg": 0.088,
            "neu": 0.833,
            "pos": 0.079
        }
    },
    {
        "date": "2024-07-25T00:00:00+00:00",
        "title": "3 Flying Car Stocks to Capitalize on the Coming Trillion-Dollar Market",
        "content": "Flying car stocks: Discover top contenders like Embraer, Boeing, and Honeywell shaping the future of urban air mobility.",
        "link": "https://investorplace.com/2024/07/3-flying-car-stocks-to-capitalize-on-the-coming-trillion-dollar-market/",
        "symbols": [
            "BA.US",
            "ERJ.US",
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.511,
            "neg": 0,
            "neu": 0.788,
            "pos": 0.212
        }
    },
    {
        "date": "2024-07-25T00:00:00+00:00",
        "title": "HON Stock Earnings: Honeywell Intl Beats EPS, Beats Revenue for Q2 2024",
        "content": "HON stock results show that Honeywell Intl beat analyst estimates for earnings per share and beat on revenue for the second quarter of 2024.",
        "link": "https://investorplace.com/earning-results/2024/07/hon-stock-earnings-honeywell-intl-for-q2-of-2024/",
        "symbols": [
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.296,
            "neg": 0,
            "neu": 0.913,
            "pos": 0.087
        }
    },
    {
        "date": "2024-07-25T00:00:00+00:00",
        "title": "Why Honeywell Stock Tumbled Today",
        "content": "Investors weren't happy with the company's revised earnings guidance.",
        "link": "https://www.fool.com/investing/2024/07/25/why-honeywell-stock-tumbled-today/",
        "symbols": [
            "HON.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.2,
            "neg": 0.183,
            "neu": 0.817,
            "pos": 0
        }
    }
]