[
    {
        "date": "2024-08-26T17:18:00+00:00",
        "title": "Honeywell (HON) Stock Trading Above 50-Day SMA: Should You Buy Now?",
        "content": "The industrial conglomerate Honeywell International Inc. HON crossed its 200-day simple moving average (SMA) on Aug 19, reaching a key support level from a technical perspective.  This reflects a positive market sentiment and confidence in the company's financial health and long-term prospects.\n\nHON Overtakes the 200-Day Moving Average Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nConsidering the past few days' price movement, the stock was seen outperforming the benchmarks, the broader industry as well as its major peers. Over the past seven days, shares of the company have risen 1.7%, while the S&P 500 inched up 0.4% and the Zacks Diversified Operations industry declined 1.6%.\r\n\r\nShares of its key rivals like RTX Corporation RTX and Johnson Controls International plc JCI have risen 0.2% and 1%, respectively.\n\nSeven-Day Price Performance Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nClosing at $202.48 in the last trading session, the stock is trading below its 52-week high of $220.79 but higher than its 52-week low of $174.88. With investors’ sentiment starting to pick up for Honeywell, it is the right time to assess the stock’s potential upsides. Let’s delve deeper.\r\n\r\nAerospace Technologies Unit Aids Growth Prospects: Honeywell is witnessing solid momentum in its Aerospace Technologies segment on sustained strength in both commercial aviation, and defense and space sectors. The company’s commercial aviation aftermarket business (sales increased 17% year over year in the second quarter of 2024) is benefiting from strong demand for products in the business aviation market as global flight activity continues to rise.\r\n\r\nAlso, strength in the company’s commercial aviation original equipment business (sales increased 10% in the second quarter), backed by increased shipset deliveries, particularly in the air transport market, has been favorable. In the quarters ahead, it expects the Aerospace Technologies segment to benefit from strong demand in the commercial aviation market, growth in air transport flight hours and higher shipset deliveries.\r\n\r\nExpanding defense budget also remains a growth catalyst for Honeywell. While the commercial aviation market remained the major driver for the company, the defense side of the industry has been witnessing positive momentum, cushioned by steady government support. \r\n\r\nIt’s worth noting that in December 2023, U.S. President Joe Biden signed the U.S. defense policy bill that authorizes a record $886 billion in annual military spending, thereby increasing the nation's total national security budget by about 3%.  Such improved budgetary provisions set the stage for Honeywell, focused on defense business to win more contracts. This is likely to boost its top line.\r\n\r\nAlso, strength in the advanced materials business, driven by higher demand for fluorine products, bodes well for the Energy and Sustainability Solutions segment. For 2024, it expects overall revenues to be in the $39.1-$39.7 billion range. Organic revenues are anticipated to rise 5-6% on a year-over-year basis.\r\n\r\nOperational Initiatives Boost Margins: Honeywell’s three transformation initiatives —Connected Enterprise, Integrated Supply Chain and Honeywell Digital — along with its pricing actions, help maintain a healthy margin performance. In the second quarter of 2024, its operating income margin increased 10 basis points year over year to 20.7%.\r\n\r\nShareholder-Friendly Moves: HON’s ability to generate strong cash flow supports its shareholder-friendly activities. For instance, its free cash flow totaled $1.11 billion in the second quarter. For 2024, it expects free cash flow of $5.5-$5.9 billion, indicating an increase of 4-11% year-over-year. Also, in the first six months of 2024, it paid out dividends of $1.4 billion and repurchased shares worth $1.2 billion.\n\nStory continues\n\nFew Near-Term Concerns Prevail\n\nSoftness in the Industrial Automation Unit: Weakness in the warehouse and workflow solutions businesses due to lower demand for projects has been affecting the Industrial Automation segment's performance (sales declined 8% in the second quarter). Continued softness in the warehouse automation business, owing to lower investments in the market, remains a concern for the segment.\r\n\r\nHigh Debt Level: The company exited the second quarter with long-term debt and current maturities of $23.4 billion. The high debt level was primarily attributable to the funds raised for the Global Access Solutions acquisition. Considering its high debt level, its cash and cash equivalents of $9.6 billion do not look impressive. Also, the stock looks more leveraged than the industry. Its total debt-to-capital ratio is currently 0.57, higher than 0.44 of the industry.\n\nStock Valuation\n\nHoneywell is currently trading at a forward 12-month P/E of 18.71X, at a premium compared with the industry’s 15.63X. The stock is also not cheap when compared with its industry peer 3M Company MMM, which is currently trading at 17.12X. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nEstimate Revision Trend\n\nAmid these, the company’s earnings estimates for 2024 have decreased 0.4% to $10.15 over the past 60 days, and the same for 2025 has declined 0.6% to $11.18. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nShould You Invest in HON Right Now?\n\nDespite Honeywell’s several upsides and impressive dividend pay-out trend, the near-term challenges, such as weakness in the Industrial Automation unit and high debt level, are limiting this Zacks Rank #3 (Hold) company’s near-term prospects. While current shareholders should hold their positions, new investors should wait for the stock to retract some of its recent gains and provide a better entry point.\r\n\r\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nJohnson Controls International plc (JCI) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/honeywell-hon-stock-trading-above-171800964.html",
        "symbols": [
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.037,
            "neu": 0.771,
            "pos": 0.192
        }
    }
]