[
    {
        "date": "2024-07-30T15:45:58+00:00",
        "title": "The Top 3 Manufacturing Stocks to Buy Now: Summer 2024",
        "content": "It’s been a rough month for manufacturing stocks. The reading on manufacturing activity is one of the most closely watched economic reports. In July, the S&P Global Flash U.S. Manufacturing Purchasing Managers Index came in at 49.5. The number was lower than estimated at 51.7, approximately equal to the 49 registered in July 2023. It also was the lowest reading recorded since November 2023.\n\nAny number under 50 indicates contraction, which is another example of an economy that continues to take one step forward and two steps back. At least that’s the perception. And since perception often reflects investor sentiment, it’s unsurprising that many manufacturing stocks are doing poorly.\n\nHowever, in many cases, that sentiment can be misdirected. It takes a little digging, but if you look at the sectors driving the economy, you can find some manufacturing stocks offering upside. And if money continues to rotate away from the tech sector, there may still be strong gains.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nHoneywell International (HON) Quantum Computing Stocks - Honeywell (HON)\n\nInvestors can argue that diversification is a good strategy, but it’s one of the arguments for Honeywell International (NYSE:HON). The company is exposed to both the technology and manufacturing sectors. Its business units include building technologies, performance materials and technologies, safety and productivity solutions, and aerospace. The latter includes investments in the emerging eVTOL (electric vertical take-off and landing) vehicle sector.\n\nHoneywell was one of the first companies to report quarterly earnings, delivering beats in revenue and earnings. The numbers were also higher year-over-year. Still, HON stock dropped approximately 5% after the earnings reports on concerns about weaker guidance. That turned a stock already underperforming the market into negative territory for the year.\n\nHowever, the company continues executing a disciplined growth strategy through mergers and acquisitions. That will take some time to play out. In the meantime, it’s maintaining its free cash flow at year-over-year levels.\n\nAnalysts are lowering their price targets after earnings but still give the stock a consensus “Buy” rating. The company has increased its dividend for 13 years and is on track to announce another dividend increase in its upcoming quarter.\n\nRTX (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nRTX (NYSE:RTX) is another manufacturer that delivered strong earnings. Diversification is a story here, as RTX is a leading aerospace and defense contractor. The company provides the Patriot and Javelin missiles that NATO and Israel have used. Its engines also power the engines of the F15 and F16 fighter jets. The company’s business also touches on the growing space economy.\n\nStory continues\n\nThis ability to impact many verticals was reflected in the earnings report. RTX, formerly known as Raytheon, beat on the top and bottom lines. Both numbers were also higher year-over-year. The company also raised its full-year guidance.\n\nAnalysts quickly boosted their price targets for RTX stock, which is already up 35% in 2024. Traders looking to buy the stock may want to wait for an opportunistic pullback. However, as a long-term investment, RTX has been a solid performer with a total return of over 63% in the last five years.\n\nHillenbrand (HI) Hillenbrand's (HI) corporate headquarters in Batesville, Indiana. Hillenbrand is a producer of machinery and equipment.\n\nSource: smoothsails / Shutterstock.com\n\nIf small-cap stocks are more your thing, Hillenbrand (NYSE:HI) may be a name to watch. There’s been a conscious rotation away from mega-cap technology stocks, and small-cap stocks like Hillebrand are benefiting. Hillenbrand delivers processing technologies in extrusion, material handling, and injection molding.\n\nHI stock is up over 10% in the last month. Having said that, the stock is still down 7.3% in 2024. That’s largely due to a revenue miss in the first quarter, which was due, in part, to slower-than-expected final customer decisions. The company also guided lower sales during the full year.\n\nThat said, positive customer decisions may be more forthcoming if the Federal Reserve lowers interest rates as expected in the back half of the year. That would seem to be the opinion of analysts with a “Strong Buy” rating on HI stock with a $56.80 price target of 28% above its closing price on July 26, 2024.\n\nAnd it’s important to note that Hillebrand pays a dividend growing for 17 consecutive years. The dividend yield of 2.01% is higher than the sector’s median of 1.43%.\n\nOn the date of publication, Chris Markoch did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly orindirectly) any positions in the securities mentioned in this article.\n\nChris Markoch is a freelance financial copywriter who has been covering the market for over five years. He has been writing for InvestorPlace since 2019.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post The Top 3 Manufacturing Stocks to Buy Now: Summer 2024 appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/top-3-manufacturing-stocks-buy-154558375.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "9HI.F",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HI.US",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.034,
            "neu": 0.87,
            "pos": 0.096
        }
    },
    {
        "date": "2024-07-30T00:00:00+00:00",
        "title": "The Top 3 Manufacturing Stocks to Buy Now: Summer 2024",
        "content": "If money continues to rotate away from the tech sector there may be some strong gains in these manufacturing stocks.",
        "link": "https://investorplace.com/2024/07/the-top-3-manufacturing-stocks-to-buy-now-summer-2024/",
        "symbols": [
            "HI.US",
            "HON.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.691,
            "neg": 0,
            "neu": 0.759,
            "pos": 0.241
        }
    }
]