[
    {
        "date": "2024-09-30T22:32:00+00:00",
        "title": "RTX's Pratt &amp; Whitney awarded F135 Engine Core Upgrade contract",
        "content": "$1.3 billion contract will enable continued design maturation and aircraft integration\n\nEAST HARTFORD, Conn., Sept. 30, 2024 /PRNewswire/ -- Pratt & Whitney, an RTX (NYSE: RTX) business, has been awarded a contract valued up to $1.3 billion to continue work on the F135 Engine Core Upgrade (ECU), which will deliver enhanced durability to the engine. The ECU also provides power and cooling for Block 4 and beyond capabilities for all three variants of the F-35 global enterprise.\n\n\"This contract is critical to continuing our positive forward momentum on this program,\" said Jill Albertelli, president of Pratt & Whitney's Military Engines business. \"It allows us to continue work in the risk reduction phase with a fully staffed team focused on design maturation, aircraft integration, and mobilizing the supply base to prepare for production.\"\n\nIn July, Pratt & Whitney announced it had completed the F135 ECU's preliminary design review which signified the alignment between Pratt & Whitney and the F-35 Joint Program Office on the upgrade's design. Today, more than 700 engineers and program managers are working full-time on the program.\n\n\"We are fortunate to have bipartisan and bicameral support from our congressional advocates, especially the Connecticut and Maine delegations led by senior appropriators Sen. Susan Collins and Rep. Rosa DeLauro,\" said Jeff Shockey, senior vice president of RTX Global Government Relations. \"Their steadfast commitment to the F135 ensures it will deliver critical capabilities for decades to come.\"\n\nThe F135 program is a major driver of economic growth in the states of Connecticut, Maine, and around the country; supporting more than 57,000 jobs across 43 states.\n\nTo date, Pratt & Whitney has delivered more than 1,200 F135 production engines, with more than 900,000 engine flight hours recorded. The F135 ECU will be incorporated into F-35s at the point of production or retrofitted at one of the multiple F135 depot sustainment facilities around the world and will be available to all F-35 operators.\n\nAbout Pratt & Whitney \r\nPratt & Whitney is a world leader in the design, manufacture and service of aircraft engines and auxiliary power units. To learn more visit www.prattwhitney.com.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com. Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-pratt--whitney-awarded-f135-engine-core-upgrade-contract-302263255.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-pratt-whitney-awarded-f135-223200145.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.978,
            "neg": 0.026,
            "neu": 0.881,
            "pos": 0.092
        }
    },
    {
        "date": "2024-09-30T14:24:34+00:00",
        "title": "RTX Receives $525 Million U.S. Navy Contract for ESSM Block 2 Missiles",
        "content": "Raytheon, an RTX business, has received a $525 million contract from the U.S. Navy to produce ESSM Block 2 missiles and spares for the U.S. and allied nations.\n\nESSM Block 2 is a short to medium-range, ship-launched, dual-mode, guided missile that has increased maneuverability and improved performance over its Block 1 predecessor.\n\nMost Read on Design & Development Today:\n\nBoeing Completes First Flight of E-7 Wedgetail GM Recalling More Than 449,000 SUVs, Pickups Due to Issue with Low Brake Fluid Warning Light Electra Conducts Multiple Flight Demonstrations of Ultra Short Aircraft for U.S. Military A Capsule has Been Propelled Through a Hyperloop Test Tube in a Step Forward for the Transit System\n\nThe newest ESSM variant reduces dependence on shipboard illumination and is integrated on a wide variety of combat systems and launchers, delivering improved performance in stressing marine environments, and has significant digital processing margin to keep pace with evolving threats through software improvements.\n\nLeveraging learning from other active seeker systems – such as AMRAAM and Standard Missile 6 – RTX is using common hardware and factory processes across multiple missile platforms to enable cost savings and increased production capacity. Additionally, the consortium continues to invest in test infrastructure and material to keep capacity ahead of demand and accelerate deliveries.\n\nESSM is managed by the NATO SEASPARROW Consortium composed of 12 nations: Australia, Belgium, Canada, Denmark, Germany, Greece, the Netherlands, Norway, Portugal, Spain, Türkiye, and the United States. The consortium is NATO's largest and most successful cooperative weapons project and represents over 50 years of international military-industrial cooperation.\n\nClick here to subscribeto our daily newsletter.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-receives-525-million-u-142434998.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.135,
            "neg": 0.089,
            "neu": 0.827,
            "pos": 0.084
        }
    },
    {
        "date": "2024-09-30T14:00:00+00:00",
        "title": "RTX's Raytheon delivers Missile-Warning Sensor",
        "content": "USSF Next-Gen OPIR payload to provide critical missile warning data\n\nEL SEGUNDO, Calif., Sept. 30, 2024 /PRNewswire/ -- Raytheon, an RTX (NYSE: RTX) business, delivered its first sensor payload to prime contractor Lockheed Martin, keeping the U.S. Space Force Space Systems Command's first Next-Generation Overhead Persistent Infrared, or Next-Gen OPIR, Geosynchronous Earth Orbit (GEO) Block 0 missile warning satellite on track for a 2025 initial launch capability.\n\nDesigned to improve missile warning resilience and performance, two Next-Gen OPIR GEO satellites will eventually provide continuous coverage over mid-latitudes to the existing constellation. Raytheon is designing and building sensor payloads for both satellites.\n\nPrior to delivery of the first payload, Raytheon completed a series of assessments including thermal vacuum testing. Thermal vacuum testing exposes the payload to a space-like environment and validates digital models to ensure the sensor meets design requirements. The second sensor payload is more than 60 percent completed and is scheduled to start thermal vacuum testing in early 2025.\n\n\"Persistent early warning of missile threats is critical to our national security,\" said Sandy Brown, vice president for Mission Solutions & Payloads for Raytheon. \"Our payloads offer early, resilient warning against increasingly challenging ballistic threats from adversaries.\"\n\nAbout Raytheon \r\nRaytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nAbout RTX\r\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com. Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-raytheon-delivers-missile-warning-sensor-302261576.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-raytheon-delivers-missile-warning-140000499.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.752,
            "neg": 0.081,
            "neu": 0.806,
            "pos": 0.113
        }
    },
    {
        "date": "2024-09-30T13:00:00+00:00",
        "title": "RTX receives U.S. Navy contract for ESSM Block 2 Missiles",
        "content": "Multi-mission weapon system will provide increased flexibility and capability for U.S. and allied navies\n\nTUCSON, Ariz., Sept. 30, 2024 /PRNewswire/ -- Raytheon, an RTX (NYSE: RTX) business, has received a $525 million contract from the U.S. Navy to produce ESSM Block 2 missiles and spares for the U.S. and allied nations.\n\nESSM Block 2 is a short to medium-range, ship-launched, dual-mode, guided missile that has increased maneuverability and improved performance over its Block 1 predecessor.\n\n\"The role of self-ship and local area defense has become increasingly important, and ESSM Block 2 delivers critical capability in this mission,\" said Barbara Borgonovi, president of Naval Power at Raytheon. \"By partnering with the U.S. Navy and allied navies, we're ensuring this versatile system is ready to support our fleets around the world.\"\n\nThe newest ESSM variant reduces dependence on shipboard illumination and is integrated on a wide variety of combat systems and launchers, delivering improved performance in stressing marine environments, and has significant digital processing margin to keep pace with evolving threats through software improvements.\n\nLeveraging learning from other active seeker systems – such as AMRAAM and Standard Missile 6 – RTX is using common hardware and factory processes across multiple missile platforms to enable cost savings and increased production capacity. Additionally, the consortium continues to invest in test infrastructure and material to keep capacity ahead of demand and accelerate deliveries.\n\nESSM is managed by the NATO SEASPARROW Consortium composed of 12 nations: Australia, Belgium, Canada, Denmark, Germany, Greece, the Netherlands, Norway, Portugal, Spain, Türkiye, and the United States. The consortium is NATO's largest and most successful cooperative weapons project and represents over 50 years of international military-industrial cooperation.\n\nAbout Raytheon \r\nRaytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nAbout RTX \r\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtx-receives-us-navy-contract-for-essm-block-2-missiles-302261630.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-receives-u-navy-contract-130000834.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.981,
            "neg": 0.069,
            "neu": 0.783,
            "pos": 0.147
        }
    }
]