[
    {
        "date": "2024-05-03T14:33:00+00:00",
        "title": "RTX's new generation of commercial satellite imagers launches with Maxar's WorldView Legion",
        "content": "Advanced imagers will provide high-resolution visual data in real time\n\nARLINGTON, Va., May 3, 2024 /PRNewswire/ -- Two next-generation imaging instruments designed by Raytheon, an RTX (NYSE: RTX) business, launched yesterday as part of Maxar's WorldView Legion satellites. These are the first two of six planned WorldView Legion satellites, which will provide a significant leap forward in Earth observation capabilities, offering improved surveillance and monitoring for a wide range of applications. Raytheon’s imager was designed using digital engineering practices.\n\nPositioned in low Earth orbit, the satellites will provide the highest commercially available resolution, and when all six join the Maxar Intelligence constellation, they will enable a revisit rate of up to 15 times per day over the most populated parts of Earth. These WorldView Legion satellites will support applications across multiple sectors, including national security, military and commercial mapping, maritime monitoring, telecommunications network planning, change detection and feature identification.\n\n\"Raytheon's advanced instrument technology sets a new industry standard, providing 30cm high-resolution satellite imagery that enables WorldView Legion to fulfill today's customer needs and adapt to the evolving needs of tomorrow,\" said Nicholas Yiakas, director of Civil, Commercial, and Special Programs for Raytheon.\n\nRaytheon's innovative telescope design is the culmination of 15 years of research and development into a novel optical material that is stronger and lighter than previous designs. As part of the effort, Raytheon received 8 patents with the U.S. Patent Office. The combination of lighter optics and electronics allowed Maxar to successfully reduce spacecraft mass by more than two times, reducing time to orbit and launch costs.\n\nThe high-resolution image is focused onto a next-generation digital focal plane array designed and built by Raytheon to provide high-resolution multispectral images.\n\nThe satellite imagery collected by WorldView Legion will aid in assessing humanitarian needs, providing aid to natural disasters and businesses with transformational capabilities including mapping and logistical planning, insights to world events and supporting national defense.\n\nAbout Raytheon \r\nRaytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nStory continues\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com. Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/rtxs-new-generation-of-commercial-satellite-imagers-launches-with-maxars-worldview-legion-302135667.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-generation-commercial-satellite-imagers-143300653.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.021,
            "neu": 0.826,
            "pos": 0.152
        }
    },
    {
        "date": "2024-05-03T13:50:11+00:00",
        "title": "Here's Why RTX (RTX) is a Strong Momentum Stock",
        "content": "Taking full advantage of the stock market and investing with confidence are common goals for new and old investors alike.\n\nAchieving those goals is made easier with the Zacks Style Scores, a unique set of guidelines that rates stocks based on popular investing methodologies, namely value, growth, and momentum. The Style Scores can help you narrow down which stocks are better for your portfolio and which ones can beat the market over the long-term.\n\nIs This 1 Momentum Stock a Screaming Buy Right Now?\n\nFor momentum investors, upward or downward trends in a stock's price or earnings outlook take precedent, so they'll want to zero in on the Momentum Style Score. This Score can pinpoint good times to build a position in a stock, using factors like one-week price change and the monthly percentage change in earnings estimates.\n\nRTX (RTX)\n\nIn July 2023, Raytheon Technologies was renamed as RTX Corporation. On Apr 3, 2020, Raytheon Technologies was formed following the completion of merger between United Technologies and Raytheon Company. Based in Waltham, MA, Raytheon Technologies has emerged as an aerospace and defense company, with pro-forma combined annual revenues of $74 billion as of the end of 2019, providing advanced systems and services for commercial, military and government customers worldwide. Effective July 2023, the company operates through three business segments.\n\nRTX boasts a Momentum Style Score of A and VGM Score of B, and holds a Zacks Rank #3 (Hold) rating. Shares of RTX has seen some interesting price action recently; the stock is up 0.2% over the past one week and up 2.6% over the past four weeks. And in the last one-year period, RTX has gained 6.2%. As for the stock's trading volume, 7,489,805 shares on average were traded over the last 20 days.\n\nMomentum investors don't just pay attention to price changes; positive earnings play a crucial role, too. Three analysts revised their earnings estimate upwards in the last 60 days for fiscal 2024. The Zacks Consensus Estimate has increased $0.01 to $5.40 per share. RTX boasts an average earnings surprise of 6.9%.\n\nRTX should be on investors' short list because of its impressive earnings fundamentals, a good Zacks Rank, and strong Momentum and VGM Style Scores.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/heres-why-rtx-rtx-strong-135011554.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.006,
            "neu": 0.822,
            "pos": 0.173
        }
    },
    {
        "date": "2024-05-03T11:35:34+00:00",
        "title": "Top 20 States Where the US Military Spends the Most Money",
        "content": "In this article, we look at the 20 states where the US military spends the most money. You can skip our detailed analysis on the breakdown of the Department of Defense (DoD)’s spending by state and head over directly to the Top 5 States Where the US Military Spends the Most Money.\n\nFigures released by the Stockholm International Peace Research Institute (SIPRI) last month revealed that global military spending reached an all-time high of $2.44 trillion in 2023, increasing 6.8% in real terms compared to 2022. This is the steepest year-on-year rise in defense expenditure since 2009. The report also highlighted that world military expenditure has now been increasing for the last consecutive nine years.\n\nDefense spending in the United States grew 2.3% to total $916 billion in 2023, which amounted to 37.5% of the global military expenditure, and represented 68% of all NATO military spending. On the other hand, Russia’s defense bills also witnessed a 24% increase in 2023 amid the war in Ukraine. Israel’s military expenditure rose 24% as well compared to 2022, driven by its large-scale offensive against Hamas in Gaza. India and Saudi Arabia also continued to spend heavily on defense during the year.\n\nThe surge in spending has a created a boom in the global defense industry, especially for aerospace and armaments manufacturers in the United States – a country that accounts for nearly two-fifths of all global military spending, and is home to several top defense contractors countries across the world looks toward to procure their military supplies from.\n\nLockheed Martin Corporation (NYSE:LMT) generated $67.6 billion in revenues in 2023, reporting an increase of 2.4% in comparison to 2022. The aerospace company’s net earnings were also $1.2 billion higher compared to last year. RTX Corporation (NYSE:RTX)’s numbers soared as well, with sales reaching a whopping $68.9 billion in 2023, having grown 3% year-on-year. On the other hand, General Dynamics Corporation (NYSE:GD) posted its highest revenue in history, totaling $42.3 billion last year – which was 7.3% higher than in 2022.\n\nAs a result, the United States continues to retain its military superiority over its rivals, and given the advanced research and development ongoing in the country’s defense industry, this trend is likely to stay for the foreseeable future. The country is already looking ahead to the future, and working on building weapons tailored to address the rapidly evolving dynamics of modern warfare.\n\nAn example of that is the Next Generation Air Dominance (NGAD) Program launched by the United States Air Force (USAF) in 2014 to develop the sixth-generation fighter jet to replace Lockheed Martin Corporation (NYSE:LMT)’s F-22 Raptor. The USAF requested $1.7 billion in its FY24 budget for the project which is likely to cost $16 billion between 2023 and 2028. Five companies – Lockheed Martin Corporation (NYSE:LMT), Northrop Grumman Corporation (NYSE:NOC), The Boeing Company (NYSE:BA), General Electric Company (NYSE:GE), and Pratt & Whitney, a subsidiary of RTX Corporation (NYSE:RTX) – are working on the NGAD Program, with each being awarded contracts worth $975 million in 2022 for a period of ten years.\n\nStory continues\n\nThe enormous sums of money that go into the American defense industry for the procurement of new military equipment by the US government and foreign buyers, and the research and development to develop improved weaponry, heavily influences the US economy in many ways. However, the spending is not evenly distributed across all states. Understandably so, states that are home to major defense companies and host a larger number of military installations receive a greater share of this money.\n\nThe Department of Defense (DoD) in September 2023 released a report on its contract obligations and spending across various states of the United States in 2022. Of the $558.7 billion spent that year, 70% went into contracts for products and services, while 28% were used to pay salaries of DoD’s personnel. 2% of the total amount was awarded as grants. Let’s now take a look at top states where the US military spends the most money. Top 20 States Where the US Military Spends the Most Money\n\nFrontpage/Shutterstock.com\n\nMethodology\n\nThe top 20 states where the US military spends the most money are ranked in ascending order of the DoD spending by state in billions of dollars. 2022 is the latest year for which data is available, and was released by the Department of Defense in September 2023. In cases where the estimated, rounded figure of defense spending was similar for two or more states, we outranked one over the other on the basis of defense spending per resident, with the state having the greater value ranking higher in the list.\n\nBy the way, Insider Monkey is an investing website that tracks the movements of corporate insiders and hedge funds. By using a similar consensus approach, we identify the best stock picks of more than 900 hedge funds investing in US stocks. The top 10 consensus stock picks of hedge funds outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). Whether you are a beginner investor or professional one looking for the best stocks to buy, you can benefit from the wisdom of hedge funds and corporate insiders.\n\nTop 20 States Where the US Military Spends the Most Money:\n\n20. Ohio\n\nTotal Defense Spending in State: $8.9 billion\n\nShare of Overall DoD Spending: 1.59%\n\nWe begin our list with Ohio, where $5.1 billion of the total $8.9 billion amount was spent on DoD contracts in the state, with the rest being divided between grants and payroll spending. The DoD defense spending per resident in Ohio is $759.\n\n19. Missouri\n\nTotal Defense Spending in State: $8.9 billion\n\nShare of Overall DoD Spending: 1.59%\n\nNext up is Missouri, which is home to 12 military installations, according to the Department of Defense. The DoD spent $8.9 billion on military expenditure in the state in 2022.\n\n18. New Jersey\n\nTotal Defense Spending in State: $9.4 billion\n\nShare of Overall DoD Spending: 1.68%\n\nIn 2022, the DoD spent $7 billion on contracts, $2 billion on payrolls, and a little over $400 million on grants in New Jersey. It is among states where the US military spends the most money.\n\n17. Illinois\n\nTotal Defense Spending in State: $10.2 billion\n\nShare of Overall DoD Spending: 1.83%\n\nMore than $10 billion was spent on defense in the state of Illinois in 2022. Nearly three-fourths of the amount was spent on DoD contracts. Defense spending per resident in Illinois is $811.\n\n16. Colorado\n\nTotal Defense Spending in State: $12.9 billion\n\nShare of Overall DoD Spending: 2.31%\n\nColorado has a high defense spending per resident of $2,215. The DoD spent $8.8 billion on defense contracts in the state in 2022, while $3.9 billion were incurred on payrolls, with the rest being accounted for by grants.\n\n15. Georgia\n\nTotal Defense Spending in State: $13.4 billion\n\nShare of Overall DoD Spending: 2.40%\n\nGeorgia represented 2.4% of the DoD’s overall defense spending in 2022. The state is home to Lockheed Martin Corporation (NYSE:LMT)’s site in Marietta that works on the engine modernization and avionics programs for the P-3 Orion program operations and C-5 Galaxy strategic transport.\n\n14. North Carolina\n\nTotal Defense Spending in State: $13.4 billion\n\nShare of Overall DoD Spending: 2.40%\n\nNorth Carolina is home to 15 military installations, including seven key military bases. The state also has numerous universities that have industrial partnerships with the DoD and intelligence agencies. With more than $13 billion spent on defense in the state in 2022, North Carolina is among the top 20 states where the US military spends the most money.\n\n13. Kentucky\n\nTotal Defense Spending in State: $13.9 billion\n\nShare of Overall DoD Spending: 2.49%\n\nNext on our list of states where the US military spends the most money is Kentucky, where the DoD incurred a whopping $13.9 billion in defense expenditure in 2022, of which $10.6 billion comprised contract spending. The military spending per resident in the state is $3,084.\n\n12. Alabama\n\nTotal Defense Spending in State: $14 billion\n\nShare of Overall DoD Spending: 2.51%\n\nThere are ten military installations in the state of Alabama, according to the DoD. In 2022, $14 billion were spent by the US military in the state of which $10.3 billion went into DoD contracts, while $3.5 billion was expensed on payroll.\n\n11. Washington\n\nTotal Defense Spending in State: $14.6 billion\n\nShare of Overall DoD Spending: 2.61%\n\nNext up is Washington, where the military spending per resident in 2022 was $1,874, with $14.6 billion spent across the state in defense expenditure during the year. About 51% of the amount was expensed on payrolls.\n\n10. Arizona\n\nTotal Defense Spending in State: $15 billion\n\nShare of Overall DoD Spending: 2.68%\n\nAccording to the DoD, 2.68% of their entire defense expenditure in 2022 was incurred in Arizona. The state is home to around 18 key military installations, and also hosts regional offices of several defense manufacturers, including RTX Corporation (NYSE:RTX) which employs over 12,000 workers in the city of Tucson.\n\n9. Massachusetts\n\nTotal Defense Spending in State: $15.2 billion\n\nShare of Overall DoD Spending: 2.72%\n\nMassachusetts is in ninth spot, with $15.2 billion spent on defense in the state during 2022, which represented 2.72% of DoD’s overall spending. There are 10 key military installations across the state.\n\n8. Pennsylvania\n\nTotal Defense Spending in State: $17.9 billion\n\nShare of Overall DoD Spending: 3.20%\n\nThere are 16 military installations in the state of Pennsylvania. The DoD in 2022 spent close to $18 billion in the state, of which $14.3 billion were accounted for contractual spending.\n\n7. Connecticut\n\nTotal Defense Spending in State: $22.3 billion\n\nShare of Overall DoD Spending: 3.99%\n\nWith $22.3 billion spent on defense in 2022, Connecticut is seventh on our list. The state hosts the General Dynamics Electric Boat (GDEB), a subsidiary of the General Dynamics Corporation (NYSE:GD) that has been the primary manufacturer of submarines for the US Navy for over a century.\n\n6. Maryland\n\nTotal Defense Spending in State: $26.4 billion\n\nShare of Overall DoD Spending: 4.73%\n\nThe state of Maryland is in sixth spot, with over $26 billion expensed on defense during 2022, with two-thirds of the amount being represented by the DoD contracts. An estimated $626 million went into grants, while $8.4 billion were incurred on payrolls.\n\nClick to continue reading and see the Top 5 States Where the US Military Spends the Most Money.\n\nSuggested Articles:\n\n20 Countries With Highest Military Spending In The World NATO Spending by Country Per Capita: Top 15 Countries 15 Countries that will have the Most Powerful Militaries by 2030\n\nDisclosure: None. Top 20 States Where the US Military Spends the Most Money is originally published on Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/top-20-states-where-us-113534370.html",
        "symbols": [
            "0IUC.LSE",
            "0R3E.LSE",
            "BA.US",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "GE.US",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.009,
            "neu": 0.872,
            "pos": 0.119
        }
    }
]