[
    {
        "date": "2024-10-14T12:00:00+00:00",
        "title": "RTX's Raytheon demos KuRFS and Coyote performance against complex UAS threats",
        "content": "U.S. Army tests prove LIDS effectiveness against enemy drones\n\nYUMA PROVING GROUND, Ariz., Oct. 14, 2024 /PRNewswire/ -- Raytheon, an RTX (NYSE: RTX) business demonstrated the capabilities of the Ku-band Radio Frequency Sensor, known as KuRFS, the Coyote™ Block 2 kinetic effector, and the Block 3 non-kinetic effector during the U.S. Army's annual summer test period. Testing requirements against high-speed, maneuvering targets, the systems tested their essential detect and defeat capabilities as part of the Low, slow, small-unmanned aircraft Integrated Defense System, or LIDS, the Army's go-to counter-drone solution.\n\nThe persistent, 360-degree KuRFS radar excelled in a stress test, successfully detecting and tracking a swarm of unmanned aircraft vehicles. Coyote defeated targets, singles and swarms, demonstrating reduced engagement timelines to defeat multiple threats. The tests validated software enhancements made to both systems.\n\n\"These systems were developed to effectively defeat unmanned aircraft systems and designed to easily incorporate updates to outpace this ever-evolving threat,\" said Tom Laliberty, president of Land and Air Defense Systems at Raytheon. \"By continuously building on the combat-proven capabilities and performance of both KuRFS and Coyote, ground forces around the globe can gain a significant advantage in the defense against the threat of enemy drones.\"\n\nKuRFS precision targeting radar and the scaled Ku720-2 XBAEU distributed, mobile sensing radar deliver 360-degree, persistent detection, identification and tracking of airborne threats. The Coyote Block 2 kinetic effector and the Block 3 non-kinetic effector defeated multiple drones varying in size and maneuverability.\n\nThe U.S. Army is currently bolstering its counter-drone defenses through a series of recent contracts totaling $374.8 million to equip customers with LIDS. These include a contract that supports a fourth division with systems and support services.\n\nDemand for the combat-proven Coyote kinetic effector has increased. Raytheon has further invested in test equipment and tooling to support and sustain increased capacity ahead of schedule.\n\nAbout Raytheon\r\nRaytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nStory continues\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-raytheon-demos-kurfs-and-coyote-performance-against-complex-uas-threats-302274562.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-raytheon-demos-kurfs-coyote-120000078.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.875,
            "neg": 0.102,
            "neu": 0.753,
            "pos": 0.145
        }
    },
    {
        "date": "2024-10-14T11:07:00+00:00",
        "title": "Why Is the Pentagon Buying $12 Billion Worth of Bombs and Missiles From Boeing, Lockheed Martin, and RTX?",
        "content": "The Pentagon's fiscal year 2024 has come to an end. And just like the end of every year, the Pentagon ended with more of a bang than a whimper.\n\nIn contrast to the usual handful of contracts announced on an average day any other time of the year, the last few days of the Pentagon's fiscal year can see anywhere from dozens to more than a hundred contracts handed out in a single day.\n\nWhy?\n\nPresumably, because the Pentagon has an annual budget, and if it doesn't spend its budget before the year is over, Congress might get the impression that it doesn't need as much money next fiscal year -- and might cut the budget.\n\nThis existential fear of an accidental budget cut causes the Pentagon to shovel contracts out the door as fast as it can as the deadline approaches. And this year, three of America's biggest defense stocks benefited mightily from this spending spree: Boeing(NYSE: BA), Lockheed Martin(NYSE: LMT), and RTX (NYSE: RTX).\n\n$6.9 billion for Boeing\n\nOn Sept. 30, literally the last day of the fiscal year, Boeing landed a monster $6.9 billion order to supply small diameter bombs (SDB) to the U.S. Air Force.\n\nThe Air Force describes the SDB as a 250-pound guided air-to-surface munition that can be deployed by a variety of fighters and bombers, including the F-15E, F-22, F-35, and even by F-16s such are now being delivered to Ukraine. Perhaps not coincidentally, while most of these bombs are on order for the U.S. Air Force, Bulgaria, Japan, and Ukraine are also named as recipients in the Pentagon's contract announcement.\n\n$3.6 billion for Lockheed Martin\n\nNot to be left out of the Pentagon's largesse, Lockheed Martin won two missile contracts on the second-to-last day of the fiscal year. The larger contract, worth $3.2 billion, covers the supply of both joint air-to-surface standoff missiles (JASSM) and long-range anti-ship missiles (LRASM) to the U.S. Air Force and various U.S. allies (Finland, Japan, the Netherlands, and Poland).\n\nThe Air Force describes JASSM as a GPS/INS (that's internation navigation system -- useful when GPS is being jammed)-guided air-to-surface missile used primarily for air-to-ground use. Lockheed clarifies that LRASM is similar, and in fact derived from JASSM's design, but designed primarily to target ships at sea.\n\nA separate contract announced on the same day, worth $358.4 million, relates solely to the supply of LRASM missiles, bringing total missile orders for the company to just under $3.6 billion.\n\n$1.5 billion for RTX\n\nFinally, RTX won three separate contracts worth $1.5 billion in total -- awarded on the same day as Lockheed's contracts.\n\nStory continues\n\nRTX's biggest award, worth $736.6 million, covers the supply of more than 1,100 AIM-9X Sidewinder air-to-air missiles for the U.S. Navy, Air Force, Army, and for foreign allies. For $525.5 million, RTX will also supply Evolved Seasparrow air defense guided missiles for the U.S. Navy and American allies. Finally, RTX will receive $254.5 million for maintenance of standard missiles, also used for air defense.\n\nAdd it all up, and the total bill for all these bombs and missiles comes to a nice, round $12 billion.\n\nWhat it means for investors\n\nBut which of these contracts is most significant from an investor's point of view? Your instinct might be to say, \"Boeing, of course,\" because its $6.9 billion SDB contract is bigger than the five contracts won by Lockheed Martin and RTX combined -- but I think that would be a mistake.\n\nThe $6.9 billion SDB contract, you see, will be run through Boeing's Defense and Space business unit (BDS). It's a big contract, worth nearly 28% of that business's annual revenue. Problem is, BDS isn't currently profitable, and hasn't been for two years. As such, even $6.9 billion in revenue might not be enough to add value (i.e., earn a profit) for Boeing.\n\nContrast that with how even their smaller contracts would benefit the more consistently profitable defense businesses at Lockheed Martin and RTX. Lockheed's missiles and fire control (MFC) division earns the best operating profit margin of any of these defense contractors -- nearly 13% of the revenue it collects. According to data from S&P Global Market Intelligence, RTX earns less, about 9% margin at its Raytheon defense business. Applied to their respective missile contracts, this implies that RTX's contracts could result in about a 2% increase over 2023 operating profit, while Lockheed's earnings could grow 5%.\n\nAdmittedly, these numbers seem like small improvements in the context of the multibillion-dollar defense contracts the companies have just won. This just goes to show that it takes a lot of money to move the needle on businesses as big as Lockheed ($67.6 billion in 2023 revenue) and RTX ($68.9 billion). Still, in each case, at least the contracts will move the needle, and will add profit for investors.\n\nUltimately, this makes RTX stock a better bet than Boeing, and Lockheed Martin stock arguably the best choice of all.\n\nShould you invest $1,000 in Boeing right now?\n\nBefore you buy stock in Boeing, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Boeing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $826,069!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of October 7, 2024\n\nRich Smith has no position in any of the stocks mentioned. The Motley Fool recommends Lockheed Martin and RTX. The Motley Fool has a disclosure policy.\n\nWhy Is the Pentagon Buying $12 Billion Worth of Bombs and Missiles From Boeing, Lockheed Martin, and RTX? was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/why-pentagon-buying-12-billion-110700046.html",
        "symbols": [
            "BA.US",
            "LMT.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.038,
            "neu": 0.836,
            "pos": 0.126
        }
    }
]