[
    {
        "date": "2024-08-06T13:00:00+00:00",
        "title": "NSPA awards RTX's Raytheon a $478 million Patriot GEM-T missile contract",
        "content": "Additional missiles to replenish German inventory\n\nANDOVER, Mass., Aug. 6, 2024 /PRNewswire/ -- Raytheon, an RTX (NYSE: RTX) business, was awarded a $478 million contract from the NATO Support and Procurement Agency (NSPA) to supply additional GEM-T missiles to Germany. This contract supports the replenishment of Patriot missiles donated by Germany to Ukraine. Showing their strong support for Ukraine, Denmark, the Netherlands and Norway have agreed to participate in the financing of this procurement.\n\n\"Our customers are already realizing the benefits of bundled, multi-national procurement of Patriot missiles through NSPA, including the economies that offer greater affordability and the pre-negotiated contracting framework that shortens the acquisition timeline,\" said Tom Laliberty, president of Land and Air Defense Systems at Raytheon. \"As a result, not only can we better support the missile inventories for these European partners, but also strengthen our cooperation, their interoperability, and their contribution to an essential NATO mission.\"\n\nMs Stacy A. Cummings, NSPA General Manager, confirmed: \"This contract demonstrates once again that NSPA, as NATO's lead organization for multinational acquisition, support and sustainment, delivers effective and cost-efficient multinational solutions to nations, while reinforcing European industrial capacities. Through close Euro-Atlantic cooperation between allies and industry, customer nations have achieved economies of scale, reduced their logistics footprint, and are obtaining capable solutions and support through a proven turnkey legal framework.\"\n\nGEM-T, the Patriot Advanced Capability 2 (PAC-2) missile interceptor enhanced for defeating tactical ballistic missiles, is a primary effector for the combat-proven Patriot® air and missile defense system. Patriot is relied upon by eight European nations, and Ukraine, for defense against cruise missiles, ballistic missiles, and enemy drones and aircraft. The system is the foundation of air defense for 19 countries, and it continues to demonstrate its effectiveness against the most advanced and complex threats.\n\nAbout Raytheon Raytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nStory continues\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/nspa-awards-rtxs-raytheon-a-478-million-patriot-gem-t-missile-contract-302215211.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/nspa-awards-rtxs-raytheon-478-130000543.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.037,
            "neu": 0.78,
            "pos": 0.184
        }
    }
]