[
    {
        "date": "2024-06-11T16:52:14+00:00",
        "title": "Older worker accuses defense contractor of discriminating by seeking recent college grads",
        "content": "BOSTON (AP) — A major defense contractor was sued Tuesday over allegations that it discriminated against older workers in job ads.\n\nThe class action filed in federal court in Boston accuses RTX Corporation of posting ads that target younger workers at the expense of their older peers in violation of the federal Age Discrimination in Employment Act, the Massachusetts Fair Employment Practices Act, and the Virginia Human Rights Act.\n\nRTX, formerly Raytheon Technologies Corporation, is an American multinational aerospace and defense conglomerate headquartered in Arlington, Virginia. The lawsuit alleges it posted ads seeking job applicants who are recent graduates or have less than two years' experience, which excluded older workers from consideration or deterred them from applying in the first place.\n\nThe lawsuit challenges a practice that is widespread among U.S. employers, even those facing a shortages of workers.\n\n“Americans are living and working longer than ever, yet unfair and discriminatory hiring practices are keeping older workers from jobs they’re qualified for,” the AARP Foundation's senior vice president for litigation, William Alvarado Rivera, said in a statement. “Raytheon’s intentional discrimination against experienced job candidates, simply because of their age, is illegal and unacceptable.”\n\nThe company did not immediately respond to a request for comment.\n\nA 2023 AARP survey found that nearly one in six adults reported they were not hired for a job they applied for within the past two years because of their age. Half of job seekers reported they were asked by an employer to produce provide their birthdate during the application or interview process.\n\nAbout half of Americans also think there’s age discrimination in the workplace, according to a poll by The Associated Press-NORC Center for Public Affairs Research. But there’s a split by age. The poll finds 60% of adults age 60 and over say older workers in the U.S. are always or often discriminated against, while 43% of adults younger than 45 say the same.\n\nThe suit was filed by the AARP Foundation, Peter Romer-Friedman Law, and Outten & Goldenm, whose managing partner, Adam Klein, said it should serve as a warning to other big companies engaged in such discrimination.\n\n“Fortune 500 companies should know better than to exclude hardworking older Americans from jobs by targeting ‘recent college graduates’ in hiring posts,” Klein said in a statement, adding that the Equal Employment Opportunity Commission “has long held that this type of language discourages qualified older workers from applying for jobs.”\n\nStory continues\n\nThe plaintiff in the case, Mark Goldstein, 67, alleges he applied for several positions at the company since 2019. Goldstein filed a complaint with the EEOC alleging he wasn't considered for these jobs, and the EEOC found he was denied due to his age. The EEOC also found Raytheon's job advertisements violated the ADEA, the lawsuit says.\n\nThe lawsuit is demanding that the company end practices that discriminate against Goldstein and the “tens of thousands\" of potential members of the class action who \"have applied, attempted to apply, or have been interested in applying” for jobs. It also demands that the company institute policies that provide “equal employment opportunities for all employees” regardless of their age, and pay damages including backpay to Goldstein and other affected workers.\n\nView comments",
        "link": "https://finance.yahoo.com/news/older-worker-accuses-defense-contractor-165214334.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.975,
            "neg": 0.087,
            "neu": 0.876,
            "pos": 0.036
        }
    },
    {
        "date": "2024-06-11T10:15:00+00:00",
        "title": "3 Stocks Over $100 You Should Buy Now: June 2024",
        "content": "The $100 per share price point is a magical threshold for many investors and companies. Stocks priced below that amount are considered affordable while those above it are “expensive.” It is why when many companies announce a stock split the ratio applied is typically sufficient to get the shares below $100.\n\nFor example, Chipotle Mexican Grill (NYSE:CMG) trades at over $3,100 per share. Its shareholders just approved a 50-to-1 stock split, one of the largest splits in the history of the New York Stock Exchange. When completed, CMG stock will trade for around $63 a share.\n\nChipotle could have split its stock 2-to-1, 3-to-1 or even 10-to-1 but it wouldn’t have been enough. Even at 20-to-1, Chipotle stock would still trade for more than $150 a stub. It is a psychological barrier that companies feel the need to break through. Yet whether Chipotle Mexican Grill costs $3,100 or $63, it is still a great stock to own. It is not the price that matters but the business underlying that is important.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nMaybe you can’t afford a stock costing thousands of dollars and don’t have access to a brokerage that will let you buy fractional shares. That’s okay. There are still plenty of stocks over $100 to buy that will make great investments without breaking the bank.\n\nTJX Companies (TJX) An outside shot of a T.J. Maxx (TJX) store in Romeoville, Illinois.\n\nSource: Joe Hendrickson / Shutterstock.com\n\nOff-price retailer TJX Companies (NYSE:TJX) is a great place to start your hunt for excellent stocks over $100 to buy. The owner of TJ Maxx, Marshalls, HomeGoods and more, has a long history of market outperformance, even during a recession. Perhaps especially during recessions.\n\nHelping consumers get great deals on name brand products has been the hallmark of TJX business. Through all types of business and economic cycles, the retailer has maintained a steady upward trajectory. Since its 1989 initial public offering, TJX gave investors a total return of 30,610% versus just 3,000% for the S&P 500. The change in stock price alone generated 18,000% returns for investors.\n\nTJX Companies stock goes for around $107 per share and though its valuation is slightly elevated compared to historical norms, it remains one of the stocks over $100 to buy. The retailer continues to see rising sales, profits and margins. As the economy becomes more difficult, consumers looking for a bargain while trying to look good will return again and again to its retail banners.\n\nRTX (RTX) A booth showcasing various technologies offered by Raytheon.\n\nSource: Jordan Tan / Shutterstock.com\n\nRTX (NYSE:RTX) is the second-largest defense contractor producing much of the U.S. military’s missile defense systems. Among its many platforms, RTX is responsible for the Patriot missile system, Stinger and Javelin missiles, high-speed, anti-radiation missiles (HARMS) and national surface-to-air missile systems (NASAMS).\n\nStory continues\n\nLike death and taxes, the reality is that war will always be with us. Yet as President Theodore Roosevelt once said, “speak softly and carry a big stick.” RTX is a big part of the U.S. military’s “big stick.” Preparedness ensures wars needn’t be fought on U.S. soil.\n\nThe defense contractor generated $19.2 billion in Q1 sales, a 12% increase. GAAP profits soared 32% to $1.32 per share. Adjusted earnings rose 10% to $1.34 per share. The future looks just as strong. RTX President and COO Chris Calio said, “We’re operating in one of the strongest demand periods in our history with a record $202 billion backlog.”\n\nThe war in Ukraine certainly fuels a lot of the demand for RTX weapons systems. During the quarter it booked $282 million for NASAMS for Ukraine. But the military contractor also booked $1.6 billion for Patriot systems for Germany, $818 million for Patriot-guided enhance missiles (GEM-T) for NATO and another $874 million for various international GEM-T orders.\n\nI’ve long expected RTX stock to hit an inflection point because of all the global hot spots that erupted over the last four years. Shares have more than doubled in that time frame, and trade at $108 today. Yet RTX stock is up over 50% since just last October. War is big business and RTX is one of the biggest to benefit from it.\n\nAxcelis Technologies (ACLS) Image of the Axcelis (ACLS) logo on a web browser amplified through the lens of a magnifying glass\n\nSource: Pavel Kapysh / Shutterstock.com\n\nThe third stock over $100 to buy is Axcelis Technologies (NASDAQ:ACLS), a manufacturer of ion implantation systems that are critical to the chip-making process. As the complexity of computer chips has grown, the number of implant steps increased with it. Implantation is a form of introducing impurities into a semiconductor to its electrical, optical and structural properties.\n\nAxcelis is the second-largest provider of implantation systems behind Applied Materials (NASDAQ:AMAT) and has a 28% share of the market. It is the only company offering a broad range of equipment for the process. It is the fastest-growing one in the field.\n\nWhere Axcelis Technologies stock had been trading at $111 per share recently, Bank of America upgraded its price target to $125 and the stock immediately took off to meet the new target. The consensus view on Wall Street has a one-year price target of $146 per share, implying an additional 16% upside in the stock.\n\nPresident and CEO Russell Low said Axcelis was “off to a good start in 2024” after posting first-quarter results as the tech stock’s products “continue to win business from new customers globally.” It makes the tech equipment leader an excellent stock over $100 to buy.\n\nOn the date of publication, Rich Duprey held a LONG position in RTX stock. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nRich Duprey has written about stocks and investing for the past 20 years. His articles have appeared on Nasdaq.com, The Motley Fool, and Yahoo! Finance, and he has been referenced by U.S. and international publications, including MarketWatch, Financial Times, Forbes, Fast Company, USA Today, Milwaukee Journal Sentinel, Cheddar News, The Boston Globe, L’Express, and numerous other news outlets.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 3 Stocks Over $100 You Should Buy Now: June 2024 appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-stocks-over-100-buy-101500048.html",
        "symbols": [
            "0LCE.LSE",
            "5UR.F",
            "5UR.XETRA",
            "ACLS.US",
            "AMAT.US",
            "CMG.US",
            "RTX.US",
            "RYTT34.SA",
            "TJX.BE",
            "TJX.F",
            "TJX.MU",
            "TJX.MX",
            "TJX.STU",
            "TJX.US",
            "TJXC34.SA",
            "XXA1.F",
            "XXA1.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.049,
            "neu": 0.833,
            "pos": 0.118
        }
    },
    {
        "date": "2024-06-11T00:00:00+00:00",
        "title": "3 Stocks Over $100 You Should Buy Now: June 2024",
        "content": "Cheap stocks are often cheap for a reason, so when finding stocks over $100 to buy it is because they have a business supporting the price. ",
        "link": "https://investorplace.com/2024/06/3-stocks-over-100-you-should-buy-now-june-2024/",
        "symbols": [
            "ACLS.US",
            "RTX.US",
            "TJX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.44,
            "neg": 0,
            "neu": 0.888,
            "pos": 0.112
        }
    }
]