[
    {
        "date": "2024-07-19T08:00:00+00:00",
        "title": "RTX's Pratt &amp; Whitney and SR Technics announce first GTF engine induction",
        "content": "Swiss shop becomes the 17th active facility in growing GTF MRO network\n\nEAST HARTFORD, Conn., July 19, 2024 /PRNewswire/ -- Pratt & Whitney, an RTX (NYSE: RTX) business, and SR Technics announced today the induction of the first Pratt & Whitney GTF™ engine at the MRO service provider's Zurich-based facility. SR Technics will provide full disassembly, assembly and test capability for the PW1100G-JM engine for the Airbus A320neo aircraft family.\n\n\"Today, we extend our relationship with SR Technics, which began 35 years ago with maintenance on the PW4000 engine,\" said Marc Meredith, vice president of commercial aftermarket for GTF engines at Pratt & Whitney. \"With their top-tier performance history, SR Technics will continue to deliver industry-leading services providing vital support for the expanding GTF fleet.\"\n\nPratt & Whitney is committed to expanding GTF MRO capacity with industry-leading providers such as SR Technics to support the growing aftermarket demand. In 2023 alone, Pratt & Whitney announced three GTF MRO facility expansions and six shop activations to support the growing GTF fleet. SR Technics, which joined the Pratt & Whitney GTF MRO network in 2022, marks the 17th active location and the seventh facility in Europe.\n\n\"With the first induction of the GTF engine, we are fulfilling our strategy to continuously expand our capabilities,\" said Owen McClave, chief executive officer at SR Technics. \"In maintaining the GTF engine, we will not only be able to support more global customers, but we are also adding to the skillset of our talented employees in Zurich.\"\n\nThe GTF MRO network is part of Pratt & Whitney EngineWise® solutions which provide operators with a full range of aftermarket services resulting in long-term, sustainable value. For more information, visit prattwhitney.com/enginewise.\n\nAbout Pratt & Whitney\r\nPratt & Whitney is a world leader in the design, manufacture and service of aircraft engines and auxiliary power units. To learn more visit www.prattwhitney.com.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com. Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-pratt--whitney-and-sr-technics-announce-first-gtf-engine-induction-302201397.html\n\nSOURCE RTX",
        "link": "https://finance.yahoo.com/news/rtxs-pratt-whitney-sr-technics-080000007.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.987,
            "neg": 0.011,
            "neu": 0.872,
            "pos": 0.117
        }
    }
]