[
    {
        "date": "2024-07-28T23:41:37+00:00",
        "title": "Former Rockwell Collins chief being considered for Boeing CEO, report says",
        "content": "Former Rockwell Collins chief Kelly Ortberg has joined the list of contenders under serious consideration by Boeing as the planemaker's next chief executive officer, The Air Current reported on Sunday, citing industry officials.",
        "link": "https://www.reuters.com/business/aerospace-defense/former-rockwell-collins-chief-being-considered-boeing-ceo-report-says-2024-07-28/",
        "symbols": [
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.077,
            "neg": 0.039,
            "neu": 0.961,
            "pos": 0
        }
    },
    {
        "date": "2024-07-28T12:00:14+00:00",
        "title": "Insiders Who Sold US$4.2m Of RTX Made The Right Call",
        "content": "While it’s been a great week for RTX Corporation (NYSE:RTX) shareholders after stock gained 11%, they should consider it with a grain of salt. In spite of the relatively cheap prices, insiders made the decision to sell US$4.2m worth of stock in the last 12 months. This could be a warning indicator of vulnerabilities in the future.\n\nAlthough we don't think shareholders should simply follow insider transactions, we would consider it foolish to ignore insider transactions altogether.\n\nView our latest analysis for RTX\n\nThe Last 12 Months Of Insider Transactions At RTX\n\nThe President of Pratt & Whitney, Shane Eddy, made the biggest insider sale in the last 12 months. That single transaction was for US$3.2m worth of shares at a price of US$91.19 each. That means that an insider was selling shares at slightly below the current price (US$114). We generally consider it a negative if insiders have been selling, especially if they did so below the current price, because it implies that they considered a lower price to be reasonable. While insider selling is not a positive sign, we can't be sure if it does mean insiders think the shares are fully valued, so it's only a weak sign. This single sale was 84% of Shane Eddy's stake.\n\nInsiders in RTX didn't buy any shares in the last year. You can see a visual depiction of insider transactions (by companies and individuals) over the last 12 months, below. If you want to know exactly who sold, for how much, and when, simply click on the graph below! insider-trading-volume\n\nIf you like to buy stocks that insiders are buying, rather than selling, then you might just love this freelist of companies. (Hint: Most of them are flying under the radar).\n\nRTX Insiders Are Selling The Stock\n\nThe last three months saw significant insider selling at RTX. In total, Director Robert Ortberg dumped US$1.0m worth of shares in that time, and we didn't record any purchases whatsoever. This may suggest that some insiders think that the shares are not cheap.\n\nDoes RTX Boast High Insider Ownership?\n\nI like to look at how many shares insiders own in a company, to help inform my view of how aligned they are with insiders. We usually like to see fairly high levels of insider ownership. It's great to see that RTX insiders own 0.1% of the company, worth about US$145m. Most shareholders would be happy to see this sort of insider ownership, since it suggests that management incentives are well aligned with other shareholders.\n\nWhat Might The Insider Transactions At RTX Tell Us?\n\nAn insider hasn't bought RTX stock in the last three months, but there was some selling. And even if we look at the last year, we didn't see any purchases. It is good to see high insider ownership, but the insider selling leaves us cautious. In addition to knowing about insider transactions going on, it's beneficial to identify the risks facing RTX. At Simply Wall St, we've found that RTX has 5 warning signs (1 is significant!) that deserve your attention before going any further with your analysis.\n\nStory continues\n\nIf you would prefer to check out another company -- one with potentially superior financials -- then do not miss this freelist of interesting companies, that have HIGH return on equity and low debt.\n\nFor the purposes of this article, insiders are those individuals who report their transactions to the relevant regulatory body. We currently account for open market transactions and private dispositions of direct interests only, but not derivative transactions or indirect interests.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/insiders-sold-us-4-2m-120014063.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.98,
            "neg": 0.048,
            "neu": 0.862,
            "pos": 0.09
        }
    }
]