[
    {
        "date": "2024-05-23T15:30:41+00:00",
        "title": "RTX (RTX) Up 5.2% Since Last Earnings Report: Can It Continue?",
        "content": "A month has gone by since the last earnings report for RTX (RTX). Shares have added about 5.2% in that time frame, outperforming the S&P 500.\n\nWill the recent positive trend continue leading up to its next earnings release, or is RTX due for a pullback? Before we dive into how investors and analysts have reacted as of late, let's take a quick look at the most recent earnings report in order to get a better handle on the important drivers.\n\nRTX Q1 Earnings Surpass Estimates by 9%, Sales Increase Y/Y\n\nRTX Corporation’s first-quarter 2024 adjusted earnings per share (EPS) of $1.34 beat the Zacks Consensus Estimate of $1.23 by 8.9%. The bottom line also improved 9.8% from the year-ago quarter’s level of $1.22.\n\nIncluding one-time items, the company reported GAAP earnings of $1.28 per share compared with 97 cents in the prior-year quarter.\n\nOperational Performance\n\nRTX’s first-quarter net sales totaled $19,305 million, which surpassed the Zacks Consensus Estimate of $18,412.6 million by 4.8%. The top line also improved 12% from $17,214 million recorded in the first quarter of 2023.\n\nTotal costs and expenses increased 14% year over year to $17,807 million. The company generated an operating profit of $1,870 million compared with $1,687 million in the prior-year quarter.\n\nRTX posted an adjusted operating profit of $2,292 million, up 6.5% from the year-ago quarter’s reported figure of $2,153 million.\n\nSegmental Performance\n\nCollins Aerospace: Sales in this segment totaled $6,673 million, up 9% year over year.  This improvement can be attributed to higher commercial aftermarket and commercial OEM sales, backed by strong demand across commercial aerospace end markets. Increased defense sales driven by higher volume also benefited this unit’s sales.\n\nThe segment’s adjusted operating profit totaled $1,048 million compared with $903 million in the year-ago quarter.\n\nPratt & Whitney: This segment’s sales totaled $6,456 million, up 23% from the year-ago quarter’s level. The improvement was due to growth in the commercial aftermarket and commercial OEM businesses, driven by higher GTF OE volume and favorable mix, and higher aftermarket volume.Increased military sales, driven by higher sustainment volume across multiple platforms, also contributed to this unit’s sales growth.\n\nAdjusted operating profit amounted to $430 million compared with the year-ago quarter’s level of $434 million.\n\nRaytheon: This segment recorded first-quarter sales of $6,659 million, up 6% year over year, driven by higher sales volume from land and air defense systems, including Global Patriot, counter-UAS systems and NASAMS, and advanced technology programs.\n\nStory continues\n\nThe segment’s adjusted operating profit amounted to $630 million, up 8% from $584 million recorded in the corresponding period of 2023.\n\nFinancial Update\n\nRTX had cash and cash equivalents of $5,607 million as of Mar 31, 2024, compared with $6,587 million as of Dec 31, 2023.\n\nLong-term debt totaled $42,334 million as of Mar 31, 2024, up from $42,355 million as of Dec 31, 2023.\n\nNet cash flow from operating activities was $342 million as of Mar 31, 2024, against cash outflow from operating activities of $863 million at the end of first-quarter 2023.\n\nFree cash outflow totaled $125 million at the end of first-quarter 2024 compared with $1,383 million at the end of first-quarter 2023.\n\nGuidance\n\nRTX reiterated its financial guidance for 2024.\n\nThe company still projects adjusted EPS in the band of $5.25-$5.40. The Zacks Consensus Estimate for RTX’s 2024 EPS is pegged at $5.39, higher than the mid-point of the company’s guided range.\n\nRTX continues to expect to generate sales in the band of $78-$79 billion in 2024. The Zacks Consensus Estimate for sales is pegged at $78.63 billion, which lies above the mid-point of the company’s guidance.\n\nThe company still expects free cash flow of $5.7 billion for 2024.\n\nHow Have Estimates Been Moving Since Then?\n\nIn the past month, investors have witnessed a downward trend in estimates revision.\n\nVGM Scores\n\nAt this time, RTX has a subpar Growth Score of D, a grade with the same score on the momentum front. Charting a somewhat similar path, the stock was allocated a grade of C on the value side, putting it in the middle 20% for this investment strategy.\n\nOverall, the stock has an aggregate VGM Score of C. If you aren't focused on one strategy, this score is the one you should be interested in.\n\nOutlook\n\nEstimates have been broadly trending downward for the stock, and the magnitude of these revisions looks promising. Notably, RTX has a Zacks Rank #3 (Hold). We expect an in-line return from the stock in the next few months.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-rtx-5-2-since-153041052.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.01,
            "neu": 0.879,
            "pos": 0.111
        }
    },
    {
        "date": "2024-05-23T14:00:00+00:00",
        "title": "RTX's Collins Aerospace awarded Survivable Airborne Operations Center subcontract",
        "content": "SNC-led team to deliver NC3 capabilities to U.S. Air Force\n\nRICHARDSON, Texas, May 23, 2024 /PRNewswire/ -- Collins Aerospace, an RTX (NYSE: RTX) business was awarded a multi-billion-dollar subcontract as part of a team led by SNC to design, develop and deliver systems and products for a new aircraft under the U.S. Air Force's Survivable Airborne Operations Center (SAOC) program. The SAOC program delivers next-generation of the E-4B National Airborne Operations Center, providing top military leaders with a survivable aircraft to ensure performance of the National Military Command System. (Image source: SNC)\n\nThe SAOC program delivers next-generation of the E-4B National Airborne Operations Center, providing top military leaders with a survivable aircraft to ensure performance of the National Military Command System.\n\nCollins Aerospace is on contract to deliver multiple products from across the business.\n\n\"We're bringing together systems from across RTX to help the team deliver an advanced, survivable airborne operations center to the U.S. Air Force,\" said Conn Doherty, vice president and general manager, Strategic Solutions for Collins Aerospace. \"Our collaboration with SNC leverages the best of our collective engineering and manufacturing expertise. This mission is especially urgent and our decades of experience designing for contested environments is critical to its success.\"\n\nThis team of agile and proven leaders will bring together innovation, speed with discipline, advanced engineering and on-cost and accelerated deliveries to recapitalize the costly and aging E-4B fleet with next-generation capabilities.\n\nAbout Collins Aerospace\n\nCollins Aerospace, an RTX business, is a leader in integrated and intelligent solutions for the global aerospace and defense industry. Our 80,000 employees are dedicated to delivering future-focused technologies to advance sustainable and connected aviation, passenger safety and comfort, mission success, space exploration, and more.\n\nAbout RTX\n\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com. Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/rtxs-collins-aerospace-awarded-survivable-airborne-operations-center-subcontract-302153770.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-collins-aerospace-awarded-survivable-140000728.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.015,
            "neu": 0.83,
            "pos": 0.155
        }
    },
    {
        "date": "2024-05-23T00:19:47+00:00",
        "title": "The Largest Weapon Manufacturer in the World",
        "content": "In this article, we look at the largest weapon manufacturer in the world. If interested, you can also view our recently released complete list of the 15 Largest Weapon Manufacturers in the World.\n\nLatest figures released by the Stockholm International Peace Research Institute (SIPRI) in April this year estimated the global military spending in 2023 at a record-high of $2.44 trillion, up 6.8% compared to 2022. The year witnessed the steepest rise in defense expenditure since 2009, and was the ninth successive year in which defense spending had increased worldwide.\n\nThe United States continued to remain the largest spender on military expenditure in 2023 as well, having incurred a whopping $916 billion in defense bills during the year, growing 2.3% from last year. Washington’s spending represented 37.5% of the world’s military expenditure, and accounted for 68% of all NATO spending. $588 billion was spent by countries in Europe, which was equivalent to 24% of the global share. Of this amount, an overwhelming 69% was expensed in Central and Western Europe. Both Russia and Ukraine substantially increased their military expenditure during the year, whereas other countries in the region actively racked up their defenses as well with war having returned to the continent after decades of peace.\n\nAnother report by SIPRI highlighted that arms imported by countries in Europe between 2019-2023 were 94% higher than the monetary volume in 2014-2018. The United States was the origin of an estimated 55% of all weapons received by Europe, making the country the largest exporter of arms in the world.\n\nThe spike in defense expenditure has resulted in a boom in the defense industry. Lockheed Martin Corporation (NYSE:LMT)’s stock price has surged 29% since the start of the war in Ukraine. Several countries in Europe are eying the company’s famed F-35 fifth-generation fighter, while the production of HIMARS is also in full swing to replenish stocks of allies arming Kyiv. This month, the US Army awarded a $861 million contract to Lockheed Martin Corporation (NYSE:LMT) for the supply of additional HIMARS, believed to be linked to military assistance for Ukraine. According to the Defense Post, the contract did not specify the number of launchers ordered, but is expected to be around 288 based on previous solicitation documents that were seen.\n\nRTX Corporation (NYSE:RTX)’s numbers have also been promising, having posted $68.9 billion in revenue in 2023, with a year-on-year growth of 3%, aided by the ongoing conflict in Europe. Between February 2022, when the war started, and October 2023, the company had received orders worth $3 billion for its AMRAAM rockets alone to assist Ukraine in pushing back advancing Russian troops. Earlier last year in March, RTX Corporation (NYSE:RTX) also won a $1.2 billion contract from Germany to build Patriot air and missile defense systems for the country and boost its air defenses, while in November, Hungary received the delivery of two units of the NASAMS air defense system it had ordered from Kongsberg Defence & Aerospace and RTX Corporation (NYSE:RTX).\n\nStory continues\n\nOn the other hand, General Dynamics Corporation (NYSE:GD) too posted its highest-ever revenue in history last year, totaling $42.3 billion, up 7.7% from the previous year. The company has reported an increase in its artillery production from 14,000 rounds per month to 20,000. The company’s 155 millimeter artillery replacements have played a vital role in Kyiv’s fightback against Russia, which have been regularly provided to the country as part of military assistance by the United States.\n\nWith that said, let’s take a look at the largest weapon manufacturer in the world. The Largest Weapon Manufacturer in the World\n\nMethodology\n\nTo compile the list, we ranked the largest weapon manufacturers in the world in ascending order of their arms revenue in 2022. This is the latest year for which revenue breakdown is available for all major defense companies in the world. Data has been sourced from the Stockholm International Peace Research Institute (SIPRI).\n\nThe largest weapon manufacturer in the world is Lockheed Martin Corporation (NYSE:LMT).\n\n1. Lockheed Martin Corporation (NYSE:LMT)\n\nCountry of Origin: United States\n\nTotal Revenue in 2022: $65.98 billion\n\nArms Revenue in 2022: $59.39 billion\n\nShare of Overall Revenue: 90%\n\nLockheed Martin Corporation (NYSE:LMT) is the largest weapon manufacturer in the world, with over $59 billion worth of arms revenue in 2022 – three-fourths of which came from over $45 billion in DoD contracts. It is the manufacturer of the famed F-35 fifth-generation fighter jet, and the company is likely to retain its status as a cornerstone for the US Air Force as it works alongside other partners in the industry on the Next Generation Air Dominance (NGAD) program to build a sixth-generation fighter.\n\nYou can see the rest of the rankings here.\n\nIf you are looking for states where the US military spends the most funds, you can head over to our article on the Top 20 States Where the US Military Spends the Most Money.\n\nREAD NEXT:15 Biggest Aircraft Carriers in the World\n\nDisclosure: None. This article is originally published on Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/largest-weapon-manufacturer-world-001947620.html",
        "symbols": [
            "0IUC.LSE",
            "0R3E.LSE",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.04,
            "neu": 0.847,
            "pos": 0.114
        }
    }
]