[
    {
        "date": "2024-09-13T13:50:12+00:00",
        "title": "Here's Why RTX (RTX) is a Strong Momentum Stock",
        "content": "For new and old investors, taking full advantage of the stock market and investing with confidence are common goals.\n\nAchieving those goals is made easier with the Zacks Style Scores, a unique set of guidelines that rates stocks based on popular investing methodologies, namely value, growth, and momentum. The Style Scores can help you narrow down which stocks are better for your portfolio and which ones can beat the market over the long-term.\n\nIs This 1 Momentum Stock a Screaming Buy Right Now?\n\nFor momentum investors, upward or downward trends in a stock's price or earnings outlook take precedent, so they'll want to zero in on the Momentum Style Score. This Score can pinpoint good times to build a position in a stock, using factors like one-week price change and the monthly percentage change in earnings estimates.\n\nRTX (RTX)\n\nIn July 2023, Raytheon Technologies was renamed as RTX Corporation. On Apr 3, 2020, Raytheon Technologies was formed following the completion of merger between United Technologies and Raytheon Company. Based in Waltham, MA, Raytheon Technologies has emerged as an aerospace and defense company, with pro-forma combined annual revenues of $74 billion as of the end of 2019, providing advanced systems and services for commercial, military and government customers worldwide. Effective July 2023, the company operates through three business segments.\n\nRTX boasts a Momentum Style Score of B and VGM Score of B, and holds a Zacks Rank #3 (Hold) rating. Shares of RTX has seen some interesting price action recently; the stock is up 0.4% over the past one week and up 1.5% over the past four weeks. And in the last one-year period, RTX has gained 59.1%. As for the stock's trading volume, 4,436,172.50 shares on average were traded over the last 20 days.\n\nA company's earnings performance is important for momentum investors as well. For fiscal 2024, six analysts revised their earnings estimate higher in the last 60 days for RTX, while the Zacks Consensus Estimate has increased $0.05 to $5.45 per share. RTX also boasts an average earnings surprise of 6.6%.\n\nInvestors should take the time to consider RTX for their portfolios due to its solid Zacks Ranks, notable earnings metrics, and impressive Momentum and VGM Style Scores.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/heres-why-rtx-rtx-strong-135012397.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.006,
            "neu": 0.837,
            "pos": 0.157
        }
    }
]