[
    {
        "date": "2024-06-06T14:00:00+00:00",
        "title": "RTX provides Blue Canyon Satellites for NASA Polar climate mission",
        "content": "Twin CubeSats will improve Earth climate modeling\n\nLAFAYETTE, Colo., June 6, 2024 /PRNewswire/ -- RTX's (NYSE: RTX) small satellite manufacturer and mission services provider, Blue Canyon Technologies, has established communication with both CubeSats for the NASA PREFIRE (Polar Radiant Energy in the Far InfraRed Experiment) mission. The PREFIRE mission will measure the amount of heat Earth emits into space from the Arctic and Antarctica. Blue Canyon Technologies has successfully made contact with NASA's twin PREFIRE CubeSats. Credit: NASA/JPL\n\nBlue Canyon provided two heritage 6U CubeSats for the mission, which is managed by NASA's Jet Propulsion Laboratory for the agency's Science Mission Directorate. Analysis of PREFIRE's measurements will inform climate and ice models, helping to improve projections of how a warming world will affect sea ice loss, ice sheet melt and sea level rise.\n\n\"Improving climate models can provide more accurate projections on the impacts of storm severity and frequency, as well as coastal erosion and flooding,\" said Chris Winslett, general manager for Blue Canyon Technologies.\n\nThe PREFIRE project was jointly developed by NASA and the University of Wisconsin-Madison. JPL provided the thermal infrared spectrometer payload, and the University of Wisconsin-Madison will process the data collected by the instruments.\n\nAbout Blue Canyon Technologies Blue Canyon Technologies (BCT), RTX's small satellite manufacturer and mission services provider, offers a diverse portfolio of innovative, reliable, and affordable spacecraft and components that enable a broad range of missions and technological advancements for the new space economy. The company currently supports numerous unique missions with over 100 cumulative spacecraft orders.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/rtx-provides-blue-canyon-satellites-for-nasa-polar-climate-mission-302165691.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-provides-blue-canyon-satellites-140000655.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.987,
            "neg": 0.013,
            "neu": 0.865,
            "pos": 0.122
        }
    },
    {
        "date": "2024-06-06T11:00:00+00:00",
        "title": "IAE AG and FTAI Aviation Sign Strategic V2500® Engine Maintenance Services Agreement",
        "content": "FTAI Aviation Ltd.\n\nOne of IAE’s largest engine maintenance agreements by number of engines with a non-airline customer V2500-engine\n\nThe V2500® engine powers commercial, cargo and military aircraft, and has a long track record of providing reliable and efficient performance (Source: Pratt & Whitney)\n\nNEW YORK, June 06, 2024 (GLOBE NEWSWIRE) -- FTAI Aviation Ltd. (NASDAQ: FTAI) and IAE International Aero Engines AG (IAE) today announced a five-year EngineWise® maintenance services agreement for V2500 engines. The agreement includes over 100 full performance restoration shop visits. IAE is a multinational consortium comprised of Pratt & Whitney, an RTX (NYSE: RTX) business, Pratt & Whitney Aero Engines International GmbH, Japanese Aero Engines Corporation and MTU Aero Engines AG.\n\n“FTAI’s expansion of V2500 offerings is a testament to the engine’s reliability and value to lessors,” said Kim Kinsley, president, IAE AG, and vice president, Mature Commercial Engines at Pratt & Whitney. “We are committed to working with FTAI on V2500 engine maintenance to optimize fleet performance for FTAI’s customers around the world.”\n\n“We look forward to collaborating with IAE to restore these engines together,” said Joe Adams, CEO, FTAI Aviation. “We are committed to the V2500 engine and see tremendous demand for it in the next decade. Teaming up with IAE allows us to extend the life of the V2500 fleet while providing flexible engine power to our airline customers.”\n\nFTAI Aviation focuses on engine leasing, revolutionizing the approach to how lessors serve operators by offering a variety of standalone engines and unique maintenance products to support their fleets. FTAI currently owns and is committed to over 140 V2500 engines and looks to grow its portfolio to 200 by 2025.\n\nThe V2500 engine offers the most fuel-efficient propulsion system in its class, with up to 3% fuel burn and emissions advantage over prior generation engines. It is a versatile engine, powering commercial, cargo and military platforms, with a long track record of providing reliable and efficient performance.\n\nThe V2500 engine is backed by an established global network of 13 facilities for maintenance, repair and overhaul, including eight IAE partner facilities, of which three are managed by Pratt & Whitney and its joint ventures: the Turkish Engine Center in Istanbul, the Shanghai Engine Center in China and the Christchurch Engine Center in New Zealand.\n\nPratt & Whitney's EngineWise service portfolio provides engine operators with a variety of aftermarket services to maximize engine performance and fleet availability. Visit http://www.EngineWise.com for more information.\n\nStory continues\n\nAbout FTAI Aviation Ltd. FTAI owns and maintains commercial jet engines with a focus on engines for the A320ceo fleet. FTAI’s proprietary portfolio of products enables it to provide cost savings and flexibility to its airline, lessor, and maintenance, repair, and operations customer base. Additionally, FTAI owns and leases jet aircraft which often facilitates the acquisition of engines at attractive prices. FTAI invests in aviation assets and aerospace products that generate strong and stable cash flows with the potential for earnings growth and asset appreciation. To learn more visit: www.ftaiaviation.com.\n\nAbout Pratt & Whitney\r\nPratt & Whitney is a world leader in the design, manufacture and service of aircraft engines and auxiliary power units. To learn more visit www.prattwhitney.com.\n\nAbout RTX\r\nRTX is the world's largest aerospace and defense company. With more than 185,000 global employees, we push the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – RTX is advancing aviation, engineering integrated defense systems for operational success, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $68.9 billion, is headquartered in Arlington, Virginia.\n\nCautionary Note Regarding Forward-Looking Statements \r\nThis communication contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, including but not limited to the ability to extend the life of the V2500 fleet, and FTAI’s ability to grow its V2500 portfolio to 200 by 2025. You can identify these forward-looking statements by the use of forward-looking words such as “outlook,” “believes,” “expects,” “potential,” “continues,” “may,” “will,” “should,” “could,” “seeks,” “approximately,” “predicts,” “intends,” “plans,” “estimates,” “anticipates,” “target,” “projects,” “contemplates” or the negative version of those words or other comparable words. Any forward-looking statements contained in this communication are based upon our historical performance and on our current plans, estimates and expectations in light of information currently available to us. The inclusion of this forward-looking information should not be regarded as a representation by us that the future plans, estimates or expectations contemplated by us will be achieved. Such forward-looking statements are subject to various risks and uncertainties and assumptions relating to our operations, financial results, financial condition, business, prospects, growth strategy and liquidity. Accordingly, there are or will be important factors that could cause our actual results to differ materially from those indicated in these statements, including, but not limited to, the risk factors set forth in Item 1A. “Risk Factors” of FTAI’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023 and FTAI’s Quarterly Reports on Form 10-Q, as updated by annual, quarterly and other reports FTAI files with the SEC.\n\nThe information contained on, or accessible through, any websites included in this press release is not incorporated by reference into, and should not be considered a part of, this press release.\n\nFor further information, please contact:\n\nAlan Andreini\r\nInvestor Relations\r\nFTAI Aviation Ltd.\r\n(646) 734-9414\r\naandreini@fortress.com\n\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/25840c64-23a5-4bab-a350-d865c0c26be6\n\nView comments",
        "link": "https://finance.yahoo.com/news/iae-ag-ftai-aviation-sign-110000804.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "FTAI.US",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.988,
            "neg": 0.019,
            "neu": 0.897,
            "pos": 0.084
        }
    }
]