[
    {
        "date": "2024-07-29T17:04:00+00:00",
        "title": "Jet Engines Need Constant Repairs. Their Manufacturers Are Raking In Cash.",
        "content": "Many in the aviation industry are railing against misaligned incentives in the engine-making business, which makes profit through repair-shop visits and spare parts.\n\nContinue reading\n\nView comments",
        "link": "https://finance.yahoo.com/m/64be58e4-7fb2-3208-8838-a013f158cde0/jet-engines-need-constant.html",
        "symbols": [
            "0BOE.LSE",
            "0KVV.IL",
            "0KVV.LSE",
            "0R2N.LSE",
            "1AIR.MI",
            "5UR.F",
            "5UR.XETRA",
            "AIR.F",
            "AIR.MC",
            "AIR.PA",
            "AIR.STU",
            "AIR.XETRA",
            "AIRA.BE",
            "AIRA.F",
            "AIRA.MU",
            "AIRA.STU",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.637,
            "neg": 0,
            "neu": 0.828,
            "pos": 0.172
        }
    },
    {
        "date": "2024-07-29T12:00:00+00:00",
        "title": "RTX's Raytheon awarded Mentor Protégé agreements to develop operational AI",
        "content": "The collaboration will leverage commercial and defense technologies to enhance decision making\n\nMCKINNEY, Texas, July 29, 2024 /PRNewswire/ -- Raytheon, an RTX (NYSE: RTX) business, was awarded two strategic Mentor-Protégé Agreement initiatives from the Department of the Navy Office of Small Business Programs to support the development of operational Artificial Intelligence for Department of Defense platforms and programs.\n\nThrough joint sponsorship from NAVAIR and the Office of Naval Research, Raytheon will mentor Anacapa Micro Products, Inc. and Nara Logics, Inc. Under two individual three-year contracts, Raytheon will provide mentorship for operational AI on system design, software architecture, systems integration, IT security constraints and authority-to-operate requirements in a collaborative environment.\n\n\"The Mentor Protégé Program is an essential element of our overall supplier diversity small business strategy,\" said Colin Whelan, president of Advanced Technology at Raytheon. \"Through this partnership, we'll leverage commercial innovations that can make meaningful contributions to our defense capabilities and ultimately, the success of our servicemen and women.\"\n\nThis collaboration is part of the DoD's Mentor-Protégé Program, which was established in 1990 and is the oldest continuously operating federal mentor-protégé program in existence. Raytheon has been an active participant in the program since 1991.\n\nTogether, the team of Raytheon, Anacapa, and Nara Logics will work to accelerate the development of next-generation autonomous capabilities to enhance the decision-making effectiveness of our servicemen and women.\n\n\"We are privileged to participate in this Mentor Protégé relationship that will enhance our joint technical abilities to deliver critical mission support functionality on emerging defense and intelligence platforms,\" said Jana Eggers, CEO of Nara Logics.\n\n\"Our organization is very proud to be a partner with Raytheon under this Mentor Protégé Agreement and we're looking forward to supporting the development, production and testing of next-generation AI to better serve the warfighter,\" said Ken Marks, CEO of Anacapa Micro Products.\n\nUpon completion, Raytheon will possess an extremely robust technology roadmap aligned with emerging commercial technologies of industry leading small business capabilities.\n\nAbout Raytheon\n\nRaytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nStory continues\n\nAbout RTX\n\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-raytheon-awarded-mentor-protege-agreements-to-develop-operational-ai-302208197.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-raytheon-awarded-mentor-prot-120000651.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.014,
            "neu": 0.82,
            "pos": 0.166
        }
    },
    {
        "date": "2024-07-29T01:46:28+00:00",
        "title": "The Country with the Best Military in the World",
        "content": "This article looks at the country that has the best military in the world. To see the full free list, you can head over to the 15 Countries That Have the Best Military in the World.\n\nGlobal Defense Spending\n\nFigures released this April by the Stockholm International Peace Research Institute (SIPRI) estimated global defense spending for 2023 at a record high of $2.44 trillion, having risen 6.8% compared to the previous year. This is the biggest spike in military expenditure since 2009 and the ninth successive year defense spending had increased.\n\nWith defense bills worth a whopping $916 billion during the year, the United States accounted for 37.5% of the world’s total military spending in 2023. The figure was 2.3% higher than last year and represented more than two-thirds (68%) of NATO’s overall defense expenditure in 2023. $588 billion was spent in Europe, which was 16% higher than in 2022, and made up 24% of the global spending. The spike was triggered by a substantial increase in defense spending by both Russia and Ukraine, while several other countries in the region also bolstered their defenses with war returning to the continent after decades of peace.\n\nAsia incurred $560 billion on defense in 2023. The figure was 40% more than what it was a decade ago in 2014. A major chunk of this expenditure came from East Asia and South Asia, while oil-rich monarchies in the Middle East also spent hefty amounts on strengthening their national security.\n\nThe surge in defense spending over the last two years, specifically after Russia’s invasion of Ukraine in February 2022 has created a boom in the global defense industry. The ongoing conflict in the Middle East involving Israel and Hamas has further bolstered their finances. Lockheed Martin Corporation (NYSE:LMT) posted a revenue of $67.6 billion in 2023, representing a 2.4% increase year-over-year. The company’s earnings also grew $1.2 billion compared to 2023.\n\nSince the beginning of the Russia-Ukraine conflict, Lockheed Martin Corporation (NYSE:LMT)’s share price has gained 29%, due to strong demand for its weapons, especially HIMARS, GMLRS, and the F-35 fifth-generation fighter jet. The stock is projected for further growth with no end in sight to the war in Europe and the aggravating situation in the Middle East. In April, this year, the United States announced $95 billion in fresh military aid for Ukraine, Israel, and Taiwan. Experts believe a major chunk of this amount is going to go into the procurement of advanced weapons from companies such as Lockheed Martin Corporation (NYSE:LMT). It is one of the best aerospace and defense stocks to buy now, with 47 hedge funds bullish about the company’s prospects in Q1 2024, according to Insider Monkey.\n\nStory continues\n\nRTX Corporation (NYSE:RTX) is another stock that is flying high amid strong financial results. After a solid 2023, during which it posted nearly $69 billion in revenue, the company had a robust first quarter of 2024 as well, with sales totaling $19.3 billion and registering a 12% YoY growth. Its earnings per share of $1.34 was also 10% higher than in the first quarter of last year. RTX Corporation (NYSE:RTX)’s share price has spiked 15% since the start of the Ukraine war in early 2022.\n\nAnticipating a sustained demand for its weapons, RTX Corporation (NYSE:RTX) expects a total revenue between $78-99 billion for FY2024 and an EPS in the range of $5.25 – $5.40. According to Insider Monkey’s hedge funds database, 62 hedge funds are bullish on the company. Their optimism stems from RTX Corporation (NYSE:RTX)’s impressive backlog of $196 billion, of which $78 billion is related to defense orders, including a $2.8 billion guided-missile order by NATO.\n\nYou can read about other best-performing stocks in the industry by heading over to our recent article on the 10 Best Aerospace and Defense Stocks to Buy Now. The Country with the Best Military in the World\n\nPhoto by Joel Rivera-Camacho on Unsplash\n\nMethodology\n\nWe considered 14 weighted metrics to rank 15 countries that have the best military in the world. These include GDP and defense spending (20%), technological capabilities (15%), manpower and special forces strength (15%), nuclear weapons (10%), aircraft including fighter jets (10%), aircraft carriers and submarines (10%), tanks and artillery (5%), military satellites in orbit (5%), overseas military bases (5%), and cybersecurity capabilities (5%).\n\nIt was seen where each country ranked on a given metric and then was assigned a weighted score accordingly. Finally, all weighted scores were aggregated to get an overall score. Countries with the best military in the world are ranked in ascending order of their overall weighted scores.\n\nData on GDP was sourced from the IMF, while SIPRI was consulted for numbers related to defense spending. For other military-related metrics, we referred to our recent articles such as 20 Largest Air Forces in the World Heading into 2024, 15 Countries with the Most Battle Tanks in the World, Artillery Strength by Country: Top 20 Militaries, 15 Navies with the Most Submarines in the World, amongst others, the Global Firepower Index 2024; and Power Atlas. For technological advancement levels, we referenced the Global Innovation Index 2023.\n\nThe country with the best military in the world is the United States.\n\n1. United States\n\nGDP (2023): $26.95 trillion\n\nDefense Expenditure (2023): $916 billion\n\nTechnological Capabilities Rank: 3\n\nNuclear Weapons: 5,550\n\nManpower: 1,328,000\n\nSpecial Forces Rank: 1\n\nTanks: 4,657\n\nArtillery: 3,556\n\nAircraft/Fighter Jets: 5,209\n\nAircraft Carriers: 11\n\nSubmarines: 64\n\nMilitary Satellites: 218\n\nOverseas Military Bases: 759\n\nCyber capabilities Rank: 1\n\nWeighted Score: 1.65\n\nThe United States has the best military in the world. The country outranks all counterparts in ground forces, aerial, and naval strength. In 2023, Washington spent a staggering $916 billion on defense expenditure, which represented close to two-fifths of the world’s military spending and 68% of NATO’s defense expenditure during the year. The United States has the largest fleet of fighter jets and aircraft carriers in the world, which alone is a testament to its military power. Moreover, the country enjoys a distinct geographic advantage through its 759 overseas military bases across 80 countries, which allow it to strike enemy targets anywhere in the world at will. The United States is also the third most technologically advanced country in the world and ranks first in the globe for cybersecurity capabilities.\n\nTo learn about other strong militaries, you can check out our detailed report 15 Countries That Have the Best Military in the World.\n\nAt Insider Monkey, we delve into a variety of topics, ranging from best militaries to other business aspects in the industry; however, our expertise lies in identifying the top-performing stocks. Currently, Artificial Intelligence (AI) technology stands out as one of the most promising fields. If you are looking for an AI stock that is more promising than NVDA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nREAD NEXT: Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and Jim Cramer is Recommending These 10 Stocks in June.\n\nDisclosure: None. This article is originally published on Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/country-best-military-world-014906523.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.029,
            "neu": 0.852,
            "pos": 0.119
        }
    }
]