[
    {
        "date": "2024-06-20T11:00:00+00:00",
        "title": "3 Must-Own Stocks from Jeremy Grantham’s New ETF",
        "content": "The GMO U.S. Quality ETF (NYSEARCA:QLTY) seeks quality stocks to buy.\n\nAt the end of May, Barron’s published an article about investing guru Jeremy Grantham’s new ETF and how it’s beating the markets despite not owningNvidia (NASDAQ:NVDA).\n\n“The GMO U.S. Quality ETF’s disciplined approach uses both quantitative and fundamental techniques to assess the relative quality and valuation of U.S.-domiciled companies and aims to exploit a long-term investment horizon while withstanding short-term volatility in an actively managed ETF format,” states the EYF’s website.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nIn fact, Grantham does not manage the fund. Tom Hancock, GMO’s Head of Focused Equity, does this with portfolio managers Ty Cobb and Anthony Hene.\n\nHancock likens the latest AI craze to the dot-com froth of the late 1990s where stocks traded at nosebleed valuations. With Nvidia valued at twice the S&P 500 and Tesla’s (NASDAQ:TSLA) margins likely to fall, he steered clear of these two Magnificent Seven stocks.\n\nLaunched last November, the ETF, which focuses on both growth and value, is up nearly 20% since its inception in line with the index.\n\nHere are three stocks to buy from QLTY’s 35 holdings.\n\nMicrosoft (MSFT) The Microsoft (MSFT) logo on a corporate office building during the day time.\n\nSource: The Art of Pics / Shutterstock.com\n\nMicrosoft (NASDAQ:MSFT) is QLTY’s largest holding with a 7.4% weighting. It is the top Magnificent Seven holding. The other four weights range between 5.3% and 2.6%. Hancock considers Microsoft a cheaper way to play AI than Nvidia.\n\nMicrosoft currently is valued at 14.1x sales and 30.4x cash flow. By comparison, Nvidia’s P/S and P/CF ratios are 40.9x and 73.7x, respectively. There is no comparison.\n\nWhile I 100% believe in Nvidia CEO Jensen Huang’s AI plans, it’s hard not to respect the job Microsoft CEO Satya Nadella has done in the decade he’s been in the top job. Since taking the helm in February 2014, its shares have appreciated 1,074%. That’s pretty good for a company that was as large as MSFT was when he took over.\n\nOf the 58 analysts that cover MSFT stock, 55 rate it a Buy, with a $479.79 target price, 8% higher than its current share price.\n\nUp 32% over the past year, analysts are being conservative in their estimates. Through the first nine months of 2024, its operating cash flow is up 38% to $81.35 billion.\n\nIt’s a cash flow machine.\n\nGE Aerospace (GE) General Electric (GE stock) logo on headquarters building\n\nSource: JPstock / Shutterstock.com\n\nGE Aerospace (NYSE:GE) is QLTY’s 13th-largest holding at 2.9%.\n\nAlthough Larry Culp remains the CEO and the symbol is the same, GE Aerospace has little in common with the former industrial conglomerate. And that’s good for shareholders.\n\nStory continues\n\nIn the span of a week, no less than three well-respected publications ran articles about the company’s success: Morningstar.com discussed how GE Aerospace has more focus now since splitting off its health care and energy businesses.\n\nBarron’s talked about how Culp’s decision to stay at GE and avoid a Boeing (NYSE:BA) turnaround was good news for investors. Lastly, Investor’s Business Daily focused on GE Aerospace’s healthy profitability and free cash flow growth.\n\nAt one time, GE paid an annual dividend of $1.24. It’s now back to $0.24, with more to come.\n\n“The very long-term, profitable, and predictable nature of the jet engine service business is highly compatible with a generous dividend policy,” stated Morningstar equity analyst Nicolas Owens on June 18.\n\nThere’s no question Culp has earned the high praise he gets from analysts. Of the 19 that cover GE stock, 17 rate it a Buy, with a $180.04 target price, 9% higher than its current share price.\n\nOtis Worldwide (OTIS) momentum stocks: a smartphone screen displaying the Otis Worldwide (OTIS) logo\n\nSource: rafapress/shutterstock.com\n\nOtis Worldwide (NYSE:OTIS) is the 24th-largest holding of QLTY with a 2.2% weighting.\n\nThe elevator company and its sister company, Carrier Global (NYSE:CARR), which specializes in heating and cooling systems, were spun off from United Technologies in April 2020. United Technologies then merged with Raytheon Technologies in an all-stock deal to form RTX (NYSE:RTX).\n\nOf the three stocks, CARR stock has done the best since the spinoff, up 415%. However, OTIS hasn’t done too bad, gaining 114% over the past four years.\n\nIn December, I suggested that Otis would benefit from the ongoing global urbanization.\n\n“As cities grow and real estate goes more vertical rather than horizontal, elevators become vital to a building’s success. That’s Otis Worldwide’s (NYSE:OTIS) bread and butter,” I wrote.\n\nIn the latest quarter, while new equipment orders fell by 10.3%, its service business saw modernization orders rise by 12.9%, while its modernization backlog rose 15%. That’s the beauty of its business: Even when real estate owners are slow to buy new equipment, the old equipment has to continue to function safely. It’s not an expense they can avoid.\n\nIn 2024, it expects net sales of $14.65 billion at the midpoint of its guidance with organic sales growth of 4%. On the bottom line, it expects adjusted earnings per share of $3.87, 9% higher year-over-year.\n\nIt trades at a reasonable 25x its EPS estimate for 2024.\n\nOn the date of publication, Will Ashworth did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nWill Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 3 Must-Own Stocks from Jeremy Grantham’s New ETF appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-must-own-stocks-jeremy-110000306.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "BA.US",
            "CARR.US",
            "GCP.F",
            "GCP.XETRA",
            "GE.MX",
            "GE.US",
            "GEC.LSE",
            "GEOO34.SA",
            "GNE.PA",
            "MSFT.US",
            "NVDA.US",
            "OTIS.US",
            "RTX.US",
            "RYTT34.SA",
            "TSLA.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.024,
            "neu": 0.851,
            "pos": 0.125
        }
    }
]