[
    {
        "date": "2024-05-24T14:45:00+00:00",
        "title": "Bulletproof Your Portfolio: 3 Defense Stocks to Own Now",
        "content": "With two significant wars at the moment, you would think the question of which defense stocks to buy would be a topic of interest for investors. However, according to Barron’s, the top five defense stocks: Lockheed Martin (NYSE:LMT), Northrop Grumman (NYSE:NOC), Boeing (NYSE:BA), General Dynamics (NYSE:GD) and RTX (NYSE:RTX) have only gained an average of 30% over the past five years, significantly less than the index itself. That could explain some of the investor reluctance.\n\nMoreover, the industry feels inadvertently unpredictable to many investors, with the potential for government spending priorities to shift based on the administration. Nevertheless, defense stocks, if selected correctly, can be exceptionally defensive for a portfolio. That’s because not all defense stocks rely on large government spending packages to remain competitive, due to the critical nature of the products they sell, like ammo or aircraft maintenance parts.\n\nIf you’re interested in defense stocks, here are three to buy to bulletproof your portfolio.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nRTX (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nRTX (NYSE:RTX), formerly known as Raytheon Technologies, has three operating segments: Collins Aerospace, Pratt & Whitney, and Raytheon. Collins sells products and services to aircraft manufacturers, airlines, the U.S. government, defense contractors, and independent distributors worldwide. Pratt & Whitney supplies aircraft engines to both commercial and military customers. Lastly, Raytheon manufactures and sells advanced radar detection systems and sensors for missile defense applications.\n\nAll three sectors generated around $6.5 billion in revenue in Q1, 2024. However, of the three, Raytheon had the highest operating margin at 15.0%, 230 basis points higher than Collins Aerospace and more than double Pratt & Whitney’s. Together, RTX had total segment sales of $19.79 billion and operating profits of $2.26 billion, both considerably higher than a year ago.\n\nWhile its shares aren’t cheap, the company continues to grow revenues and operating profits at a decent pace, making it a good long-term hold. It’s also an incredibly relevant producer of defense technologies, as the wars of today depend on missile technology more than ever before.\n\nHeico (HEI)\n\nSource: Shutterstock\n\nHeico (NYSE:HEI) was founded in 1957 and today operates two segments: Flight Support Group (60% of revenue) and Electronic Technologies Group (40%).\n\nThe Flight Support Group designs and manufactures jet engine and aircraft component replacement parts in accordance with Federal Aviation Administration guidelines. It also repairs, overhauls, and distributes jet engines and aircraft components like avionics and instruments for domestic and foreign commercial air carriers, aircraft repair companies, and military and business aircraft operators.\n\nStory continues\n\nThe Electronic Technologies Group designs, manufactures, and sells various electronic, microwave, and electro-optical products. From the time the current management took control of the business in 1990 through fiscal 2023, its annual revenues have grown from $26 million to nearly $3 billion, a compound annual growth rate (CAGR) of 15%. The CAGR for its net income is even higher at 18%.\n\nOver the past three years, its annualized revenue and operating income growth rate was 18.4%. While analysts are lukewarm about its business, its shares have doubled over the past five years for a reason.\n\nNational Presto Industries (NPK) Gold shield; digital shield, defense, protection\n\nSource: anttoniart / Shutterstock\n\nThis last pick is a bit of a wildcard. National Presto Industries (NYSE:NPK). According to MarketWatch, only one analyst covers the small-cap stock, rating it a buy, with a $128 target, 68% higher than where it’s currently trading.\n\nNational Presto is one of those stocks you buy and forget about for years because it does a few things rather than specializing in one industry or sector. It operates three businesses: Housewares/Small Appliances (29% of revenue), Defense (70%), and Safety (1%).\n\nConsumers could be familiar with its housewares segment, which makes everything from skillets and griddles to air fryers and rice cookers, even coffee makers. However, it’s the defense segment that gets it into this article.\n\nThe company has several subsidiaries under the National Defense Corporation, including AMTEC, which manufactures 40mm ammunition for the U.S. Department of Defense. As I mentioned, defense accounts for nearly three-quarters of its annual revenue and about 84% of its operating profits.\n\nOf the three defense stocks, National Presto is the value play. Its enterprise value of $476 million is 10.5x its EBITDA (earnings before interest, taxes, depreciation, and amortization), way less than RTX (18.6x) and HEI (35.3x).\n\nOn the date of publication, Will Ashworth did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nWill Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post Bulletproof Your Portfolio: 3 Defense Stocks to Own Now appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/bulletproof-portfolio-3-defense-stocks-144500765.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "BA.US",
            "GD.US",
            "HEI.US",
            "LMT.US",
            "NOC.US",
            "NPK.US",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.02,
            "neu": 0.876,
            "pos": 0.105
        }
    },
    {
        "date": "2024-05-24T00:00:00+00:00",
        "title": "Bulletproof Your Portfolio: 3 Defense Stocks to Own Now",
        "content": "These defense stocks to buy all are doing quite well financially, but their shares haven’t benefited nearly enough.",
        "link": "https://investorplace.com/2024/05/bulletproof-your-portfolio-3-defense-stocks-to-own-now/",
        "symbols": [
            "HEI.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.576,
            "neg": 0,
            "neu": 0.724,
            "pos": 0.276
        }
    }
]