[
    {
        "date": "2024-08-26T18:35:08+00:00",
        "title": "Jim Cramer Wants You To Consider Raytheon Technologies Corp. (RTX) ‘If You’re Interested In Aerospace’",
        "content": "We recently compiled a list of the Jim Cramer Wants You to Check These 10 Stocks.In this article, we are going to take a look at where Raytheon Technologies Corp. (NYSE:RTX) stands against the Jim Cramer-approved stocks.\n\nJim Cramer noticed a strange pattern during the recent winning streak last week. According to Cramer, when a company reported earnings that were better than expected, its stock price would rise significantly. Even if the results were just a bit better than feared, the stock still went up. Conversely, if a company posted disappointing earnings, the market largely ignored it, believing it was just a temporary setback because the Fed might soon cut interest rates. This led to continued buying. However, this trend changed today as reality began to take hold.\n\n\"You see, we had a very odd pattern during the winning streak. It was a bit of Pangloss and a nip of Camelot. When a company reported a better-than-expected quarter, it was great. When a company reported a quarter that was just better than feared, the stock still rose. And when a company reported a bad quarter, we decided that it was the last bad quarter because the Fed was about to cut rates, so it was no big deal—buy anyway. In other words, companies could do no wrong, but not today. Today, we had a bit of a reckoning, a dose of reality.\"\n\nJim Cramer pointed out that Tuesday’s market drop was anticipated because the S&P had been rising for eight straight days, and a ninth day would have been unusual, something not seen since 2004. The day was challenging, with the Dow falling 62 points and the S&P dropping 2%, which felt like a bigger loss. This raises concerns about whether the market can continue to rise, especially since negative news finally led to a decline after a strong eight-day rally.\n\n\"We were due for today's modest pullback—the S&P had been up for eight straight days, and nine straight would have put us in rarefied territory. We haven't seen that kind of winning streak since 2004. Today’s session was rough, with the Dow off by 62 points and the S&P dipping 2%, like losing 33%. We have to wonder if the market still has the momentum to go higher because today we got bad news, and guess what—stocks actually went down. That didn’t happen much during the 8-day gain.\"\n\nJim Cramer observed that the market had been in a phase where strong performance drove stock prices up, and even poor results were overlooked because of the belief that the Fed would intervene. However, after seven days of gains, he suggested that this optimistic trend might be ending. The market has now reached a point where stocks no longer automatically benefit from positive bias.\n\n\"People had been reporting a perfect market scenario where good performance led to stock gains, and poor performance was cushioned by expectations that the Fed would step in to save the day. But after seven relentlessly positive days, we have to accept that stocks may no longer get the benefit of the doubt. We've reached a point where the market is sufficiently elevated, and we're back to business as usual—where the good stocks rise, and the bad ones fall. At these high levels, we can't just dismiss the bears with \"heads I win, tails you lose.\" There's a return to rationality, and rationality is the enemy of a market where everything rallies indiscriminately.\"\n\nCramer also mentioned that many investors are hoping for the Fed to step in during their meeting at Jackson Hole on Friday. If those expectations aren't met, there could be significant selling pressure, particularly on a summer Friday. He noted that Lowe's recently suffered because the market might be entering a phase where multiple rate cuts are necessary, but there's no clear indication that such cuts are on the way. Without them, the company may struggle to turn its business around quickly.\n\n\"It doesn’t help that many expect the Fed cavalry to show up on Friday when they head to Jackson Hole. If things don’t go as expected, there could be a lot of selling, especially since it's a summer Friday.\"\n\nOur Methodology\n\nIn this article, we analyzed a recent episode of Jim Cramer's Mad Money and selected ten stocks he talked about. We also included information on how hedge funds feel about each stock and ranked them based on the number of hedge funds that own them, from the fewest to the most.\n\nAt Insider Monkey we are obsessed with the stocks that hedge funds pile into. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\n\nAn aerial view of a commercial jetliner in flight, its airframe glinting in the sun.\n\nRaytheon Technologies Corp . (NYSE:RTX)\n\nNumber of Hegde Fund Investors: 54\n\nJim Cramer highlighted Raytheon Technologies Corp . (NYSE:RTX) as a strong option for those interested in aerospace. He pointed out that Raytheon Technologies Corp . (NYSE:RTX) provides engines that are essential for safety, as they are designed to stay securely attached to the plane. This reliability is a key factor in the company’s appeal for aerospace investments.\n\n\"If you're interested in aerospace, consider RTX, which provides engines that ideally stay attached to the plane—something crucial for safety.\"\n\nIn the second quarter of 2024, Raytheon Technologies Corp . (NYSE:RTX) reported $18.4 billion in revenue, up 6% from the previous year, and earnings per share (EPS) of $1.98, surpassing analyst expectations by 8%. Raytheon Technologies Corp . (NYSE:RTX)'s backlog has grown to $64 billion, driven by new contracts and increased demand, including a notable $5 billion contract with the U.S. Department of Defense for advanced missile defense systems.\n\nRaytheon Technologies Corp. (NYSE:RTX) is also making strides in technology with its new Hypersonic Strike Weapon system, positioning itself to benefit from the growing hypersonic weapons market. With the global defense sector expected to expand at a compound annual growth rate (CAGR) of 5.4% through 2028, Raytheon Technologies Corp . (NYSE:RTX) is well-positioned to capitalize on rising defense spending and modernization efforts worldwide. This blend of strong financial results, major contract wins, technological progress, and favorable market trends highlights Raytheon Technologies Corp . (NYSE:RTX)’s promising growth potential and reinforces its role as a leading player in the defense sector.\n\nOverall RTX ranks 6th on our list of the stocks Jim Cramer wants you to check out. While we acknowledge the potential of RTX as an investment, our conviction lies in the belief that under the radar AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than RTX but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nREAD NEXT:$30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/jim-cramer-wants-consider-raytheon-183508429.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.085,
            "neu": 0.761,
            "pos": 0.154
        }
    }
]