[
    {
        "date": "2024-08-14T13:40:13+00:00",
        "title": "Here's Why RTX (RTX) is a Strong Value Stock",
        "content": "Taking full advantage of the stock market and investing with confidence are common goals for new and old investors alike.\n\nWhile you may have an investing style you rely on, finding great stocks is made easier with the Zacks Style Scores. These are complementary indicators that rate stocks based on value, growth, and/or momentum characteristics.\n\nWhy Investors Should Pay Attention to This Value Stock\n\nValue investors love finding good stocks at good prices, especially before the broader market catches on to a stock's true value. Utilizing ratios like P/E, PEG, Price/Sales, and Price/Cash Flow, the Value Style Score identifies the most attractive and most discounted stocks.\n\nRTX (RTX)\n\nIn July 2023, Raytheon Technologies was renamed as RTX Corporation. On Apr 3, 2020, Raytheon Technologies was formed following the completion of merger between United Technologies and Raytheon Company. Based in Waltham, MA, Raytheon Technologies has emerged as an aerospace and defense company, with pro-forma combined annual revenues of $74 billion as of the end of 2019, providing advanced systems and services for commercial, military and government customers worldwide. Effective July 2023, the company operates through three business segments.\n\nRTX sits at a Zacks Rank #2 (Buy), holds a Value Style Score of B, and has a VGM Score of B. Compared to the Aerospace - Defense industry's P/E of 20.1X, shares of RTX are trading at a forward P/E of 21.5X. RTX also has a PEG Ratio of 2.1, a Price/Cash Flow ratio of 14.7X, and a Price/Sales ratio of 2.2X.\n\nValue investors don't just pay attention to a company's valuation ratios; positive earnings play a crucial role, too. Six analysts revised their earnings estimate upwards in the last 60 days for fiscal 2024. The Zacks Consensus Estimate has increased $0.05 to $5.44 per share. RTX has an average earnings surprise of 6.6%.\n\nRTX should be on investors' short lists because of its impressive earnings and valuation fundamentals, a good Zacks Rank, and strong Value and VGM Style Scores.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/heres-why-rtx-rtx-strong-134013632.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.003,
            "neu": 0.763,
            "pos": 0.234
        }
    }
]