[
    {
        "date": "2024-07-18T14:01:15+00:00",
        "title": "RTX (RTX) Reports Next Week: What to Know Ahead of the Release",
        "content": "Wall Street expects flat earnings compared to the year-ago quarter on higher revenues when RTX (RTX) reports results for the quarter ended June 2024. While this widely-known consensus outlook is important in gauging the company's earnings picture, a powerful factor that could impact its near-term stock price is how the actual results compare to these estimates.\n\nThe stock might move higher if these key numbers top expectations in the upcoming earnings report, which is expected to be released on July 25. On the other hand, if they miss, the stock may move lower.\n\nWhile management's discussion of business conditions on the earnings call will mostly determine the sustainability of the immediate price change and future earnings expectations, it's worth having a handicapping insight into the odds of a positive EPS surprise.\n\nZacks Consensus Estimate\n\nThis an aerospace and defense company is expected to post quarterly earnings of $1.29 per share in its upcoming report, which represents no change from the year-ago quarter.\n\nRevenues are expected to be $19.31 billion, up 5.4% from the year-ago quarter.\n\nEstimate Revisions Trend\n\nThe consensus EPS estimate for the quarter has been revised 0.24% higher over the last 30 days to the current level. This is essentially a reflection of how the covering analysts have collectively reassessed their initial estimates over this period.\n\nInvestors should keep in mind that the direction of estimate revisions by each of the covering analysts may not always get reflected in the aggregate change.\n\nEarnings Whisper\n\nEstimate revisions ahead of a company's earnings release offer clues to the business conditions for the period whose results are coming out. This insight is at the core of our proprietary surprise prediction model -- the Zacks Earnings ESP (Expected Surprise Prediction).\n\nThe Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a more recent version of the Zacks Consensus EPS estimate. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.\n\nThus, a positive or negative Earnings ESP reading theoretically indicates the likely deviation of the actual earnings from the consensus estimate. However, the model's predictive power is significant for positive ESP readings only.\n\nA positive Earnings ESP is a strong predictor of an earnings beat, particularly when combined with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold). Our research shows that stocks with this combination produce a positive surprise nearly 70% of the time, and a solid Zacks Rank actually increases the predictive power of Earnings ESP.\n\nStory continues\n\nPlease note that a negative Earnings ESP reading is not indicative of an earnings miss. Our research shows that it is difficult to predict an earnings beat with any degree of confidence for stocks with negative Earnings ESP readings and/or Zacks Rank of 4 (Sell) or 5 (Strong Sell).\n\nHow Have the Numbers Shaped Up for RTX?\n\nFor RTX, the Most Accurate Estimate is lower than the Zacks Consensus Estimate, suggesting that analysts have recently become bearish on the company's earnings prospects. This has resulted in an Earnings ESP of -1.86%.\n\nOn the other hand, the stock currently carries a Zacks Rank of #3.\n\nSo, this combination makes it difficult to conclusively predict that RTX will beat the consensus EPS estimate.\n\nDoes Earnings Surprise History Hold Any Clue?\n\nWhile calculating estimates for a company's future earnings, analysts often consider to what extent it has been able to match past consensus estimates. So, it's worth taking a look at the surprise history for gauging its influence on the upcoming number.\n\nFor the last reported quarter, it was expected that RTX would post earnings of $1.23 per share when it actually produced earnings of $1.34, delivering a surprise of +8.94%.\n\nOver the last four quarters, the company has beaten consensus EPS estimates four times.\n\nBottom Line\n\nAn earnings beat or miss may not be the sole basis for a stock moving higher or lower. Many stocks end up losing ground despite an earnings beat due to other factors that disappoint investors. Similarly, unforeseen catalysts help a number of stocks gain despite an earnings miss.\n\nThat said, betting on stocks that are expected to beat earnings expectations does increase the odds of success. This is why it's worth checking a company's Earnings ESP and Zacks Rank ahead of its quarterly release. Make sure to utilize our Earnings ESP Filter to uncover the best stocks to buy or sell before they've reported.\n\nRTX doesn't appear a compelling earnings-beat candidate. However, investors should pay attention to other factors too for betting on this stock or staying away from it ahead of its earnings release.\n\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-rtx-reports-next-week-140115779.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.044,
            "neu": 0.841,
            "pos": 0.115
        }
    },
    {
        "date": "2024-07-18T13:00:16+00:00",
        "title": "Do Fundamentals Have Any Role To Play In Driving RTX Corporation's (NYSE:RTX) Stock Up Recently?",
        "content": "RTX's (NYSE:RTX) stock up by 4.3% over the past week. We wonder if and what role the company's financials play in that price change as a company's long-term fundamentals usually dictate market outcomes. In this article, we decided to focus on RTX's  ROE.\n\nReturn on equity or ROE is a key measure used to assess how efficiently a company's management is utilizing the company's capital. In other words, it is a profitability ratio which measures the rate of return on the capital provided by the company's shareholders.\n\nSee our latest analysis for RTX\n\nHow Do You Calculate Return On Equity?\n\nThe formula for return on equity is:\n\nReturn on Equity = Net Profit (from continuing operations) ÷ Shareholders' Equity\n\nSo, based on the above formula, the ROE for RTX is:\n\n5.9% = US$3.6b ÷ US$62b (Based on the trailing twelve months to March 2024).\n\nThe 'return' is the yearly profit. So, this means that for every $1 of its shareholder's investments, the company generates a profit of $0.06.\n\nWhat Is The Relationship Between ROE And Earnings Growth?\n\nWe have already established that ROE serves as an efficient profit-generating gauge for a company's future earnings. Depending on how much of these profits the company reinvests or \"retains\", and how effectively it does so, we are then able to assess a company’s earnings growth potential. Assuming everything else remains unchanged, the higher the ROE and profit retention, the higher the growth rate of a company compared to companies that don't necessarily bear these characteristics.\n\nRTX's Earnings Growth And 5.9% ROE\n\nAt first glance, RTX's ROE doesn't look very promising. We then compared the company's ROE to the broader industry and were disappointed to see that the ROE is lower than the industry average of 14%. However, the moderate 15% net income growth seen by RTX over the past five years is definitely a positive. So, there might be other aspects that are positively influencing the company's earnings growth. For instance, the company has a low payout ratio or is being managed efficiently.\n\nWe then compared RTX's net income growth with the industry and we're pleased to see that the company's growth figure is higher when compared with the industry which has a growth rate of 6.4% in the same 5-year period. past-earnings-growth\n\nThe basis for attaching value to a company is, to a great extent, tied to its earnings growth. The investor should try to establish if the expected growth or decline in earnings, whichever the case may be, is priced in. This then helps them determine if the stock is placed for a bright or bleak future. Is RTX fairly valued? This infographic on the company's intrinsic value  has everything you need to know.\n\nStory continues\n\nIs RTX Using Its Retained Earnings Effectively?\n\nWhile RTX has a three-year median payout ratio of 72% (which means it retains 28% of profits), the company has still seen a fair bit of earnings growth in the past, meaning that its high payout ratio hasn't hampered its ability to grow.\n\nMoreover, RTX is determined to keep sharing its profits with shareholders which we infer from its long history of paying a dividend for at least ten years. Upon studying the latest analysts' consensus data, we found that the company's future payout ratio is expected to drop to 43% over the next three years. Accordingly, the expected drop in the payout ratio explains the expected increase in the company's ROE to 13%, over the same period.\n\nSummary\n\nOn the whole, we do feel that RTX has some positive attributes. Namely, its high earnings growth. We do however feel that the earnings growth number could have been even higher, had the company been reinvesting more of its earnings and paid out less dividends. On studying current analyst estimates, we found that analysts expect the company to continue its recent growth streak. To know more about the company's future earnings growth forecasts take a look at this freereport on analyst forecasts for the company to find out more.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/fundamentals-role-play-driving-rtx-130016490.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.02,
            "neu": 0.834,
            "pos": 0.145
        }
    },
    {
        "date": "2024-07-18T12:00:00+00:00",
        "title": "RTX's Raytheon demonstrates SM-6 integration with LTAMDS and IBCS",
        "content": "Army and Navy programs combine to defeat complex threat\n\nPEARL HARBOR, Hawaii, July 18, 2024 /PRNewswire/ -- At Valiant Shield 24, Raytheon, an RTX business, demonstrated a simulated complex missile engagement leveraging the U.S. Army's Lower Tier Air and Missile Defense Sensor, or LTAMDS, and Integrated Air and Missile Defense Battle Command System, IBCS, launching the U.S. Navy's premier, long-range effector, Standard Missile-6 (SM-6).\n\nUsing track data from Army LTAMDS simulators and operational SM-6 engagement control software interfaced with IBCS, the test demonstrated the successful integration of these existing, respective Army and Navy program capabilities. This proves the feasibility of SM-6 as an additional effector within the Army IAMD architecture including IBCS and LTAMDS. The experiment, which used a combination of physical systems' hardware and simulation, demonstrated the effective detection and identification of an in-coming threat, target and track data transfer, launch command, and the successful guide to missile intercept.\n\n\"The successful test confirms a viable option for INDOPACOM by demonstrating SM-6 integrated with IBCS and LTAMDS,\" said Tom Laliberty, president of Land & Air Defense Systems at Raytheon. \"LTAMDS matched with SM-6 adds an exceptional capability to defeat increasingly diverse and complex threats with a multi-mission missile that flies as far as the radar can see – providing for long range Army and Joint integrated air and missile defense.\"\n\nValiant Shield is a bi-annual exercise that brings allies and partners together to develop, test and train in a relevant and realistic environment. Government and industry bring technologies, designs and solutions with the common goal to increase the joint-combined force's ability to plan, communicate and conduct complex, multi-domain operations throughout the Indo-Pacific.\n\nAbout Raytheon\r\nRaytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea, and space.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com  Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-raytheon-demonstrates-sm-6-integration-with-ltamds-and-ibcs-302200258.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-raytheon-demonstrates-sm-6-120000886.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.987,
            "neg": 0.049,
            "neu": 0.807,
            "pos": 0.144
        }
    }
]