[
    {
        "date": "2024-05-06T20:51:05+00:00",
        "title": "3 Top Stock Picks Positioned to Capitalize on Skyrocketing Defense Spending",
        "content": "Global military spending for 2023 touched record highs of $2.44 trillion. On a year-on-year basis, defense spending increased by 6.8%. That does not come as a surprise, as there are multiple points of geopolitical friction globally. It’s also likely that defense spending will continue to increase at a healthy pace through the decade. From an investment perspective, it’s a good opportunity to consider exposure to some of the best defense stock picks.\n\nIf we look at some top defense companies, the order backlog has been swelling. Further, companies are investing in next-generation defense technology. A swelling backlog implies clear revenue and cash flow visibility. Investment in R&D will ensure that growth remains healthy as new technology replaces the existing in the coming years.\n\nTherefore, the overall outlook for the defense sector is positive. Even with macroeconomic headwinds, I don’t see a slowdown in defense spending. As a matter of fact, global defense spending increased even during the pandemic years.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nWith this overview, let’s discuss three defense stock picks poised to surge higher on the back of potential growth acceleration.\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) Space Systems sign in Sunnyvale, California.\n\nSource: Ken Wolter / Shutterstock.com\n\nLockheed Martin (NYSE:LMT) is my top pick from the defense sector. After remaining sideways for the last 12 months, LMT stock trades at an attractive forward price-earnings ratio of 17.9. Further, the stock offers a dividend yield of 2.73%. With business progress remaining positive, I am bullish on a strong breakout for LMT stock.\n\nAs of Q1 2024, Lockheed reported a strong order backlog of $159 billion. That provides clear revenue and cash flow visibility. For the current year, Lockheed has guided for free cash flow of $6.2 billion. FCF will likely continue to swell in the coming years on the back of healthy order intake.\n\nAn important point to note is that Lockheed is investing in next-generation defense technology. That includes hypersonics and next-generation interceptors, among others. Investment in research and development will ensure that Lockheed is ahead of the curve. Further, with expanding sales to allies, the addressable market is significant.\n\nLeonardo DRS (DRS)\n\nAmong the emerging defense stocks,Leonardo DRS (NASDAQ:DRS) is worth considering for multibagger returns. DRS stock has trended higher by 35% in the last 12 months. However, the growth stock remains attractive at a forward price-earnings ratio of 26.8. With a swelling order backlog, I expect growth to accelerate in the coming years.\n\nStory continues\n\nAs an overview, Leonardo DRS is a provider of defense technologies. For the last financial year, the company clocked revenue and EBITDA of $3 billion and $378 million respectively. It’s worth noting that as of Q1 2024, Leonardo reported an order backlog of $7.8 billion. On a year-on-year basis, the backlog swelled by 84%. If the order intake remains robust, there is a strong case for a healthy upside in EBITDA and cash flows.\n\nI must add here that Leonardo has been consistently investing in R&D. Last month, the company won the 2024 Herschel Award for the “development of a groundbreaking cooled infrared sensor that unlocks the ability for advanced military and scientific capabilities.”\n\nRTX (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nRTX (NYSE:RTX) has witnessed a healthy rally of 20% for year-to-date. However, the stock remains attractively valued at a forward price-earnings ratio of 19.3. Therefore, I expect further upside for this 2.49% dividend yield defense stock.\n\nFor Q1 2024, RTX reported healthy sales growth of 12% on a year-on-year basis to $19.3 billion. For the same period, the company reported a healthy order backlog of $202 billion. That included a $125 billion backlog from the commercial segment and $77 billion from defense. A robust backlog provides clear revenue visibility.\n\nAn important point to note is that the order intake for Q1 2024 was $25 billion. If that pace of intake sustains, organic sales growth will likely remain robust. I must add that RTX has guided for free cash flow of $5.7 billion for the year. That provides ample flexibility to invest in operational modernization and technological innovation.\n\nOn the date of publication, Faisal Humayun did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nFaisal Humayun is a senior research analyst with 12 years of industry experience in the field of credit research, equity research and financial modeling. Faisal has authored over 1,500 stock specific articles with focus on the technology, energy and commodities sector.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post 3 Top Stock Picks Positioned to Capitalize on Skyrocketing Defense Spending appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-top-stock-picks-positioned-205105598.html",
        "symbols": [
            "0R3E.LSE",
            "2VZ.F",
            "5UR.F",
            "5UR.XETRA",
            "DRS.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.001,
            "neu": 0.8,
            "pos": 0.199
        }
    },
    {
        "date": "2024-05-06T12:00:00+00:00",
        "title": "RTX's advanced ground system for space-based missile warning now operational",
        "content": "Mission data processing framework rapidly moved from prototype to operations at Battlespace Awareness Center\n\nAURORA, Colo., May 6, 2024 /PRNewswire/ -- An advanced ground system for space-based missile warning developed by Raytheon, an RTX (NYSE: RTX) business, is now operational at the U.S. Space Force's Overhead Persistent Infrared Battlespace Awareness Center (OBAC).\n\nThe Future Operationally Resilient Ground Evolution Mission Data Processing Application Framework (FORGE MDPAF) is a modular and adaptable framework that enables fast integration of mission focused applications to process, exploit and disseminate information from satellites.\n\nThe current version of FORGE MDPAF is the result of the company working through regular incremental development releases to optimize and add new iterative capabilities. As a next step, FORGE MDPAF will move from supporting OBAC operations to full missile warning detection.\n\n\"There are thousands of satellites on orbit today and space is an increasingly contested domain,\" said Sandy Brown, vice president for Mission Solutions & Payloads for Raytheon. \"FORGE MDPAF is designed to scale in a way that can handle the current volume of missile warning data and grow to support future proliferated space data processing needs.\"\n\nFORGE MDPAF is used to process Overhead Persistent Infrared (OPIR) satellite data from both the U.S. Space Force's Space Based Infrared System constellation and the future Next Gen OPIR constellation, as well as processing data from other civil and environmental sensors.\n\nAbout Raytheon Raytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com. Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-advanced-ground-system-for-space-based-missile-warning-now-operational-302136068.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-advanced-ground-system-space-120000014.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.981,
            "neg": 0.034,
            "neu": 0.845,
            "pos": 0.121
        }
    },
    {
        "date": "2024-05-06T10:32:12+00:00",
        "title": "RTX's (NYSE:RTX) Shareholders Will Receive A Bigger Dividend Than Last Year",
        "content": "The board of RTX Corporation (NYSE:RTX) has announced that it will be increasing its dividend by 6.8% on the 13th of June to $0.63, up from last year's comparable payment of $0.59. The payment will take the dividend yield to 2.3%, which is in line with the average for the industry.\n\nView our latest analysis for RTX\n\nRTX's Earnings Easily Cover The Distributions\n\nUnless the payments are sustainable, the dividend yield doesn't mean too much. Prior to this announcement, RTX's dividend made up quite a large proportion of earnings but only 53% of free cash flows. This leaves plenty of cash for reinvestment into the business.\n\nLooking forward, earnings per share is forecast to rise by 127.8% over the next year. Under the assumption that the dividend will continue along recent trends, we think the payout ratio could be 40% which would be quite comfortable going to take the dividend forward. historic-dividend\n\nDividend Volatility\n\nAlthough the company has a long dividend history, it has been cut at least once in the last 10 years. The annual payment during the last 10 years was $2.14 in 2014, and the most recent fiscal year payment was $2.36. Dividend payments have been growing, but very slowly over the period. The dividend has seen some fluctuations in the past, so even though the dividend was raised this year, we should remember that it has been cut in the past.\n\nThe Dividend Has Limited Growth Potential\n\nWith a relatively unstable dividend, it's even more important to evaluate if earnings per share is growing, which could point to a growing dividend in the future. Earnings per share has been sinking by 15% over the last five years. Such rapid declines definitely have the potential to constrain dividend payments if the trend continues into the future. On the bright side, earnings are predicted to gain some ground over the next year, but until this turns into a pattern we wouldn't be feeling too comfortable.\n\nOur Thoughts On RTX's Dividend\n\nIn summary, while it's always good to see the dividend being raised, we don't think RTX's payments are rock solid. The payments haven't been particularly stable and we don't see huge growth potential, but with the dividend well covered by cash flows it could prove to be reliable over the short term. This company is not in the top tier of income providing stocks.\n\nInvestors generally tend to favour companies with a consistent, stable dividend policy as opposed to those operating an irregular one. However, there are other things to consider for investors when analysing stock performance. Taking the debate a bit further, we've identified 4 warning signs for RTX that investors need to be conscious of moving forward. If you are a dividend investor, you might also want to look at our curated list of high yield dividend stocks.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-nyse-rtx-shareholders-receive-103212011.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.04,
            "neu": 0.854,
            "pos": 0.107
        }
    },
    {
        "date": "2024-05-06T00:00:00+00:00",
        "title": "3 Top Stock Picks Positioned to Capitalize on Skyrocketing Defense Spending",
        "content": "These are the best defense stock picks, as they represent companies with a growing order backlog likely to translate into cash flow upside.\n",
        "link": "https://investorplace.com/2024/05/3-top-stock-picks-positioned-to-capitalize-on-skyrocketing-defense-spending/",
        "symbols": [
            "DRS.US",
            "LMT.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.751,
            "neg": 0,
            "neu": 0.72,
            "pos": 0.28
        }
    }
]