[
    {
        "date": "2024-05-02T20:15:00+00:00",
        "title": "RTX Board of Directors Increases Quarterly Cash Dividend",
        "content": "ARLINGTON, Va., May 2, 2024 /PRNewswire/ -- RTX (NYSE: RTX) announced today that its Board of Directors declared a dividend of 63 cents per outstanding share of RTX common stock, which represents an increase of 6.8 percent over the prior quarter's dividend amount. The dividend will be payable on June 13, 2024 to shareowners of record at the close of business on May 17, 2024.\n\n\"The growth of RTX's dividend reflects our confidence that our portfolio is strong and demand for our products continues to grow,\" said RTX President and CEO Chris Calio. \"We are on track to return between $36 and $37 billion of capital to shareowners through dividends and share repurchases from the date of the merger through 2025.\"\n\nRTX has paid cash dividends on its common stock every year since 1936.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nCautionary Statement Regarding Forward-Looking Statements This release includes statements related to dividends that constitute \"forward-looking statements\" under the securities laws. All forward-looking statements involve risks, uncertainties and assumptions that may cause actual results to differ materially from those expressed or implied in the forward-looking statements. Past dividends provide no assurance as to future dividends. The timing, payment and amount of future dividends, if any, could vary significantly from past dividends due to a number of risks and uncertainties. These factors include those described under the caption \"Risk Factors\" in our reports on Forms 10-K, 10-Q and 8-K filed with the SEC from time to time.\n\nMedia Contact\r\nC: 202.384.2474\n\nInvestor Contact\r\nC: 781.522.5123 Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtx-board-of-directors-increases-quarterly-cash-dividend-302134826.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-board-directors-increases-quarterly-201500983.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.957,
            "neg": 0.049,
            "neu": 0.844,
            "pos": 0.107
        }
    }
]