[
    {
        "date": "2024-08-25T11:01:32+00:00",
        "title": "RTX's (NYSE:RTX) investors will be pleased with their respectable 44% return over the last year",
        "content": "Passive investing in index funds can generate returns that roughly match the overall market. But you can significantly boost your returns by picking above-average stocks. To wit, the RTX Corporation (NYSE:RTX) share price is 40% higher than it was a year ago, much better than the market return of around 26% (not including dividends) in the same period. That's a solid performance by our standards! And shareholders have also done well over the long term, with an increase of 39% in the last three years.\n\nLet's take a look at the underlying fundamentals over the longer term, and see if they've been consistent with shareholders returns.\n\nSee our latest analysis for RTX\n\nTo paraphrase Benjamin Graham: Over the short term the market is a voting machine, but over the long term it's a weighing machine. One way to examine how market sentiment has changed over time is to look at the interaction between a company's share price and its earnings per share (EPS).\n\nDuring the last year, RTX actually saw its earnings per share drop 56%.\n\nGiven the share price gain, we doubt the market is measuring progress with EPS. Indeed, when EPS is declining but the share price is up, it often means the market is considering other factors.\n\nRevenue was pretty stable on last year, so deeper research might be needed to explain the share price rise.\n\nYou can see below how earnings and revenue have changed over time (discover the exact values by clicking on the image). earnings-and-revenue-growth\n\nRTX is a well known stock, with plenty of analyst coverage, suggesting some visibility into future growth. So it makes a lot of sense to check out what analysts think RTX will earn in the future (free analyst consensus estimates)\n\nWhat About Dividends?\n\nAs well as measuring the share price return, investors should also consider the total shareholder return (TSR). The TSR incorporates the value of any spin-offs or discounted capital raisings, along with any dividends, based on the assumption that the dividends are reinvested. It's fair to say that the TSR gives a more complete picture for stocks that pay a dividend. In the case of RTX, it has a TSR of 44% for the last 1 year. That exceeds its share price return that we previously mentioned. This is largely a result of its dividend payments!\n\nA Different Perspective\n\nWe're pleased to report that RTX shareholders have received a total shareholder return of 44% over one year. That's including the dividend. Since the one-year TSR is better than the five-year TSR (the latter coming in at 12% per year), it would seem that the stock's performance has improved in recent times. Someone with an optimistic perspective could view the recent improvement in TSR as indicating that the business itself is getting better with time. It's always interesting to track share price performance over the longer term. But to understand RTX better, we need to consider many other factors. To that end, you should learn about the  4 warning signs  we've spotted with RTX (including 1 which is a bit concerning) .\n\nStory continues\n\nWe will like RTX better if we see some big insider buys. While we wait, check out this freelist of undervalued stocks (mostly small caps) with considerable, recent, insider buying.\n\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-nyse-rtx-investors-pleased-110132747.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.019,
            "neu": 0.826,
            "pos": 0.154
        }
    }
]