[
    {
        "date": "2024-06-05T17:46:27+00:00",
        "title": "3 Defense Stocks to Defend Your Portfolio Against Economic Mayhem",
        "content": "While “economic mayhem” is far from being my base case scenario, I can envision a few events that could indeed play havoc with the U.S. economy. One problem that could trigger economic mayhem is the huge, unsustainable amount of debt that the U.S. government has accumulated. BlueBay asset manager Mark Dowling told the Economist that “sooner or later” the debt would likely produce “a big earthquake.”\n\nIn another potential scenario, a massive war in the Mideast could cause oil prices to leap to $150 per barrel or more, causing the U.S. to enter a recession. And finally, a large terrorist attack against the U.S. certainly can’t be ruled out, especially because many terrorists may have entered America across its southern border. Additionally, America’s involvement in the Israel-Hamas War makes a terrorist attack more likely.\n\nGiven the ongoing wars in Gaza and Ukraine, along with widespread fear of Russia, China and Iran, the demand for U.S. weapons is likely to stay strong going forward no matter what happens economically. As a result, defense stocks are likely to prove fairly resilient if the economy does take a big hit. Here are three top defense names to buy.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nRTX (RTX) A German army mobile Raytheon (RTX) MIM-104 Patriot surface-to-air missile (SAM) system on display during the Laage airbase open house.\n\nSource: VanderWolf Images / Shutterstock.com\n\nRTX (NYSE:RTX) includes the defense company formerly known as Raytheon and United Technologies.\n\nThe defense contractor is clearly benefiting tremendously from geopolitical conflicts and potential conflicts around the world. For example, in Q1 the firm sold $1.2 billion of Patriot anti-air defense systems to Germany, and Ukraine ordered $282 million of Advanced Surface-to-Air Missile Systems from it. The company also received $1.6 billion of  “classified bookings,” and announced a $301.76 million contract modification from the U.S. Navy on May 31.\n\nCEO Chris Calio noted that America’s defense budget for this year is favorable for RTX, as it funds the company’s key offerings. Those include “next generation propulsion, critical munitions, and upgrades to the F-135” and RTX provides the engines for the F-35 Joint Strike Fighter. The CEO indicated that RTX would also benefit from the Pentagon’s spending on “counter unmanned aircraft and hypersonics.”\n\nWhile a significant portion of RTX’s revenue and profit are generated from commercial airlines, I expect that business to be relatively resilient to economic shocks as well, given the very long-term outlook that airlines have to adopt.\n\nKratos Defense & Security (KTOS) a group of soldiers in the desert with a drone flying over their heads\n\nSource: Shutterstock\n\nStory continues\n\nAs I noted in a previous column, Kratos Defense & Security (NASDAQ:KTOS) “provides a variety of defense products, but specializes in developing extremely high tech military drones.”\n\nIn the previous column, I noted Kratos appeared to have been obtaining a large number of contracts from the Pentagon. As a result, I’m not surprised to see the firm reported excellent first-quarter results on May 7. Specifically, its revenue jumped 20% versus the same period a year earlier while its net income came in at $1.3 million, up from a loss of $7 million in Q1 of 2022. Also unsurprisingly, the company’s drone business powered the strong showing as its unmanned systems revenue jumped 24% year-over-year to $59.4 million. Kratos expects its drone business to expand by a robust 20% in 2024.\n\nThe defense contractor has developed the Valkyrie, an AI-powered combat drone. With China and Russia investing a great deal in AI and Iran developing many drones of its own, the U.S. and its allies are likely to continue investing a great deal of money in Kratos’ AI-powered, advanced drones to counter their adversaries.\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) C-130J Super Hercules of the United States Air Force performing at Aero India 2017.\n\nSource: Joe Ravi / Shutterstock.com\n\nLockheed Martin (NYSE:LMT) is a large, multifaceted defense contactor. Over the U.S. government’s last fiscal year, the company benefited from multiple initiatives undertaken by the Pentagon, including increases in its purchases of Lockheed’s F-35 fighter jets, combat rescue helicopters and C130 military transport aircraft. During the current fiscal year, the firm expects to get boosts from elevated outlays on the Sikorsky CH-53K helicopters, its space hypersonic weapon and missile defense systems, which it refers to as the Next Generation Interceptor.\n\nLast quarter, the company’s top line jumped to $17.2 billion, up from $15.1 billion during the same period a year earlier. The company’s earnings per share came in at $6.42, down from $6.62 in Q1 of 2023. However, easing inflationary pressures should boost the company’s bottom line going forward.\n\nWhat’s more, in 2023 Lockheed’s operating income jumped to $9.06 billion from $7.47 billion in 2022, and the shares have a rather low enterprise value/EBITDA ratio of 12.4 times.\n\nOn the date of publication, Larry Ramer did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines\n\nLarry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been SMCI, INTC, and MGM. You can reach him on Stocktwits at @larryramer.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 3 Defense Stocks to Defend Your Portfolio Against Economic Mayhem appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-defense-stocks-defend-portfolio-174627875.html",
        "symbols": [
            "0JS0.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "KTOS.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "WF5A.BE",
            "WF5A.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.065,
            "neu": 0.815,
            "pos": 0.12
        }
    },
    {
        "date": "2024-06-05T00:00:00+00:00",
        "title": "3 Defense Stocks to Defend Your Portfolio Against Economic Mayhem",
        "content": "The U.S. could indeed enter economic mayhem, and, given the state of the world,  defense stocks are a very good way to defend your portfolio.",
        "link": "https://investorplace.com/2024/06/3-defense-stocks-to-defend-your-portfolio-against-economic-mayhem/",
        "symbols": [
            "KTOS.US",
            "LMT.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.567,
            "neg": 0,
            "neu": 0.825,
            "pos": 0.175
        }
    }
]