[
    {
        "date": "2024-05-20T13:06:00+00:00",
        "title": "RTX's Collins Aerospace offers solution for passengers with reduced mobility",
        "content": "Travelers to board and remain in their wheelchairs during flight, offering greater comfort at an affordable cost to airlines\n\nWINSTON-SALEM, N.C., May 20, 2024 /PRNewswire/ -- Collins Aerospace, an RTX (NYSE: RTX) business will unveil its cabin solution for onboard wheelchair accommodation next week at the annual Aircraft Interiors Expo in Hamburg, Germany. The Collins product is compatible with most WC19 and ISO 7176-19 transport-certified powered wheelchair devices, allowing passengers with reduced mobility (PRM) an inflight experience more equivalent to that of able-bodied passengers. The Collins Aerospace wheelchair seating solution provides a more comfortable and dignified flying experience without impacting existing aircraft cabin densities.\n\nImplementation involves installation of a restraint system at the front of a narrow body aircraft to accommodate a wheelchair user. Restraining the wheelchair in place is simple and can easily be carried out by on-board crews without requiring assistance from maintenance staff.\n\n\"Enabling motorized wheelchair users to remain in their chair is imperative to providing a more equitable and dignified air travel experience to the millions of people who rely on personal mobility devices in their everyday lives,\" said Cynthia Muklevicz, vice president of customer and business development for Collins Aerospace. \"Innovating solutions that enhance the inflight and cabin experience is fundamental to the mission of Collins. We're confident this certifiable solution1 will help eliminate barriers, opening greater possibilities to a wider population to more conveniently experience the excitement and necessity of air travel.\"\n\nBoarding and deplaning are also simplified, not only reducing the risk of personal injury and discomfort associated with transporting individuals in and out of their wheelchairs, but also greatly reducing instances of mishandled wheelchairs during the check-in, handling and stowage processes. In recent tests at the National Institute of Aviation Research (NIAR) the boarding process with the Collins solution was shown to be akin to the average ground transportation experience – harmonizing the air travel experience with the typical accommodations found in other modes of transportation.\n\nInstallation of the Collins solution involves an integrated restraint system and seat belt attachments securing both wheelchair and passenger. The restraint system is stowed when not in use. The Collins solution utilizes unused space and does not require seat removal or modification, maintaining a consistent experience for all passengers and allowing airlines to operate with existing densities.\n\nDemonstrations of Collins' integrated seating solution will be held during the Aircraft Interiors Exhibition, May 28-30.\n\nStory continues\n\nAbout Collins Aerospace\r\nCollins Aerospace, an RTX business, is a leader in integrated and intelligent solutions for the global aerospace and defense industry. Our 80,000 employees are dedicated to delivering future-focused technologies to advance sustainable and connected aviation, passenger safety and comfort, mission success, space exploration, and more.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com\n\n1 Based on current regulations and future modifications. Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/rtxs-collins-aerospace-offers-solution-for-passengers-with-reduced-mobility-302149585.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-collins-aerospace-offers-solution-130600633.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.015,
            "neu": 0.836,
            "pos": 0.149
        }
    }
]