[
    {
        "date": "2024-08-16T19:19:17+00:00",
        "title": "US State Dept OKs potential sale of tactical missiles to Canada",
        "content": "The U.S. State Department approved a foreign military sale to Canada of tactical missiles and related support for $264.6 million, the Pentagon said on Friday.",
        "link": "https://www.reuters.com/business/aerospace-defense/us-state-dept-oks-potential-sale-tactical-missiles-canada-2024-08-16/",
        "symbols": [
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.671,
            "neg": 0,
            "neu": 0.8,
            "pos": 0.2
        }
    },
    {
        "date": "2024-08-16T18:53:17+00:00",
        "title": "Defense tech startup Anduril aims to take a Tesla-like approach to weapons manufacturing",
        "content": "Modern warfare is evolving, and Anduril Industries has a plan to capitalize on this shift by reimagining the design and production of American military power.\n\nThe defense technology startup recently raised $1.5 billion in a new funding round to scale its weapons manufacturing. The deal, which was co-led by Peter Thiel’s Founders Fund and Sands Capital, values Anduril at $14 billion, nearly double the startup’s valuation after its previous funding round two years ago.\n\nAnduril’s strategy is to increase American weapons manufacturing by replicating the modern techniques and processes employed by commercial powerhouses such as Elon Musk’s Tesla (TSLA). In other words, it's using a software-first approach flexible enough to build weapons quickly and at scale.\n\n“What we are doing at Anduril is we are taking the risk up front to build the capabilities and to build the infrastructure that we need to deploy those capabilities very quickly,” Trae Stephens, co-founder and executive chairman of Anduril and partner at Founders Fund, told Yahoo Finance (video above).\n\n“Now is that a bet on ourselves that, once we produce these things, the customer will show up to buy it?” Stephens asked. “Absolutely, but I think that is the way it should work. There should be some risk taken from an industry perspective as well.” A Border Patrol agent walks by an Autonomous Surveillance Tower made by Anduril near Sunland Park, New Mexico, on Jan. 18, 2022. (Salwan Georges/The Washington Post via Getty Images) (The Washington Post via Getty Images)\n\nAnduril plans to use the majority of the funds to invest in a new software-defined manufacturing platform and build a new manufacturing facility called Arsenal-1.\n\nThe factory is expected to ultimately employ more than 1,500 people, encompass more than 5 million square feet of manufacturing capacity, and produce tens of thousands of weapons, such as counterstrike drones and autonomous submarines, per year.\n\nWhile the company has not yet determined where the Arsenal-1 facility will be located, it already has experience building out its manufacturing footprint.\n\nIn June, Anduril announced a $75 million investment to increase manufacturing and production capacity for solid rocket motors in Mississippi. That same month, the company also announced the opening of a facility in Rhode Island, enabling Anduril to increase production of underwater drones.\n\nStartups like Anduril, which aim to disrupt the American defense industry and take on the \"primes\" — giants like Boeing (BA), Lockheed Martin (LMT), General Dynamics (GD), RTX (RTX), and Northrop Grumman (NOC) — have attracted venture investors to the sector. StockStory aims to help individual investors beat the market.\n\nBetween 2021 and mid-June of this year, venture capitalists invested $130 billion in defense tech startups, according to PitchBook.\n\nStory continues\n\nNick Beim, a partner at venture firm Venrock, explained investors are eager to invest in the next Anduril, Palantir (PLTR), or SpaceX.\n\n“The character of warfare is changing significantly due to emerging technologies,” Beim recently told Yahoo Finance. “I think the future of warfare will be much more driven by AI software and autonomous systems at the edge than by the traditional military platforms that are used today.”\n\n“Venture-backed companies are now best positioned to provide these critical systems, better positioned than the traditional military suppliers,” Beim added.\n\nStephens declined to say when Anduril would IPO but told Yahoo Finance the company is considering such a move.\n\n“We are starting to think a lot more about that three- to five-year kind of timeline for being ready to go if the market conditions were right and the company continues to grow as well as we have been,” he said.\n\nClick here for the latest technology news that will impact the stock market\n\nRead the latest financial and business news from Yahoo Finance\n\nView comments",
        "link": "https://finance.yahoo.com/news/defense-tech-startup-anduril-aims-to-take-a-tesla-like-approach-to-weapons-manufacturing-185317884.html",
        "symbols": [
            "0BOE.LSE",
            "0IUC.LSE",
            "0K92.LSE",
            "0R2N.LSE",
            "0R3E.LSE",
            "1TSLA.MI",
            "5UR.F",
            "5UR.XETRA",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.98,
            "neg": 0.039,
            "neu": 0.88,
            "pos": 0.081
        }
    },
    {
        "date": "2024-08-16T13:50:16+00:00",
        "title": "Why RTX (RTX) is a Top Momentum Stock for the Long-Term",
        "content": "Taking full advantage of the stock market and investing with confidence are common goals for new and old investors alike.\n\nWhile you may have an investing style you rely on, finding great stocks is made easier with the Zacks Style Scores. These are complementary indicators that rate stocks based on value, growth, and/or momentum characteristics.\n\nIs This 1 Momentum Stock a Screaming Buy Right Now?\n\nDifferent than value or growth investors, momentum-oriented investors live by the saying \"the trend is your friend.\" This investing style is all about taking advantage of upward or downward trends in a stock's price or earnings outlook. Employing factors like one-week price change and the monthly percentage change in earnings estimates, the Momentum Style Score can indicate favorable times to build a position in high-momentum stocks.\n\nRTX (RTX)\n\nIn July 2023, Raytheon Technologies was renamed as RTX Corporation. On Apr 3, 2020, Raytheon Technologies was formed following the completion of merger between United Technologies and Raytheon Company. Based in Waltham, MA, Raytheon Technologies has emerged as an aerospace and defense company, with pro-forma combined annual revenues of $74 billion as of the end of 2019, providing advanced systems and services for commercial, military and government customers worldwide. Effective July 2023, the company operates through three business segments.\n\nRTX sits at a Zacks Rank #3 (Hold), holds a Momentum Style Score of B, and has a VGM Score of B. The stock is up 2.8% and up 14% over the past one-week and four-week period, respectively, and RTX has gained 39% in the last one-year period as well. Additionally, an average of 6,696,440.50 shares were traded over the last 20 trading sessions.\n\nMomentum investors also pay close attention to a company's earnings. For RTX, six analysts revised their earnings estimate upwards in the last 60 days, and the Zacks Consensus Estimate has increased $0.05 to $5.44 per share for 2024. RTX boasts an average earnings surprise of 6.6%.\n\nWith strong earnings growth, a good Zacks Rank, and top-tier Momentum and VGM Style Scores, investors should think about adding RTX to their portfolios.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/why-rtx-rtx-top-momentum-135016843.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.009,
            "neu": 0.821,
            "pos": 0.17
        }
    }
]