[
    {
        "date": "2024-10-11T13:50:12+00:00",
        "title": "Why This 1 Momentum Stock Could Be a Great Addition to Your Portfolio",
        "content": "Taking full advantage of the stock market and investing with confidence are common goals for new and old investors alike.\n\nWhile you may have an investing style you rely on, finding great stocks is made easier with the Zacks Style Scores. These are complementary indicators that rate stocks based on value, growth, and/or momentum characteristics.\n\nIs This 1 Momentum Stock a Screaming Buy Right Now?\n\nMomentum investors, who live by the saying \"the trend is your friend,\" are most interested in taking advantage of upward or downward trends in a stock's price or earnings outlook. Utilizing one-week price change and the monthly percentage change in earnings estimates, among other factors, the Momentum Style Score can help determine favorable times to buy high-momentum stocks.\n\nRTX (RTX)\n\nIn July 2023, Raytheon Technologies was renamed as RTX Corporation. On Apr 3, 2020, Raytheon Technologies was formed following the completion of merger between United Technologies and Raytheon Company. Based in Waltham, MA, Raytheon Technologies has emerged as an aerospace and defense company, with pro-forma combined annual revenues of $74 billion as of the end of 2019, providing advanced systems and services for commercial, military and government customers worldwide. Effective July 2023, the company operates through three business segments.\n\nRTX boasts a Momentum Style Score of B and VGM Score of B, and holds a Zacks Rank #3 (Hold) rating. Shares of RTX has seen some interesting price action recently; the stock is down 0.6% over the past one week and up 2.4% over the past four weeks. And in the last one-year period, RTX has gained 67.7%. As for the stock's trading volume, 5,653,163.50 shares on average were traded over the last 20 days.\n\nMomentum investors don't just pay attention to price changes; positive earnings play a crucial role, too. Two analysts revised their earnings estimate upwards in the last 60 days for fiscal 2024. The Zacks Consensus Estimate has increased $0.02 to $5.46 per share. RTX boasts an average earnings surprise of 6.6%.\n\nWith strong earnings growth, a good Zacks Rank, and top-tier Momentum and VGM Style Scores, investors should think about adding RTX to their portfolios.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/why-1-momentum-stock-could-135012206.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.006,
            "neu": 0.816,
            "pos": 0.178
        }
    }
]