[
    {
        "date": "2024-08-07T12:00:20+00:00",
        "title": "RTX (NYSE:RTX) Takes On Some Risk With Its Use Of Debt",
        "content": "Legendary fund manager Li Lu (who Charlie Munger backed) once said, 'The biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital.' So it might be obvious that you need to consider debt, when you think about how risky any given stock is, because too much debt can sink a company. As with many other companies RTX Corporation (NYSE:RTX) makes use of debt. But is this debt a concern to shareholders?\n\nWhy Does Debt Bring Risk?\n\nDebt is a tool to help businesses grow, but if a business is incapable of paying off its lenders, then it exists at their mercy. Part and parcel of capitalism is the process of 'creative destruction' where failed businesses are mercilessly liquidated by their bankers. However, a more usual (but still expensive) situation is where a company must dilute shareholders at a cheap share price simply to get debt under control. Of course, plenty of companies use debt to fund growth, without any negative consequences. When we examine debt levels, we first consider both cash and debt levels, together.\n\nSee our latest analysis for RTX\n\nWhat Is RTX's Net Debt?\n\nYou can click the graphic below for the historical numbers, but it shows that as of June 2024 RTX had US$42.1b of debt, an increase on US$35.4b, over one year. On the flip side, it has US$6.01b in cash leading to net debt of about US$36.0b. debt-equity-history-analysis\n\nHow Strong Is RTX's Balance Sheet?\n\nThe latest balance sheet data shows that RTX had liabilities of US$49.6b due within a year, and liabilities of US$50.9b falling due after that. Offsetting these obligations, it had cash of US$6.01b as well as receivables valued at US$23.8b due within 12 months. So its liabilities outweigh the sum of its cash and (near-term) receivables by US$70.6b.\n\nRTX has a very large market capitalization of US$153.0b, so it could very likely raise cash to ameliorate its balance sheet, if the need arose. But it's clear that we should definitely closely examine whether it can manage its debt without dilution.\n\nWe use two main ratios to inform us about debt levels relative to earnings. The first is net debt divided by earnings before interest, tax, depreciation, and amortization (EBITDA), while the second is how many times its earnings before interest and tax (EBIT) covers its interest expense (or its interest cover, for short). The advantage of this approach is that we take into account both the absolute quantum of debt (with net debt to EBITDA) and the actual interest expenses associated with that debt (with its interest cover ratio).\n\nRTX has a debt to EBITDA ratio of 3.9 and its EBIT covered its interest expense 2.8 times. Taken together this implies that, while we wouldn't want to see debt levels rise, we think it can handle its current leverage. Even worse, RTX saw its EBIT tank 39% over the last 12 months. If earnings keep going like that over the long term, it has a snowball's chance in hell of paying off that debt. When analysing debt levels, the balance sheet is the obvious place to start. But ultimately the future profitability of the business will decide if RTX can strengthen its balance sheet over time. So if you want to see what the professionals think, you might find this free report on analyst profit forecasts to be interesting.\n\nFinally, a business needs free cash flow to pay off debt; accounting profits just don't cut it. So we clearly need to look at whether that EBIT is leading to corresponding free cash flow. Over the most recent three years, RTX recorded free cash flow worth 72% of its EBIT, which is around normal, given free cash flow excludes interest and tax. This cold hard cash means it can reduce its debt when it wants to.\n\nOur View\n\nWe'd go so far as to say RTX's EBIT growth rate was disappointing. But at least it's pretty decent at converting EBIT to free cash flow; that's encouraging. Looking at the balance sheet and taking into account all these factors, we do believe that debt is making RTX stock a bit risky. Some people like that sort of risk, but we're mindful of the potential pitfalls, so we'd probably prefer it carry less debt. There's no doubt that we learn most about debt from the balance sheet. However, not all investment risk resides within the balance sheet - far from it. Be aware that  RTX is showing  4 warning signs in our investment analysis, and 1 of those is concerning...\n\nOf course, if you're the type of investor who prefers buying stocks without the burden of debt, then don't hesitate to discover our exclusive list of net cash growth stocks, today.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-nyse-rtx-takes-risk-120020798.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.47,
            "neg": 0.146,
            "neu": 0.713,
            "pos": 0.14
        }
    },
    {
        "date": "2024-08-07T10:54:00+00:00",
        "title": "Forget Tech! 3 Value Stocks That Could Win Big From Rate Cuts.",
        "content": "Investors usually rush into tech stocks when rate cuts loom on the horizon, as they do now. Federal Reserve Chair Jerome Powell just said that those cuts could come in September. However, it makes sense to also consider value stocks.\n\nLower lending rates benefit all sectors, and value shares must not be overlooked. Although the relationship between value stocks and rate cuts isn’t as well established as in tech stocks, there are reasons to invest.\n\nMany value stocks exist in cyclical sectors that also tend to perform well during expansionary periods. That bodes well for many value stocks, which will also be stimulated by the breakouts.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nThe economic stimulus of lower rates should also serve to increase earnings growth. That should make value stocks more attractive in the process. There’s also the issue of mean reversion. Growth stocks have been overvalued for quite some time, and the pivot toward a more value-oriented investment style is overdue. That suggests that value stocks could win big from rate cuts.\n\nPfizer (PFE) Pfizer logo on Pfizer building. Pfizer is an American pharmaceutical corporation.\n\nSource: Manuel Esteban / Shutterstock.com\n\nThe notion that Pfizer (NYSE:PFE) stock makes sense for its value is one thing, its performance is another.\n\nPfizer just released better-than-expected earnings, with revenues and per-share earnings beating consensus expectations. The $13.28 billion in sales bested the $13.02 billion expected, representing 2% growth. Per share earnings fell by 11% to $0.60, but that was better than the 46 cents Wall Street had anticipated.\n\nPfizer continues to deal with issues related to the decline of pandemic revenues and concerns over its future, which has led to its undervaluation. Yet, the company has a strong pipeline, particularly in oncology, following its Seagen acquisition. The potential is there over the long term, and the recent outperformance should serve to bolster that notion.\n\nPfizer seems to believe so, as the company raised the midpoint of its full-year revenue and EPS guidance following the earnings release. Rate cuts should help Pfizer increase its research and development spending, especially in relation to GLP-1 drugs, which it intends to push into regulatory studies next year.\n\nPrologis (PLD) The Prologis (PLD) logo displayed on a smartphone screen.\n\nSource: rafapress / Shutterstock.com\n\nPrologis (NYSE:PLD) is an industrial REIT, which should offer immediate clues as to why it’s undervalued. The company operates and leases logistics facilities that aren’t as attractive in a high-rate environment. Business slows as rates rise, and those same firms are less able to shore up their logistical capabilities. Thus, they are less likely to contract with Prologis.\n\nStory continues\n\nAs rates fall, the opposite is true. That results in all kinds of positives for Prologis. One of the most important factors is the increase in operating funds. That’s important for REITs because they pay required dividends from operating funds. Prologis’ trailing 12 months of funds from operations is $4.85. The company currently pays dividends per share of 96 cents. That equates to $3.84, meaning Prologis is paying a lot to fund its dividend. That should fall with lower lending rates, increasing the attractiveness of the dividend in the process.\n\nRTX (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nBig public-side firms like RTX (NYSE:RTX) aren’t normally the first to pop into mind when considering stocks that should benefit from rate cuts.\n\nGenerally speaking, big defense firms benefit in a sort of trickle-down fashion when rates fall. The idea is that RTX and others generally benefit from the economic stimulation of decreased lending rates, which spurs increased tax revenues and bigger defense budgets. Big defense firms don’t benefit as much from the positive effects of rate cuts on lending: They tend to remain highly creditworthy due to their Coles government ties.\n\nNevertheless, RTX is poised to benefit from rate cuts overall. It’s really about those general factors that help all defense firms and RTX’s internal strengths. I’m referring to something called the PEG ratio. It factors in the effects of the regular P/E ratio and projected growth. If it is under one, it suggests that the firm is undervalued and poised for growth. RTX is exactly that, with impressive earnings growth on the horizon.\n\nOn the date of publication, Alex Sirois did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nAlex Sirois is a freelance contributor to InvestorPlace whose personal stock investing style is focused on long-term, buy-and-hold, wealth-building stock picks. Having worked in several industries from e-commerce to translation to education and utilizing his MBA from George Washington University, he brings a diverse set of skills through which he filters his writing.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post Forget Tech! 3 Value Stocks That Could Win Big From Rate Cuts. appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/forget-tech-3-value-stocks-105400072.html",
        "symbols": [
            "0KOD.LSE",
            "5UR.F",
            "5UR.XETRA",
            "P1LD34.SA",
            "PFE.US",
            "PLD.US",
            "PLDGP.US",
            "POJN.STU",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.036,
            "neu": 0.787,
            "pos": 0.177
        }
    },
    {
        "date": "2024-08-07T00:00:00+00:00",
        "title": "Forget Tech! 3 Value Stocks That Could Win Big From Rate Cuts.",
        "content": "Several value stocks are poised to benefit richly from upcoming rate cuts that could happen as soon as September when the Fed reconvenes.",
        "link": "https://investorplace.com/2024/08/forget-tech-3-value-stocks-that-could-win-big-from-rate-cuts/",
        "symbols": [
            "PFE.US",
            "PLD.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.796,
            "neg": 0.072,
            "neu": 0.59,
            "pos": 0.338
        }
    }
]