[
    {
        "date": "2024-08-29T16:25:39+00:00",
        "title": "Lockheed-Raytheon JV secures $1.3 billion Javelin missile contract from U.S. Army",
        "content": "(Reuters) - A joint venture between Lockheed Martin and RTX's Raytheon was awarded a $1.3 billion follow-on contract by the U.S. army for its Javelin missiles, which has played a major role in Ukraine's defense against Russia's invasion, Lockheed said on Thursday.\n\nThis latest agreement is part of a larger contract awarded last year, which could reach up to $7.2 billion for an \"indefinite quantity\" of missiles between 2023 and 2026.\n\nSince then, the joint venture has been ramping up Javelin production, with plans to reach an annual manufacturing capacity of around 4,000 missiles by late 2026.\n\nThe new contract includes the production of more than 4,000 Javelins specifically to replenish stocks sent to Ukraine, the Maryland-based defense contractor said.\n\nDemand for U.S. weaponry, particularly shoulder-mounted Javelin systems, remains high in Europe due to the ongoing conflict between Ukraine and Russia.\n\n(Reporting by Pratyush Thakur in Bengaluru; Editing by Tasim Zahid)",
        "link": "https://ca.finance.yahoo.com/news/lockheed-raytheon-jv-secures-1-162539449.html",
        "symbols": [
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.818,
            "neg": 0.036,
            "neu": 0.86,
            "pos": 0.103
        }
    },
    {
        "date": "2024-08-29T09:25:03+00:00",
        "title": "Jim Cramer on Raytheon Technologies Corp (RTX): ‘I Like Defense Stocks, And This One Is My Favorite’",
        "content": "We recently compiled a list of the 10 Stocks Jim Cramer Believes Will Soar.In this article, we are going to take a look at where Raytheon Technologies Corp (NYSE:RTX) stands against the other stocks Jim Cramer believes will soar.\n\nOn a recent episode of Mad Money, Jim Cramer reflects on Wall Street's favorite GPU maker's remarkable journey and current status in the stock market. After the sharp decline three weeks ago, caused by the sudden sell-off linked to the yen carry trade, the market is rebounding.\n\n\"We’ve had a remarkable run from the lows three weeks ago as we realized that the forced selling caused by the implosion of the yen carry trade is merely temporary.\"\n\nCramer notes that the Federal Reserve's upcoming rate cuts should support this recovery. However, Wall Street has become more selective, and investors are less forgiving of mediocre results now that the market has rallied significantly.\n\n\"Now the Fed is our friend again with rate cuts on the way, starting at next month’s Federal Open Market Committee meeting. At the same time, though, after such a spectacular rally, Wall Street’s gotten a little more discerning. Investors are no longer willing to give companies a pass for less-than-stellar results once we reach more elevated levels. That’s what happens—the exuberance goes away. Now we’re in a tricky moment that feels like a race against time.\"\n\nCramer emphasizes that the current economic climate is uncertain. The economy is slowing, and while the Fed's rate cuts are expected to help, their impact is unpredictable. The effectiveness of these measures and the extent of the economic downturn remain unclear.\n\n\"While the economy is slowing and we know the Fed rate-cut cavalry is riding to the rescue, we just don’t know how effective it will be and how bad things will get before Fed Chief Powell manages to turn the tide—and he will. We need to figure out how quickly the economy will deteriorate and how quickly the rate cuts will work their magic. Both of these are judgment calls, and we don’t necessarily have enough data to decide either way. We never do at this point in what we call the economic cycle.\"\n\nJim Cramer: In my 43 Years on Wall Street, I’ve Never Seen Anything Like This\n\nAccording to Cramer, Nvidia has captured extraordinary attention from investors. He describes it as a groundbreaking company, now valued at $3.2 trillion, a dramatic increase from $580 billion just 18 months ago. Cramer highlights its dominance in the semiconductor industry and its influence on technology, particularly in artificial intelligence.\n\n\"I searched for comparisons and came up grasping at something ethereal to describe this incredible $3.2 trillion company, which was worth just $580 billion 18 months ago. It has captivated not just investors but people far removed from the stock market. It’s almost miraculous how many have had life-changing experiences because of this single stock.\"\n\nDespite its impressive achievements, Cramer notes that the stock's performance will be scrutinized closely. He points out that the company's quarterly results need to surpass high expectations, including significant revenue beats and strong future guidance.\n\n\"But tomorrow, the stock will descend into mere mortality, and I feel compelled to explain why. Why does it hold such a high status, and why can it never fully live up to the hype of its $3.2 trillion market cap based solely on one quarterly report? The quarter is about it beating earnings estimates, topping revenue numbers, and crushing forecasts. The stock has run so high that it needs a $2 billion revenue beat and guidance that’s $2 billion higher than expected, along with a bullish conference call discussing a strong roadmap. And let’s not forget a gigantic buyback because the company has too much cash sitting idle.\"\n\nCramer concludes that the company's technology is so advanced that it’s difficult to fully grasp its future potential. Despite this, he believes the company's achievements should be celebrated, and the stock might still hold significant upside surprises.\n\n\"The bottom line: I don’t want to be poetic, but it excels in ways that are unmatched. We should celebrate its achievements and bring on those upside surprises.\"\n\nOur Methodology\n\nIn this article, we examine a recent episode of Jim Cramer's Mad Money, where he highlighted ten stocks with strong potential for growth. We also analyze hedge fund perspectives on these stocks and rank them according to hedge fund ownership, from the least to the most.\n\nAt Insider Monkey we are obsessed with the stocks that hedge funds pile into. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\n\nAn aerial view of a commercial jetliner in flight, its airframe glinting in the sun.\n\nRaytheon Technologies Corp (NYSE:RTX)\n\nNumber of Hedge Fund Investors: 54\n\nJim Cramer shares his thoughts on Raytheon Technologies Corp (NYSE:RTX), a defense stock that faced a significant drop due to a recall of certain engines. During this downturn, Raytheon Technologies Corp (NYSE:RTX) bought back a large amount of its own stock, a move Cramer praises as one of Greg Hayes’ greatest achievements.\n\n\"Well, let me say this about RTX. When the stock went down really badly because of the recall of certain engines, the company bought a ton of stock. It was one of the greatest things Greg Hayes has ever done. Now Greg has just stepped down, and Chris Calio is in charge. I think he's going to do a good job. At 21 times earnings, I like it very much. I like defense stocks, and this one is my favorite.\"\n\nRaytheon Technologies Corp (NYSE:RTX)’s broad portfolio, including advanced missile systems, avionics, and satellite technologies, is well-suited to benefit from increased global defense spending and the rising need for advanced aerospace solutions.\n\nRaytheon Technologies Corp (NYSE:RTX)’s substantial order backlog reflects strong demand for its products and provides a clear path for future revenue growth. Its ongoing investment in research and development drives innovation in key areas such as hypersonic weapons and cybersecurity, giving it a competitive advantage. Moreover, Raytheon Technologies Corp (NYSE:RTX)’s strategic acquisitions, like its merger with United Technologies, have broadened its capabilities and market presence.\n\nOverall RTX ranks 2nd on our list of the stocks Jim Cramer believes will soar. While we acknowledge the potential of RTX as an investment, our conviction lies in the belief that under the radar AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for a promising AI stock that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nREAD NEXT:$30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/jim-cramer-raytheon-technologies-corp-092503106.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.048,
            "neu": 0.805,
            "pos": 0.147
        }
    }
]