[
    {
        "date": "2024-09-25T14:52:00+00:00",
        "title": "This Under-the-Radar Sector Is Getting Ready to Take Flight Amid Falling Rates",
        "content": "Fed's jumbo rate cuts have eased recession fears as stocks reach record highs. Meanwhile, the industrial sector shows growth potential amid the broadening rally. We'll take a look at the sector's prospects and one stock worth considering. Looking for actionable trade ideas to navigate the current market volatility? Unlock access to InvestingPro’s AI-selected stock winners for under $9 a month!\n\nThe market has made it clear: rate cuts don't signal an imminent recession, won't bring inflation back, and don’t cap equity yields.\n\nDespite early fears in 2022 that a recession was inevitable due to the inverted yield curve and soaring inflation, those concerns never materialized.\n\nInflation appears to be under control, the Fed has already cut rates, and the stock market continues to hit record highs.\n\nHistorically, the 12-month returns following a Fed rate cut have been solid. The chart below tracks future yields after each rate cut since 1957, and the numbers speak for themselves—annual returns have been impressive. 12-Month Equity Returns\n\nIndustrials Could Ride the Rate-Cut Wave Higher\n\nIf you're looking for the next hot sector, consider industrials. Over the past decade, it has surged over 200%, driven by a strong bullish trend.\n\nBut when we compare it to the Nasdaq, we see industrials have hit new lows in the past four years. This isn’t a sign of weakness in industrial stocks but rather the exceptional strength of growth stocks. Industrial Sector Vs. Nasdaq\n\nTop Stocks to Watch From the Sector\n\nHere are 10 stocks that could extend the bullish trend in the coming months:\n\nGE Aerospace (NYSE:GE) Caterpillar (NYSE:CAT) RTX Corp. (NYSE:RTX) Union Pacific (NYSE:UNP) Uber Technologies (NYSE:UBER) Honeywell International (NASDAQ:HON) Eaton Corporation (NYSE:ETN) Lockheed Martin (NYSE:LMT) Boeing (NYSE:BA) Automatic Data Processing (NASDAQ:ADP)\n\nWe’ve ranked them in Pro watchlists based on analysts' predicted upside potential. PRO Watchlist\n\nSource: InvestingPro\n\nA review of their performance over the past five years, as well as the last year, reveals robust growth across the board, with analysts projecting an average upside of 20%.\n\nThe majority of these companies belong to the aerospace and ground transportation sectors. Analysis Section\n\nSource: InvestingPro\n\nUber Technologies: The Top Pick?\n\nAdditionally, when ranked by growth rate, Uber Technologies stock emerges as both a top performer and one of the most undervalued stocks. Analysts' watchlists indicate substantial upside potential. Ranking by Growth Rate\n\nSource: InvestingPro\n\nThis indicates a substantial price increase during this period, signaling a favorable market response to the company's strategies.\n\nStory continues Annual Return Vs. Competitor\n\nSource: InvestingPro\n\nUber’s financial health score supports its bullish outlook, with a rating of 4 out of 5.\n\nThe company boasts a low price-to-earnings (P/E) ratio relative to its short-term earnings growth, further highlighting its undervalued status. PEG Ratio\n\nSource: InvestingPro\n\nAnalysts expect Uber to be profitable this year, signaling stronger revenue than costs—a key indicator of its potential to continue growing and reinvesting in its business. Net Income to Common Ex. Extra Items\n\nSource: InvestingPro\n\nBottom Line\n\nThe current market landscape offers attractive opportunities, especially in the industrial sector. With rate cuts alleviating recession concerns and some stocks showing notable growth potential, investors should look for strategic positions.\n\nCompanies like Uber Technologies highlight a mix of strong financial health and undervaluation, positioning them well for future gains.\n\nSubscribe now with an exclusive discount and unlock access to several market-beating features, including:\n\nInvestingPro Fair Value: Instantly find out if a stock is underpriced or overvalued. AI ProPicks: AI-selected stock winners with proven track record. Stock Screener: Search for the best stocks based on hundreds of selected filters, and criteria. Top Ideas: See what stocks billionaire investors such as Warren Buffett, Michael Burry, and George Soros are buying. Subscribe Today!\n\n***\n\nDisclaimer:This article is written for informational purposes only. It is not intended to encourage the purchase of assets in any way, nor does it constitute a solicitation, offer, recommendation or suggestion to invest. I would like to remind you that all assets are evaluated from multiple perspectives and are highly risky, so any investment decision and the associated risk is at the investor's own risk. We also do not provide any investment advisory services. We will never contact you to offer investment or advisory services.\n\nRelated Articles\n\nThis Under-the-Radar Sector Is Getting Ready to Take Flight Amid Falling Rates\n\nFedEx Stock: Why Analysts Think This Rebound Still Has Legs\n\n3 Undervalued Chinese Stocks Poised to Take Off Thanks to Beijingâ\u0080\u0099s Stimulus\n\nView comments",
        "link": "https://finance.yahoo.com/news/under-radar-sector-getting-ready-145200471.html",
        "symbols": [
            "0A1U.IL",
            "ADP.US",
            "BA.US",
            "CAT.US",
            "ETN.US",
            "GE.US",
            "HON.US",
            "LMT.US",
            "RTX.US",
            "U1BE34.SA",
            "UBER.NEO",
            "UBER.US",
            "UNP.US",
            "UT8.F",
            "UT8.STU",
            "UT8.XETRA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.048,
            "neu": 0.779,
            "pos": 0.174
        }
    },
    {
        "date": "2024-09-25T13:00:00+00:00",
        "title": "RTX's Raytheon completes first AN/TPY-2 radar for the Kingdom of Saudi Arabia",
        "content": "This latest version features GaN technology for increased sensitivity.\n\nTUCSON, Ariz., Sept. 25, 2024 /PRNewswire/ -- Raytheon, an RTX (NYSE: RTX) business, has delivered the first AN/TPY-2 radar for the Kingdom of Saudi Arabia. The AN/TPY-2 is a missile defense radar that can detect, track and discriminate ballistic missiles in multiple phases of flight.\n\nThis is the first AN/TPY-2 radar with a complete Gallium Nitride, or GaN, populated array in the system. GaN is a glasslike material that offers key advantages over other radio frequency semiconductors in energy efficiency, weight and power output. GaN technology provides greater sensitivity to increase range as well as expand surveillance capacity. This technology is also a key enabler in allowing the AN/TPY-2 radar to support the hypersonic mission.\n\n\"The latest AN/TPY-2 radar is now in a different class with Raytheon making more than 50 enhancements to the radar,\" said Paul Ferraro, President, Air & Space Defense Systems, Raytheon. \"These upgrades will help Saudi Arabia to better defend itself from missile threats and will additionally benefit the entire fleet with enhanced sensing capability.\"\n\nAN/TPY-2 operates in the X-band of the electromagnetic spectrum. This enables it to see targets more clearly and distinguish between an actual threat to a defended area and non-threat objects, like separation debris. When operating in Terminal mode, AN/TPY-2 is directly in the fire control loop of the Terminal High Altitude Area Defense (THAAD) ballistic missile defense system through its direct communication with the THAAD missile.\n\nAbout Raytheon Raytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-raytheon-completes-first-antpy-2-radar-for-the-kingdom-of-saudi-arabia-302258589.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-raytheon-completes-first-tpy-130000224.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.031,
            "neu": 0.802,
            "pos": 0.166
        }
    }
]