[
    {
        "date": "2024-07-10T17:07:08+00:00",
        "title": "3 Defense Stocks With Strong Dividend Track Records",
        "content": "3 Defense Stocks With Strong Dividend Track Records\n\nBenzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\n\nMilitary spending is consistently a significant part of the United States budget, and there are no signs of that abating any time soon. In fact, for the 2025 fiscal year, the U.S. Department of Defense has requested $850 billion in defense spending, a number that represents approximately 3% of the U.S. GDP. The vast defense budget is deployed across a wide variety of contractors, many of which are publicly traded. There are a few standouts that have a solid dividend yield and a consistent growth story.\n\nDon’t Miss: Finance companies are leaving New York for this hot city. Investing in its booming real estate market has never been more accessible.\n\nAn Aristocrat In The Making\n\nLockheed Martin (NYSE:LMT) is primarily known as a defense technology company. Its wide portfolio of products features aircraft, including both helicopters and military planes; radar and electronic warfare; submersible vehicles; space technology; and missiles. It frequently receives key contracts from the U.S. Department of Defense, including an over $500 million contract update with the Air Force.\n\nIn its most recent quarter, it achieved net sales of over $17.2 billion. But what might most interest investors is the money it returns to investors. During the quarter, it announced $1.8 billion in share buybacks and dividends, returning $780 million to shareholders in dividends.\n\nLockheed Martin's forward dividend yield is 2.73%. While some companies decreased or paused their dividends during the pandemic, Lockheed continued to grow its dividend at $3.15 or $12.30 annualized. It is in its 24th year of increasing dividends, bringing it very close to dividend aristocrat status. While the stock price has fluctuated, it has risen by nearly 25% over the past five years. Lockheed Martin's $159 billion backlog should keep business steady for years.\n\nTrending: Mark Cuban believes “the next wave of revenue generation is around real estate and entertainment” — this new real estate fund allows you to get started with just $100.\n\nA Former Dividend Aristocrat Still Shines\n\nIn 2023, Raytheon rebranded to RTX, bringing together Collins Aerospace, Pratt & Whitney, and Raytheon under a single name. Raytheon saw defense sales rise by 7% during the first quarter. Like Lockheed Martin, RTX has a substantial backlog of business, over $202 billion, as demand grows for its technology-driven products. RTX is heavily tied to the U.S. military but receives key contracts from other nations, including a $1.2 billion contract from Germany for radar, launchers, and command and control stations.\n\nStory continues\n\nThe dividend story is more modest here. RTX delivers a 2.52% forward dividend yield, but the annual dividend is $2.36. However, it was a dividend aristocrat until it decreased its dividend during the 2020 pandemic. While it has yet to achieve the dividend it was delivering before the pandemic, it has raised its dividend consistently over the past four years, and the stock price is up over 20% during the last five years.\n\nBy Land, Sea, And More\n\nFounded in 1952, General Dynamics has multiple business units related to defense, including aerospace, combat systems, and marine systems. Like RTX, its strength expands far beyond the U.S. military. It has contracts with various nations, including Romania, Austria, and Canada, delivering combat vehicles, submarines, and more. Gulfstream Aerospace is also a wholly owned subsidiary of General Dynamics, giving it more than military strength.\n\nDuring its most recent quarter, General Dynamics paid $361 million in dividends. The forward dividend yield is 2.02% and the annual dividend is $5.36. It started paying a dividend in 2012 and has raised that dividend consistently over time. It has a $93.7 billion backlog of business, up 4.4% year over year. The stock price has risen approximately 50% over the past five years.\n\nDefense spending may fluctuate over time, but it is unlikely to disappear from national budgets anytime soon. That is a powerful incentive for companies that have a history of contracts with national militaries to keep innovating, capture more of that money over time, and potentially share profits with investors.\n\nCheck Out Some of Benzinga's Top Picks for Private Market Opportunities Available Now:\n\nIntegris Secured Credit Fund IV\n\nThe fund provides a fixed annual return of 12%, payable quarterly, over a 2-year period starting April 2024 and ending April 2026. The note is secured by collateral with an estimated value of $71M, with an anticipated loan-to-value ratio of 14%.\n\nMinimum investment: $100,000 Available to: Accredited investors View fund information\n\nAustin Cityfund\n\nInvest in the future growth of Austin's real estate market through an innovative home equity investment product. Austin Cityfund's assets have already appreciated 10.90% since July, delivering strong returns for investors.\n\nMinimum investment: $500 Available to: Accredited and non-accredited investors Invest in Austin\n\nView more private market offerings on Benzinga's Alternative Investment screener.\n\nThis article 3 Defense Stocks With Strong Dividend Track Records originally appeared on Benzinga.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-defense-stocks-strong-dividend-170708945.html",
        "symbols": [
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.016,
            "neu": 0.857,
            "pos": 0.126
        }
    },
    {
        "date": "2024-07-10T13:00:00+00:00",
        "title": "RTX tests new battle management concepts at Valiant Shield",
        "content": "Capabilities demonstrated support for the U.S. Army's Mission Command On-The-Move concept and the Air Force Research Lab\n\nPHILIPPINES, July 10, 2024 /PRNewswire/ -- Collins Aerospace, an RTX (NYSE: RTX) business, successfully demonstrated mobile, distributed command and control during a series of fires, networking and mission command experiments at INDOPACOM's Valiant Shield exercise.\n\nCollins partnered with the U.S. Army's 1st Multi-Domain Task Force to conduct the experiments—inside a ground vehicle—to rapidly reconfigure and deploy capabilities based on evolving mission needs. The mission command 'on-the-move' concept uses commercial and military communications networks to provide access to multiple intelligence sources. To 'make sense' of the data from various sources, the company used an AI/ML battle management software. This created fused situational awareness that can be shared with bilateral and joint force partners.\n\n\"Mobile command and control capabilities give battle management operators and commanders the ability to replicate fixed site capabilities at the very edge of the fight,\" said Elaine Bitonti, vice president and general manager, Connected Battlespace & Emerging Capabilities for Collins Aerospace. \"Our agile, distributed demonstration concept provides the Army with the ability to maintain Mission Command On-the-Move.\"\n\nValiant Shield is a biennial field training that builds real-world proficiency in sustaining U.S. forces through detecting, locating, tracking, and engaging units at sea, in the air, on land, and in cyberspace in response to a range of mission areas.\n\nAbout Collins Aerospace  \r\nCollins Aerospace, an RTX business, is a leader in integrated and intelligent solutions for the global aerospace and defense industry. Our 80,000 employees are dedicated to delivering future-focused technologies to advance sustainable and connected aviation, passenger safety and comfort, mission success, space exploration, and more.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com. Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtx-tests-new-battle-management-concepts-at-valiant-shield-302193059.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-tests-battle-management-concepts-130000407.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.99,
            "neg": 0.02,
            "neu": 0.838,
            "pos": 0.142
        }
    },
    {
        "date": "2024-07-10T12:00:00+00:00",
        "title": "U.S. Army selects RTX's RCADE defense analysis solution to enable future concept experimentation",
        "content": "Large-scale modeling and simulation will help military leaders quickly solve highly complex problems across domains\n\nARLINGTON, Va., July 10, 2024 /PRNewswire/ -- Raytheon, an RTX (NYSE: RTX) business, has been awarded a contract from the U.S. Army Futures Command (AFC) Futures and Concepts Center (FCC) to conduct theater level concept experimentation and mission analysis to support agile learning of the future battlefield.\n\nUnder the contract, a Raytheon team will use its Rapid Campaign Analysis and Demonstration Environment, known as RCADE, to develop large-scale theater scenarios to help FCC leaders assess concepts of operations in a multi-domain conflict. Quantitative data and findings from the scenarios will help identify capabilities needed to succeed in future conflicts.\n\n\"RCADE helps our customers look at some of the most difficult missions and evaluate how to change the outcome for the positive,\" said Colin Whelan, president of Advanced Technology at Raytheon. \"Our team of highly trained experts power this groundbreaking capability, enabling it to deliver credible, unbiased solutions.\"\n\nRCADE is part of Raytheon's integrated ecosystem of modeling and simulation capabilities that are fed by real-world analytics, models, and data. It creates an experimentation environment where customers can explore battlefield scenarios, assess how different variables impact mission outcomes and quickly iterate their options with greater speed.\n\nIn tandem with RCADE, the technical expertise provided by Raytheon engineers will complement the U.S. Army's analysis enterprise. They will work together to meet the challenge of the future and solve complex evolving threats.\n\nAbout Raytheon\n\nRaytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nAbout RTX\n\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com  Cision\n\nView original content:https://www.prnewswire.com/news-releases/us-army-selects-rtxs-rcade-defense-analysis-solution-to-enable-future-concept-experimentation-302192967.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/u-army-selects-rtxs-rcade-120000674.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.982,
            "neg": 0.056,
            "neu": 0.8,
            "pos": 0.145
        }
    }
]