[
    {
        "date": "2024-09-27T12:58:00+00:00",
        "title": "RTX Ships Its AN/TPY-2 Radar to the Kingdom of Saudi Arabia",
        "content": "RTX Corporation’s RTX business segment, Raytheon, recently shipped the first AN/TPY-2 radar to the Kingdom of Saudi Arabia.  This is RTX’s first AN/TPY-2 radar equipped with a complete Gallium Nitride, or GaN technology, which delivers increased sensitivity, allowing for wider range and surveillance capability.\r\n\r\nThis technology also plays an important role in allowing the AN/TPY-2 radar to assist the hypersonic mission.\n\nRTX’s Expertise in Making Top-Grade Radars\n\nWith the rapid rise of geopolitical tensions in recent years, governments throughout the world have dramatically increased their military arsenals. As radars constitute a crucial component of this arsenal, rising defense spending has resulted in a rise in demand for combat-proven radars.\r\n\r\nThis must have been ushering in a solid order flow for radar manufacturing companies like RTX, whose extensive expertise in radar technology applies to a vast range of advanced radar systems for various applications, including air defense, missile defense, maritime surveillance and a few more. The latest contract win is a bright example of that.\r\n\r\nIn particular, RTX's AN/TPY-2 is a missile defense radar capable of detecting, tracking and distinguishing ballistic missiles. It operates in the X band of the electromagnetic spectrum, allowing it to see objects more clearly. The radar comes in two models — one for detecting rising ballistic missiles and another for guiding interceptors to a descending warhead.\n\nRTX Stock’s Growth Opportunities\n\nThe need for military radars has skyrocketed in recent years due to several factors, such as rising defense spending in developing countries, increased geopolitical tensions and inter-country conflicts that have heightened threats from missiles and aircraft. This must have prompted the Markets and Markets firm to project a CAGR of 5.4% for the military radar market in the 2024-2029 period. Such growth projections bode well for prominent radar manufacturers like RTX.\r\n\r\nRTX’s product portfolio consists of varied radars like SPY 6, APG-63(V)3, APG-79 and APG-82(V)1 and GhostEye MR and a few more that enjoy solid demand in the global military radar market.\n\nProspects for RTX’s Peers\n\nSome other defense contractors, which are also major radar producers, are projected to gain from the expanding global military radar industry. Those companies have been discussed below.\r\n\r\nLockheed Martin LMT: The company’s radars are the choice of more than 45 nations across six continents. Its product portfolio consists of varied radars like missile defense radars, ballistic missile radars as well as surveillance radars like TPY-4, the AN/APY-9 Radar, the AN/TPQ-53 Radar System, SPY-7, TPS-77 and Sentinel A4.\r\n\r\nLMT has a long-term (three to five years) earnings growth rate of 4.7%. The Zacks Consensus Estimate for the company’s 2024 sales indicates year-over-year growth of 5.3%.\r\n\r\nNorthrop Grumman NOC: The company has been at the forefront of Active Electronically Scanned Array (AESA) innovations for more than 60 years now and is a pioneer in AESA radars. Its diverse product portfolio also includes a handful of other radars like AN/ZPY-5 VADER, AN/TPS-80 G/ATOR, AN/TPS-78 and HAMMR.\r\n\r\nNorthrop has a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for the company’s 2024 sales indicates year-over-year growth of 5.4%.\r\n\r\nL3Harris Technologies LHX: The company is a renowned manufacturer of combat-proven radars. Its product portfolio includes SPS-48 land-based surveillance radar, AN/APY-11 Multimode radar, Tactical Air Surveillance radar, AN/SPS-48G Long range 3D surveillance radar and many more. \r\n\r\nL3Harris has a long-term earnings growth rate of 8.9%. The Zacks Consensus Estimate for LHX’s 2024 sales implies an improvement of 9.6% from the prior-year figure.\n\nStory continues\n\nRTX Stock’s Price Movement\n\nIn the past six months, shares of RTX have risen 23.4% against the industry’s decline of 0.9%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nRTX’s Zacks Rank\n\nRTX currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nL3Harris Technologies Inc (LHX) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-ships-tpy-2-radar-125800235.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.XETRA",
            "LHX.US",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.018,
            "neu": 0.827,
            "pos": 0.155
        }
    }
]