[
    {
        "date": "2024-07-25T23:51:11+00:00",
        "title": "RTX Sets Aside $959 Million to End Corruption, Price Probes",
        "content": "(Bloomberg) -- RTX Corp. said it has set aside a combined $959 million as part of a deal with the US government to settle a criminal investigation into pricing for missile and defense services, as well as a separate corruption probe.\n\nMost Read from Bloomberg\n\nTrump Risks Losing Voters He Needs With Loaded Attacks on Harris Harris Just Showed Why Trump Is So Afraid of Her Stocks Caught in Tug of War Between Tech and Rest: Markets Wrap Markets Tear Up Popular Trades That Reached ‘Stupid Levels’ I Changed My Mind. The Fed Needs to Cut Rates Now.\n\nThe company, formerly known as Raytheon, expects to enter into a three-year deferred-prosecution agreement with the Justice Department, which will include oversight by a corporate monitor, RTX said Thursday in filing with the US Securities and Exchange Commission.\n\nRTX has set aside $575 million to cover potential penalties that come out of the defective pricing probes and another $384 million for the corruption matter, according to the filing.\n\nThe Justice Department in Washington declined to comment. A representative for RTX didn’t immediately respond to a request for comment sent outside of normal business hours.\n\nThe Justice Department began investigating Raytheon in October 2020 and its probe looked into pricing claims made by Raytheon for missiles and defense contracts entered into between 2011 and 2013 as well as one from 2017, filings show. Separately, the government has been investigating possible improper payments by Raytheon involving contracts with certain Middle East countries.\n\nBloomberg reported in June that RTX was in the late stages of a resolution.\n\n--With assistance from Tom Schoenberg.\n\n(Updates with Justice Department declining to comment.)\n\nMost Read from Bloomberg Businessweek\n\nThe Miseducation of America’s Nurse Practitioners The $12,000 Harvard Class Celebrities Are Fighting to Get Into Joe Rogan Invaded Austin and Became Comedy’s New Kingmaker The US Economy Is Slowing, Which Is Just Fine With the Fed Elon Musk Goes All In for Trump\n\n©2024 Bloomberg L.P.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-sets-aside-959-million-230126021.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.84,
            "neg": 0.063,
            "neu": 0.836,
            "pos": 0.1
        }
    },
    {
        "date": "2024-07-25T21:37:14+00:00",
        "title": "L3Harris raises 2024 outlook amid global tensions",
        "content": "L3Harris raised its outlook for 2024 after beating Wall Street estimates for second-quarter profit on Thursday, betting on sustained weapons demand and robust defense spending amid escalating global security concerns.",
        "link": "https://www.reuters.com/business/aerospace-defense/l3harris-raises-2024-outlook-amid-global-tensions-2024-07-25/",
        "symbols": [
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.202,
            "neg": 0.187,
            "neu": 0.581,
            "pos": 0.232
        }
    },
    {
        "date": "2024-07-25T20:30:33+00:00",
        "title": "Why RTX (RTX) Stock Is Trading Up Today",
        "content": "Why RTX (RTX) Stock Is Trading Up Today\n\nWhat Happened:\n\nShares of aerospace and defense company Raytheon (NYSE:RTX) jumped 10% in the afternoon session after the company reported a \"beat and raise\" quarter. RTX blew past analysts' organic revenue expectations. Its revenue also outperformed Wall Street's estimates. That the company raised full year revenue and EPS expectations is icing on the cake. Overall, we think this was a really good quarter that should please shareholders.\n\nIs now the time to buy RTX? Access our full analysis report here, it's free.\n\nWhat is the market telling us:\n\nRTX's shares are not very volatile than the market average and over the last year have had only 3 moves greater than 5%. In context of that, today's move is indicating the market considers this news meaningful, although it might not be something that would fundamentally change its perception of the business.\n\nRTX is up 33.2% since the beginning of the year, and at $113.50 per share, has set a new 52-week high. Investors who bought $1,000 worth of RTX's shares 5 years ago would now be looking at an investment worth $832.36.\n\nHere at StockStory, we certainly understand the potential of thematic investing. Diverse winners from Microsoft (MSFT) to Alphabet (GOOG), Coca-Cola (KO) to Monster Beverage (MNST) could all have been identified as promising growth stories with a megatrend driving the growth. So, in that spirit, we’ve identified a relatively under-the-radar profitable growth stock benefitting from the rise of AI, available to you FREE via this link.\n\nView comments",
        "link": "https://finance.yahoo.com/news/why-rtx-rtx-stock-trading-203033041.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0,
            "neu": 0.811,
            "pos": 0.189
        }
    },
    {
        "date": "2024-07-25T17:59:04+00:00",
        "title": "Northrop Grumman lifts 2024 earnings forecast on weapons demand",
        "content": "U.S. defense company Northrop Grumman raised its forecast for full-year revenue and profit on Thursday, amid increased global defense spending and a strong backlog.",
        "link": "https://www.reuters.com/business/aerospace-defense/northrop-grumman-lifts-2024-earnings-forecast-weapons-demand-2024-07-25/",
        "symbols": [
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.852,
            "neg": 0,
            "neu": 0.614,
            "pos": 0.386
        }
    },
    {
        "date": "2024-07-25T17:13:00+00:00",
        "title": "RTX's Pratt &amp; Whitney, Embraer and OGMA announce first GTF engine induction",
        "content": "Portugal shop becomes the 18th active facility in growing GTF MRO network\n\nLONDON, July 25, 2024 /PRNewswire/ -- Farnborough Air Show -- Pratt & Whitney, an RTX (NYSE: RTX) business, and OGMA Indústria Aeronáutica de Portugal S.A. (\"OGMA\"), an Embraer company, announced today the induction of the first Pratt & Whitney GTF™ engine at OGMA during the inaugural opening of the Alverca-based facility.\n\n\"This marks a significant milestone in our expanding relationship with OGMA and Embraer, furthering our commitment to providing global industry-leading service and support to increase GTF MRO capacity,\" said Marc Meredith, vice president of aftermarket for GTF engines at Pratt & Whitney. \"OGMA brings more than a century of maintenance expertise to the network and will provide critical support for the growing GTF fleet in Europe.\"\n\nThe Embraer company joined the GTF MRO network in 2020 to provide disassembly, assembly and test capability for the PW1100G-JM engine, which powers the Airbus A320neo aircraft family. In 2021, OGMA announced that it will add capability for the PW1900G engine, which powers the Embraer E190-E2 and E195-E2 aircraft.\n\n\"We're proud to extend our collaboration with Pratt & Whitney on today's most advanced technologies,\" said Paulo Monginho, chief executive officer at OGMA. \"By adding the GTF engine to our portfolio, we are growing our capabilities to serve the needs of operators in Europe and around the world.\"\n\n\"Embraer and OGMA are very pleased to deepen its relationship with Pratt & Whitney. With this collaboration, we are on the right track to expand our services portfolio for the GTF fleet as part of Embraer's accelerated growth strategy\", says Carlos Naufel, President and CEO, Embraer Services & Support.\n\nPratt & Whitney announced three GTF MRO facility expansions and six shop activations in 2023 to support the growing GTF fleet. OGMA marks the 18th active location and the eighth facility in Europe. By 2025, the company expects to have 19 active GTF MRO shops worldwide.\n\nThe GTF MRO network is part of Pratt & Whitney EngineWise® solutions which provide operators with a full range of aftermarket services resulting in long-term, sustainable value. For more information, visit prattwhitney.com/enginewise.\n\nAbout Pratt & Whitney\r\nPratt & Whitney is a world leader in the design, manufacture and service of aircraft engines and auxiliary power units. To learn more visit www.prattwhitney.com.\n\nStory continues\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com. Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-pratt--whitney-embraer-and-ogma-announce-first-gtf-engine-induction-302206911.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-pratt-whitney-embraer-ogma-171300094.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.01,
            "neu": 0.859,
            "pos": 0.132
        }
    },
    {
        "date": "2024-07-25T16:46:46+00:00",
        "title": "Embraer opens P&W repair hub as demand for engine maintenance rockets",
        "content": "Brazilian planemaker Embraer on Thursday opened a maintenance hub for Pratt & Whitney (P&W) engines in Portugal, which it expects to bring in an additional 600 million euros ($653 million) in revenues per year once fully operational.",
        "link": "https://www.reuters.com/business/aerospace-defense/embraer-opens-pw-repair-hub-demand-engine-maintenance-rockets-2024-07-25/",
        "symbols": [
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0,
            "neg": 0,
            "neu": 1,
            "pos": 0
        }
    },
    {
        "date": "2024-07-25T14:50:00+00:00",
        "title": "RTX Beats Q2 Earnings Estimates, Hikes '24 Sales Guidance",
        "content": "RTX Corporation’s RTX second-quarter 2024 adjusted earnings per share (EPS) of $1.41 beat the Zacks Consensus Estimate of $1.29 by 9.3%. The bottom line also improved 9.3% from the year-ago quarter’s level of $1.29.\r\n\r\nIncluding one-time items, the company reported GAAP earnings of 8 cents per share compared with 90 cents in the prior-year quarter. The year-over-year deterioration can be attributed to higher costs and expenses, along with higher other expenses, net.\n\nOperational Performance\n\nRTX’s second-quarter net sales totaled $19.72 billion, which surpassed the Zacks Consensus Estimate of $19.31 billion by 2.2%. The top line also improved 7.7% from $18.31 billion recorded in the second quarter of 2023.\n\nRTX Corporation Price, Consensus and EPS Surprise RTX Corporation Price, Consensus and EPS Surprise\n\nRTX Corporation price-consensus-eps-surprise-chart | RTX Corporation Quote\n\nThe top-line improvement was driven by higher sales growth from RTX’s Pratt & Whitney and Collins Aerospace business segments.\r\n\r\nTotal costs and expenses increased 8.6% year over year to $18.30 billion. The company generated an operating profit of $0.53 billion compared with $1.49 billion in the prior-year quarter.\r\n\r\nRTX posted an adjusted operating profit of $2.56 billion, up 14.1% from the year-ago quarter’s reported figure.\n\nSegmental Performance\n\nCollins Aerospace: Sales in this segment totaled $7 billion, up 10% year over year.  This improvement can be attributed to higher commercial aftermarket and commercial OEM sales, backed by an increase in commercial air traffic, including higher flight hours, and increased volume across all OEM sales channels. Increased defense sales, driven by higher volumes, also benefited this unit’s sales.\r\n\r\nThe segment’s adjusted operating profit totaled $1.15 billion compared with $0.92 billion in the year-ago quarter.\r\n\r\nPratt & Whitney: This segment’s sales totaled $6.80 billion, up 19% from the year-ago quarter’s level. The improvement was due to sales growth in the commercial aftermarket and commercial OEM businesses, driven by higher GTF OE volumes and favorable mix, as well as higher aftermarket volumes. Increased military sales, driven by higher sustainment volume across multiple platforms, also contributed to this unit’s sales growth.\r\n\r\nThe adjusted operating profit amounted to $537 million compared with the year-ago quarter’s level of $436 million.\r\n\r\nRaytheon: This segment recorded second-quarter adjusted sales of $6.58 billion, down 2% year over year, primarily due to the divestment of the Cybersecurity, Intelligence and Services business, which was finished in the first quarter of 2024.\r\n\r\nThe segment’s adjusted operating profit amounted to $709 million compared with $662 million recorded in the corresponding period of 2023.\n\nStory continues\n\nFinancial Update\n\nRTX had cash and cash equivalents of $6.01 billion as of Jun 30, 2024 compared with $6.59 billion as of Dec 31, 2023.\r\n\r\nThe long-term debt totaled $40.30 billion as of Jun 30, 2024, down from $42.36 billion as of Dec 31, 2023.\r\n\r\nNet cash flow from operating activities was $3.08 billion as of Jun 30, 2024 compared to the cash outflow from operating activities of $0.14 billion at the end of the second quarter of 2023.\r\n\r\nFree cash outflow totaled $2.07 billion at the end of the second quarter of 2024 compared with free cash outflow of $0.19 billion at the end of the second quarter of 2023.\n\nGuidance\n\nRTX updated its financial guidance for 2024.\r\n\r\nThe company now projects adjusted EPS in the band of $5.35-$5.45, up from the previous EPS range of $5.25-$5.40. The Zacks Consensus Estimate for RTX’s 2024 EPS is pegged at $5.40, which lies in line with the midpoint of the company’s guided range.\r\n\r\nRTX also increased its sales expectations to the band of $78.75-$79.50 billion in 2024 compared to the previous range of $78-$79 billion.The Zacks Consensus Estimate for sales is pegged at $78.99 billion, which lies below the midpoint of the company’s guidance.\r\n\r\nRTX now expects to generate free cash flow of $4.7 billion for 2024, which is lower than its previous expectation of $5.7 billion.\n\nZacks Rank\n\nRTX currently carries a Zacks Rank #3 (Hold).  You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nRecent Defense Releases\n\nTeledyne Technologies Inc. TDY reported second-quarter 2024 adjusted earnings of $4.58 per share, which surpassed the Zacks Consensus Estimate of $4.49 by 2%. However, the bottom line declined 1.9% from $4.67 recorded in the year-ago quarter.\r\n\r\nTotal sales were $1.37 billion, which missed the Zacks Consensus Estimate of $1.38 billion by 0.2%. The top line also dropped 3.6% from $1.42 billion reported in the year-ago quarter.\r\n\r\nLockheed Martin Corporation LMT reported second-quarter 2024 adjusted earnings of $7.11 per share, which beat the Zacks Consensus Estimate of $6.45 by 10.2%. The bottom line also improved 5.6% from the year-ago quarter's recorded figure of $6.73.\r\n\r\nNet sales were $18.12 billion, which surpassed the Zacks Consensus Estimate of $17.10 billion by 6%. The top line also increased 8.6% from $16.69 billion reported in the year-ago quarter.\r\n\r\nTextron Inc. TXT reported second-quarter 2024 adjusted earnings of $1.54 per share, which surpassed the Zacks Consensus Estimate of $1.49 by 3.4%. The bottom line also improved 5.5% from the year-ago quarter’s figure of $1.46 per share.\r\n\r\nTXT reported total revenues of $3.53 billion, which missed the Zacks Consensus Estimate of $3.55 billion by 0.6%. However, the reported figure increased 3% from the year-ago quarter’s level of $3.42 billion.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nTeledyne Technologies Incorporated (TDY) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-beats-q2-earnings-estimates-145000195.html",
        "symbols": [
            "0LF0.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "TXT.BE",
            "TXT.DU",
            "TXT.F",
            "TXT.MU",
            "TXT.STU",
            "TXT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.015,
            "neu": 0.863,
            "pos": 0.123
        }
    },
    {
        "date": "2024-07-25T13:30:31+00:00",
        "title": "RTX (RTX) Reports Q2 Earnings: What Key Metrics Have to Say",
        "content": "RTX (RTX) reported $19.72 billion in revenue for the quarter ended June 2024, representing a year-over-year increase of 7.7%. EPS of $1.41 for the same period compares to $1.29 a year ago.\n\nThe reported revenue compares to the Zacks Consensus Estimate of $19.31 billion, representing a surprise of +2.15%. The company delivered an EPS surprise of +9.30%, with the consensus EPS estimate being $1.29.\n\nWhile investors scrutinize revenue and earnings changes year-over-year and how they compare with Wall Street expectations to determine their next move, some key metrics always offer a more accurate picture of a company's financial health.\n\nAs these metrics influence top- and bottom-line performance, comparing them to the year-ago numbers and what analysts estimated helps investors project a stock's price performance more accurately.\n\nHere is how RTX performed in the just reported quarter in terms of the metrics most widely monitored and projected by Wall Street analysts:\n\nAdjusted Net Sales- Collins Aerospace: $7 billion compared to the $6.89 billion average estimate based on three analysts. Adjusted Net Sales- Pratt & Whitney: $6.80 billion compared to the $6.42 billion average estimate based on three analysts. Net Sales- Raytheon: $6.51 billion versus the three-analyst average estimate of $6.51 billion. Adjusted Net Sales- Eliminations & Other: -$591 million versus -$537.50 million estimated by two analysts on average. Operating Profit- Collins Aerospace- Adjusted: $1.15 billion versus the three-analyst average estimate of $1.10 billion. Operating Profit- Raytheon- Adjusted: $709 million versus the three-analyst average estimate of $619.97 million. Operating Profit- Pratt & Whitney- Adjusted: $537 million versus $479.02 million estimated by three analysts on average. Operating Profit- Corporate expenses and other unallocated items- Adjusted: -$7 million versus -$53.67 million estimated by three analysts on average. Operating Profit- Eliminations and Other- Adjusted: -$36 million versus the three-analyst average estimate of -$26.75 million.\n\nView all Key Company Metrics for RTX here>>>\r\n\r\nShares of RTX have returned +3.5% over the past month versus the Zacks S&P 500 composite's -0.3% change. The stock currently has a Zacks Rank #3 (Hold), indicating that it could perform in line with the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nStory continues\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-rtx-reports-q2-earnings-133031532.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.985,
            "neg": 0,
            "neu": 0.911,
            "pos": 0.089
        }
    },
    {
        "date": "2024-07-25T11:14:17+00:00",
        "title": "RTX's (NYSE:RTX) Q2: Beats On Revenue",
        "content": "RTX's (NYSE:RTX) Q2: Beats On Revenue\n\nAerospace and defense company Raytheon (NYSE:RTX) reported Q2 CY2024 results beating Wall Street analysts' expectations , with revenue up 7.7% year on year to $19.72 billion. The company expects the full year's revenue to be around $79.13 billion, in line with analysts' estimates. It made a non-GAAP profit of $1.41 per share, improving from its profit of $0.90 per share in the same quarter last year.\n\nIs now the time to buy RTX? Find out in our full research report.\n\nRTX (RTX) Q2 CY2024 Highlights:\n\nRevenue: $19.72 billion vs analyst estimates of $19.28 billion (2.3% beat) EPS (non-GAAP): $1.41 vs analyst estimates of $1.30 (8.6% beat) The company raised its revenue and EPS guidance for the full year (both above expectations) Gross Margin (GAAP): 18.2%, down from 20.7% in the same quarter last year Free Cash Flow of $2.20 billion is up from -$125 million in the previous quarter Organic Revenue rose 10% year on year (13.1% in the same quarter last year) Market Capitalization: $139.1 billion\n\n\"RTX delivered strong operational performance in the second quarter, with 10 percent organic sales* growth, adjusted margin* expansion across all three segments and $2.2 billion in free cash flow*,\" said RTX President and CEO Chris Calio.\n\nOriginally focused on refrigeration technology, Raytheon (NSYE:RTX) provides a a variety of products and services to the aerospace and defense industries.\n\nDefense Contractors\n\nDefense contractors typically require technical expertise and government clearance. Companies in this sector can also enjoy long-term contracts with government bodies, leading to more predictable revenues. Combined, these factors create high barriers to entry and can lead to limited competition. Lately, geopolitical tensions–whether it be Russia’s invasion of Ukraine or China’s aggression towards Taiwan–highlight the need for defense spending. On the other hand, demand for these products can ebb and flow with defense budgets and even who is president, as different administrations can have vastly different ideas of how to allocate federal funds.\n\nSales Growth\n\nReviewing a company's long-term performance can reveal insights into its business quality. Any business can have short-term success, but a top-tier one tends to sustain growth for years. Unfortunately, RTX's 4.9% annualized revenue growth over the last five years was sluggish. This shows it failed to expand in any major way and is a rough starting point for our analysis. RTX Total Revenue\n\nWe at StockStory place the most emphasis on long-term growth, but within industrials, a half-decade historical view may miss cycles, industry trends, or a company capitalizing on catalysts such as a new contract win or a successful product line. RTX's annualized revenue growth of 9.2% over the last two years is above its five-year trend, suggesting its demand recently accelerated.\n\nStory continues\n\nRTX also reports organic revenue, which strips out one-time events like acquisitions and currency fluctuations because they don't accurately reflect its fundamentals. Over the last two years, RTX's organic revenue averaged 15% year-on-year growth. Because this number is better than its normal revenue growth, we can see that some mixture of divestitures and foreign exchange rates dampened its headline performance. RTX Year-On-Year Organic Revenue Growth\n\nThis quarter, RTX reported solid year-on-year revenue growth of 7.7%, and its $19.72 billion of revenue outperformed Wall Street's estimates by 2.3%. Looking ahead, Wall Street expects sales to grow 4.2% over the next 12 months, a deceleration from this quarter.\n\nUnless you’ve been living under a rock, it should be obvious by now that generative AI is going to have a huge impact on how large corporations do business. While Nvidia and AMD are trading close to all-time highs, we prefer a lesser-known (but still profitable) semiconductor stock benefitting from the rise of AI. Click here to access our free report on our favorite semiconductor growth story.\n\nOperating Margin\n\nOperating margin is an important measure of profitability. It’s the portion of revenue left after accounting for all core expenses–everything from the cost of goods sold to advertising and wages. Operating margin is also useful for comparing profitability across companies with different levels of debt and tax rates because it excludes interest and taxes.\n\nRTX was profitable over the last five years but held back by its large expense base. It demonstrated paltry profitability for an industrials business, producing an average operating margin of 5.1%.\n\nOn the bright side, RTX's annual operating margin rose by 3.7 percentage points over the last five years. RTX Operating Margin (GAAP)\n\nThis quarter, RTX generated an operating profit margin of 2.7%, down 5.5 percentage points year on year. This contraction shows it was recently less efficient because its expenses grew faster than its revenue.\n\nEPS\n\nAnalyzing long-term revenue trends tells us about a company's historical growth, but the long-term change in its earnings per share (EPS) points to the profitability of that growth–for example, a company could inflate its sales through excessive spending on advertising and promotions.\n\nSadly for RTX, its EPS declined by 6.5% annually over the last five years while its revenue grew by 4.9%. However, its operating margin actually expanded during this timeframe, telling us non-fundamental factors affected its ultimate earnings. RTX EPS (Adjusted)\n\nDiving into the nuances of RTX's earnings can give us a better understanding of its performance. A five-year view shows RTX has diluted its shareholders, growing its share count by 55.4%. This dilution overshadowed its increased operating efficiency and has led to lower per share earnings. Taxes and interest expenses can also affect EPS but don't tell us as much about a company's fundamentals. RTX Diluted Shares Outstanding\n\nLike with revenue, we also analyze EPS over a more recent period because it can give insight into an emerging theme or development for the business. For RTX, its two-year annual EPS growth of 16% was higher than its five-year trend. This acceleration made it one of the faster-growing industrials companies in recent history.\n\nIn Q2, RTX reported EPS at $1.41, up from $0.90 in the same quarter last year. This print beat analysts' estimates by 8.6%. Over the next 12 months, Wall Street expects RTX to grow its earnings. Analysts are projecting its EPS of $5.29 in the last year to climb by 6.8% to $5.65.\n\nKey Takeaways from RTX's Q2 Results\n\nThis was a beat and raise quarter. Specifically, we were impressed by how significantly RTX blew past analysts' organic revenue expectations this quarter. We were also excited its revenue outperformed Wall Street's estimates. That the company raised full year revenue and EPS expectations is icing on the cake. Overall, we think this was a really good quarter that should please shareholders. The stock traded up 3.1% to $108.10 immediately following the results.\n\nRTX may have had a good quarter, but does that mean you should invest right now? When making that decision, it's important to consider its valuation, business qualities, as well as what has happened in the latest quarter. We cover that in our actionable full research report which you can read here, it's free.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-nyse-rtx-q2-beats-111417450.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.027,
            "neu": 0.809,
            "pos": 0.164
        }
    },
    {
        "date": "2024-07-25T10:55:00+00:00",
        "title": "Get Your Money Out of These 3 Defense Stocks by 2025",
        "content": "Rising global geopolitical turmoil in the Middle East and Eastern Europe and rising tensions in Southeast Asia create the perfect conditions for defense stocks to soar. The companies behind these stocks often see an uptick in orders for equipment and services.\n\nDespite the perfect conditions for defense stocks to thrive in 2024, the S&P Aerospace & Defense Select Industry Index has underperformed the market. Year to date, it is up 7.71%, compared to the 16.07% gain of the S&P 500 Index in the same period.\n\nA major reason major defense indices have underperformed in 2024 is Boeing’s (BA) recent poor performance. Besides that, the US is headed into an election in November 2024, which could see major policy changes in the future.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nWhile Congress approved $95 billion in spending for its allies, including $61 billion for Ukraine, that might not be possible in 2025. As such, with funding scarce in 2025, these three defense stocks might not sustain their momentum.\n\nThese three defense stocks might be risky to hold based on various factors, which will be explained below.\n\nRTX (RTX) A German army mobile Raytheon (RTX) MIM-104 Patriot surface-to-air missile (SAM) system on display during the Laage airbase open house.\n\nSource: VanderWolf Images / Shutterstock.com\n\nRTX (NYSE:RTX) has seen an uptick in interest since hostilities in the Middle East escalated. Formerly called Raytheon Technologies, it maintains three business units through its subsidiaries: Raytheon, Pratt &Whitney and Aerospace.\n\nThe company is heavily involved in the supply of radars, sensors, torpedos, microwave systems, command and control systems and space-based systems. Diversifying into commercial operations means it can source some revenue outside the defense sector.\n\nSince the start of the year, RTX stock has grown by 20.64%. Consequently, analysts believe it is overvalued. They forecast an average price target of $102.11, a 1.67% downside based on the last closing price of $102.81. The most pessimistic analysts forecast a price of $73.00, a 29.70% downside.\n\nRTX has shed 2.15% of its value in the past month, which could signal the beginning of a downward trend. When coupled with pessimistic projects from analysts, RTX might be one of the defense stocks you should drop by 2025.\n\nLeonardo DRS (DRS) defense stocks with dividend growth\n\nSource: Shutterstock\n\nLeonardo DRS (NASDAQ:DRS) Leonardo DRS has been a major supplier to the US military. For instance, it recently announced a new milestone in supplying its equipment to the US Army helicopter missile warning system.\n\nIt also announced in May 2024 that it had won a major KC-46 Pegasus Tanker Fleet contract. However, the most significant defense contract to date was a $3 billion contract for the U.S. Navy’s Columbia-Class Submarine Program.\n\nStory continues\n\nLike RTX, Leonardo DRS faces a similar political challenge. With Republicans opposed to the war in Ukraine and Trump’s vow to end the conflict, it could place Leonardo DRS in a tough spot.\n\nAdditionally, the US Navy has been known to cancel major contracts with short notice. Two recent examples are the cancellation of the Zumwalt class destroyer program and the Seawolf submarine program.\n\nDue to recent major defense contracts, DRS stock is up 40.92% year to date. However, if the Navy decides to institute cost-cutting measures, the Columbia-Class submarine program could be amongst those cut first.\n\nStock analysts are also pessimistic about the future of DRS stock. They forecast an average price target of $25.14, a 9.70% downside, based on the last closing price of $27.79. Meanwhile, the most pessimistic analysts forecast is that DRS will slide 38.94% to $17.00.\n\nBased on the analysts’ pessimistic outlook and risky political climate for the stock’s future, DRS should be one of the defense stocks you drop by 2025.\n\nBoeing (BA) image of a Boeing (BA) 737 max aircraft. stocks to buy and sell related to Boeing\n\nSource: Marco Menezes / Shutterstock.com\n\nBoeing (NYSE:BA) is one of the world’s biggest aerospace and defense companies. It is also a major supplier of commercial planes, satellites, fixed-wing and rotary crafts and laser weapons.\n\nHowever, the company has recently been in the news for all the wrong reasons. First was the Alaska Airlines Boeing 737-MAX-9 incident, in which an emergency door was blown off. Several passengers were injured, but they were later medically cleared.\n\nThe incident caused an uproar, with Alaska Airlines grounding all 737-MAX-9 planes pending an investigation into the issue.\n\nSoon after, the US Federal Aviation Administration began a safety investigation into the company. On its website, the federal agency stated that it had stopped all production of Beoing 737 MAX. Additionally, the FAA is looking into Boeing’s 787 Dreamliner production quality after it emerged that Boeing employees may have falsified safety records.\n\nAmidst negative publicity, Boeing stock has plummeted 28.63% since the start of 2024. With added political intrigues in November that could see a slowdown in US defense spending, its future looks bleak.\n\nAnalysts are not confident about Beoing’s future, giving it a solid sell rating. They forecast an average price target of $2322, a 23.18% upside. The most optimistic analysts forecast a 270.00,\n\n49.81% upside, while the most pessimistic analysts expect $140.00, 22.32% downside.\n\nThe halt in production by the Federal Aviation Administration and the pending outcome of legal problems could lead to a huge financial hit for the company. Consequently, it should be amongst the top defense stocks you drop before the end of the year.\n\nOn the date of publication, Joel Lim did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nJoel Lim is a contributor at InvestorPlace.com and a finance content contractor who creates content for several companies like LTSE and Realtor, along with financial publications, including Business Insider, Yahoo Finance, Mises Institution and Foundation for Economic Education.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post Get Your Money Out of These 3 Defense Stocks by 2025 appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/money-3-defense-stocks-2025-105500994.html",
        "symbols": [
            "2VZ.F",
            "BA.US",
            "DRS.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.68,
            "neg": 0.068,
            "neu": 0.856,
            "pos": 0.077
        }
    },
    {
        "date": "2024-07-25T10:30:00+00:00",
        "title": "RTX Reports Q2 2024 Results",
        "content": "RTX delivers solid operational performance and 8% sales growth; Increases 2024 outlook for adjusted sales* and adjusted EPS*, revises free cash flow*\n\nARLINGTON, Va., July 25, 2024 /PRNewswire/ -- RTX (NYSE: RTX) reported second quarter 2024 results.\n\nSecond quarter 2024\n\nReported sales of $19.7 billion, up 8 percent versus prior year and up 10 percent on an organic* basis Adjusted sales* of $19.8 billion, up 8 percent versus prior year GAAP EPS was $0.08 and included $0.29 of acquisition accounting adjustments and $1.04 of other net significant and/or non-recurring items and restructuring, including $0.03 of restructuring and other non-recurring items, a $0.68 charge related to the expected resolution of several legacy legal matters, and a $0.33 charge related to a fixed priced development contract with a foreign customer at Raytheon Adjusted EPS* of $1.41, up 9 percent versus prior year Operating cash flow of $2.7 billion; Free cash flow* of $2.2 billion Company backlog of $206 billion; including $129 billion of commercial and $77 billion of defense Realized $120 million of incremental RTX gross cost synergies\n\nUpdates outlook for full year 2024\n\nAdjusted sales* of $78.75 - $79.5 billion, up from $78.0 - $79.0 billion Adjusted EPS* of $5.35 - $5.45, up from $5.25 - $5.40 Free cash flow* of approximately $4.7 billion, down from approximately $5.7 billion\n\n\"RTX delivered strong operational performance in the second quarter, with 10 percent organic sales* growth, adjusted margin* expansion across all three segments and $2.2 billion in free cash flow*,\" said RTX President and CEO Chris Calio. \"The strength in our end markets and first half performance give us the confidence to increase our outlook for adjusted sales* and adjusted EPS* for the full year.\"\n\n\"With a $206 billion backlog and unprecedented demand across our portfolio, we are focused on executing on our customer commitments powered by our CORE operating system, investing in innovative technologies and capabilities, and leveraging the breadth and scale of RTX to drive long-term shareowner value.\"\n\nSecond quarter 2024 RTX reported second quarter sales of $19.7 billion, up 8 percent over the prior year. Adjusted sales* were $19.8 billion, also up 8 percent over the prior year. GAAP EPS of $0.08 was down 91 percent versus the prior year, and included $0.29 of acquisition accounting adjustments, $0.03 of restructuring and other net significant and/or non-recurring charges, a $0.68 charge related to the expected resolution of several legacy legal matters and a $0.33 charge related to a fixed price development contract with a foreign customer at Raytheon. Adjusted EPS* of $1.41 was up 9 percent versus the prior year.\n\nStory continues\n\nThe company reported net income attributable to common shareowners in the second quarter of $111 million which included $393 million of acquisition accounting adjustments, $35 million of restructuring and other net significant and/or non-recurring charges, a charge of $918 million related to the expected resolution of several legacy legal matters and a $438 million charge related to a fixed price development contract with a foreign customer at Raytheon. Adjusted net income* of $1.9 billion was flat versus prior year as growth in adjusted segment operating profit* was offset by higher interest and tax expenses, and lower pension income. Operating cash flow in the second quarter was $2.7 billion. Capital expenditures were $537 million, resulting in a free cash flow* of $2.2 billion.\n\nLegacy Legal Matters The Company has made progress in the quarter on resolving several outstanding legal matters which has resulted in an EPS charge of $0.68 associated with the expected resolution of these matters. The Company expects to enter into a deferred prosecution agreement with the Department of Justice (DOJ) and to be subject to an administrative order with the Securities and Exchange Commission (SEC) to resolve the previously disclosed criminal and civil government investigations into improper payments made by Raytheon Company and its joint venture, Thales-Raytheon Systems (TRS), in connection with certain Middle East contracts since 2012. The Company also expects to enter into a deferred prosecution agreement and an False Claims Act (FCA) settlement with the DOJ to resolve previously disclosed criminal and civil government investigations into defective pricing claims for certain legacy Raytheon Company contracts entered into between 2011 and 2013 and in 2017. The charge also includes the impact of certain voluntarily disclosed export controls violations primarily identified in connection with the integration of Rockwell Collins and, to a lesser extent, Raytheon Company into RTX, including certain violations expected to be resolved pursuant to a consent agreement with the Department of State (DOS). In total, RTX recorded an aggregate charge of $918 million in the quarter, bringing the total associated reserve for these matters to $1.24 billion. Based upon the current status of discussions, we believe that the finalization of our respective agreements with the DOJ, SEC and DOS will occur during the second half of 2024 and therefore, expect approximately $1.0 billion of related payments to be made within the same timeframe with the balance to be paid over the next several years. The items above have been incorporated in our updated 2024 free cash flow* outlook.\n\nSummary Financial Results – Operations Attributable to Common Shareowners\n\n2nd Quarter ($ in millions, except EPS) 2024 2023 % Change Reported Sales $    19,721 $    18,315 8 % Net Income  $         111 $      1,327 (92) % EPS $        0.08 $        0.90 (91) % Adjusted* Sales $    19,791 $    18,315 8 % Net Income $      1,895 $      1,895 — % EPS $        1.41 $        1.29 9 % Operating Cash Flow $      2,733 $         719 280 % Free Cash Flow* $      2,196 $         193 1038 %\n\nSegment Results\n\nCollins Aerospace\n\n2nd Quarter ($ in millions) 2024 2023 % Change Reported Sales $   6,999 $   6,384 10 % Operating Profit $   1,118 $      899 24 % ROS 16.0 % 14.1 % 190 bps Adjusted* Sales $   6,999 $   6,384 10 % Operating Profit $   1,145 $      915 25 % ROS 16.4 % 14.3 % 210 bps\n\nCollins Aerospace had second quarter 2024 reported sales of $6,999 million, up 10 percent versus the prior year. The increase in sales was driven by a 12 percent increase in commercial aftermarket, a 10 percent increase in commercial OE, and a 7 percent increase in defense. The increase in commercial sales was driven primarily by an increase in commercial air traffic, including in higher flight hours, and increased volume across all OEM sales channels. The increase in defense sales was driven primarily by higher volume.\n\nCollins Aerospace reported operating profit of $1,118 million, up 24 percent versus the prior year. The increase in operating profit was primarily driven by drop through on higher commercial aftermarket volume, as well as higher defense and commercial OE volume. On an adjusted basis, operating profit* of $1,145 million was up 25 percent versus the prior year.\n\nPratt & Whitney\n\n2nd Quarter ($ in millions) 2024 2023 % Change Reported Sales $   6,802 $   5,701 19 % Operating Profit $      542 $      230 136 % ROS 8.0 % 4.0 % 400 bps Adjusted* Sales $   6,802 $   5,701 19 % Operating Profit $      537 $      436 23 % ROS 7.9 % 7.6 % 30 bps\n\nPratt & Whitney had second quarter 2024 reported sales of $6,802 million, up 19 percent versus the prior year. The increase in sales was driven by a 33 percent increase in commercial OE, a 16 percent increase in military, and a 15 percent increase in commercial aftermarket. The increase in commercial sales was primarily due to higher volume and favorable mix within aftermarket as well as higher GTF OE volume and favorable mix. The increase in military sales was driven by higher sustainment volume across multiple platforms.\n\nPratt & Whitney reported operating profit of $542 million, up 136 percent versus the prior year. Drop through on higher commercial aftermarket volume as well as favorable Large Commercial OE and commercial aftermarket mix, was partially offset by higher Large Commercial OE deliveries and the absence of a $60 million favorable prior year contract matter. Higher military volume and favorable mix was more than offset by higher production costs and higher R&D and SG&A expenses. The prior year reported operating profit included the impact of a charge related to a customer insolvency of $181 million. On an adjusted basis, operating profit* of $537 million was up 23 percent versus the prior year.\n\nRaytheon\n\n2nd Quarter ($ in millions) 2024 2023 % Change Reported Sales $   6,511 $   6,700 (3) % Operating Profit $      127 $      644 (80) % ROS 2.0 % 9.6 % (760) bps Adjusted* Sales $   6,581 $   6,700 (2) % Operating Profit $      709 $      662 7 % ROS 10.8 % 9.9 % 90 bps\n\nRaytheon had second quarter 2024 reported sales of $6,511 million, down 3 percent versus prior year as higher volume on land and air defense systems including Global Patriot, counter-UAS programs and Stinger was more than offset by the divestiture of the Cybersecurity, Intelligence and Services business completed in the first quarter of 2024. Adjusted sales* of $6,581 million were down 2 percent versus prior year. Excluding the impact of acquisition and divestitures, sales were up 4 percent versus prior year*.\n\nRaytheon reported operating profit of $127 million, down 80 percent versus the prior year. Drop through on higher volume, favorable mix, and improved net productivity was more than offset by a $575 million charge related to the anticipated termination of a fixed price development contract with a foreign customer which was contracted in 2016 under legacy Raytheon Company. On an adjusted basis, operating profit* of $709 million was up 7 percent versus the prior year.\n\n*Adjusted net sales, organic sales, adjusted operating profit (loss) and margin, adjusted segment operating profit (loss) and margin, adjusted net income, adjusted earnings per share (\"EPS\"), adjusted effective tax rate and free cash flow are non-GAAP financial measures. When we provide our expectation for adjusted net sales, adjusted EPS and free cash flow on a forward-looking basis, a reconciliation of these non-GAAP financial measures to the corresponding GAAP measures (expected diluted EPS and expected cash flow from operations) is not available without unreasonable effort due to potentially high variability, complexity, and low visibility as to the items that would be excluded from the GAAP measure in the relevant future period, such as unusual gains and losses, the ultimate outcome of pending litigation, fluctuations in foreign currency exchange rates, the impact and timing of potential acquisitions and divestitures, and other structural changes or their probable significance. The variability of the excluded items may have a significant, and potentially unpredictable, impact on our future GAAP results. See \"Use and Definitions of Non-GAAP Financial Measures\" below for information regarding non-GAAP financial measures.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nConference Call on the Second Quarter 2024 Financial Results RTX's financial results conference call will be held on Thursday, July 25, 2024 at 8:00 a.m. ET. The conference call will be webcast live on the company's website at www.rtx.com and will be available for replay following the call. The corresponding presentation slides will be available for downloading prior to the call.\n\nUse and Definitions of Non-GAAP Financial Measures RTX Corporation (\"RTX\" or \"the Company\") reports its financial results in accordance with accounting principles generally accepted in the United States (\"GAAP\"). We supplement the reporting of our financial information determined under GAAP with certain non-GAAP financial information. The non-GAAP information presented provides investors with additional useful information but should not be considered in isolation or as substitutes for the related GAAP measures. We believe that these non-GAAP measures provide investors with additional insight into the Company's ongoing business performance. Other companies may define non-GAAP measures differently, which limits the usefulness of these measures for comparisons with such other companies. We encourage investors to review our financial statements and publicly-filed reports in their entirety and not to rely on any single financial measure. A reconciliation of the non-GAAP measures to the corresponding amounts prepared in accordance with GAAP appears in the tables in this Appendix. Below are our non-GAAP financial measures:\n\nNon-GAAP measure Definition Adjusted net sales Represents consolidated net sales (a GAAP measure), excluding net significant and/or non-recurring items1 (hereinafter referred to as \"net significant and/or non-recurring items\"). Organic sales Organic sales represents the change in consolidated net sales (a GAAP measure), excluding the impact of foreign currency translation, acquisitions and divestitures completed in the preceding twelve months and net significant and/or non-recurring items. Adjusted operating \r\nprofit (loss) and margin Adjusted operating profit (loss) represents operating profit (loss) (a GAAP measure), excluding restructuring costs, acquisition accounting adjustments and net significant and/or non-recurring items. Adjusted operating profit margin represents adjusted operating profit (loss) as a percentage of adjusted net sales. Segment operating \r\nprofit (loss) and margin Segment operating profit (loss) represents operating profit (loss) (a GAAP measure) excluding Acquisition Accounting Adjustments2, the FAS/CAS operating adjustment3, Corporate expenses and other unallocated items, and Eliminations and other. Segment operating profit margin represents segment operating profit (loss) as a percentage of segment sales (net sales, excluding Eliminations and other). Adjusted segment sales Represents consolidated net sales (a GAAP measure) excluding eliminations and other and net significant and/or non-recurring items. Adjusted segment \r\noperating profit (loss) \r\nand margin Adjusted segment operating profit (loss) represents segment operating profit (loss) excluding restructuring costs, and net significant and/or non-recurring items. Adjusted segment operating profit margin represents adjusted segment operating profit (loss) as a percentage of adjusted segment sales (adjusted net sales excluding Eliminations and other). Adjusted net income Adjusted net income represents net income (a GAAP measure), excluding restructuring costs, acquisition accounting adjustments and net significant and/or non-recurring items. Adjusted earnings per \r\nshare (EPS) Adjusted EPS represents diluted earnings per share (a GAAP measure), excluding restructuring costs, acquisition accounting adjustments and net significant and/or non-recurring items. Adjusted effective tax rate Adjusted effective tax rate represents the effective tax rate (a GAAP measure), excluding the tax impact of restructuring costs, acquisition accounting adjustments and net significant and/or non-recurring items. Free cash flow Free cash flow represents cash flow from operations (a GAAP measure) less capital expenditures. Management believes free cash flow is a useful measure of liquidity and an additional basis for assessing RTX's ability to fund its activities, including the financing of acquisitions, debt service, repurchases of RTX's common stock and distribution of earnings to shareowners.\n\n1 Net significant and/or non-recurring items represent significant nonoperational items and/or significant operational items that may occur at irregular intervals. 2 Acquisition Accounting Adjustments include the amortization of acquired intangible assets related to acquisitions, the amortization of the property, plant and equipment fair value adjustment acquired through acquisitions, the amortization of customer contractual obligations related to loss making or below market contracts acquired, and goodwill impairment, if applicable. 3 The FAS/CAS operating adjustment represents the difference between the service cost component of our pension and postretirement benefit (PRB) expense under the Financial Accounting Standards (FAS) requirements of GAAP and our pension and PRB expense under U.S. government Cost Accounting Standards (CAS) primarily related to our Raytheon segment.\n\nWhen we provide our expectation for adjusted net sales, organic sales, adjusted operating profit (loss) and margin, adjusted segment operating profit (loss) and margin, adjusted EPS, adjusted effective tax rate, and free cash flow, on a forward-looking basis, a reconciliation of the differences between the non-GAAP expectations and the corresponding GAAP measures, as described above, generally are not available without unreasonable effort due to potentially high variability, complexity, and low visibility as to the items that would be excluded from the GAAP measure in the relevant future period, such as unusual gains and losses, the ultimate outcome of pending litigation, fluctuations in foreign currency exchange rates, the impact and timing of potential acquisitions and divestitures, and other structural changes or their probable significance. The variability of the excluded items may have a significant, and potentially unpredictable, impact on our future GAAP results.\n\nCautionary Statement Regarding Forward-Looking Statements This press release contains statements which, to the extent they are not statements of historical or present fact, constitute \"forward-looking statements\" under the securities laws. From time to time, oral or written forward- looking statements may also be included in other information released to the public. These forward-looking statements are intended to provide RTX Corporation (\"RTX\") management's current expectations or plans for our future operating and financial performance, based on assumptions currently believed to be valid and are not statements of historical fact. Forward-looking statements can be identified by the use of words such as \"believe,\" \"expect,\" \"expectations,\" \"plans,\" \"strategy,\" \"prospects,\" \"estimate,\" \"project,\" \"target,\" \"anticipate,\" \"will,\" \"should,\" \"see,\" \"guidance,\" \"outlook,\" \"goals,\" \"objectives,\" \"confident,\" \"on track,\" \"designed to\" and other words of similar meaning. Forward-looking statements may include, among other things, statements relating to future sales, earnings, cash flow, results of operations, uses of cash, share repurchases, tax payments and rates, research and development spending, cost savings, other measures of financial performance, potential future plans, strategies or transactions, credit ratings and net indebtedness, the Pratt powder metal matter and related matters and activities, including without limitation other engine models that may be impacted, anticipated benefits to RTX of its segment realignment, pending disposition of Collins' actuation and flight control business, the merger (the \"merger\") between United Technologies Corporation (\"UTC\") and Raytheon Company (\"Raytheon\") or the spin-offs by UTC of Otis Worldwide Corporation and Carrier Global Corporation into separate independent companies (the \"separation transactions\") in 2020, targets and commitments (including for share repurchases or otherwise), and other statements that are not solely historical facts. All forward-looking statements involve risks, uncertainties and other factors that may cause actual results to differ materially from those expressed or implied in the forward-looking statements. For those statements, we claim the protection of the safe harbor for forward- looking statements contained in the U.S. Private Securities Litigation Reform Act of 1995. Such risks, uncertainties and other factors include, without limitation: (1) the effect of changes in economic, capital market and political conditions in the U.S. and globally, such as from the global sanctions and export controls with respect to Russia, and any changes therein, including related to financial market conditions, banking industry disruptions, fluctuations in commodity prices or supply (including energy supply), inflation, interest rates and foreign currency exchange rates, disruptions in global supply chain and labor markets, and geopolitical risks; (2) risks associated with U.S. government sales, including changes or shifts in defense spending due to budgetary constraints, spending cuts resulting from sequestration, a continuing resolution, a government shutdown, the debt ceiling or measures taken to avoid default, or otherwise, and uncertain funding of programs; (3) risks relating to our performance on our contracts and programs, including our ability to control costs, and our inability to pass some or all of our costs on fixed price contracts to the customer, and risks related to any termination of these contracts or programs, including the outcome of such terminations and related payments; (4) challenges in the development, production, delivery, support, and performance of RTX advanced technologies and new products and services and the realization of the anticipated benefits (including our expected returns under customer contracts), as well as the challenges of operating in RTX's highly-competitive industries; (5) risks relating to RTX's reliance on U.S. and non-U.S. suppliers and commodity markets, including the effect of sanctions, delays and disruptions in the delivery of materials and services to RTX or its suppliers and price increases; (6) risks relating to RTX international operations from, among other things, changes in trade policies and implementation of sanctions, foreign currency fluctuations, economic conditions, political factors, sales methods, and U.S. or local government regulations; (7) the condition of the aerospace industry; (8) the ability of RTX to attract, train and retain qualified personnel and maintain its culture and high ethical standards, and the ability of our personnel to continue to operate our facilities and businesses around the world; (9) the scope, nature, timing and challenges of managing acquisitions, investments, divestitures and other transactions, including the realization of synergies and opportunities for growth and innovation, the assumption of liabilities and other risks and incurrence of related costs and expenses, and risks related to completion of announced divestitures; (10) compliance with legal, environmental, regulatory and other requirements, including, among other things, export and import requirements such as the International Traffic in Arms Regulations and the Export Administration Regulations, anti-bribery and anticorruption requirements, such as the Foreign Corrupt Practices Act, industrial cooperation agreement obligations, and procurement and other regulations in the U.S. and other countries in which RTX and its businesses operate; (11) the outcome of pending, threatened and future legal proceedings, investigations, and other contingencies (including the ultimate outcome of those certain legacy legal matters described above), including those related to U.S. government audits and disputes and the potential for suspension or debarment of U.S. government contracting or export privileges as a result thereof, and including updates to accrual amounts as a result of such outcomes; (12) factors that could impact RTX's ability to engage in desirable capital-raising or strategic transactions, including its credit rating, capital structure, levels of indebtedness and related obligations, capital expenditures and research and development spending, and capital deployment strategy including with respect to share repurchases, and the availability of credit, borrowing costs, credit market conditions, and other factors; (13) uncertainties associated with the timing and scope of future repurchases by RTX of its common stock, including the ability to complete the accelerated share repurchase (\"ASR\"), the purchase price of the shares acquired pursuant to the ASR agreement, and the timing and duration of the ASR program or declarations of cash dividends, which may be discontinued, accelerated, suspended or delayed at any time due to various factors, including market conditions and the level of other investing activities and uses of cash; (14) risks relating to realizing expected benefits from, incurring costs for, and successfully managing, strategic initiatives such as cost reduction, restructuring, digital transformation and other operational initiatives; (15) risks of additional tax exposures due to new tax legislation or other developments, in the U.S. and other countries in which RTX and its businesses operate; (16) risks relating to addressing the identified rare condition in powder metal used to manufacture certain Pratt & Whitney engine parts requiring accelerated removals and inspections of a significant portion of the PW1100G-JM Geared Turbofan (GTF) fleet, including, without limitation, the number and expected timing of shop visits, inspection results and scope of work to be performed, turnaround time, availability of new parts, available capacity at overhaul facilities, outcomes of negotiations with impacted customers, and risks related to other engine models that may be impacted by the powder metal matter, and in each case the timing and costs relating thereto, as well as other issues that could impact RTX product performance, including quality, reliability or durability; (17) changes in production volumes of one or more of our significant customers as a result of business or other challenges, and the resulting effect on its or their demand for our products and services; (18) risks relating to a RTX product safety failure or other failure affecting RTX's or its customers' or suppliers' products or systems; (19) risks relating to cybersecurity, including cyber-attacks on RTX's information technology infrastructure, products, suppliers, customers and partners, and cybersecurity-related regulations; (20) threats to RTX facilities and personnel, as well as other events outside of RTX's control such as public health crises, damaging weather or other acts of nature; (21) the effect of changes in accounting estimates for our programs on our financial results; (22) the effect of changes in pension and other postretirement plan estimates and assumptions and contributions; (23) risks relating to an impairment of goodwill and other intangible assets; (24) the effects of climate change and changing climate-related regulations, customer and market demands, products and technologies; and (25) the intended qualification of (i) the merger as a tax-free reorganization and (ii) the separation transactions and other internal restructurings as tax-free to UTC and former UTC shareowners, in each case, for U.S. federal income tax purposes. For additional information on identifying factors that may cause actual results to vary materially from those stated in forward-looking statements, see the reports of RTX, UTC and Raytheon on Forms S-4, 10-K, 10-Q and 8-K filed with or furnished to the Securities and Exchange Commission from time to time. Any forward-looking statement speaks only as of the date on which it is made, and RTX assumes no obligation to update or revise such statement, whether as a result of new information, future events or otherwise, except as required by applicable law.\n\nRTX Corporation Condensed Consolidated Statement of Operations Quarter Ended June 30, Six Months Ended June 30, (Unaudited) (Unaudited) (dollars in millions, except per share amounts; shares in millions) 2024 2023 2024 2023 Net Sales $      19,721 $      18,315 $      39,026 $      35,529 Costs and expenses: Cost of sales 16,141 14,518 31,885 28,163 Research and development 706 729 1,375 1,336 Selling, general, and administrative 1,449 1,600 2,843 2,963 Total costs and expenses 18,296 16,847 36,103 32,462 Other income (expense), net (896) 25 (524) 113 Operating profit 529 1,493 2,399 3,180 Non-service pension income (374) (447) (760) (891) Interest expense, net 475 333 880 648 Income before income taxes 428 1,607 2,279 3,423 Income tax expense 253 248 361 583 Net income 175 1,359 1,918 2,840 Less: Noncontrolling interest in subsidiaries' earnings 64 32 98 87 Net income attributable to common shareowners $           111 $        1,327 $        1,820 $        2,753 Earnings Per Share attributable to common shareowners: Basic $          0.08 $          0.91 $          1.37 $          1.89 Diluted $          0.08 $          0.90 $          1.36 $          1.87 Weighted Average Shares Outstanding: Basic shares 1,331.8 1,457.5 1,330.5 1,459.9 Diluted shares 1,342.1 1,468.7 1,339.7 1,471.5\n\nRTX Corporation Segment Net Sales and Operating Profit (Loss) Quarter Ended Six Months Ended (Unaudited) (Unaudited) June 30, 2024 June 30, 2023 June 30, 2024 June 30, 2023 (dollars in millions) Reported Adjusted Reported Adjusted Reported Adjusted Reported Adjusted Net Sales Collins Aerospace $  6,999 $  6,999 $  6,384 $  6,384 $  13,672 $  13,672 $  12,504 $  12,504 Pratt & Whitney 6,802 6,802 5,701 5,701 13,258 13,258 10,931 10,931 Raytheon 6,511 6,581 6,700 6,700 13,170 13,240 12,992 12,992 Total segments 20,312 20,382 18,785 18,785 40,100 40,170 36,427 36,427 Eliminations and other (591) (591) (470) (470) (1,074) (1,074) (898) (898) Consolidated $  19,721 $  19,791 $  18,315 $  18,315 $  39,026 $  39,096 $  35,529 $  35,529 Operating Profit (Loss) Collins Aerospace $  1,118 $  1,145 $     899 $     915 $  1,967 $  2,193 $  1,796 $  1,818 Pratt & Whitney 542 537 230 436 954 967 645 870 Raytheon 127 709 644 662 1,123 1,339 1,215 1,246 Total segments 1,787 2,391 1,773 2,013 4,044 4,499 3,656 3,934 Eliminations and other (36) (36) (16) (26) (41) (41) 35 (43) Corporate expenses and other \r\nunallocated items (930) (7) (59) (28) (1,026) (32) (102) (68) FAS/CAS operating adjustment 212 212 284 284 426 426 573 573 Acquisition accounting \r\nadjustments (504) — (489) — (1,004) — (982) — Consolidated $     529 $  2,560 $  1,493 $  2,243 $  2,399 $  4,852 $  3,180 $  4,396 Segment Operating Profit Margin Collins Aerospace 16.0 % 16.4 % 14.1 % 14.3 % 14.4 % 16.0 % 14.4 % 14.5 % Pratt & Whitney 8.0 % 7.9 % 4.0 % 7.6 % 7.2 % 7.3 % 5.9 % 8.0 % Raytheon 2.0 % 10.8 % 9.6 % 9.9 % 8.5 % 10.1 % 9.4 % 9.6 % Total segment 8.8 % 11.7 % 9.4 % 10.7 % 10.1 % 11.2 % 10.0 % 10.8 %\n\nRTX Corporation Condensed Consolidated Balance Sheet June 30, 2024 December 31, 2023 (dollars in millions) (Unaudited) (Unaudited) Assets Cash and cash equivalents $                  6,011 $                  6,587 Accounts receivable, net 10,252 10,838 Contract assets 13,581 12,139 Inventory, net 13,047 11,777 Other assets, current 6,334 7,076 Total current assets 49,225 48,417 Customer financing assets 2,320 2,392 Fixed assets, net 15,693 15,748 Operating lease right-of-use assets 1,664 1,638 Goodwill 53,347 53,699 Intangible assets, net 34,503 35,399 Other assets 4,417 4,576 Total assets $              161,169 $              161,869 Liabilities, Redeemable Noncontrolling Interest, and Equity Short-term borrowings $                     231 $                     189 Accounts payable 10,939 10,698 Accrued employee compensation 2,065 2,491 Other accrued liabilities 17,048 14,917 Contract liabilities 17,665 17,183 Long-term debt currently due 1,617 1,283 Total current liabilities 49,565 46,761 Long-term debt 40,303 42,355 Operating lease liabilities, non-current 1,415 1,412 Future pension and postretirement benefit obligations 2,264 2,385 Other long-term liabilities 6,941 7,511 Total liabilities 100,488 100,424 Redeemable noncontrolling interest 31 35 Shareowners' Equity: Common stock 37,295 37,040 Treasury stock (27,080) (26,977) Retained earnings 51,488 52,154 Accumulated other comprehensive loss (2,718) (2,419) Total shareowners' equity 58,985 59,798 Noncontrolling interest 1,665 1,612 Total equity 60,650 61,410 Total liabilities, redeemable noncontrolling interest, and equity $             161,169 $             161,869\n\nRTX Corporation Condensed Consolidated Statement of Cash Flows Quarter Ended June 30, Six Months Ended June 30, (Unaudited) (Unaudited) (dollars in millions) 2024 2023 2024 2023 Operating Activities: Net income $        175 $     1,359 $        1,918 $        2,840 Adjustments to reconcile net income to net cash flows provided by (used in) \r\noperating activities: Depreciation and amortization 1,072 1,044 2,131 2,078 Deferred income tax provision (benefit) 299 (371) 185 (700) Stock compensation cost 111 112 223 212 Net periodic pension and other postretirement income (328) (390) (666) (778) Gain on sale of business, net of transaction costs — — (415) — Change in: Accounts receivable 156 263 587 (699) Contract assets (479) (232) (1,457) (1,430) Inventory (715) (602) (1,361) (1,322) ...Other current assets 442 (108) 217 (634) Accounts payable and accrued liabilities 1,463 (639) 1,245 (149) Contract liabilities 566 32 512 255 Other operating activities, net (29) 251 (44) 183 Net cash flows provided by (used in) operating activities 2,733 719 3,075 (144) Investing Activities: Capital expenditures (537) (526) (1,004) (1,046) Dispositions of businesses, net of cash transferred — — 1,283 — Increase in other intangible assets (155) (160) (318) (314) (Payments) receipts from settlements of derivative contracts, net (28) 58 (29) 45 Other investing activities, net (13) 5 28 113 Net cash flows used in investing activities (733) (623) (40) (1,202) Financing Activities: Proceeds from long-term debt — 3 — 2,974 Repayment of long-term debt (750) (3) (1,700) (3) Change in commercial paper, net — 897 — 470 Change in other short-term borrowings, net 65 (46) 43 (24) Dividends paid on common stock (823) (844) (1,592) (1,634) Repurchase of common stock (44) (596) (100) (1,158) Other financing activities, net (32) (39) (242) (157) Net cash flows (used in) provided by financing activities (1,584) (628) (3,591) 468 Effect of foreign exchange rate changes on cash and cash equivalents (4) 18 (12) 19 Net increase (decrease) in cash, cash equivalents and restricted cash 412 (514) (568) (859) Cash, cash equivalents and restricted cash, beginning of period 5,646 5,946 6,626 6,291 Cash, cash equivalents and restricted cash, end of period 6,058 5,432 6,058 5,432 Less: Restricted cash, included in Other assets, current and Other assets 47 41 47 41 Cash and cash equivalents, end of period $     6,011 $     5,391 $        6,011 $        5,391\n\nRTX Corporation Reconciliation of Adjusted (Non-GAAP) Results Adjusted Sales, Adjusted Operating Profit & Operating Profit Margin Quarter Ended June 30, Six Months Ended June 30, (Unaudited) (Unaudited) (dollars in millions - Income (Expense)) 2024 2023 2024 2023 Collins Aerospace Net sales $     6,999 $     6,384 $   13,672 $   12,504 Operating profit $     1,118 $        899 $     1,967 $     1,796 Restructuring (12) (5) (18) (8) Segment and portfolio transformation costs (15) (11) (33) (14) Charge associated with initiating alternative titanium sources (5)  — — (175) — Adjusted operating profit $     1,145 $        915 $     2,193 $     1,818 Adjusted operating profit margin 16.4 % 14.3 % 16.0 % 14.5 % Pratt & Whitney Net sales $     6,802 $     5,701 $   13,258 $   10,931 Operating profit $        542 $        230 $        954 $        645 Restructuring (15) (25) (33) (44) Insurance settlement 20 — 20 — Charges related to a customer insolvency (4) — (181) — (181) Adjusted operating profit $        537 $        436 $        967 $        870 Adjusted operating profit margin 7.9 % 7.6 % 7.3 % 8.0 % Raytheon Net sales $     6,511 $     6,700 $   13,170 $   12,992 Contract termination (2) (70) — (70) — Adjusted net sales $     6,581 $     6,700 $   13,240 $   12,992 Operating profit $        127 $        644 $     1,123 $     1,215 Restructuring (7) (17) (16) (24) Contract termination (2) (575) — (575) — Gain on sale of business, net of transaction and other related costs (3) — — 375 — Segment and portfolio transformation costs — (1) — (7) Adjusted operating profit $        709 $        662 $     1,339 $     1,246 Adjusted operating profit margin 10.8 % 9.9 % 10.1 % 9.6 % Eliminations and Other Net sales $       (591) $       (470) $    (1,074) $       (898) Operating profit (loss) $         (36) $         (16) $         (41) $          35 Gain on sale of land — — — 68 Charges related to a customer insolvency (4) — 10 — 10 Adjusted operating loss $         (36) $         (26) $         (41) $         (43) Corporate expenses and other unallocated items Operating loss $       (930) $         (59) $    (1,026) $       (102) Restructuring (2) (21) (3) (22) Tax audit settlements (6) — — (68) — Legal matters (1) (918) — (918) — Segment and portfolio transformation costs (3) (10) (5) (12) Adjusted operating loss $           (7) $         (28) $         (32) $         (68) FAS/CAS Operating Adjustment Operating profit $        212 $        284 $        426 $        573 Acquisition Accounting Adjustments Operating loss $       (504) $       (489) $    (1,004) $       (982) Acquisition accounting adjustments (504) (489) (1,004) (982) Adjusted operating profit $          — $          — $          — $          — RTX Consolidated Net sales $   19,721 $   18,315 $   39,026 $   35,529 Total net significant and/or non-recurring items included in Net sales above (2) (70) — (70) — Adjusted net sales $   19,791 $   18,315 $   39,096 $   35,529 Operating profit $        529 $     1,493 $     2,399 $     3,180 Restructuring (36) (68) (70) (98) Acquisition accounting adjustments (504) (489) (1,004) (982) Total net significant and/or non-recurring items included in Operating profit \r\nabove(1)(2)(3)(4)(5)(6) (1,491) (193) (1,379) (136) Adjusted operating profit $     2,560 $     2,243 $     4,852 $     4,396\n\n(1) Total net significant and/or non-recurring items in the table above for the quarter and six months ended June 30, 2024 includes charges of $918 million related to the expected resolution of several outstanding legal matters. The charge includes an additional accrual of $269 million to resolve the previously disclosed criminal and civil government investigations of defective pricing claims for certain legacy Raytheon Company contracts entered into between 2011 and 2013 and in 2017; an additional accrual of $364 million to resolve the previously disclosed criminal and civil government investigations of improper payments made by Raytheon Company and its joint venture, Thales-Raytheon Systems, in connection with certain Middle East contracts since 2012; and an accrual of $285 million related to certain voluntarily disclosed export controls violations, primarily identified in connection with the integration of Rockwell Collins and, to a lesser extent, Raytheon Company, including certain violations expected to be resolved pursuant to a consent agreement with the Department of State. Management has determined that these impacts are directly attributable to these legacy legal matters and that the nature of the charges are considered significant and unusual and therefore, not indicative of the Company's ongoing operational performance. (2) Total net significant and/or non-recurring items in the table above for the quarter and six months ended June 30, 2024 includes a pre-tax charge of $575 million related to the anticipated termination of a fixed price development contract with a foreign customer at Raytheon. The charge includes the write-off of remaining contract assets and our best estimate of the expected settlement in conjunction with this termination. Management has determined that these impacts are directly attributable to the expected termination, incremental to similar costs incurred for reasons other than those attributable to the termination and has determined that the nature of the pre-tax charge is considered significant and unusual and therefore, not indicative of the Company's ongoing operational performance. (3) Total net significant and/or non-recurring items in the table above for the six months ended June 30, 2024 includes a pre-tax gain, net of transaction and other related costs, of $0.4 billion associated with the completed sale of the Cybersecurity, Intelligence and Services (CIS) business at Raytheon. Management has determined that the nature of the net gain on the divestiture is considered significant and non-operational and therefore, not indicative of the Company's ongoing operational performance. (4) Total net significant and/or non-recurring items in the table above for the six months ended June 30, 2023 includes a net pre-tax charge of $0.2 billion related to a customer insolvency during the second quarter of 2023. The charge primarily relates to Contract assets and Customer financing assets exposures with the customer. Management has determined that the nature and significance of the charge is considered unusual and, therefore not indicative of the Company's ongoing operational performance. (5) Total net significant and/or non-recurring items in the table above for the six months ended June 30, 2024 includes a net pre-tax charge of $0.2 billion related to the recognition of unfavorable purchase commitments and an impairment of contract fulfillment costs associated with initiating alternative titanium sources at Collins. These charges were recorded as a result of the Canadian government's imposition of new sanctions in February 2024, which included U.S.- and German-based Russian-owned entities from which we source titanium for use in our Canadian operations. Management has determined that these impacts are directly attributable to the sanctions, incremental to similar costs incurred for reasons other than those related to the sanctions and has determined that the nature of the charge is considered significant and unusual, and therefore, not indicative of the Company's ongoing operational performance. (6) Total net significant and/or non-recurring items in the table above for the six months ended June 30, 2024 includes a tax benefit of $0.3 billion recognized as a result of the closure of the examination phase of multiple federal tax audits. In addition, there was a pre-tax charge of $68 million for the write-off of certain tax related indemnity receivables and a pre-tax gain on the reversal of $78 million of interest accruals, both directly associated with these tax audit settlements. Management has determined that the nature of these impacts related to the tax audit settlements is considered significant and non-operational and therefore, not indicative of the Company's ongoing operational performance.\n\nRTX Corporation Reconciliation of Adjusted (Non-GAAP) Results Adjusted Income, Earnings Per Share, and Effective Tax Rate Quarter Ended \r\nJune 30, Six Months Ended \r\nJune 30, (Unaudited) (Unaudited) (dollars in millions - Income (Expense)) 2024 2023 2024 2023 Net income attributable to common shareowners $    111 $ 1,327 $  1,820 $  2,753 Total Restructuring (36) (68) (70) (98) Total Acquisition accounting adjustments (504) (489) (1,004) (982) Total net significant and/or non-recurring items included in Operating profit (1)(2)(3)(4)(5)(6) (1,491) (193) (1,379) (136) Significant and/or non-recurring items included in Non-service Pension Income Non-service pension restructuring (3) — (5) (2) Pension curtailment related to sale of business (3) — — 9 — Significant non-recurring and non-operational items included in Interest Expense, Net Tax audit settlements (6) — — 78 — Tax effect of restructuring and net significant and/or non-recurring items above 257 165 216 266 Significant and/or non-recurring items included in Income Tax Expense Tax audit settlements (6) — — 296 — Significant and/or non-recurring items included in Noncontrolling Interest Noncontrolling interest share of customer insolvency charges (4) — 17 — 17 Noncontrolling interest share of charges related to an insurance settlement (7) — (7) — Less: Impact on net income attributable to common shareowners (1,784) (568) (1,866) (935) Adjusted net income attributable to common shareowners $ 1,895 $ 1,895 $  3,686 $  3,688 Diluted Earnings Per Share $   0.08 $   0.90 $    1.36 $    1.87 Impact on Diluted Earnings Per Share (1.33) (0.39) (1.39) (0.64) Adjusted Diluted Earnings Per Share $   1.41 $   1.29 $    2.75 $    2.51 Effective Tax Rate  59.1 % 15.4 % 15.8 % 17.0 % Impact on Effective Tax Rate  38.4 % (2.1) % (3.0) % (1.3) % Adjusted Effective Tax Rate  20.7 % 17.5 % 18.8 % 18.3 %\n\n(1) Total net significant and/or non-recurring items in the table above for the quarter and six months ended June 30, 2024 includes charges of $918 million related to the expected resolution of several outstanding legal matters. The charge includes an additional accrual of $269 million to resolve the previously disclosed criminal and civil government investigations of defective pricing claims for certain legacy Raytheon Company contracts entered into between 2011 and 2013 and in 2017; an additional accrual of $364 million to resolve the previously disclosed criminal and  civil government investigations of improper payments made by Raytheon Company and its joint venture, Thales-Raytheon Systems, in connection with certain Middle East contracts since 2012; and an accrual of $285 million related to certain voluntarily disclosed export controls violations, primarily identified in connection with the integration of Rockwell Collins and, to a lesser extent, Raytheon Company, including certain violations expected to be resolved pursuant to a consent agreement with the Department of State. Management has determined that these impacts are directly attributable to these legacy legal matters and that the nature of the charges are considered significant and unusual and therefore, not indicative of the Company's ongoing operational performance. (2) Total net significant and/or non-recurring items in the table above for the quarter and six months ended June 30, 2024 includes a pre-tax charge of $575 million related to the anticipated termination of a fixed price development contract with a foreign customer at Raytheon. The charge includes the write-off of remaining contract assets and our best estimate of the expected settlement in conjunction with this termination. Management has determined that these impacts are directly attributable to the expected termination, incremental to similar costs incurred for reasons other than those attributable to the termination and has determined that the nature of the pre-tax charge is considered significant and unusual and therefore, not indicative of the Company's ongoing operational performance.  (3) Total net significant and/or non-recurring items in the table above for the six months ended June 30, 2024 includes a pre-tax gain, net of transaction and other related costs, of $0.4 billion associated with the completed sale of the Cybersecurity, Intelligence and Services (CIS) business at Raytheon. Management has determined that the nature of the net gain on the divestiture is considered significant and non-operational and therefore, not indicative of the Company's ongoing operational performance. (4) Total net significant and/or non-recurring items in the table above for the six months ended June 30, 2023 includes a net pre-tax charge of $0.2 billion related to a customer insolvency during the second quarter of 2023. The charge primarily relates to Contract assets and Customer financing assets exposures with the customer. Management has determined that the nature and significance of the charge is considered unusual and, therefore not indicative of the Company's ongoing operational performance. (5) Total net significant and/or non-recurring items in the table above for the six months ended June 30, 2024 includes a net pre-tax charge of $0.2 billion related to the recognition of unfavorable purchase commitments and an impairment of contract fulfillment costs associated with initiating alternative titanium sources at Collins. These charges were recorded as a result of the Canadian government's imposition of new sanctions in February 2024, which included U.S.- and German-based Russian-owned entities from which we source titanium for use in our Canadian operations. Management has determined that these impacts are directly attributable to the sanctions, incremental to similar costs incurred for reasons other than those related to the sanctions and has determined that the nature of the charge is considered significant and unusual, and therefore, not indicative of the Company's ongoing operational performance. (6) Total net significant and/or non-recurring items in the table above for the six months ended June 30, 2024 includes a tax benefit of $0.3 billion recognized as a result of the closure of the examination phase of multiple federal tax audits. In addition, there was a pre-tax charge of $68 million for the write-off of certain tax related indemnity receivables and a pre-tax gain on the reversal of $78 million of interest accruals, both directly associated with these tax audit settlements. Management has determined that the nature of these impacts related to the tax audit settlements is considered significant and non-operational and therefore, not indicative of the Company's ongoing operational performance.\n\nRTX Corporation Reconciliation of Adjusted (Non-GAAP) Results Segment Operating Profit Margin and Adjusted Segment Operating Profit Margin Quarter Ended June 30, Six Months Ended June 30, (Unaudited) (Unaudited) (dollars in millions - Income (Expense)) 2024 2023 2024 2023 Net Sales $   19,721 $   18,315 $   39,026 $   35,529 Reconciliation to segment net sales: Eliminations and other 591 470 1,074 898 Segment Net Sales $   20,312 $   18,785 $   40,100 $   36,427 Reconciliation to adjusted segment net sales: Net significant and/or non-recurring items (1) (70) — (70) — Adjusted Segment Net Sales $   20,382 $   18,785 $   40,170 $   36,427 Operating Profit $        529 $     1,493 $     2,399 $     3,180 Operating Profit Margin 2.7 % 8.2 % 6.1 % 9.0 % Reconciliation to segment operating profit: Eliminations and other 36 16 41 (35) Corporate expenses and other unallocated items 930 59 1,026 102 FAS/CAS operating adjustment (212) (284) (426) (573) Acquisition accounting adjustments 504 489 1,004 982 Segment Operating Profit $     1,787 $     1,773 $     4,044 $     3,656 Segment Operating Profit Margin 8.8 % 9.4 % 10.1 % 10.0 % Reconciliation to adjusted segment operating profit: Restructuring  (34) (47) (67) (76) Net significant and/or non-recurring items (1)(2)(3)(4)(5) (570) (193) (388) (202) Adjusted Segment Operating Profit $     2,391 $     2,013 $     4,499 $     3,934 Adjusted Segment Operating Profit Margin 11.7 % 10.7 % 11.2 % 10.8 %\n\n(1) Total net significant and/or non-recurring items in the table above for the quarter and six months ended June 30, 2024 includes a pre-tax charge of $575 million related to the anticipated termination of a fixed price development contract with a foreign customer at Raytheon. The charge includes the write-off of remaining contract assets and our best estimate of the expected settlement in conjunction with this termination. Management has determined that these impacts are directly attributable to the expected termination, incremental to similar costs incurred for reasons other than those attributable to the termination and has determined that the nature of the pre-tax charge is considered significant and unusual and therefore, not indicative of the Company's ongoing operational performance.  (2) Net significant and/or non-recurring items in the table above for the six months ended June 30, 2024 includes a pre-tax gain, net of transaction and other related costs, of $0.4 billion associated with the completed sale of the CIS business at Raytheon. Management has determined that the nature of the net gain on the divestiture is considered significant and non-operational and therefore, not indicative of the Company's ongoing operational performance. (3) Net significant and/or non-recurring items in the table above for the six months ended June 30, 2023 includes a net pre-tax charge of $0.2 billion related to a customer insolvency during the second quarter of 2023. The charge primarily relates to Contract assets and Customer financing assets exposures with the customer. Management has determined that the nature and significance of the charge is considered unusual and, therefore not indicative of the Company's ongoing operational performance. (4) Net significant and/or non-recurring items in the table above for the six months ended June 30, 2024 includes a net pre-tax charge of $0.2 billion related to the recognition of unfavorable purchase commitments and an impairment of contract fulfillment costs associated with initiating alternative titanium sources at Collins. These charges were recorded as a result of the Canadian government's imposition of new sanctions in February 2024, which included U.S.- and German-based Russian-owned entities from which we source titanium for use in our Canadian operations. Management has determined that these impacts are directly attributable to the sanctions, incremental to similar costs incurred for reasons other than those related to the sanctions and has determined that the nature of the charge is considered significant and unusual, and therefore, not indicative of the Company's ongoing operational performance. (5) Net significant and/or non-recurring items in the table above for the six months ended June 30, 2024 includes a tax benefit of $0.3 billion recognized as a result of the closure of the examination phase of multiple federal tax audits. In addition, there was a pre-tax charge of $68 million for the write-off of certain tax related indemnity receivables and a pre-tax gain on the reversal of $78 million of interest accruals, both directly associated with these tax audit settlements. Management has determined that the nature of these impacts related to the tax audit settlements is considered significant and non-operational and therefore, not indicative of the Company's ongoing operational performance.\n\nRTX Corporation Free Cash Flow Reconciliation Quarter Ended June 30, (Unaudited) (dollars in millions) 2024 2023 Net cash flows provided by operating activities $              2,733 $                 719 Capital expenditures (537) (526) Free cash flow  $              2,196 $                 193 Six Months Ended June 30, (Unaudited) (dollars in millions) 2024 2023 Net cash flows provided by (used in) operating activities $              3,075 $                (144) Capital expenditures (1,004) (1,046) Free cash flow $              2,071 $            (1,190)\n\nMedia Contact 202.384.2474\n\nInvestor Contact 781.522.5123 Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtx-reports-q2-2024-results-302205879.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-reports-q2-2024-results-103000677.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.035,
            "neu": 0.831,
            "pos": 0.134
        }
    },
    {
        "date": "2024-07-25T00:00:00+00:00",
        "title": "RTX Stock Earnings: RTX Beats EPS, Beats Revenue for Q2 2024",
        "content": "RTX stock results show that RTX beat analyst estimates for earnings per share and beat on revenue for the second quarter of 2024.",
        "link": "https://investorplace.com/earning-results/2024/07/rtx-stock-earnings-rtx-for-q2-of-2024/",
        "symbols": [
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.296,
            "neg": 0,
            "neu": 0.909,
            "pos": 0.091
        }
    }
]