[
    {
        "date": "2024-09-17T14:01:59+00:00",
        "title": "Raytheon Selected to Streamline Production U.S. Navy Radar Modules",
        "content": "Raytheon, an RTX business, has been awarded an Office of Naval Research (ONR) Navy ManTech project from Penn State University Applied Research Laboratory's Electronics Manufacturing Center of Excellence to streamline the production of SPY-6 Transmit/Receive (TR) modules.\n\nManufacturing advancements like automation, new material sources and process yield improvements will result in cost-savings for the U.S. Navy across the life cycle of the SPY-6 radar.\n\nMost Read on Design & Development Today:\n\nNavy Officer Demoted After Sneaking Starlink Satellite Dish Onto a Warship It Took 50,000 Gallons of Water to Put Out Tesla Semi Fire in California, U.S. Agency Says A Capsule has Been Propelled Through a Hyperloop Test Tube in a Step Forward for the Transit System Battery-Powered Devices are Overheating More Often on Planes and Raising Alarm\n\nSPY-6 is the U.S. Navy's family of radars that performs air and missile defense on several classes of ships. They enable ships to simultaneously detect, track, and discriminate air, surface and ballistic missile targets, providing a 360-degree integrated air and missile defense for ships.\n\nThe four variants of SPY-6 use common hardware and software, and their construction is modular – making it more reliable and less expensive to maintain. Manufacturing advancements will further increase performance while reducing overall production costs.\n\nWork on this contract is being conducted in Andover, Massachusetts. New SPY-6 radio frequency TR modules are expected to be delivered in 2026-2027.\n\nClick here to subscribeto our daily newsletter.\n\nView comments",
        "link": "https://finance.yahoo.com/news/raytheon-selected-streamline-production-u-140159201.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.856,
            "neg": 0.026,
            "neu": 0.905,
            "pos": 0.068
        }
    },
    {
        "date": "2024-09-17T12:00:00+00:00",
        "title": "RTX's Raytheon selected to streamline production of SPY-6 Transmit/Receive modules",
        "content": "Manufacturing advancements expected to reduce production costs\n\nANDOVER, Mass., Sept. 17, 2024 /PRNewswire/ -- Raytheon, an RTX (NYSE: RTX) business, has been awarded an Office of Naval Research (ONR) Navy ManTech project from Penn State University Applied Research Laboratory's Electronics Manufacturing Center of Excellence to streamline the production of SPY-6 Transmit/Receive (TR) modules. Manufacturing advancements like automation, new material sources and process yield improvements will result in cost-savings for the U.S. Navy across the life cycle of the SPY-6 radar.\n\n\"TR modules are a key component in many of the military's critical sensing systems,\" said Colin Whelan, president of Advanced Technology at Raytheon. \"These manufacturing advancements will greatly benefit future capabilities and can be implemented on other U.S. Navy and Department of Defense programs.\"\n\nSPY-6 is the U.S. Navy's family of radars that performs air and missile defense on several classes of ships. They enable ships to simultaneously detect, track, and discriminate air, surface and ballistic missile targets, providing a 360-degree integrated air and missile defense for ships.\n\nThe four variants of SPY-6 use common hardware and software, and their construction is modular – making it more reliable and less expensive to maintain. Manufacturing advancements will further increase performance while reducing overall production costs.\n\nWork on this contract is being conducted in Andover, Massachusetts. New SPY-6 radio frequency TR modules are expected to be delivered in 2026-2027.\n\nAbout Raytheon\n\nRaytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nAbout RTX\n\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-raytheon-selected-to-streamline-production-of-spy-6-transmitreceive-modules-302249999.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-raytheon-selected-streamline-production-120000812.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.989,
            "neg": 0.018,
            "neu": 0.847,
            "pos": 0.135
        }
    },
    {
        "date": "2024-09-17T08:13:13+00:00",
        "title": "Q2 Earnings Outperformers: Northrop Grumman (NYSE:NOC) And The Rest Of The Defense Contractors Stocks",
        "content": "Q2 Earnings Outperformers: Northrop Grumman (NYSE:NOC) And The Rest Of The Defense Contractors Stocks\n\nThe end of the earnings season is always a good time to take a step back and see who shined (and who not so much). Let’s take a look at how defense contractors stocks fared in Q2, starting with Northrop Grumman (NYSE:NOC).\n\nDefense contractors typically require technical expertise and government clearance. Companies in this sector can also enjoy long-term contracts with government bodies, leading to more predictable revenues. Combined, these factors create high barriers to entry and can lead to limited competition. Lately, geopolitical tensions–whether it be Russia’s invasion of Ukraine or China’s aggression towards Taiwan–highlight the need for defense spending. On the other hand, demand for these products can ebb and flow with defense budgets and even who is president, as different administrations can have vastly different ideas of how to allocate federal funds.\n\nThe 15 defense contractors stocks we track reported a strong Q2. As a group, revenues beat analysts’ consensus estimates by 4.7% while next quarter’s revenue guidance was 6.7% below.\n\nInflation progressed towards the Fed’s 2% goal at the end of 2023, leading to strong stock market performance. On the other hand, 2024 has been a bumpier ride as the market switches between optimism and pessimism around rate cuts and inflation. Thankfully, defense contractors stocks have been resilient with share prices up 7.3% on average since the latest earnings results.\n\nNorthrop Grumman (NYSE:NOC)\n\nResponsible for the development of the first stealth bomber, Northrop Grumman (NYSE:NOC) specializes in providing aerospace, defense, and security solutions for various industry applications.\n\nNorthrop Grumman reported revenues of $10.22 billion, up 6.7% year on year. This print exceeded analysts’ expectations by 2%. Overall, it was a very strong quarter for the company with an impressive beat of analysts’ operating margin estimates and a solid beat of analysts’ organic revenue estimates. Northrop Grumman Total Revenue\n\nInterestingly, the stock is up 17.6% since reporting and currently trades at $520.\n\nIs now the time to buy Northrop Grumman? Access our full analysis of the earnings results here, it’s free.\n\nBest Q2: Mercury Systems (NASDAQ:MRCY)\n\nFounded in 1981, Mercury Systems (NASDAQ:MRCY) specializes in providing processing subsystems and components for primarily defense applications.\n\nMercury Systems reported revenues of $248.6 million, down 1.8% year on year, outperforming analysts’ expectations by 7.8%. The business had an incredible quarter with an impressive beat of analysts’ organic revenue and earnings estimates.\n\nStory continues Mercury Systems Total Revenue\n\nThe market seems happy with the results as the stock is up 10.2% since reporting. It currently trades at $37.48.\n\nIs now the time to buy Mercury Systems? Access our full analysis of the earnings results here, it’s free.\n\nWeakest Q2: General Dynamics (NYSE:GD)\n\nCreator of the famous M1 Abrahms tank, General Dynamics (NYSE:GD) develops aerospace, marine systems, combat systems, and information technology products.\n\nGeneral Dynamics reported revenues of $11.98 billion, up 18% year on year, exceeding analysts’ expectations by 4.1%. Still, it was a slower quarter as it posted a miss of analysts’ backlog sales estimates.\n\nInterestingly, the stock is up 4.5% since the results and currently trades at $307.55.\n\nRead our full analysis of General Dynamics’s results here.\n\nKratos (NASDAQ:KTOS)\n\nEstablished with a commitment to supporting national security, Kratos (NASDAQ:KTOS) is a provider of advanced engineering, technology, and security solutions tailored for critical national security applications.\n\nKratos reported revenues of $300.1 million, up 16.8% year on year. This number topped analysts’ expectations by 8.7%. Overall, it was a strong quarter as it also put up an impressive beat of analysts’ organic revenue and earnings estimates.\n\nThe stock is up 10.1% since reporting and currently trades at $22.14.\n\nRead our full, actionable report on Kratos here, it’s free.\n\nRTX (NYSE:RTX)\n\nOriginally focused on refrigeration technology, Raytheon (NSYE:RTX) provides a a variety of products and services to the aerospace and defense industries.\n\nRTX reported revenues of $19.72 billion, up 7.7% year on year. This print beat analysts’ expectations by 2.3%. It was a very strong quarter as it also recorded an impressive beat of analysts’ operating income and EPS estimates.\n\nThe stock is up 13.9% since reporting and currently trades at $119.49.\n\nRead our full, actionable report on RTX here, it’s free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/q2-earnings-outperformers-northrop-grumman-081313861.html",
        "symbols": [
            "0K92.LSE",
            "GD.US",
            "KTOS.US",
            "MCY.F",
            "MCY.MU",
            "MCY.STU",
            "MRCY.US",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.026,
            "neu": 0.795,
            "pos": 0.179
        }
    }
]