[
    {
        "date": "2024-07-31T22:11:54+00:00",
        "title": "Boeing names aerospace veteran Kelly Ortberg CEO to steer turnaround",
        "content": "One of the two global planemakers, Boeing has been mired in a reputational and safety crisis after a Jan. 5 mid-air cabin panel blowout on an Alaska Airlines-operated MAX 9 jet carrying 171 passengers.",
        "link": "https://www.reuters.com/business/aerospace-defense/boeing-names-kelly-ortberg-new-ceo-2024-07-31/",
        "symbols": [
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.318,
            "neg": 0.117,
            "neu": 0.802,
            "pos": 0.08
        }
    },
    {
        "date": "2024-07-31T16:36:26+00:00",
        "title": "Boeing Cash Burn Shows Turbulent Path Ahead for New CEO Ortberg",
        "content": "(Bloomberg) -- In his first comments as Boeing Co.’s next chief executive officer, Kelly Ortberg said “there is much work to be done” — and the company was swift to reinforce that point.\n\nMost Read from Bloomberg\n\nKamala Harris Wipes Out Trump’s Swing-State Lead in Election Dead Heat Intel to Cut Thousands of Jobs to Reduce Costs, Fund Rebound Luxury Heir Alleges His $13 Billion Hermès Fortune Has Vanished Hamas Says Israel Killed Political Leader With Airstrike in Iran Ukraine Receives First F-16 Fighter Jets After Long Wait\n\nJust hours after the embattled planemaker announced Ortberg as its new leader, the enormity of the task came into sharper focus. Boeing will continue to burn cash in the third quarter, after consuming more than $1 billion each month in the first half, Chief Financial Officer Brian West cautioned. Just how big the drain would turn out to be for the full year, he couldn’t say.\n\n“I’m just not smart enough right at this moment to say whether it’s $5 billion or $10 billion,” West told analysts during Boeing’s earnings conference call.\n\nThe comments highlight just how deep in uncharted territory Boeing finds itself, and the task ahead for Ortberg to pull one of the country’s most storied manufacturers out of its current crisis. The company would be dangerously low on cash if not for a $10 billion debt financing injection last quarter. And it’s unclear how long Boeing can continue to tap bond markets, or maintain its investment grade rating, without a sharp improvement in its operations.\n\nOrtberg was hired out of retirement after rising through the ranks at aviation supplier Rockwell Collins, and his appointment was viewed positively by analysts and investors. But stabilizing Boeing will hand him one of the most audacious turnaround challenges in corporate America, and at a much bigger and more complex company than he ran at any point in his career.\n\n“Right now, Boeing needs a company doctor to come in, turn over every stone, tell everyone the bad news, take the charges needed and then bring about an effective turnaround,” said Nick Cunningham, an aviation analyst at Agency Partners in London.\n\nBoeing picked Ortberg as it works through one of the most tumultuous periods in its history. In January, a fuselage panel blew out of an almost-new 737 Max 9 airliner during flight, which investigators attributed to missing bolts in the so-called door plug segment. That set of a chain reaction of events, culminating in Ortberg’s appointment.\n\nThe stock has lost 26% in value this year, which puts it on track for its worst annual performance since 2020. The planemaker is working to placate frustrated airlines and win back the trust of US regulators and the flying public after the Jan. 5 accident.\n\nStory continues\n\nRead this next: Boeing’s Legacy Vanished Into Thin Air. Saving It Will Take Years\n\nThe new CEO takes over from Dave Calhoun, who announced he planned to step down in March amid a broader management shake-up as the extent of the crisis became clear. Among his biggest tasks will be to “foster continuous problem solving and collaboration on the shop floor,” said Nicolas Owens, industrials equity analyst at Morningstar Research Services LLC.\n\n“The real test for any Boeing CEO will be navigating the very long cycle and high cost of investment in new plane designs, which can be tricky because the rewards accrue in decades, not years,” Owens said.\n\nCash Burn\n\nThe planemaker said on Wednesday that it burned through $4.33 billion in cash during the second quarter. That’s after a similar outflow in the first three months, as Boeing slowed down output of its commercial jet factories.\n\nBoeing’s defense and space division suffered its worst quarter since mid-2023 as costs ballooned to convert a pair of 747 jumbo jets into the next presidential Air Force One fleet. The company said it recorded $1 billion of losses on fixed-price contracts.\n\nThe defense stumbles are a reminder that Boeing’s operational difficulties extend well beyond its crisis-stricken commercial division. The company has gradually been stepping up output in its 737 Max jets under close supervision by federal regulators, but faces another crisis with a strike deadline looming in September for Seattle-area factory workers.\n\n‘Experienced Leader’\n\nWith the appointment, Ortberg steps into the leadership role that many once expected him to play at RTX, one of Boeing’s biggest suppliers and the parent to enginemaker Pratt & Whitney. He briefly ran Collins Aerospace before shifting to an advisory role and eventually RTX’s board in 2020.\n\nAt Rockwell Collins, Ortberg had a track record as dealmaker — striking his first major acquisition just 11 days after taking over as CEO. He was known for his blunt, no-nonsense style and his effort to flatten hierarchy.\n\n“Kelly is an experienced leader who is deeply respected in the aerospace industry,” said Boeing Chairman Steve Mollenkopf, who led the search for the new CEO. Boeing said it waived the mandatory retirement age of 65 for Ortberg, as it did in 2021 for Calhoun.\n\nOrtberg was the rare executive to openly criticize Boeing at a time when the US planemaker held huge sway over its subcontractors. Ortberg called out the manufacturer as “delinquent” in 2016, after it abruptly switched payment terms from 30 days to as long as four months, squeezing working capital for its suppliers.\n\nLeadership Shuffle\n\nHe eventually joined the consolidation wave, selling the Cedar Rapids, Iowa-based aerospace company to United Technologies, which later combined with Raytheon Technologies, now RTX. At the time, it was the biggest acquisition in aviation history.\n\nCalhoun will continue to serve as special adviser until March 2025. As part of his decision to step down, Boeing also named Stephanie Pope as new head of its commercial aviation business earlier this year. Pope, 52, was seen as the most promising internal candidate for the CEO job. Given she’s more than 10 years younger than Ortberg, she may yet get her moment to take the top job.\n\nCalhoun, who had previously thrown his weight behind her as the next CEO, appeared to suggest she’s here to stay.\n\nSpeaking on the same call as West, Calhoun said of Ortbert that “I don’t think he’s coming in with a notion to want to change a lot of folks.”\n\n--With assistance from Siddharth Philip and Allyson Versprille.\n\nMost Read from Bloomberg Businessweek\n\nHow to Calculate the Value of an MBA ‘Dancing With Death’: What It’s Like to Dismantle a Ship Scammers Target Middle East Influencers With Meta’s Own Tools Inside GunTube, the YouTube Subculture Linked to the Trump Shooter The Miseducation of America’s Nurse Practitioners\n\n©2024 Bloomberg L.P.\n\nView comments",
        "link": "https://finance.yahoo.com/news/boeing-cash-burn-shows-turbulent-163626181.html",
        "symbols": [
            "0BOE.LSE",
            "5UR.F",
            "5UR.XETRA",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.721,
            "neg": 0.051,
            "neu": 0.893,
            "pos": 0.056
        }
    },
    {
        "date": "2024-07-31T13:24:09+00:00",
        "title": "Are Wall Street Analysts Bullish on RTX Corporation (RTX) Now?",
        "content": "We recently compiled a list of the 8 Best Drone Stocks to Buy Now. In this article, we are going to take a look at where RTX Corporation (NYSE:RTX) stands against the other drone stocks.\n\nThe term \"drone\" refers to any remotely piloted aircraft (RPA), which can vary in form and autonomy, either controlled by a human pilot or capable of fully autonomous flights. In 2005, the United States Department of Defense (DoD) and the Federal Aviation Administration (FAA) adopted the term \"unmanned aircraft system\" (UAS) to describe these aerial drones. This terminology was later adopted by other governmental agencies globally, highlighting the importance of considering various system components rather than focusing solely on the aircraft for regulatory development. The rapid evolution of drones began with the advancement of defense technologies, enabling the remote piloting of aircraft equipped with both weaponized and non-weaponized systems. These larger military drones, often weighing several kilograms, are crucial for deployment in environments too dangerous for human pilots. Today, smaller drones are employed by various government agencies for a range of operations, including precision agriculture mapping and surveillance.\n\nThe Russia-Ukraine war, which began in February 2022, has driven a significant increase in demand for drones, as both militaries employ them for various operations, including intelligence, surveillance, reconnaissance, and target acquisition support. The unprecedented scale of Unmanned aerial vehicles (UAVs) deployment caught both Ukrainian and Russian forces unprepared for such extensive use. However, both militaries have rapidly advanced their drone technology, frequently modernizing and adapting these systems directly on the front lines. In a statement this past year, Anton Gerashchenko, an adviser to Ukraine's Minister of Internal Affairs, stated \"This war is a war of drones; they are the super weapon here.\" With advancements in artificial intelligence (AI) and increasing legislative support, the drone market seems poised for significant growth.\n\nAnother trend involves the development of specialized drones tailored for specific industries. These industry-specific drones are equipped with sensors, cameras, and software designed to meet the unique requirements of sectors such as agriculture, construction, and inspection. These 'Consumer' and 'Recreational' drones have become a common part of daily life, particularly among drone hobbyists. As of April of this year, over 780,000 drones were reportedly registered with the Federal Aviation Administration (FAA), with 375,226 classified as commercial and 400,858 as recreational.\n\nStory continues\n\nWhat Does the Market Think About the Future of Drones?\n\nThe U.S. commercial drone market was valued at $5.85 billion in 2023 and is projected to reach approximately $14.11 billion by 2033, growing at a compound annual growth rate (CAGR) of 9.2% from 2024 to 2033. In 2023, the rotary blade segment held the largest market share at around 81%, while the hybrid segment is anticipated to experience the fastest growth, with a CAGR of over 11% during the forecast period.\n\nOn the other hand, a report by MarkNtel Advisors states that the global military drone market was valued at approximately $20.21 billion in 2023 and is projected to grow at a CAGR of about 12.21% from 2024 to 2030. This rapid growth is driven by the widespread adoption of Extended Visual Line of Sight (EVLOS) UAVs for long-range missions focused on data collection, battle management, and electronic warfare. A notable example of this technology came in the form of General Atomics' testing of advanced datalink and avionics enhancements for the MQ-1C Gray Eagle Extended Range (GE-ER) drone back in 2022.\n\nOur Methodology\n\nTo compile the list of the best drone stocks to invest in, we first sifted through ETFs and online rankings to come up with a preliminary list. Next, we scanned Insider Monkey’s database of 920 hedge funds and selected the 8 drone stocks that were the most widely held by institutional investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple, our research has shown that we can outperform the market by imitating the top stock picks of best hedge funds. Our quarterly newsletter’s strategy picks 14 small and large-caps every quarter and it has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\n\nAn aerial view of a commercial jetliner in flight, its airframe glinting in the sun.\n\nRTX Corporation (NYSE:RTX)\n\nNumber of Hedge Fund Holders: 62\n\nRTX Corporation (NYSE: RTX), a firm specializing in aerospace and defense, provides systems and services to clients in the global commercial, military, and government sectors. The company operates through four primary segments: Collins Aerospace, Pratt & Whitney, Raytheon Intelligence & Space, and Raytheon Missiles & Defense. The defense contractors Coyote drone was a favored choice for the U.S. military as a near-term counter-UAS solution.\n\nIn Q1 2024, RTX Corporation (NYSE:RTX) reported sales of $19.3 billion, marking a 12% increase from Q1 2023. The company's earnings growth was even more impressive, with a 32% year-over-year increase, reaching $1.28 per diluted share. Consequently, with profits rising faster than sales, RTX also achieved improved profit margins.\n\nIn addition, RTX Corporation (NYSE:RTX) has recently secured several significant contracts, including a $506 million agreement with NASA to develop the Landsat Next Instrument Suite (LandIS), which aims to enhance Earth observation capabilities. Additionally, the aerospace company managed to win a $677 million contract to continue producing AN/SPY-6(V) radars for the U.S. Navy. This marks the third option exercised from the March 2022 hardware, production, and sustainment contract, valued at up to $3 billion over five years. Under this contract, the U.S. Navy will receive seven additional radars, bringing the total number of radars under procurement to 38.\n\nAt the end of Q1 2024, 62 hedge funds tracked by Insider Monkey held stakes in RTX Corporation (NYSE:RTX), a slight increase from 61 in the previous quarter. These stakes have a total value of nearly $2.4 billion. With almost 9 million shares, Fisher Asset Management was the company’s leading stakeholder in Q1.\n\nOverall RTX ranks 2nd on our list of the best drone stocks to buy. You can visit 8 Best Drone Stocks to Buy Nowto see the other drone stocks that are on hedge funds’ radar. While we acknowledge the potential of RTX as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than RTX but that trades at less than 5 times its earnings, check out our report about the cheapest AI Stock.\n\nREAD NEXT: Michael Burry Is Selling These Stocks and Jim Cramer is Recommending These Stocks.\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/wall-street-analysts-bullish-rtx-132409882.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.017,
            "neu": 0.883,
            "pos": 0.1
        }
    },
    {
        "date": "2024-07-31T13:01:49+00:00",
        "title": "Who is Boeing's new CEO Kelly Ortberg?",
        "content": "Boeing named former Rockwell Collins executive Kelly Ortberg as its new President and CEO, tasking the aerospace industry veteran with turning the struggling planemaker around.",
        "link": "https://www.reuters.com/business/aerospace-defense/who-is-boeings-new-ceo-kelly-ortberg-2024-07-31/",
        "symbols": [
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.422,
            "neg": 0.104,
            "neu": 0.896,
            "pos": 0
        }
    }
]