[
    {
        "date": "2024-06-26T12:11:18+00:00",
        "title": "NASA Faces Setback As RTX's Collins Aerospace Backs Out Of Spacesuit Deal",
        "content": "NASA Faces Setback As RTX's Collins Aerospace Backs Out Of Spacesuit Deal\n\nCollins Aerospace, a subsidiary of RTX Corp (NYSE:RTX), is in discussions with the National Aeronautics and Space Administration, famously known as NASA, to withdraw from its contract to develop new spacesuits for the International Space Station (ISS).\n\nThe move marks a setback for NASA as it grapples with its aging spacewalking suits.\n\nThe contract, part of a $3.5 billion agreement awarded in 2022, aimed to create new spacesuits for the ISS and future lunar missions. Collins initially received $97 million for the ISS suit development.\n\nReuters highlights that Collins’ involvement in the program has faced numerous challenges, leading to significant delays. The report adds, citing sources familiar with the matter, that discussions are underway to wind down the company’s role.\n\nThis development comes at a particularly challenging time for NASA, which has recently experienced a rare series of astronaut spacewalk cancellations due to issues with its current 40-year-old spacesuits, which Collins manages.\n\n“After a thorough evaluation, Collins Aerospace and NASA mutually agreed to descope Exploration Extravehicular Activity Services (xEVAS) task orders,” Reuters noted, citing a Collins spokeswoman, referring to the spacesuit contract.\n\nOn June 13, a planned spacewalk was canceled due to a “spacesuit discomfort issue.” A second attempt on Monday was aborted minutes into the mission because of a water leak in U.S. astronaut Tracy Dyson’s suit.\n\n“There’s water everywhere ... I got an arctic blast all over my visor,” Dyson reported to mission control.\n\nThese issues highlight the long-standing difficulties NASA has faced in modernizing its spacesuits, which are essentially human-shaped spacecraft designed for routine repairs on the ISS.\n\nNASA has struggled to update these bulky, complex systems for decades, with minor redesigns and refurbishments failing to address fundamental issues.\n\nNASA’s inspector general and the Aerospace Safety Advisory Panel have repeatedly urged the agency to upgrade its spacesuits, Reuters points.\n\nCollins’ potential withdrawal from the new spacesuit program could leave the future development of NASA’s suits to Axiom Space, a startup currently managing astronaut flights and building its own space station.\n\nPrice Action: RTX shares were trading lower by 0.09% at $101.48 premarket at the last check on Wednesday.\n\nDisclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\n\nPhoto by L Galbraith on Shutterstock\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nStory continues\n\nGet the latest stock analysis from Benzinga?\n\nRTX (RTX): Free Stock Analysis Report\n\nThis article NASA Faces Setback As RTX's Collins Aerospace Backs Out Of Spacesuit Deal originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nView comments",
        "link": "https://finance.yahoo.com/news/nasa-faces-setback-rtxs-collins-121118915.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.909,
            "neg": 0.045,
            "neu": 0.879,
            "pos": 0.075
        }
    },
    {
        "date": "2024-06-26T08:20:00+00:00",
        "title": "3 Defense Stocks to Buy With $875 and Hold Forever",
        "content": "Defense and aerospace companies can be underrated long-term investments. A handful of power players dominate the industry, enjoying competitive advantages thanks to their constant innovation, deep pockets, and strong ties to the U.S. government and its allies.\n\nThey also benefit from the fact that America faces numerous (and varied) threats. At the moment, war and lesser conflicts are taking place in Europe and the Middle East. Meanwhile, emerging national economies (like those in BRICS) have created economic pressure on Western countries like the United States, which has long had tense relationships with some Eastern powers.\n\nThe unfortunate reality is that America's strength protects America but it also creates global tension, which means that defense spending will likely be a priority for the U.S. government for the foreseeable future: US Government Defense Spending with Forecast Chart\n\nGeneral Dynamics(NYSE: GD), Lockheed Martin(NYSE: LMT), and RTX(NYSE: RTX) are three of the world's six largest defense and aerospace companies. Their products and services span land, sea, air, and space, and they are poised to grow for decades to come as key partners in America's defense efforts.\n\nThe best part? You can own stock in all three for under $900.\n\nHere is what you need to know about these three buy-and-hold defense stocks.\n\n1. General Dynamics (trading around $300 a share)\n\nDefense companies understandably depend primarily on government spending for revenue, but General Dynamics offers more diversification than most. Its aerospace unit builds private jets and provides aviation services to companies and high-net-worth clients. The company's marine division is the leading designer and builder of nuclear-powered submarines. Lastly, its combat and technologies segments build land vehicles, weapons systems, and software used for IT and mission control.\n\nPolitics can create volatility, primarily when politicians debate America's defense budget. The budget doesn't always go up, stagnating for periods at a time. That can impact companies like General Dynamics. Still, revenue and earnings have historically marched higher if you're patient enough. GD Revenue (TTM) Chart\n\nThat seems poised to continue. Analysts believe General Dynamics will grow earnings by an average of 12% annually over the long term. This sets investors up for double-digit returns once you factor in the company's 1.9% dividend yield. Those looking for investment exposure to a little bit of everything should give General Dynamics a hard look.\n\n2. Lockheed Martin (trading around $472 a share)\n\nInvestors might have seen the F-35 in the news for its potential $2 trillion lifetime program cost. It's probably fair to say that it is Lockheed Martin's most famous product. However, the defense behemoth builds many products across its business units, including jets and helicopters, naval ships, satellites and spacecraft, missile systems, and cybersecurity offerings. The company's space segment represents nearly a fifth of revenue, making the stock an excellent pick for long-term exposure.\n\nStory continues\n\nWhile controversial, the F-35 program has become a cornerstone for America's defense, with a potential runtime through 2088. It arguably sets a high floor for Lockheed Martin's business, which should give investors confidence that it will grow for decades. LMT Revenue (TTM) Chart\n\nDespite the F-35's presence, analysts are more cautious about Lockheed Martin's growth. Analyst estimates call for annualized growth of 4% for the next three to five years. That sets investors up for high-single-digit returns when factoring in the stock's 2.7% yield. Looking further out, it's hard not to like Lockheed Martin's space unit as a potential growth catalyst down the road. Investors can look at Lockheed Martin as a high-floor, lower-ceiling investment.\n\n3. RTX (trading around $102 a share)\n\nA 2020 merger between Raytheon Technologies and United Technologies formed RTX, the world's largest defense company with $71 billion in annual revenue. RTX has a massive footprint in the aviation sector. Its Collins Aerospace unit sells aircraft, components, and systems to military and commercial clients. At the same time, Pratt & Whitney is a separate unit and leading manufacturer of aircraft engines and auxiliary power units. Its Raytheon segment houses its military offerings, which include weapons, systems, and components for air, land, sea, and space.\n\nThe merger brought with it accounting adjustments and spinoffs that impacted GAAP earnings. However, revenue is at all-time highs, and analysts expect profits to boost back with earnings per share of approximately $5.39 this year. Long-term estimates peg earnings growth at 11% annualized over the long term, so the future looks bright for RTX and its shareholders. RTX Revenue (TTM) Chart\n\nLike General Dynamics, RTX offers investors added diversity in commercial business. Pratt & Whitney's leadership in critical aircraft components is a wide-moat competitive advantage that should help the company achieve consistent performance over the years.\n\nShould you invest $1,000 in General Dynamics right now?\n\nBefore you buy stock in General Dynamics, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and General Dynamics wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $723,729!*\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. TheStock Advisorservice has more than quadrupled the return of S&P 500 since 2002*.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of June 24, 2024\n\nJustin Pope has no position in any of the stocks mentioned. The Motley Fool recommends Lockheed Martin and RTX. The Motley Fool has a disclosure policy.\n\n3 Defense Stocks to Buy With $875 and Hold Forever was originally published by The Motley Fool\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-defense-stocks-buy-875-082000038.html",
        "symbols": [
            "GD.US",
            "LMT.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.058,
            "neu": 0.796,
            "pos": 0.146
        }
    }
]