[
    {
        "date": "2024-05-01T13:00:00+00:00",
        "title": "RTX's Pratt &amp; Whitney Canada and Angola's TAAG Airlines sign Fleet Management™ Program agreement for PW150A engines",
        "content": "PW150A regional turboprops power TAAG's De Havilland Canada Dash 8-400 aircraft\n\nADDIS ABABA, Ethiopia, May 1, 2024 /PRNewswire/ -- Pratt & Whitney Canada and TAAG Angola Airlines E.P., Angola's state-owned airline, have signed a six-year Fleet Management™ Program (FMP) agreement. The engine maintenance services cover the airline's PW150A engines which power their fleet of Dash 8-400 regional turboprops. The agreement allows Pratt & Whitney to tailor coverage to meet the airline's operating environment. Pratt & Whitney is an RTX business. TAAG’s De Havilland Canada Dash 8-400 aircraft powered by the PW150A engine\n\n\"Airlines that provide regional connectivity such as TAAG play a vital role in helping customers travel to major urban centers, often for connections to international destinations,\" says Irene Makris, vice president, Customer Service, Pratt & Whitney Canada. \"Consequently, the dispatch reliability of regional aircraft plays a critical role in keeping the entire ecosystem operating efficiently and economically. By maintaining TAAG's PW150A engines we are helping to ensure optimal aircraft availability and engine asset management.\"\n\nThe agreement also includes Pratt & Whitney's proprietary oil-analysis technology and its FAST™ diagnostic and prognostic solution which captures, analyzes and wirelessly sends full-flight data intelligence to the customer within minutes of engine shutdown.\n\n\"With a roughly 75-passenger capacity, optimal fuel efficiency, and overall reliability, the PW150A-powered Dash 8-400 fits our needs,\" said Nelson de Oliveira, CEO, TAAG Airlines. \"P&WC's FMP program is ideal for us as we can rely on the proven expertise of the engine original equipment manufacturer to ensure we gain maximum productivity and efficiency from our PW150A engines.\"\n\nFleet Management Programs are flexible, high-value maintenance planning solutions that lower operating costs and simplify fleet operations management. Tailored to suit the unique requirements of fleet operators and airlines, Pratt & Whitney's FMPs allow customers to focus on their core business and eliminate the overhead and logistical challenges of operating a maintenance facility.\n\nThe PW100/PW150 engine family powers 90 percent of 30- to 90-passenger regional turboprop aircraft operating today. These turboprop engines consume 25 to 40% less fuel and produce 50% fewer CO2 emissions than similar-sized regional jets. The engines offer airlines the best life cycle costs and help sustain an aircraft's value. In 2024, the engine family is celebrating the 40th anniversary of its entry into service.\n\nStory continues\n\nRead more about Pratt & Whitney's history of innovation here.\n\nAbout Pratt & Whitney Pratt & Whitney is a world leader in the design, manufacture and service of aircraft engines and auxiliary power units.\n\nAbout RTX\r\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/rtxs-pratt--whitney-canada-and-angolas-taag-airlines-sign-fleet-management-program-agreement-for-pw150a-engines-302132857.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-pratt-whitney-canada-angolas-130000762.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.013,
            "neu": 0.827,
            "pos": 0.161
        }
    }
]