[
    {
        "date": "2024-08-30T16:27:00+00:00",
        "title": "Lockheed, Raytheon Secure $1.3 Billion Javelin Missile Contract",
        "content": "Lockheed Martin Corporation LMT and Raytheon, part of RTX Corporation RTX, have been awarded a $1.3 billion follow-on contract by the U.S. Army for Javelin missiles. These missiles have played a significant role in Ukraine's defense. This latest agreement, which builds on a larger contract from last year, could total up to $7.2 billion for an indefinite quantity of missiles between 2023 and 2026.\r\n\r\nThe companies have been increasing Javelin production to meet rising demand and aim to achieve an annual manufacturing capacity of around 4,000 missiles by 2026. The new contract includes the production of more than 4,000 Javelins, mainly to replenish Javelin missile stock that has been sent to support Ukraine.\n\nIncreasing Usage of LMT and RTX’s Javelin Missiles\n\nThe joint venture (JV) between Lockheed Martin and Raytheon is a powerful alliance in the defense industry. These two defense companies have collaborated on various defense projects, with the Javelin missile system being one of their most successful projects. This JV brings together LMT’s extensive experience in missile production and Raytheon’s advanced technology in defense systems, thereby enabling it to meet the U.S. Army's requirements.\r\n\r\nThe Javelin missile is a versatile, shoulder-fired weapon system known for its precision and effectiveness on the battlefield. It automatically guides itself to the target after launch, allowing the gunner to take cover and avoid counterfire. Soldiers or marines using the missile can reposition immediately after firing, or reload to engage another threat. It has been widely used by U.S. forces and allied nations and is currently utilized in Ukraine. The missile’s ability to engage multiple targets, including tanks and fortified positions, has made it an essential tool for modern warfare.\n\nLMT’s Growth Prospects\n\nLockheed Martin secures major defense contracts with a steady order flow from its leveraged presence in the Army, Air Force, Navy and IT programs. Its total backlog was a solid $158.34 billion as of June 30, 2024. The company continues to win defense contracts and support the defense departments of the United States and other allied nations.\r\n\r\nThe global defense sector is seeing strong growth driven by rising geopolitical tensions and the need for advanced military capabilities. The demand for U.S. weaponry, including shoulder-mounted Javelin systems is on the rise, which will further boost LMT’s performance.\n\nProspects of LMT’s Defense Peers\n\nOther defense companies that are likely to enjoy the perks of the expanding defense market have been discussed below.\r\n\r\nNorthrop Grumman Corporation NOC develops and builds some of the world’s most advanced missile defense technology, from command systems to directed energy weapons, advanced munitions and powerful sensors.\r\n\r\nNorthrop Gruman has a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales indicates year-over-year growth of 5.4%.\r\n\r\nGeneral Dynamics Corporation GD is a manufacturer and integrator of land solutions including wheeled and tracked combat vehicles, weapon systems and munitions.\r\n\r\nGeneral Dynamics has a long-term earnings growth rate of 12.6%. The consensus estimate for GD’s 2024 sales indicates year-over-year growth of 13.5%.\n\nStory continues\n\nLMT’s Stock Price Movement\n\nShares of LMT have gained 21.4% in the past three months, compared with the industry’s 5.6% growth. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLMT’s Zacks Rank\n\nLMT currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nGeneral Dynamics Corporation (GD) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-raytheon-secure-1-3-162700684.html",
        "symbols": [
            "0IUC.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "GD.MX",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.043,
            "neu": 0.764,
            "pos": 0.193
        }
    },
    {
        "date": "2024-08-30T14:19:24+00:00",
        "title": "Lockheed, Raytheon Venture Lands $1.3 Billion Missile Contract",
        "content": "The Javelin Joint Venture (JJV) is a partnership between Raytheon and Lockheed Martin responsible for making some 50,000 Javelin missiles and more than 12,000 reusable Command Launch Units.\n\nYesterday, the U.S. Army awarded JJV a $1.3 billion contract for Javelin missiles and associated equipment and services. The deal is the largest single-year Javelin production contract to date, and the first follow-on award that is a part of an indefinite-delivery, indefinite-quantity (IDIQ) production contract initially awarded in May 2023.\n\nMost Read on IEN:\n\n2 Former Union Presidents Among 7 Indicted in Boilermaker Scheme Boeing Workers Angry as NASA Switches to SpaceX Lax FAA Oversight Blamed for Deadly Military Helicopter Crash $3M Hypercar Prototype Crashes During Test\n\nThe contract will procure Javelin weapon systems and production support for the U.S. Army. Last year, the JJV started ramping up production to increase Javelin All Up Round (AUR) production to 3,960 per year by late 2026.\n\nWith more than 25 international customers worldwide, the contract supports Javelin’s increased global demand, including new international customer Kosovo. The contract also includes more than 4,000 Javelins to replenish rounds sent to Ukraine.\n\nClick here to subscribe to our daily newsletter featuring breaking manufacturing industry news.\n\nView comments",
        "link": "https://finance.yahoo.com/news/lockheed-raytheon-venture-lands-1-141924120.html",
        "symbols": [
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.791,
            "neg": 0.059,
            "neu": 0.844,
            "pos": 0.096
        }
    }
]