[
    {
        "date": "2024-07-16T17:02:03+00:00",
        "title": "3 Defense Stocks to Sell if Trump Wins in November",
        "content": "Following the June 27 presidential debate, the leader of Russia, Vladimir Putin, openly stated how seriously he takes former President Donald Trump’s commitment to ending the war in Ukraine. With Trump vocal about the importance of ending America’s wars, it’s likely the defense industry will take a hit following the closure of Europe’s biggest war in almost 80 years. As a result, it’s highly likely that there will be several defense stocks to sell to maximize profits now from medium-term holdings.\n\nThis isn’t because these companies are financially insolvent or no longer relevant during a Trump presidency, but rather because they are not as heavily funded by the government as they are under the current Biden administration. As such, investors may want to prepare for the eventuality that the bull run the defense industry stocks had in 2022 and 2023 will likely come to an end should Trump and his foreign policies prevail in November.\n\nRTX (RTX) A German army mobile Raytheon (RTX) MIM-104 Patriot surface-to-air missile (SAM) system on display during the Laage airbase open house.\n\nSource: VanderWolf Images / Shutterstock.com\n\nOne of the defense stocks to sell with the most confidence from institutional investors, RTX (NYSE:RTX) has benefited greatly from the war in the Middle East. Today the company operates as a conglomerate of three major components, Raytheon Technologies, Collins Aerospace, and Pratt & Whitney. This results in a defense corporation whose revenue incomes are partially exposed to commercial market trends, but buffered by defense spending. Yet two major problems could arise from a Trump presidency.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nFirstly, Congress might want to increase funding for Ukraine, but Trump can veto the bills. Pair this with Republican lawmakers who have been more skeptical of foreign aid compared to Democrats, and RTX could lose big. That’s because a spending cut in Ukraine could impact RTX’s bottom line, as they recently secured a $282 million contract to supply air defense systems to the country.\n\nSecondly, a potential re-election of Donald Trump could pose a challenge. Trump has publicly advocated for ending the wars in Israel and Ukraine. This stance could threaten RTX’s $1.7 billion program to provide Patriot missiles to both NATO and Israel. Thus, it’s clear that a change in government policy could cut deep into RTX’s booked revenues and impact future performance.\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) Space Systems sign in Sunnyvale, California.\n\nSource: Ken Wolter / Shutterstock.com\n\nDespite being the biggest name in the modern aerospace industry, Lockheed Martin’s (NYSE:LMT) outlook after the 2024 election could decrease significantly. Despite its recent contract wins in the satellite sector, its contracts to supply Javelin missiles and F-35s could be at risk of cuts to NATO funding and military acquisitions.\n\nStory continues\n\nMoreover, Trump has widely advocated for spending cuts on the grossly overbudget F-35 program. In fact, seven years ago, the former president tweeted how billions of dollars need to be saved on out-of-control programs like the F-35. This slashed LMT’s stock value by $4 billion in the days following his tweet.\n\nThis kind of rhetoric from Trump helps underscore his commitment to better managing taxpayer money, which in turn means less financial flexibility for contractors like LMT. Thus, should the former president return to office, he could enact sweeping measures to reign in government spending on the admittedly over-engineered fighter jet.\n\nGeneral Dynamics (GD) image of General Dynamics (GD) website, representing dividend stocks\n\nSource: Casimiro PT / Shutterstock.com\n\nAs the primary producer of the M1 Abrams tank, which recently saw action in Ukraine, General Dynamics (NYSE:GD) stands to lose a significant source of revenue potential in the event of peace in Eastern Europe. Considering that Trump openly intends to end this war, the potential resupply revenue that would come from expended tanks and other military materials produced by General Dynamics could come to a quick close.\n\nMoreover, while the company is very broadly diversified across several different defense sectors from aviation to maritime to ground systems, the Trump administration may curtail some spending on the programs that General Dynamics relies on beyond the M1 tank program.\n\nAs a result, investors may want to consider taking profits on General Dynamics’ strong run over the last few years before it corrects in the face of a more conservative administration on the side of foreign policy.\n\nOn the date of publication, Viktor Zarev did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or\r\nindirectly) any positions in the securities mentioned in this article.\n\nViktor Zarev is a scientist, researcher, and writer specializing in explaining the complex world of technology stocks through dedication to accuracy and understanding.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post 3 Defense Stocks to Sell if Trump Wins in November appeared first on InvestorPlace.",
        "link": "https://finance.yahoo.com/news/3-defense-stocks-sell-trump-170203881.html",
        "symbols": [
            "0IUC.LSE",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "LMT.US",
            "LOM.DU",
            "LOM.MU",
            "LOM.STU",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.063,
            "neu": 0.812,
            "pos": 0.126
        }
    },
    {
        "date": "2024-07-16T07:32:59+00:00",
        "title": "Defense Contractors Stocks Q1 Results: Benchmarking Lockheed Martin (NYSE:LMT)",
        "content": "Defense Contractors Stocks Q1 Results: Benchmarking Lockheed Martin (NYSE:LMT)\n\nAs the Q1 earnings season comes to a close, it’s time to take stock of this quarter's best and worst performers in the defense contractors industry, including Lockheed Martin (NYSE:LMT) and its peers.\n\nDefense contractors typically require technical expertise and government clearance. Companies in this sector can also enjoy long-term contracts with government bodies, leading to more predictable revenues. Combined, these factors create high barriers to entry and can lead to limited competition. Lately, geopolitical tensions–whether it be Russia’s invasion of Ukraine or China’s aggression towards Taiwan–highlight the need for defense spending. On the other hand, demand for these products can ebb and flow with defense budgets and even who is president, as different administrations can have vastly different ideas of how to allocate federal funds.\n\nThe 13 defense contractors stocks we track reported a strong Q1; on average, revenues beat analyst consensus estimates by 3.5%. while next quarter's revenue guidance was 0.7% above consensus. Stocks--especially those trading at higher multiples--had a strong end of 2023, but 2024 has seen periods of volatility. Mixed signals about inflation have led to uncertainty around rate cuts, and defense contractors stocks have held roughly steady amidst all this, with share prices up 1.7% on average since the previous earnings results.\n\nLockheed Martin (NYSE:LMT)\n\nHeadquartered in Maryland, Famous for the F-35 aircraft, Lockheed Martin (NYSE:LMT) specializes in defense, space, homeland security, and information technology products.\n\nLockheed Martin reported revenues of $17.2 billion, up 13.7% year on year, exceeding analysts' expectations by 7.5%. Overall, it was a stunning quarter for the company with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates.\n\n\"Our strong start to 2024 demonstrates our continued success designing, developing and delivering 21st Century Security solutions in support of integrated deterrence for customers around the world. These first quarter results reinforce our confidence in our ability to achieve the full year financial expectations we set in January,\" said Lockheed Martin Chairman, President and CEO Jim Taiclet. Lockheed Martin Total Revenue\n\nThe stock is flat since reporting and currently trades at $463.88.\n\nIs now the time to buy Lockheed Martin? Access our full analysis of the earnings results here, it's free.\n\nBest Q1: Northrop Grumman (NYSE:NOC)\n\nResponsible for the development of the first stealth bomber, Northrop Grumman (NYSE:NOC) specializes in providing aerospace, defense, and security solutions for various industry applications.\n\nStory continues\n\nNorthrop Grumman reported revenues of $10.13 billion, up 8.9% year on year, outperforming analysts' expectations by 3.8%. It was a stunning quarter for the company with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates. Northrop Grumman Total Revenue\n\nAlthough it had a great quarter compared its peers, the market seems unhappy with the results as the stock is down 9% since reporting. It currently trades at $431.92.\n\nIs now the time to buy Northrop Grumman? Access our full analysis of the earnings results here, it's free.\n\nWeakest Q1: Mercury Systems (NASDAQ:MRCY)\n\nFounded in 1981, Mercury Systems (NASDAQ:MRCY) specializes in providing processing subsystems and components for primarily defense applications.\n\nMercury Systems reported revenues of $208.3 million, down 21% year on year, falling short of analysts' expectations by 2.9%. It was a weak quarter for the company with a miss of analysts' earnings and organic revenue estimates.\n\nMercury Systems had the weakest performance against analyst estimates and slowest revenue growth in the group. Interestingly, the stock is up 11.4% since the results and currently trades at $32.41.\n\nRead our full analysis of Mercury Systems's results here.\n\nLeidos (NYSE:LDOS)\n\nFormed through the split of IT services company SAIC, Leidos (NYSE:LDOS) offers technology and engineering solutions such as military training systems for the defense, civil, and health markets.\n\nLeidos reported revenues of $3.98 billion, up 7.5% year on year, surpassing analysts' expectations by 4.1%. Taking a step back, it was a very strong quarter for the company with an impressive beat of analysts' earnings estimates.\n\nThe stock is up 13.4% since reporting and currently trades at $149.30.\n\nRead our full, actionable report on Leidos here, it's free.\n\nRTX (NYSE:RTX)\n\nOriginally focused on refrigeration technology, Raytheon (NSYE:RTX) provides a a variety of products and services to the aerospace and defense industries.\n\nRTX reported revenues of $19.31 billion, up 12.1% year on year, surpassing analysts' expectations by 4.9%. Revenue aside, it was a stunning quarter for the company with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates.\n\nThe stock is flat since reporting and currently trades at $101.72.\n\nRead our full, actionable report on RTX here, it's free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/defense-contractors-stocks-q1-results-073259050.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "LDOS.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "MRCY.US",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.037,
            "neu": 0.787,
            "pos": 0.176
        }
    },
    {
        "date": "2024-07-16T00:00:00+00:00",
        "title": "3 Defense Stocks to Sell if Trump Wins in November",
        "content": "Investors should keep an eye out for these three defense stocks to sell before a potential election induced dip.",
        "link": "https://investorplace.com/2024/07/3-defense-stocks-to-sell-if-trump-wins-in-november/",
        "symbols": [
            "GD.US",
            "LMT.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.128,
            "neg": 0,
            "neu": 0.919,
            "pos": 0.081
        }
    }
]