[
    {
        "date": "2024-07-11T23:26:51+00:00",
        "title": "Factbox-NATO summit highlights defense deals for RTX, Boeing and others",
        "content": "WASHINGTON (Reuters) - The NATO summit in Washington showcased a series of significant deals for top U.S. defense companies and others, including RTX, Lockheed Martin, Boeing, Norway's Kongsberg Defense and Sweden's SAAB.\n\nHere are some of the weapons procurements that were highlighted, many of which have been in development for months, if not years. Many date to before the summit, with the exception of the Stinger contract which was first publicly announced at the summit.\n\nHIGHLIGHTED DEALS\n\n• A $680 million contract for 940 Stinger missiles made by the Raytheon unit of RTX. Shoulder-fired Stingers have been in hot demand in Ukraine, where they have successfully stopped Russian assaults from the air. Neighboring European countries have sought the weapon, fearing they may also need to beat back Russian forces.\n\n• Patriot GEM-T missiles, made by COMLOG, a joint venture between RTX's Raytheon and MBDA valued at $5.5 billion. NATO in January said its procurement arm would support a group of member countries, including Germany, the Netherlands, Romania and Spain, with a contract to buy up to 1,000 Patriot air defense missiles.\n\n• 155 mm artillery shell components, made by various companies including General Dynamics, valued at $365 million, have been ordered. The most pressing need for Ukraine two years after Russia's full-scale invasion is artillery ammunition, much of which has been supplied by the U.S. and other NATO members.\n\n• An extension program for NATO's AWACS airborne radar for $1.2 billion that is being built by Boeing, Italy's Leonardo, Spain's Indra, Airbus, Thales, Jacobs, and Kongsberg.\n\nHIGHLIGHTED CO-PRODUCTION AGREEMENTS\n\n• Norway's Nammo and RTX's Raytheon business unit agreed to partner to build rocket motors. These engines have become a hot commodity to propel a wide range of rockets and missiles in Ukraine and for future weaponry across NATO.\n\n• The Ground Launched Small-Diameter Bomb (GLSDB) produced by SAAB and Boeing has been used successfully in Ukraine.\n\n• Portions of interceptors for Lockheed Martin's Patriot missile defense system will be produced by Poland's Wojskowe Zakłady Elektroniczne. The United States this week also announced a second $2 billion foreign military financing direct loan deal with Poland as part of a major modernization program that will include buying U.S. defense equipment.\n\n• Kongsberg and RTX's Raytheon business unit are working to improve the National Advanced Surface-to-Air Missile System, also called NASAMs. Originally announced in October 2023, NASAMs have become an important part of missile defense in Ukraine.\n\n(Reporting by Mike Stone in Washington; Editing by Jamie Freed)\n\nView comments",
        "link": "https://finance.yahoo.com/news/factbox-nato-summit-highlights-defense-232651219.html",
        "symbols": [
            "0BOE.LSE",
            "5UR.F",
            "5UR.XETRA",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.95,
            "neg": 0.047,
            "neu": 0.85,
            "pos": 0.103
        }
    },
    {
        "date": "2024-07-11T13:00:00+00:00",
        "title": "RTX's Raytheon awarded $1.2 billion contract to provide additional Patriot air and missile defense systems to Germany",
        "content": "This marks the second Patriot order for Germany in 2024\n\nANDOVER, Mass., July 11, 2024 /PRNewswire/ -- Raytheon, an RTX (NYSE: RTX) business, was awarded a $1.2 billion contract to supply Germany with additional Patriot® air and missile defense systems.\n\nThese systems will augment Germany's existing air defense infrastructure with additional Patriot major end items. The scope of the contract includes the most current Patriot Configuration 3+ radars, launchers, command and control stations, associated spares, and support.\n\n\"Patriot remains the tried-and-true stalwart of air and missile defense, relied upon by our global customers to deter aggression and defend their interests,\" said Tom Laliberty, president of Land and Air Defense Systems at Raytheon. \"With each additional Patriot system, Germany is enhancing its own air defenses and strengthening NATO's defense posture.\"\n\nPatriot is the only combat-proven ground-based air and missile defense capability available in the world to defeat advanced long-range cruise missiles, tactical ballistic missiles, and the full spectrum of air-breathing threats. Patriot is the foundation of air defense for 19 countries, including Germany, the U.S. and Ukraine, and it continues to demonstrate its effectiveness against the most advanced and complex threats.\n\nAbout Raytheon Raytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-raytheon-awarded-1-2-billion-contract-to-provide-additional-patriot-air-and-missile-defense-systems-to-germany-302194503.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-raytheon-awarded-1-2-130000584.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.98,
            "neg": 0.042,
            "neu": 0.809,
            "pos": 0.15
        }
    },
    {
        "date": "2024-07-11T11:23:22+00:00",
        "title": "Defense Contractors Stocks Q1 Earnings: Northrop Grumman (NYSE:NOC) Best of the Bunch",
        "content": "Defense Contractors Stocks Q1 Earnings: Northrop Grumman (NYSE:NOC) Best of the Bunch\n\nLooking back on defense contractors stocks' Q1 earnings, we examine this quarter's best and worst performers, including Northrop Grumman (NYSE:NOC) and its peers.\n\nDefense contractors typically require technical expertise and government clearance. Companies in this sector can also enjoy long-term contracts with government bodies, leading to more predictable revenues. Combined, these factors create high barriers to entry and can lead to limited competition. Lately, geopolitical tensions–whether it be Russia’s invasion of Ukraine or China’s aggression towards Taiwan–highlight the need for defense spending. On the other hand, demand for these products can ebb and flow with defense budgets and even who is president, as different administrations can have vastly different ideas of how to allocate federal funds.\n\nThe 13 defense contractors stocks we track reported a strong Q1; on average, revenues beat analyst consensus estimates by 3.5%. while next quarter's revenue guidance was 0.7% above consensus. Valuation multiples for many growth stocks have not yet reverted to their early 2021 highs, but the market was optimistic at the end of 2023 due to cooling inflation. The start of 2024 has been a different story as mixed signals have led to market volatility, and while some of the defense contractors stocks have fared somewhat better than others, they collectively declined, with share prices falling 1.2% on average since the previous earnings results.\n\nBest Q1: Northrop Grumman (NYSE:NOC)\n\nResponsible for the development of the first stealth bomber, Northrop Grumman (NYSE:NOC) specializes in providing aerospace, defense, and security solutions for various industry applications.\n\nNorthrop Grumman reported revenues of $10.13 billion, up 8.9% year on year, exceeding analysts' expectations by 3.8%. Overall, it was a stunning quarter for the company with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates. Northrop Grumman Total Revenue\n\nThe stock is down 9.6% since reporting and currently trades at $429.16.\n\nIs now the time to buy Northrop Grumman? Access our full analysis of the earnings results here, it's free.\n\nRTX (NYSE:RTX)\n\nOriginally focused on refrigeration technology, Raytheon (NSYE:RTX) provides a a variety of products and services to the aerospace and defense industries.\n\nRTX reported revenues of $19.31 billion, up 12.1% year on year, outperforming analysts' expectations by 4.9%. It was a stunning quarter for the company with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates.\n\nStory continues RTX Total Revenue\n\nThe stock is flat since reporting and currently trades at $100.65.\n\nIs now the time to buy RTX? Access our full analysis of the earnings results here, it's free.\n\nWeakest Q1: Mercury Systems (NASDAQ:MRCY)\n\nListed on the NASDAQ in 1998, Mercury Systems (NASDAQGS:MRCY) specializes in providing processing subsystems and components for defense applications.\n\nMercury Systems reported revenues of $208.3 million, down 21% year on year, falling short of analysts' expectations by 2.9%. It was a weak quarter for the company with a miss of analysts' earnings and organic revenue estimates.\n\nMercury Systems had the weakest performance against analyst estimates and slowest revenue growth in the group. Interestingly, the stock is up 1.6% since the results and currently trades at $29.57.\n\nRead our full analysis of Mercury Systems's results here.\n\nICF (NASDAQ:ICFI)\n\nOriginally founded as Inner City Fund, ICF International (NASDAQ:ICFI) delivers consulting and technology services in health, environment, and infrastructure.\n\nICF reported revenues of $494.4 million, up 2.3% year on year, surpassing analysts' expectations by 1.3%. Looking more broadly, it was a strong quarter for the company with an impressive beat of analysts' earnings estimates.\n\nThe stock is down 10% since reporting and currently trades at $129.47.\n\nRead our full, actionable report on ICF here, it's free.\n\nLockheed Martin (NYSE:LMT)\n\nResponsible for renowned military systems like the F-35 fighter jet, Lockheed Martin Lockheed Martin (NYSE:LMT) specializes in defense, space, intelligence, homeland security, and information technology solutions.\n\nLockheed Martin reported revenues of $17.2 billion, up 13.7% year on year, surpassing analysts' expectations by 7.5%. Looking more broadly, it was a stunning quarter for the company with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates.\n\nThe stock is flat since reporting and currently trades at $460.82.\n\nRead our full, actionable report on Lockheed Martin here, it's free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/defense-contractors-stocks-q1-earnings-112322647.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "G6V.BE",
            "G6V.F",
            "G6V.STU",
            "ICFI.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "MCY.F",
            "MCY.MU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.032,
            "neu": 0.793,
            "pos": 0.175
        }
    },
    {
        "date": "2024-07-11T11:00:00+00:00",
        "title": "The 7 Most Undervalued Dividend Stocks to Buy in July 2024",
        "content": "Dividend stocks have long been investor favorites. Not only do dividends provide a reliable stream of income but they also increase a portfolio’s returns over time. They get even more exciting if they’re undervalued dividend stocks.\n\nSince 1930, dividend stocks outperformed all other classes of stocks. The Hartford Funds found that over the last 95 years, stocks on the S&P 500 that initiated and raised their dividends have never had a losing decade. Through world wars and global pandemics, income-generating stocks were the best investments. No other stock can say the same.\n\nAnd it stands to reason. Dividend stocks to buy are successful businesses, and having gone through numerous business and economic cycles, have come through the trials intact. With capable management and a conservative outlook, they steered their companies well and shared their success — and profits — with shareholders.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nBelow are three undervalued dividend stocks to buy in July. Despite the bull market and regardless of their performance, they now represent some of the best investments available.\n\nFord (F) Ford dealership sign against a blue sky.\n\nSource: D K Grove / Shutterstock.com\n\nEveryone focuses on Tesla (NASDAQ:TSLA) when it comes to electric vehicles, but Ford (NYSE:F) is the sleeper play in the industry. Second-quarter U.S. sales inched up 0.8% and are 3.6% higher over the first half of 2024, but virtually all of the growth came from hybrid vehicles and EVs.\n\nHybrid sales surged 55.6% in the quarter, a record 53,822 vehicles, powered by the light-duty Maverick. The model accounts for almost 44% of total hybrid volume for the first six months of the year. Fully 59% of all Maverick buyers are considered “conquest” customers, or those who were considering buying other brands. They are trading in their compact cars and crossovers in favor of the truck’s flexibility and adaptability.\n\nFord president and CEO Jim Farley told analysts earlier this year, “It’s one of our fastest-growing vehicles.” Sales are growing so fast Farley thinks Ford may run into a supply problem.\n\nYet F-150 hybrid pickups are also driving off the lots at a brisk pace with sales up 38% in the second quarter. The Escape was also rising 35% for the period.\n\nHaving been burned by its all-in bet on battery EVs, Ford quickly pivoted to hybrids and is reaping the benefits. Ford stock is up 7% in 2024 but trades at less than 7 times next year’s earnings. With its dividend yielding an attractive 5.3% annually, the automaker is one of the undervalued dividend stocks to buy in July.\n\nStory continues\n\nBenchmark Electronics (BHE) a machine manufactures semiconductor chips in a factory setting. AI Semiconductor Stocks\n\nSource: Shutterstock\n\nSmall-cap powerhouse Benchmark Electronics (NYSE:BHE) is on a roll this year, up 41% and stands 51% higher over the last 12 months. The semiconductor capital equipment manufacturer is an under-the-radar play on artificial intelligence. It provides product design, engineering, technology and manufacturing services for original equipment manufacturers (OEMs), and also serves the aerospace, defense and medical industries.\n\nThe proliferation of AI across the semiconductor industry but also throughout the other markets it serves, created a sales explosion for Benchmark. Semiconductor sales, its largest market, enjoyed a 12% increase in revenue but was dwarfed by a 35% surge in aerospace sales. Adjusted profits grew 8% to 55 cents per share.\n\nAlthough it initiated its first quarterly dividend in 2018, at 15 cents per share, it is slowly increasing the payout and its starting yield is a respectable 1.7% annually. It sports a free cash flow (FCF) payout ratio of just 24%, suggesting there is sufficient room for further growth in the future.\n\nUniversal (UVV) image of hands holding handful of processed tobacco\n\nSource: Shutterstock\n\nAnother hidden gem is Universal (NYSE:UVV), the world’s largest supplier of tobacco leaf. It counts as customers all the major cigarette manufacturers including Altria (NYSE:MO), British American Tobacco (NYSE:BTI) and Philip Morris International (NYSE:PM) but also supplies China Tobacco International, the world’s largest cigarette maker.\n\nThat is key to Universal’s future growth trajectory because although smoking is on a secular decline in the U.S., it continues to grow in China. Statista estimates the market there will reach “a staggering $282.9 billion” this year and continue growing at 1.6% annually through 2029.\n\nUniversal has a 54-year history of raising its dividend, making it a Dividend King. It has increased the payout at a near-5% compounded annual growth rate (CAGR) for the past decade and the dividend yields a juicy 6.8% annually.\n\nYet recognizing the declining industry here at home, Universal is diversifying its business. It moved into the plant-based ingredients and food products business, and though the segment is still small, it is enjoying expanding opportunities. President and CEO George Freeman said Universal “entered several new partnerships to supply innovative products that capitalize on our newly developed capabilities and portfolio across our three ingredients companies.”\n\nCardinal Health (CAH) Cardinal Health (CAH) sign with bushes in front of it\n\nSource: Shutterstock\n\nMedical supplies and drug distributor Cardinal Health (NYSE:CAH) is an industry behemoth, though just the third largest supplier. It had about $190 billion in U.S. drug sales last year, fully one-quarter of the total market. Along with Cencora (NYSE:COR) and McKesson (NYSE:MCK), the trio supply 90% of the market.\n\nCardinal serves nearly 90% of all U.S. hospitals, more than 60,000 U.S. pharmacies and over 10,000 specialty physician offices and clinics. It also provides more than 3.4 million patients with more than 46,000 home healthcare products.\n\nWhile inflation and supply chain constraints hurt segment sales and profits in fiscal 2023, inflation has eased since then and the Federal Reserve could begin cutting interest rates before the end of the year. So although it will face similar headwinds for a while yet, they should decrease going forward. Beyond that, Cardinal should be able to raise prices and benefit from an improving economy.\n\nCardinal also pays a dividend that it has increased for 27 consecutive years, making it a Dividend Aristocrat. The payout yields 2.1% a year.\n\nEnterprise Products Partners (EPD) A magnifying glass zooms in on the website of Enterprise Product Partners (EPD)\n\nSource: Casimiro PT / Shutterstock.com\n\nOil and gas industry middleman Enterprise Products Partners (NYSE:EPD) is admittedly not a stock for everyone. Although it has a very attractive business model that ensures steady revenue flows, its organization as a master limited partnership (MLP) complicates an investment.\n\nMLPs are an investment class holding immense long-term income and profit potential but there are complex tax issues investors should consider before buying in.  Because MLPs are required by law to distribute 90% or more of their profits to investors as dividends, they introduce more complicated tax considerations. But if it is an investment you can make, Enterprise Products Partners is one to consider. Those dividends yield a very healthy 7.3%.\n\nThe storage and pipeline transportation owner makes money no matter which way the oil and gas markets go. Operating on long-term fixed contracts, Enterprise Products Partners gets paid whether its customers take the product or not.\n\nWith oil and gas having long-term tailwinds behind it, Enterprise Products is among the undervalued dividend stocks to buy today.\n\nRTX (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nThe second-largest defense contractor is RTX (NYSE:RTX), formerly known as Raytheon but it changed its name after merging with United Technologies. It manufactures numerous defense systems, though missile systems are the workhorse of its business.\n\nRTX produces the Patriot missile system, Stinger and Javelin missiles, high-speed, anti-radiation missiles (HARMS) and national surface-to-air missile systems (NASAMS). It ended 2023 with a record backlog of orders totaling $196 billion. That grew to $202 billion at the end of the first quarter.\n\nThe war in Ukraine fuels a lot of the demand for RTX weapons systems. During the quarter it booked $282 million for NASAMS for Ukraine but also booked $1.6 billion for Patriot systems for Germany, $818 million for Patriot-guided enhance missiles (GEM-T) for NATO and another $874 million for various international GEM-T orders.\n\nRTX pays a dividend of $2.46 that yields 2.6% annually. It has paid a dividend every year since 1936 and has raised it for 30 consecutive years, so it should be considered among undervalued dividend stocks.\n\nToyota Motor (TM) Toyota motor corporation logo on dealership building\n\nSource: josefkubes / Shutterstock.com\n\nComing full circle, Toyota Motor (NYSE:TM) is the next dividend stock to buy as it has become the premier EV manufacturer. Although Tesla may sell more EVs than Toyota, the Japanese automaker correctly read the market well before anyone else and went all-in on the hybrid market. It is the best electric vehicle manufacturer today without exception.\n\nToyota saw a dramatic 20% surge in first-quarter sales volume. For the first half of 2024, EV sales took off even more, surging 68% and representing over 38% of total sales. It sold more than 454,000 electrified vehicles in the first six months of the year (it does make BEVs too). Overall, Toyota remains the world’s biggest automobile manufacturer. The carmaker also noted its Lexus brand recorded its best-ever first half in its 35-year history.\n\nDespite Toyota stock being up 12% year-to-date and 25% for the last 12 months, shares trade at just 8 times trailing earnings, 9 times estimates and at a fraction of its sales. Wall Street expects earnings to maintain their strong 16% CAGR for the next five years. Its dividend also yields an attractive 2.7% a year making Toyota the top undervalueddividend stock to buy in July.\n\nOn the date of publication, Rich Duprey held a LONG position in MO, CAH and RTX stock. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or\r\nindirectly) any positions in the securities mentioned in this article.\n\nRich Duprey has written about stocks and investing for the past 20 years. His articles have appeared on Nasdaq.com, The Motley Fool, and Yahoo! Finance, and he has been referenced by U.S. and international publications, including MarketWatch, Financial Times, Forbes, Fast Company, USA Today, Milwaukee Journal Sentinel, Cheddar News, The Boston Globe, L’Express, and numerous other news outlets.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post The 7 Most Undervalued Dividend Stocks to Buy in July 2024 appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/7-most-undervalued-dividend-stocks-110000705.html",
        "symbols": [
            "0HTG.LSE",
            "0S23.LSE",
            "5UR.F",
            "5UR.XETRA",
            "7203.TSE",
            "BHE.US",
            "BTI.US",
            "CAH.US",
            "CLH.BE",
            "CLH.DU",
            "CLH.F",
            "CLH.MU",
            "CLH.STU",
            "COR.US",
            "EPD.US",
            "F.MX",
            "F.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.02,
            "neu": 0.859,
            "pos": 0.121
        }
    },
    {
        "date": "2024-07-11T00:00:00+00:00",
        "title": "The 7 Most Undervalued Dividend Stocks to Buy in July 2024",
        "content": "For nearly 100 years income stocks have outperformed the market and these three undervalued dividend stocks are your best buys this month.",
        "link": "https://investorplace.com/2024/07/the-7-most-undervalued-dividend-stocks-to-buy-in-july-2024/",
        "symbols": [
            "CAH.US",
            "EPD.US",
            "F.US",
            "RTX.US",
            "TM.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.637,
            "neg": 0,
            "neu": 0.833,
            "pos": 0.167
        }
    }
]