[
    {
        "date": "2024-06-10T12:00:00+00:00",
        "title": "RTX awarded $677 million US Navy contract for SPY-6 family of radars",
        "content": "Production, progress continues for U.S. Navy's new radar\n\nANDOVER, Mass., June 10, 2024 /PRNewswire/ -- Raytheon, an RTX (NYSE: RTX) business, was awarded a $677 million contract to continue to produce AN/SPY-6(V) radars for the U.S. Navy. This is the third option exercised from the March 2022 hardware, production and sustainment contract that is valued up to $3 billion over five years. Arleigh Burke-class guided missile destroyer Jack H. Lucas (DDG 125), equipped with the SPY-6(V)1 radar, completed builder’s trials in Gulf of Mexico in April 2023. Photo credit: HII.\n\nUnder this contract, the U.S. Navy will receive seven additional radars, increasing the total amount of radars under contract for procurement to 38.\n\n\"SPY-6 provides the fleet with superior air surveillance, electronic warfare protection and enhanced detection abilities,\" said Barbara Borgonovi, president of Naval Power at Raytheon. \"This contract is a significant step forward in ensuring this technology is delivered to ships to improve the overall self-defense of the fleet.\"\n\nThe U.S. Navy is integrating SPY-6 into its surface fleet beginning with the USS Jack H. Lucas (DDG 125) that was commissioned in October 2023. The USS Richard M. McCool Jr. (LPD 29) is the second ship and the first to deploy the (V)2 variant. LPD 29 was delivered to the U.S. Navy April 11 following successful completion of builder's and acceptance trials in the Gulf of Mexico. The SPY-6(V)2 radar not only provides defense against missile threats but will also provide air traffic control capability.\n\nThe SPY-6 family of radars is the most tested, most advanced radar technology in production today. It is projected to be deployed on 65 U.S. Navy ships over the next 10 years to defend against air, surface, and ballistic threats.\n\nAbout Raytheon Raytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/rtx-awarded-677-million-us-navy-contract-for-spy-6-family-of-radars-302167484.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-awarded-677-million-us-120000140.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.99,
            "neg": 0.035,
            "neu": 0.835,
            "pos": 0.129
        }
    }
]