[
    {
        "date": "2024-08-15T17:00:16+00:00",
        "title": "While Tech Giants Tumble, Defense Titans Take Off: Who's Leading The Charge?",
        "content": "While Tech Giants Tumble, Defense Titans Take Off: Who's Leading The Charge?\n\nBenzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\n\nIn a month marked by global market turmoil, where leading tech giants like Alphabet Inc, Apple Inc, and Tesla Inc saw their valuations drop by a combined trillion dollars, the defense sector has shown resilience.\n\nStocks of three major companies—Lockheed Martin Corp (NYSE:LMT), RTX Corporation (NYSE:RTX), and Northrop Grumman Corp (NYSE NOC) have surged between 14% and 20% over the past month.\n\nAs the world grapples with escalating geopolitical tensions, these defense behemoths have not only weathered the storm but thrived, making them standout investments in a time of uncertainty.\n\nDon’t miss out on the next NVIDIA – you can invest in the future of AI for only $10. **This is a paid advertisement. Carefully consider the investment objectives, risks, charges and expenses of the Fundrise Innovation Fund before investing. This and other information can be found in the Fund's prospectus. Read them carefully before investing.\n\nLockheed Martin: Up 19.69%\n\nLockheed Martin, a cornerstone of the American aerospace and defense industry, has seen its stock rise by nearly 20% over the past month.\n\nThe company recently made headlines with the introduction of its Mako hypersonic missile, an \"affordable\" multi-mission weapon capable of flying at speeds exceeding Mach 5. This missile is being developed for the U.S. Air Force as well as international customers, highlighting Lockheed Martin's pivotal role in modern warfare.\n\nAdding to its recent achievements, Lockheed Martin delivered the first of five C-130J Super Hercules military transport aircraft to the Royal New Zealand Air Force. This delivery is part of a significant $902.3 million program aimed at replacing New Zealand's aging C-130H fleet, which has been in operation since the 1960s.\n\nThese advancements have not only strengthened Lockheed Martin’s market position but also fueled investor optimism, propelling its stock to new heights.\n\nRTX Corporation: Up 15.41%\n\nRTX Corporation, formerly known as Raytheon Technologies, has also been on an upward trajectory, with its stock climbing over 15% in the past month.\n\nThe company's recent $1.2 billion deal with Poland to produce Patriot air-defense battery components has further solidified its standing in the defense industry. This agreement, which involves the production of 48 Patriot M903 launch stations, is a significant boost for RTX, expanding its collaboration with the Polish defense sector and positioning it for future contracts that could extend through the end of the decade.\n\nStory continues\n\nThis deal comes at a time when Europe is increasingly focusing on bolstering its defense capabilities amid rising geopolitical tensions. For investors, RTX’s expanding role in European defense is a key factor driving its stock’s strong performance.\n\nDon’t Miss:\n\nThis city is the clear winner of Zillow's 2024 Home Value Forecast — No surprise as the number of millionaires there grew by 75% in the last decade. Institutional investors are increasingly turning to private credit for higher potential returns and lower volatility. You can copy their strategy by investing in your own private credit deals. With returns as high as 300%, it’s no wonder this asset is the investment choice of many billionaires. Uncover the secret.\n\nNorthrop Grumman: Up 13.92%\n\nNorthrop Grumman has seen its stock price increase by nearly 14% over the past month, driven by a series of strategic advancements.\n\nThe company successfully launched the Arctic Satellite Broadband Mission (ASBM) for Space Norway, a critical project aimed at extending broadband connectivity to the Arctic region. This launch, conducted from Vandenberg Space Force Base in California, underscores Northrop Grumman’s leadership in space-based defense technologies.\n\nAdditionally, Northrop Grumman is advancing its Cannon-Based Air Defense (CBAD) program, which aims to create a multi-layered anti-aircraft system. This system, designed to counter modern threats like cruise missiles and attack drones, highlights Northrop’s innovative approach to addressing the evolving needs of global defense.\n\nMoreover, the company’s collaboration with South Korea’s Genohco to support the KMCH program further cements its position as a key player in international defense.\n\nA Defensive Stronghold In A Volatile Market\n\nFor investors navigating the current market volatility, the defense sector has proven to be a stronghold.\n\nLockheed Martin, RTX Corporation, and Northrop Grumman have not only weathered the recent market crash but have thrived amid rising global tensions.\n\nTheir stock performance over the past month, coupled with their recent strategic advancements, suggests that these companies are well-positioned to continue delivering value to shareholders.\n\nAs the world continues to grapple with geopolitical instability, these defense stocks offer a beacon of stability and growth potential in an otherwise turbulent market.\n\nLooking For Higher-Yield Opportunities?\n\nThe current high-interest-rate environment has created an incredible opportunity for income-seeking investors to earn massive yields, but not through dividend stocks... Certain private market real estate investments are giving retail investors the opportunity to capitalize on these high-yield opportunities and Benzinga has identified some of the most attractive options for you to consider.\n\nFor instance, the Ascent Income Fund from EquityMultiple targets stable income from senior commercial real estate debt positions and has a historical distribution yield of 12.1% backed by real assets. With payment priority and flexible liquidity options, the Ascent Income Fund is a cornerstone investment vehicle for income-focused investors. First-time investors with EquityMultiple can now invest in the Ascent Income Fund with a reduced minimum of just $5,000. Benzinga Readers: Earn a 1% return boost on your first EquityMultiple investment when you sign up here (accredited investors only).\n\nDon't miss out on this opportunity to take advantage of high-yield investments while rates are high. Check out Benzinga's favorite high-yield offerings.\n\nThis article While Tech Giants Tumble, Defense Titans Take Off: Who's Leading The Charge? originally appeared on Benzinga.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/while-tech-giants-tumble-defense-170016129.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.054,
            "neu": 0.787,
            "pos": 0.159
        }
    },
    {
        "date": "2024-08-15T11:00:17+00:00",
        "title": "Institutional investors have a lot riding on RTX Corporation (NYSE:RTX) with 84% ownership",
        "content": "Key Insights\n\nGiven the large stake in the stock by institutions, RTX's stock price might be vulnerable to their trading decisions 50% of the business is held by the top 11 shareholders Insiders have been selling lately\n\nEvery investor in RTX Corporation (NYSE:RTX) should be aware of the most powerful shareholder groups. And the group that holds the biggest piece of the pie are institutions with 84% ownership. Put another way, the group faces the maximum upside potential (or downside risk).\n\nLast week’s 3.1% gain means that institutional investors were on the positive end of the spectrum even as the company has shown strong longer-term trends. The gains from last week would have further boosted the one-year return to shareholders which currently stand at 42%.\n\nLet's delve deeper into each type of owner of RTX, beginning with the chart below.\n\nSee our latest analysis for RTX  ownership-breakdown\n\nWhat Does The Institutional Ownership Tell Us About RTX?\n\nInstitutions typically measure themselves against a benchmark when reporting to their own investors, so they often become more enthusiastic about a stock once it's included in a major index. We would expect most companies to have some institutions on the register, especially if they are growing.\n\nAs you can see, institutional investors have a fair amount of stake in RTX. This implies the analysts working for those institutions have looked at the stock and they like it. But just like anyone else, they could be wrong. It is not uncommon to see a big share price drop if two large institutional investors try to sell out of a stock at the same time. So it is worth checking the past earnings trajectory of RTX, (below). Of course, keep in mind that there are other factors to consider, too. earnings-and-revenue-growth\n\nSince institutional investors own more than half the issued stock, the board will likely have to pay attention to their preferences. Hedge funds don't have many shares in RTX. Looking at our data, we can see that the largest shareholder is Capital Research and Management Company with 12% of shares outstanding. State Street Global Advisors, Inc. is the second largest shareholder owning 8.9% of common stock, and The Vanguard Group, Inc. holds about 8.7% of the company stock.\n\nLooking at the shareholder registry, we can see that 50% of the ownership is controlled by the top 11 shareholders, meaning that no single shareholder has a majority interest in the ownership.\n\nWhile studying institutional ownership for a company can add value to your research, it is also a good practice to research analyst recommendations to get a deeper understand of a stock's expected performance. There are plenty of analysts covering the stock, so it might be worth seeing what they are forecasting, too.\n\nStory continues\n\nInsider Ownership Of RTX\n\nWhile the precise definition of an insider can be subjective, almost everyone considers board members to be insiders. Management ultimately answers to the board. However, it is not uncommon for managers to be executive board members, especially if they are a founder or the CEO.\n\nI generally consider insider ownership to be a good thing. However, on some occasions it makes it more difficult for other shareholders to hold the board accountable for decisions.\n\nOur information suggests that RTX Corporation insiders own under 1% of the company. As it is a large company, we'd only expect insiders to own a small percentage of it. But it's worth noting that they own US$144m worth of shares. It is good to see board members owning shares, but it might be worth checking if those insiders have been buying.\n\nGeneral Public Ownership\n\nThe general public-- including retail investors -- own 16% stake in the company, and hence can't easily be ignored. This size of ownership, while considerable, may not be enough to change company policy if the decision is not in sync with other large shareholders.\n\nNext Steps:\n\nIt's always worth thinking about the different groups who own shares in a company. But to understand RTX better, we need to consider many other factors. Like risks, for instance. Every company has them, and we've spotted  4 warning signs for RTX  (of which 1 is potentially serious!) you should know about.\n\nIf you would prefer discover what analysts are predicting in terms of future growth, do not miss this freereport on analyst forecasts.\n\nNB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/institutional-investors-lot-riding-rtx-110017281.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.989,
            "neg": 0.026,
            "neu": 0.894,
            "pos": 0.08
        }
    },
    {
        "date": "2024-08-15T08:15:12+00:00",
        "title": "Reflecting On Defense Contractors Stocks’ Q2 Earnings: CACI (NYSE:CACI)",
        "content": "Reflecting On Defense Contractors Stocks’ Q2 Earnings: CACI (NYSE:CACI)\n\nAs the Q2 earnings season wraps, let’s dig into this quarter’s best and worst performers in the defense contractors industry, including CACI (NYSE:CACI) and its peers.\n\nDefense contractors typically require technical expertise and government clearance. Companies in this sector can also enjoy long-term contracts with government bodies, leading to more predictable revenues. Combined, these factors create high barriers to entry and can lead to limited competition. Lately, geopolitical tensions–whether it be Russia’s invasion of Ukraine or China’s aggression towards Taiwan–highlight the need for defense spending. On the other hand, demand for these products can ebb and flow with defense budgets and even who is president, as different administrations can have vastly different ideas of how to allocate federal funds.\n\nThe 14 defense contractors stocks we track reported a strong Q2. As a group, revenues beat analysts’ consensus estimates by 4.9% while next quarter’s revenue guidance was 6.7% below.\n\nValuation multiples for many growth stocks have not yet reverted to their early 2021 highs, but the market was optimistic at the end of 2023 due to cooling inflation. This year has been a different story as mixed inflation signals have led to market volatility. Thankfully, defense contractors stocks have been resilient with share prices up 6.3% on average since the latest earnings results.\n\nCACI (NYSE:CACI)\n\nFounded to commercialize SIMSCRIPT, CACI International (NYSE:CACI) offers defense, intelligence, and IT solutions to support national security and government transformation efforts.\n\nCACI reported revenues of $2.04 billion, up 19.7% year on year. This print exceeded analysts’ expectations by 5.5%. Overall, it was a very strong quarter for the company with an impressive beat of analysts’ backlog sales estimates and a decent beat of analysts’ earnings estimates.\n\n“CACI’s exceptional fiscal year 2024 financial performance is the result of the relentless execution of our strategy. Our results were strong across the board, including achieving organic growth in the mid-teens, and delivering on our margin and cash flow expectations,” said John Mengucci, CACI President and Chief Executive Officer. CACI Total Revenue\n\nInterestingly, the stock is up 3.5% since reporting and currently trades at $461.80.\n\nIs now the time to buy CACI? Access our full analysis of the earnings results here, it’s free.\n\nBest Q2: Leonardo DRS (NASDAQ:DRS)\n\nDeveloping submarine detection systems for the U.S. Navy, Leonardo DRS (NASDAQ:DRS) is a provider of defense systems, electronics, and military support services.\n\nStory continues\n\nLeonardo DRS reported revenues of $753 million, up 19.9% year on year, outperforming analysts’ expectations by 10.7%. It was an incredible quarter for the company with an impressive beat of analysts’ earnings estimates. Leonardo DRS Total Revenue\n\nLeonardo DRS achieved the biggest analyst estimates beat among its peers. Although it had a fine quarter compared its peers, the market seems unhappy with the results as the stock is down 1.6% since reporting. It currently trades at $27.75.\n\nIs now the time to buy Leonardo DRS? Access our full analysis of the earnings results here, it’s free.\n\nMercury Systems (NASDAQ:MRCY)\n\nFounded in 1981, Mercury Systems (NASDAQ:MRCY) specializes in providing processing subsystems and components for primarily defense applications.\n\nMercury Systems reported revenues of $248.6 million, down 1.8% year on year, exceeding analysts’ expectations by 7.8%. It was an incredible quarter for the company with an impressive beat of analysts’ organic revenue and earnings estimates.\n\nMercury Systems had the slowest revenue growth in the group. Interestingly, the stock is up 17.6% since the results and currently trades at $39.99.\n\nRead our full analysis of Mercury Systems’s results here.\n\nHuntington Ingalls (NYSE:HII)\n\nBuilding Nimitz-class aircraft carriers used in active service, Huntington Ingalls (NYSE:HII) develops marine vessels and their mission systems and maintenance services.\n\nHuntington Ingalls reported revenues of $2.98 billion, up 6.8% year on year, surpassing analysts’ expectations by 4.7%. More broadly, it was an incredible quarter for the company with an impressive beat of analysts’ earnings estimates.\n\nThe stock is down 4.7% since reporting and currently trades at $266.63.\n\nRead our full, actionable report on Huntington Ingalls here, it’s free.\n\nRTX (NYSE:RTX)\n\nOriginally focused on refrigeration technology, Raytheon (NSYE:RTX) provides a a variety of products and services to the aerospace and defense industries.\n\nRTX reported revenues of $19.72 billion, up 7.7% year on year, surpassing analysts’ expectations by 2.3%. Revenue aside, it was a very strong quarter for the company with an impressive beat of analysts’ organic revenue estimates and a decent beat of analysts’ earnings estimates.\n\nThe stock is up 12.4% since reporting and currently trades at $117.86.\n\nRead our full, actionable report on RTX here, it’s free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/reflecting-defense-contractors-stocks-q2-081512458.html",
        "symbols": [
            "0J76.LSE",
            "2VZ.F",
            "5UR.F",
            "5UR.XETRA",
            "CA8A.F",
            "CACI.US",
            "DRS.US",
            "HI4.F",
            "HI4.STU",
            "HII.US",
            "MCY.F",
            "MCY.MU",
            "MCY.STU",
            "MRCY.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.012,
            "neu": 0.81,
            "pos": 0.178
        }
    }
]