[
    {
        "date": "2024-10-02T17:00:19+00:00",
        "title": "RTX's Raytheon Secures DARPA Contract To Develop Ultra-Wide Bandgap Semiconductors: Details",
        "content": "RTX's Raytheon Secures DARPA Contract To Develop Ultra-Wide Bandgap Semiconductors: Details\n\nOn Wednesday, RTX Corporation (NYSE:RTX) said Raytheon has secured a three-year, two-phase contract from DARPA to develop foundational ultra-wide bandgap semiconductors.\n\nThese will be based on diamond and aluminum nitride technology, which revolutionizes semiconductor electronics by increasing power delivery and thermal management in sensors and other electronic applications.\n\nIn phase one of the contract, the Raytheon Advanced Technology team will develop diamond and aluminum nitride semiconductor films and integrate them into electronic devices.\n\nPhase two will focus on optimizing and advancing this technology for larger diameter wafers intended for sensor applications.\n\n“Raytheon has extensive proven experience developing similar materials such as Gallium Arsenide and Gallium Nitride for Department of Defense systems,” said Colin Whelan, president of Advanced Technology at Raytheon.\n\nAccording to Benzinga Pro, RTX stock has gained over 74% in the past year. Investors can gain exposure to the stock via iShares U.S. Aerospace & Defense ETF (BATS:ITA) and First Trust Exchange-Traded Fund First Trust Indxx Aerospace & Defense ETF (NYSE:MISL).\n\nAlso Read: RTX Wins $1.3B Contract For F135 Engine Upgrade: Details\n\nOn Tuesday, RTX said Raytheon received a $192 million contract from the U.S. Navy to develop the Next Generation Jammer Mid-Band Expansion, an upgrade to the current Next Generation Jammer Mid-Band system.\n\nIn a separate press release yesterday, RTX said its unit Pratt & Whitney celebrated the opening of its new 845,000-square-foot facility in Oklahoma City, Oklahoma, solidifying its position as the business’ largest military engines field location.\n\nThe $255 million investment will enable Pratt & Whitney to meet the growing demands of both U.S. and global defense customers for the F135, F117, TF33, F100 and F119 engines.\n\n“This expansion more than doubles our footprint in Oklahoma City, ensuring we have the capacity and agility to support increased workloads as military programs ramp up and new ones come online,” said Greg Treacy, vice president of Pratt & Whitney in Oklahoma City.\n\nPrice Action: RTX shares are trading lower by 0.10% to $124.26 on Wednesday.\n\nRead Next:\n\nOil Prices Spike, Energy Stocks Jump After Iran’s Missile Attack On Israel: What Investors Need To Know\n\nUNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily, plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets.\n\nGet the latest stock analysis from Benzinga?\n\nStory continues\n\nRTX (RTX): Free Stock Analysis Report\n\nThis article RTX's Raytheon Secures DARPA Contract To Develop Ultra-Wide Bandgap Semiconductors: Details originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-raytheon-secures-darpa-contract-170019920.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "MISL.US",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.012,
            "neu": 0.85,
            "pos": 0.139
        }
    },
    {
        "date": "2024-10-02T13:00:00+00:00",
        "title": "RTX to develop ultra-wide bandgap semiconductors for DARPA",
        "content": "New class of materials offer improved conductivity and thermal management properties\n\nANDOVER, Mass., Oct. 2, 2024 /PRNewswire/ -- Raytheon, an RTX (NYSE: RTX) business, has been awarded a three-year, two-phase contract from DARPA to develop foundational ultra-wide bandgap semiconductors, or UWBGS, based on diamond and aluminum nitride technology that revolutionize semiconductor electronics with increased power delivery and thermal management in sensors and other electronic applications.\n\nDuring phase one of the contract, the Raytheon Advanced Technology team will develop diamond and aluminum nitride semiconductor films and their integration onto electronic devices. Phase two will focus on optimizing and maturing the diamond and aluminum nitride technology onto larger diameter wafers for sensor applications.\n\n\"This is a significant step forward that will once again revolutionize semiconductor technology,\" said Colin Whelan, president of Advanced Technology at Raytheon. \"Raytheon has extensive proven experience developing similar materials such as Gallium Arsenide and Gallium Nitride for Department of Defense systems. By combining that pioneering history and our expertise in advanced microelectronics, we'll work to mature these materials towards future applications.\"\n\nThe unique material properties of UWBGS offer several advantages over traditional semiconductor technologies, enabling highly compact, ultra-high power radio frequency switches, limiters, and power amplifiers. Their high thermal conductivity also allows the ability to operate at higher temperatures and in more extreme environments.\n\nThe team's goal is to spearhead the development of these materials towards devices that are well suited for both existing and future radar and communication systems with extended capability and range, including cooperative sensing, electronic warfare, directed energy, and circuitry in high-speed weapon systems such as hypersonics.\n\nWork on this contract is being conducted at the company's foundry in Andover, Massachusetts.\n\nAbout Raytheon Raytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nStory continues\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtx-to-develop-ultra-wide-bandgap-semiconductors-for-darpa-302263228.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-develop-ultra-wide-bandgap-130000171.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.992,
            "neg": 0.021,
            "neu": 0.836,
            "pos": 0.143
        }
    }
]