[
    {
        "date": "2024-06-27T13:00:12+00:00",
        "title": "Insiders At RTX Sold US$4.2m In Stock, Alluding To Potential Weakness",
        "content": "Over the past year, many RTX Corporation (NYSE:RTX) insiders sold a significant stake in the company which may have piqued investors' interest. Knowing whether insiders are buying is usually more helpful when evaluating insider transactions, as insider selling can have various explanations. However, shareholders should take a deeper look if several insiders are selling stock over a specific time period.\n\nAlthough we don't think shareholders should simply follow insider transactions, we do think it is perfectly logical to keep tabs on what insiders are doing.\n\nCheck out our latest analysis for RTX\n\nRTX Insider Transactions Over The Last Year\n\nOver the last year, we can see that the biggest insider sale was by the President of Pratt & Whitney, Shane Eddy, for US$3.2m worth of shares, at about US$91.19 per share. That means that an insider was selling shares at slightly below the current price (US$101). We generally consider it a negative if insiders have been selling, especially if they did so below the current price, because it implies that they considered a lower price to be reasonable. While insider selling is not a positive sign, we can't be sure if it does mean insiders think the shares are fully valued, so it's only a weak sign. This single sale was 84% of Shane Eddy's stake.\n\nOver the last year we saw more insider selling of RTX shares, than buying. The chart below shows insider transactions (by companies and individuals) over the last year. If you click on the chart, you can see all the individual transactions, including the share price, individual, and the date! insider-trading-volume\n\nFor those who like to find hidden gems this freelist of small cap companies with recent insider purchasing, could be just the ticket.\n\nRTX Insiders Are Selling The Stock\n\nThe last quarter saw substantial insider selling of RTX shares. In total, Director Robert Ortberg sold US$1.0m worth of shares in that time, and we didn't record any purchases whatsoever. This may suggest that some insiders think that the shares are not cheap.\n\nInsider Ownership Of RTX\n\nMany investors like to check how much of a company is owned by insiders. I reckon it's a good sign if insiders own a significant number of shares in the company. RTX insiders own 0.1% of the company, currently worth about US$129m based on the recent share price. I like to see this level of insider ownership, because it increases the chances that management are thinking about the best interests of shareholders.\n\nSo What Do The RTX Insider Transactions Indicate?\n\nAn insider hasn't bought RTX stock in the last three months, but there was some selling. Zooming out, the longer term picture doesn't give us much comfort. The company boasts high insider ownership, but we're a little hesitant, given the history of share sales. While it's good to be aware of what's going on with the insider's ownership and transactions, we make sure to also consider what risks are facing a stock before making any investment decision. While conducting our analysis, we found that RTX has 4 warning signs and it would be unwise to ignore these.\n\nStory continues\n\nBut note: RTX may not be the best stock to buy. So take a peek at this freelist of interesting companies with high ROE and low debt.\n\nFor the purposes of this article, insiders are those individuals who report their transactions to the relevant regulatory body. We currently account for open market transactions and private dispositions of direct interests only, but not derivative transactions or indirect interests.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/insiders-rtx-sold-us-4-130012240.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.982,
            "neg": 0.042,
            "neu": 0.858,
            "pos": 0.1
        }
    }
]