[
    {
        "date": "2024-09-15T11:00:34+00:00",
        "title": "With 83% ownership of the shares, RTX Corporation (NYSE:RTX) is heavily dominated by institutional owners",
        "content": "Key Insights\n\nInstitutions' substantial holdings in RTX implies that they have significant influence over the company's share price A total of 13 investors have a majority stake in the company with 51% ownership Recent sales by insiders\n\nTo get a sense of who is truly in control of RTX Corporation (NYSE:RTX), it is important to understand the ownership structure of the business. And the group that holds the biggest piece of the pie are institutions with 83% ownership. In other words, the group stands to gain the most (or lose the most) from their investment into the company.\n\nBecause institutional owners have a huge pool of resources and liquidity, their investing decisions tend to carry a great deal of weight, especially with individual investors. Therefore, a good portion of institutional money invested in the company is usually a huge vote of confidence on its future.\n\nLet's take a closer look to see what the different types of shareholders can tell us about RTX.\n\nCheck out our latest analysis for RTX  ownership-breakdown\n\nWhat Does The Institutional Ownership Tell Us About RTX?\n\nInstitutional investors commonly compare their own returns to the returns of a commonly followed index. So they generally do consider buying larger companies that are included in the relevant benchmark index.\n\nAs you can see, institutional investors have a fair amount of stake in RTX. This can indicate that the company has a certain degree of credibility in the investment community. However, it is best to be wary of relying on the supposed validation that comes with institutional investors. They too, get it wrong sometimes. When multiple institutions own a stock, there's always a risk that they are in a 'crowded trade'. When such a trade goes wrong, multiple parties may compete to sell stock fast. This risk is higher in a company without a history of growth. You can see RTX's historic earnings and revenue below, but keep in mind there's always more to the story. earnings-and-revenue-growth\n\nInvestors should note that institutions actually own more than half the company, so they can collectively wield significant power. Hedge funds don't have many shares in RTX. The company's largest shareholder is Capital Research and Management Company, with ownership of 12%. The second and third largest shareholders are The Vanguard Group, Inc. and State Street Global Advisors, Inc., with an equal amount of shares to their name at 8.7%.\n\nLooking at the shareholder registry, we can see that 51% of the ownership is controlled by the top 13 shareholders, meaning that no single shareholder has a majority interest in the ownership.\n\nStory continues\n\nResearching institutional ownership is a good way to gauge and filter a stock's expected performance. The same can be achieved by studying analyst sentiments. There are plenty of analysts covering the stock, so it might be worth seeing what they are forecasting, too.\n\nInsider Ownership Of RTX\n\nThe definition of an insider can differ slightly between different countries, but members of the board of directors always count. The company management answer to the board and the latter should represent the interests of shareholders. Notably, sometimes top-level managers are on the board themselves.\n\nI generally consider insider ownership to be a good thing. However, on some occasions it makes it more difficult for other shareholders to hold the board accountable for decisions.\n\nOur information suggests that RTX Corporation insiders own under 1% of the company. Being so large, we would not expect insiders to own a large proportion of the stock. Collectively, they own US$147m of stock. Arguably recent buying and selling is just as important to consider. You can  click here to see if insiders have been buying or selling.\n\nGeneral Public Ownership\n\nThe general public-- including retail investors -- own 16% stake in the company, and hence can't easily be ignored. While this group can't necessarily call the shots, it can certainly have a real influence on how the company is run.\n\nNext Steps:\n\nI find it very interesting to look at who exactly owns a company. But to truly gain insight, we need to consider other information, too. To that end, you should learn about the  4 warning signs  we've spotted with RTX (including 1 which is significant) .\n\nIf you would prefer discover what analysts are predicting in terms of future growth, do not miss this freereport on analyst forecasts.\n\nNB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/83-ownership-shares-rtx-corporation-110034252.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.032,
            "neu": 0.882,
            "pos": 0.086
        }
    }
]