[
    {
        "date": "2024-05-28T12:00:00+00:00",
        "title": "RTX invests in Spokane to fuel manufacturing growth",
        "content": "Collins Aerospace to expand carbon brake production\n\nSPOKANE, Wash., May 28, 2024 /PRNewswire/ -- Collins Aerospace, an RTX (NYSE: RTX) business has initiated a $200 million investment to expand manufacturing at the carbon brake production site in Spokane, Washington, over a multi-year period. Collins Aerospace’s Spokane, Washington site manufactures carbon brakes for commercial and military customers. (PRNewsfoto/RTX)\n\nCollins has plans to grow the site by more than 50 percent, adding 70,000 square feet of additional manufacturing space – including up to three new buildings and additional furnaces. This expansion will support increased production capacity to meet the growing demand for carbon brakes from commercial and military customers.\n\n\"Collins Aerospace is a key contributor to the Pacific Northwest aerospace manufacturing industry and plays a significant role in Spokane's economy and technological innovation,\" said Matt Maurer, vice president and general manager for Landing Systems at Collins Aerospace. \"This expansion will enhance both our manufacturing capacity and capabilities with the latest in process innovation and efficiencies while ensuring our workforce readiness to meet the growing global demand for our carbon brakes.\"\n\nThe site specializes in the production and manufacturing of braking systems with DURACARB® carbon disk technology, which provides a longer brake life and overall cost savings. Carbon brakes have superior durability and ability to withstand high temperatures.\n\n\"We are excited to see Collins select Washington state for this expansion of high-tech manufacturing,\" said Gov. Jay Inslee. \"These new jobs will add to a growing aerospace sector in Spokane County, and the state has committed to partnering on further efforts that ensure the county can offer companies a world-class aerospace workforce and positive business environment.\"\n\nAbout Collins Aerospace\r\nCollins Aerospace, an RTX business, is a leader in integrated and intelligent solutions for the global aerospace and defense industry. Our 80,000 employees are dedicated to delivering future-focused technologies to advance sustainable and connected aviation, passenger safety and comfort, mission success, space exploration, and more.\n\nAbout RTX\r\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/rtx-invests-in-spokane-to-fuel-manufacturing-growth-302150512.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-invests-spokane-fuel-manufacturing-120000336.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.012,
            "neu": 0.815,
            "pos": 0.173
        }
    },
    {
        "date": "2024-05-28T08:00:00+00:00",
        "title": "RTX's Collins Aerospace completes industry first retrofit of Iridium Certus satellite connectivity",
        "content": "Compact and light weight, the system is reliable, easy to install and cost-effective\n\nGENEVA, May 28, 2024 /PRNewswire/ -- Collins Aerospace, an RTX (NYSE: RTX) business has modified a Prince Aviation Cessna 525 Citation Jet with its IRT NX Satellite Communication (SATCOM) system, providing high-speed cabin connectivity through the Iridium Certus® 700 satellite service. EASA certification and design approval was obtained by Q.C.M. Design GmbH with Prince Aviation installing the hardware onto the aircraft, becoming the first customer to retrofit a business jet cabin with the Collins SATCOM solution.\n\nIridium's truly global network of satellites connect with Collins' advanced ARINCDirect℠ connectivity services, enabling speeds up to 704 kbps. The comprehensive solution provides users reliable, secure and cost-effective connectivity to browse the internet, make voice calls, text, access email and utilize social media applications.\n\n\"Today's business traveler expects to step on board their aircraft and continue to stay connected, productive and informed,\" said Nathan Voight, vice president and general manager, Business and Regional Avionics at Collins Aerospace. \"Our Iridium SATCOM solution can facilitate advanced aircraft connectivity on most aircraft type, including very light jets. The compact size and lighter weight solution also enables quicker installation time and minimal drag while utilizing a reduced footprint.\"\n\nThe Collins designed and manufactured IRT NX SATCOM system includes a data unit, configuration module and antenna – providing consistent, cohesive connectivity throughout the aircraft while using less power than legacy systems.\n\nCertification and installation were completed earlier this year with the first flight performed in late April. The Collins hardware, antenna and ARINCDirect connectivity services are on display at the 2024 European Business Aviation Convention & Exhibition (EBACE) in Geneva, Switzerland at Collins Aerospace booth K72. The Prince Aviation Citation Jet will be available at static display AD16 for live demonstrations of the Wi-Fi connectivity, and to view the retrofit installation of the solution on the aircraft.\n\nAbout Collins Aerospace\r\nCollins Aerospace, an RTX business, is a leader in integrated and intelligent solutions for the global aerospace and defense industry. Our 80,000 employees are dedicated to delivering future-focused technologies to advance sustainable and connected aviation, passenger safety and comfort, mission success, space exploration, and more.\n\nStory continues\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-collins-aerospace-completes-industry-first-retrofit-of-iridium-certus-satellite-connectivity-302155681.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-collins-aerospace-completes-industry-080000122.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.009,
            "neu": 0.859,
            "pos": 0.131
        }
    },
    {
        "date": "2024-05-28T06:00:00+00:00",
        "title": "RTX's Collins Aerospace and Panasonic Avionics unveil MAYA - the future of premium air travel",
        "content": "The reimagined suite for the next generation of tech-savvy passengers elevates the on-board experience, enhancing airline loyalty, passenger satisfaction and profitability\n\nHAMBURG, Germany, May 28, 2024 /PRNewswire/ -- Collins Aerospace, an RTX (NYSE: RTX) business, and Panasonic Avionics Corporation (Panasonic Avionics) today jointly unveiled MAYA, a transformative vision for a next-generation business class suite at the 2024 Aircraft Interiors Expo in Hamburg, Germany.\n\nMAYA combines Collins Aerospace and Panasonic Avionics respective expertise in design, technology development and integration into a singular integrated solution, providing a clear differentiator for the business class cabin by redefining comfort, passenger immersion, accessibility and sustainability for the future air travel experience.\n\nThe suite provides exceptional ergonomics with an advanced seating architecture and integrated ARISE™ comfort technology that automatically optimizes cushion pressure, regulates environmental temperature and reduces peak vibration disturbances during flight – improving periods of rest and passenger wellbeing.\n\nAn Astrova Curve 45-inch ultra-wide, ultra-high-definition OLED display with headphone-less audio system is the cinematic centerpiece of the suite, providing users unprecedented immersion, customization and feature rich personalized viewing experiences.\n\nThe suite is packed with technology, it seamlessly syncs to passenger electronic devices through the ADAPT™ controller, providing familiar, curated control of the seating environment and supporting advanced mobility, sensory, cognitive and language accommodations to passengers of varying abilities.\n\n\"MAYA is the fusion of enhanced physical, digital and smart technologies that exponentially enhance the cabin experience in ways individual solutions are unable to accomplish on their own,\" said Ed Dryden, president of Interiors at Collins Aerospace. \"Unprecedented customization and user control provides uniquely personal in-flight experiences – bridging historical gaps in accessibility, enabling multi-dimensional comfort and facilitating immersive in-flight entertainment.\"\n\nPanasonic Avionics Corporation's CEO Ken Sain said: \"MAYA is the product of the leading inflight technology provider and the largest airplane seat manufacturer collaborating to create the future of business class for the next generation of tech-savvy passengers. The seamlessly integrated 45\" Astrova Curve OLED display is 3 times larger than typical screens and the first Ultra-Widescreen CinemaScope (21:9) display in the sky – the same screen format in cinemas. Based on field of view, MAYA delivers a 50% more immersive viewing experience than sitting in a theater.\"\n\nStory continues\n\nBuilt for luxury yet rooted within a sustainable framework, the MAYA suite utilizes recycled, reusable and plant-based materials along with STARLight™ composite structures to reduce production waste and improve product circularity.\n\nThe industrial design of the suite emphasizes modularity, supporting mid-life upgrades, simplifying disassembly processes and improving traceability with recycling streams.\n\nMAYA suites are on display at the Panasonic Avionics (4A10) and Collins Aerospace (5B30) booths during the Aircraft Interiors Exhibition in Hamburg, Germany, May 28-30.\n\nAbout Collins Aerospace\r\nCollins Aerospace, an RTX business, is a leader in integrated and intelligent solutions for the global aerospace and defense industry. Our 80,000 employees are dedicated to delivering future-focused technologies to advance sustainable and connected aviation, passenger safety and comfort, mission success, space exploration and more.\n\nAbout RTX\r\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nAbout Panasonic Avionics Corporation Panasonic Avionics Corporation is the world's leading supplier of in-flight entertainment and communication systems. The company pioneered the industry beginning in 1979 and has consistently introduced innovations that enable unique customer experiences and enhance airline loyalty (NPS), ancillary revenue, and operational efficiency.\n\nOver 200 leading airlines across the world have chosen to install Panasonic Avionics IFE, satellite Wi-Fi connectivity, and digital services on their aircraft. Panasonic Avionics' proven systems are supported by the largest, global support and services team utilizing OEM insights to ensure peak system performance.\n\nPanasonic Avionics Corporation is headquartered in California with over 3,500 employees and operates in 50 locations around the globe.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com. Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-collins-aerospace-and-panasonic-avionics-unveil-maya--the-future-of-premium-air-travel-302156329.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-collins-aerospace-panasonic-avionics-060000345.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.013,
            "neu": 0.838,
            "pos": 0.149
        }
    }
]