[
    {
        "date": "2024-06-17T14:00:20+00:00",
        "title": "Do Fundamentals Have Any Role To Play In Driving RTX Corporation's (NYSE:RTX) Stock Up Recently?",
        "content": "Most readers would already know that RTX's (NYSE:RTX) stock increased by 9.9% over the past three months. Given that stock prices are usually aligned with a company's financial performance in the long-term, we decided to investigate if the company's decent financials had a hand to play in the recent price move. Specifically, we decided to study RTX's  ROE in this article.\n\nReturn on equity or ROE is an important factor to be considered by a shareholder because it tells them how effectively their capital is being reinvested. Put another way, it reveals the company's success at turning shareholder investments into profits.\n\nCheck out our latest analysis for RTX\n\nHow Do You Calculate Return On Equity?\n\nReturn on equity can be calculated by using the formula:\n\nReturn on Equity = Net Profit (from continuing operations) ÷ Shareholders' Equity\n\nSo, based on the above formula, the ROE for RTX is:\n\n5.9% = US$3.6b ÷ US$62b (Based on the trailing twelve months to March 2024).\n\nThe 'return' is the yearly profit. So, this means that for every $1 of its shareholder's investments, the company generates a profit of $0.06.\n\nWhy Is ROE Important For Earnings Growth?\n\nThus far, we have learned that ROE measures how efficiently a company is generating its profits. Depending on how much of these profits the company reinvests or \"retains\", and how effectively it does so, we are then able to assess a company’s earnings growth potential. Generally speaking, other things being equal, firms with a high return on equity and profit retention, have a higher growth rate than firms that don’t share these attributes.\n\nA Side By Side comparison of RTX's Earnings Growth And 5.9% ROE\n\nOn the face of it, RTX's ROE is not much to talk about. A quick further study shows that the company's ROE doesn't compare favorably to the industry average of 14% either. Although, we can see that RTX saw a modest net income growth of 15% over the past five years. So, there might be other aspects that are positively influencing the company's earnings growth. For instance, the company has a low payout ratio or is being managed efficiently.\n\nNext, on comparing with the industry net income growth, we found that RTX's growth is quite high when compared to the industry average growth of 6.6% in the same period, which is great to see. past-earnings-growth\n\nEarnings growth is an important metric to consider when valuing a stock. The investor should try to establish if the expected growth or decline in earnings, whichever the case may be, is priced in. Doing so will help them establish if the stock's future looks promising or ominous. Has the market priced in the future outlook for RTX? You can find out in our latest intrinsic value infographic research report.\n\nStory continues\n\nIs RTX Using Its Retained Earnings Effectively?\n\nRTX has a significant three-year median payout ratio of 72%, meaning that it is left with only 28% to reinvest into its business. This implies that the company has been able to achieve decent earnings growth despite returning most of its profits to shareholders.\n\nBesides, RTX has been paying dividends for at least ten years or more. This shows that the company is committed to sharing profits with its shareholders. Existing analyst estimates suggest that the company's future payout ratio is expected to drop to 43% over the next three years. Accordingly, the expected drop in the payout ratio explains the expected increase in the company's ROE to 13%, over the same period.\n\nSummary\n\nIn total, it does look like RTX has some positive aspects to its business. That is, quite an impressive growth in earnings. However, the low profit retention means that the company's earnings growth could have been higher, had it been reinvesting a higher portion of its profits. The latest industry analyst forecasts show that the company is expected to maintain its current growth rate. To know more about the company's future earnings growth forecasts take a look at this freereport on analyst forecasts for the company to find out more.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/fundamentals-role-play-driving-rtx-140020270.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.017,
            "neu": 0.819,
            "pos": 0.163
        }
    },
    {
        "date": "2024-06-17T13:00:00+00:00",
        "title": "France becomes international customer of RTX's mobile air traffic control system",
        "content": "Transportable systems to be delivered to the French Armée de Terre\n\nPARIS, June 17, 2024 /PRNewswire/ -- Collins Aerospace, an RTX (NYSE: RTX) business, announced today that the French Direction Générale de l'Armement (DGA) has selected the company's vehicle-mounted Air Traffic Navigation, Integration, and Coordination System (ATNAVICS) for the tactical control, approach and landing capabilities of the French Armée de Terre. With this order, France joins the U.S. Army, U.S. Marine Corps, and U.S. Air Force in the use of this solution for rapid ground control approach deployment. The announcement took place at Eurosatory during a signing ceremony with representatives from both parties. ATNAVICS provides air traffic services for the rapid deployment of troops and equipment to remote locations.\n\nPackaged into the most capable, lightweight and compact configuration available, ATNAVICS provides air traffic services for the rapid deployment of troops and equipment to remote locations or in support of humanitarian missions in severe environments.\n\n\"The selection by the DGA of our mobile air traffic control systems will provide French forces with expeditionary air traffic management capabilities,\" said Dr. Bruce Brown, vice-president of Business Development Mission Systems for Collins Aerospace. \"Our mission-proven system is designed to provide field operations with on-demand surveillance, precision landing and identification friend-or-foe capabilities.\"\n\nATNAVICS is the world's only fully autonomous and complete mobile Ground Controlled Approach compliant to International Civil Aviation Organization standards. Highly mobile, it is fully mission-tested for operation and survivability on the battlefield. With over two decades of service in the U.S. and 54 systems currently in operation, ATNAVICS has received continuous upgrades and enhancements ensuring its longevity for the coming decades.\n\n\"We look forward to receiving this new capability, which will enable our forces to quickly open up theaters of operation, thanks to the use of a single military transport aircraft for ATNAVICS dispatch, which can be deployed in less than an hour,\" said Colonel Aurélie, Direction Générale de l'Armement.\n\nAbout Collins Aerospace \r\nCollins Aerospace, an RTX business, is a leader in integrated and intelligent solutions for the global aerospace and defense industry. Our 80,000 employees are dedicated to delivering future-focused technologies to advance sustainable and connected aviation, passenger safety and comfort, mission success, space exploration, and more.\n\nAbout RTX\r\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com.\n\nTechnical Material not controlled under local export regulations. This document is not controlled under U.S. regulations but may contain Technical Material that is controlled by other jurisdictions. Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/france-becomes-international-customer-of-rtxs-mobile-air-traffic-control-system-302173844.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/france-becomes-international-customer-rtxs-130000279.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.958,
            "neg": 0.011,
            "neu": 0.919,
            "pos": 0.07
        }
    }
]