[
    {
        "date": "2024-10-10T18:29:20+00:00",
        "title": "Cramer Thinks RTX Corporation (NYSE:RTX) Is A ‘Winner’",
        "content": "We recently published an article titled, Jim Cramer on Netflix and Other Stocks. In this article, we are going to take a look at where RTX Corporation (NYSE:RTX) stands against other stocks discussed by Jim Cramer.\n\nRecently, Mad Money’s host, Jim Cramer addressed what he called a “ridiculous plethora of sell-side downgrades,” noting that the Dow Jones Industrial Average fell by 0.94%, the S&P 500 decreased by 0.96%, and the Nasdaq Composite dropped by 1.18% on Monday. While he acknowledged the session’s poor performance, he cautioned that paying too much attention to downgrades can be detrimental for long-term investors.\n\nCramer urged investors not to get overly influenced by the negative sentiment on Wall Street and emphasized the importance of staying committed to strong companies, even when their stock prices experience volatility. He recounted the history of the bull market, stating:\n\n“When I look at the history of this incredible bull market, and it has been an incredible bull market, it’s littered with buy-to-hold, hold-to-sell, buy-to-hold, hold-to-sell. These downgrades scare you out of amazing stocks at levels that may temporarily be too high, but will recover later. If you listen to the downgrades, though, you’ll never recover with it.”\n\nIn discussing the challenges investors face, Cramer pointed out that many get rattled by analyst downgrades and might sell their shares in solid companies, which can make it difficult to buy back in later.\n\n“In the last decade, the toughest thing to do is to hold on to good stocks. But analysts and commentators love to take aim at big long-term winners. Their jeremiads have scared so many people out of some amazing gains.”\n\nHe observed that complacency can be prevalent on Wall Street, with bullish investors often overlooking risks while bearish ones miss out on potential opportunities. For those considering action based on a downgrade, Cramer advised waiting for a bounce to sell, but he noted that timing such moves is “incredibly hard,” even for seasoned traders.\n\nCramer emphasized that when analysts downgrade stocks that have already taken a hit and overlook positive aspects, it can create a challenging environment. However, he believes it is still possible to profit. Here’s what he said:\n\n“I need you to understand that when analysts downgrade after stocks have already been hammered, when really good investors ignore the positives, then, it may be a grim time. But not so grim that we can’t make money by focusing on the fundamentals of the companies. And not just the economy, the Fed, interest rates and oil.”\n\nStory continues Cramer Thinks RTX Corporation (NYSE:RTX) Is A ‘Winner’\n\nCramer Thinks RTX Corporation (NYSE:RTX) Is A ‘Winner’\n\nOur Methodology\n\nFor this article, we compiled a list of 15 stocks that were mentioned by Jim Cramer during his episodes of Mad Money on October 7 and October 8. We listed the stocks in ascending order of their hedge fund sentiment as of the second quarter, which was taken from Insider Monkey’s database of more than 900 hedge funds.\n\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\n\nRTX Corporation (NYSE:RTX)\n\nNumber of Hedge Fund Holders: 54\n\nRTX Corporation (NYSE:RTX) is an aerospace and defense company. It offers a variety of systems and services tailored to meet the needs of commercial, military, and government clients both in the United States and globally. The company offers its services and products through three businesses, Collins Aerospace, Pratt & Whitney, and Raytheon. Cramer called the stock a winner and said to hold on to it, highlighting that it is not expensive.\n\n“It only sells at 22 times earnings. It did hit an all-time high today, but you know what, it’s not expensive. It’s got a 2% yield. Here’s what I would do… You can try to cut the position back a little if it’s too big for you, but otherwise, you hold on. It’s a winner and nothing there shows me that it won’t continue to be so.”\n\nRecently, RTX (NYSE:RTX) announced a quarterly dividend of $0.63 per share, payable by December 12 to shareowners of record on November 15. The company has consistently paid cash dividends on its common stock since 1936, highlighting a long-standing tradition of shareholder return.\n\nDuring the second quarter, RTX (NYSE:RTX) showed substantial operational achievements, including a 10% increase in organic sales. The company also experienced adjusted margin growth across all three segments, complemented by an impressive $2.2 billion of free cash flow. Management highlighted its substantial backlog totaling $206 billion and commented that there is an unprecedented demand for its offerings. The company is concentrating on fulfilling customer commitments, driven by its CORE operating system, which facilitates efficient execution and management of operations.\n\nOverall, RTX ranks 11th on our list of stocks discussed by Jim Cramer. While we acknowledge the potential of RTX as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than RTX but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nRead Next: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/cramer-thinks-rtx-corporation-nyse-182920331.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.045,
            "neu": 0.823,
            "pos": 0.132
        }
    },
    {
        "date": "2024-10-10T13:44:00+00:00",
        "title": "RTX's Arm Gets a Contract to Develop Ultra-Wide Bandgap Semiconductors",
        "content": "RTX Corporation’s RTX unit, Raytheon, recently received a three-year contract from the Defense Advanced Research Projects Agency to create ultra-wide bandgap semiconductors (UWBGS) using new diamond and aluminum nitride materials. These new semiconductors are expected to improve power delivery and heat management in various electronic devices, including sensors.\n\nDetails of the Contract\n\nThe contract will be completed in two phases. In the first phase, the Raytheon Advanced Technology team will develop thin films made from diamond and aluminum nitride, which will be used in electronic devices. The second phase will focus on improving this technology for larger wafers that can be used in sensors. The work for this contract will take place at Raytheon's facility in Andover, MA.\n\nImportance of RTX’s UWBGS\n\nUWBGS has many advantages over traditional ones. The semiconductors can create compact and powerful radio frequency switches, limiters and amplifiers. Their high thermal conductivity means they can work well at higher temperatures and in tough environments. This makes the semiconductors very reliable for various applications.\r\n\r\nThe latest contract entails the development of UWBGS for devices that can enhance radar and communication systems. These advanced semiconductors will support capabilities like cooperative sensing, electronic warfare and directed energy systems. They will also be important for high-speed weapon systems, like hypersonics, where performance is crucial.\r\n\r\nThe potential of UWBGS to improve military and defense technology will likely change how advanced electronics are used and strengthen the U.S. military's capabilities. With continued advancements, the future of semiconductor technology looks promising.\r\n\r\nThis is likely to have prompted Global Market Insights to forecast a compound annual growth rate of more than 8% for the global military and defense semiconductor market during the 2024-2032 time period.\n\nProspects for RTX’s Peers\n\nOther companies that are likely to enjoy the perks of the expanding global semiconductor industry have been discussed below.\r\n \r\nLockheed Martin Corporation LMT: The company teamed up with GlobalFoundries in June 2023 to enhance U.S. semiconductor manufacturing. This collaboration focuses on improving the security and resilience of supply chains for national defense systems by advancing chip technologies like 3D integration and gallium nitride on silicon.\r\n \r\nMoreover, in April 2024, it was announced that Lockheed Martin together with Intel Corporation and Altera, an Intel Company, will work to support the Stimulating Transition for Advanced Microelectronics Packaging program. Under this joint venture, LMT aims to develop a low-size, weight and power (SWaP), Sensor Open Systems Architecture aligned airborne electronic defense system, utilizing Altera’s Multi-Chip Package for expected use on the MH-60R multi-mission helicopter.\r\n\r\nNorthrop Grumman Corporation NOC: The company has been offering a wide range of trusted foundry and semiconductor services that deliver high-performing and reliable microelectronics for more than 50 years.\r\n\r\nIn particular, NOC operates a leading semiconductor foundry at Space Park, specializing in III-V compound semiconductors. The foundry designs and manufactures advanced microelectronics for various applications, including satellite communications and commercial systems like smartphones.\r\n\r\nThe Boeing Company BA: It is expanding its semiconductor capabilities through a partnership with the Korea Evaluation Institute of Industrial Technology and the Korea Institute for Advancement of Technology. This collaboration focuses on developing advanced semiconductor technologies for aerospace applications.\r\n \r\nBy integrating cutting-edge semiconductor innovations into aircraft systems, Boeing aims to enhance the performance, reliability and efficiency of its aerospace products.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-arm-gets-contract-develop-134400989.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.009,
            "neu": 0.823,
            "pos": 0.169
        }
    },
    {
        "date": "2024-10-10T13:35:58+00:00",
        "title": "Raytheon Gets $736 Million to Make AIM-9X Missiles",
        "content": "Raytheon, an RTX business, was awarded a $736 million contract from the U.S. Navy to produce AIM-9X Sidewinder missiles.\n\nThis contract is for the improved Block II variant, which addresses hardware obsolescence through upgrades to ensure superior performance and long-term reliability.\n\nMost Read on Design & Development Today:\n\nBoeing Completes First Flight of E-7 Wedgetail GM Recalling More Than 449,000 SUVs, Pickups Due to Issue with Low Brake Fluid Warning Light Electra Conducts Multiple Flight Demonstrations of Ultra Short Aircraft for U.S. Military A Capsule has Been Propelled Through a Hyperloop Test Tube in a Step Forward for the Transit System\n\nAIM-9X is an advanced infrared-tracking, short-range, air-to-air and surface-to-air missile in the world. It is configured for installation on a range of modern aircraft and provides proven layered defense with ground-launched capabilities, including the National Advanced Surface-to-Air Missile System, or NASAMS.\n\nA U.S. Navy-led joint program with the U.S. Air Force, AIM-9X is used by more than 30 allied and partner nations and continues to gain international interest.\n\nIn March 2024, the Czech Republic became the most recent international customer by signing a letter of agreement for procurement of the missile for use on their F-35 aircraft.\n\nWork under this contract will take place in various locations within the continental U.S. through 2029.\n\nClick here to subscribe to our daily newsletter.\n\nView comments",
        "link": "https://finance.yahoo.com/news/raytheon-gets-736-million-aim-133558674.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.956,
            "neg": 0.031,
            "neu": 0.855,
            "pos": 0.114
        }
    },
    {
        "date": "2024-10-10T12:00:00+00:00",
        "title": "RTX's Raytheon awarded $736 million contract to produce AIM-9X missiles",
        "content": "Missile is proven across air-to-air and ground-launch domains\n\nTUCSON, Ariz., Oct. 10, 2024 /PRNewswire/ -- Raytheon, an RTX (NYSE: RTX) business, was awarded a $736 million contract from the U.S. Navy to produce AIM-9X® SIDEWINDER® missiles.\n\nThis contract is for the improved Block II variant, which addresses hardware obsolescence through upgrades to ensure superior performance and long-term reliability.\n\n\"AIM-9X remains the weapon of choice for short-range air-to-air and surface-to-air missile defense, and worldwide customer demand is strong,\" said Barbara Borgonovi, president of Naval Power at Raytheon. \"We're investing, innovating, and partnering with our U.S. Navy customer to significantly increase our AIM-9X production capacity starting with orders next year.\"\n\nAIM-9X is the most advanced infrared-tracking, short-range, air-to-air and surface-to-air missile in the world. It is configured for easy installation on a wide range of modern aircraft and provides proven layered defense with ground-launched capabilities, including the National Advanced Surface-to-Air Missile System, or NASAMS.\n\nA U.S. Navy-led joint program with the U.S. Air Force, AIM-9X is used by over 30 allied and partner nations and continues to gain international interest. In March 2024, the Czech Republic became the most recent international customer by signing a letter of agreement for procurement of the missile for use on their F-35 aircraft.\n\nWork under this contract will take place in various locations within the continental U.S. through 2029.\n\nAbout Raytheon Raytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-raytheon-awarded-736-million-contract-to-produce-aim-9x-missiles-302272427.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-raytheon-awarded-736-million-120000002.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.992,
            "neg": 0.028,
            "neu": 0.815,
            "pos": 0.157
        }
    }
]