[
    {
        "date": "2024-10-21T14:00:00+00:00",
        "title": "RTX's Collins Aerospace delivers first upgraded Venue™ cabin management systems with smart monitors",
        "content": "A new user interface and 4K smart monitors improve system performance, simplify operations and enhance inflight entertainment\n\nLAS VEGAS, Oct. 21, 2024 /PRNewswire/ -- Collins Aerospace, an RTX (NYSE: RTX) business, announced the first deliveries of its new Venue™ cabin management system (CMS). The upgraded Venue is equipped with Collins' all new smart monitors and upgraded graphical user interface (GUI), enhancing entertainment, usability and simplicity for operators and passengers, alike.\n\nWith more than 1,700 installations on over 50 aircraft models, Venue is not only the most fielded system of its kind but continues its technological evolution with 4K-enabled resolutions, comprehensive cabin controls and a redesigned user interface, providing a simplified, consistent user experience across its advanced touchscreens, seat controls and mobile application.\n\n\"The enhanced user interface and smart architecture not only advance Venue's market-leading capabilities and dependability, but also establish a firm foundation on which customers can seamlessly build onto their system as future technology upgrades become available,\" said Nathan Voight, vice president and general manager, Business and Regional Avionics at Collins Aerospace. \"Collins' network of trusted dealer partners has been instrumental in the integration and deployment of our upgraded Venue system, evolving the inflight experience to what passengers expect in ground applications.\"\n\nThe Venue smart monitor can integrate directly into a whole cabin Venue system or function as a standalone inflight entertainment (IFE) solution, allowing customers to experience their favorite movies, shows, personal content or Collins' HD Airshow in ultra-high definition.\n\nAvailable in five sizes, the versatile smart monitor provides flexible integration options and streamlined software upgrades for everything from VVIP aircraft to very light jets. The new system is compact, consolidating underfloor hardware directly into the monitor's robust internal processor that not only reduces carry weight but also conserves power consumption.\n\nThe elegantly upgraded GUI features a modernized menu structure and consistent iconography across device interfaces, simplifying cabin controls with intuitive features that require fewer touchpoints to achieve desired results.\n\nDemonstrations of the enhanced Venue system with smart monitor and upgraded GUI are available at Collins Aerospace booth #2041 during the 2024 NBAA-BACE show in Las Vegas, Nevada.\n\nStory continues\n\nAbout Collins Aerospace\n\nCollins Aerospace, an RTX business, is a leader in integrated and intelligent solutions for the global aerospace and defense industry. Our 80,000 employees are dedicated to delivering future-focused technologies to advance sustainable and connected aviation, passenger safety and comfort, mission success, space exploration, and more.\n\nAbout RTX\n\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-collins-aerospace-delivers-first-upgraded-venue-cabin-management-systems-with-smart-monitors-302281567.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-collins-aerospace-delivers-first-140000550.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.006,
            "neu": 0.813,
            "pos": 0.181
        }
    },
    {
        "date": "2024-10-21T07:05:47+00:00",
        "title": "RTX (RTX) Reports Q3: Everything You Need To Know Ahead Of Earnings",
        "content": "RTX (RTX) Reports Q3: Everything You Need To Know Ahead Of Earnings\n\nAerospace and defense company Raytheon (NYSE:RTX) will be reporting earnings tomorrow before market hours. Here’s what you need to know.\n\nRTX beat analysts’ revenue expectations by 2.3% last quarter, reporting revenues of $19.72 billion, up 7.7% year on year. It was an exceptional quarter for the company, with an impressive beat of analysts’ organic revenue estimates and operating margin estimates.\n\nIs RTX a buy or sell going into earnings? Read our full analysis here, it’s free.\n\nThis quarter, analysts are expecting RTX’s revenue to grow 4.6% year on year to $19.82 billion, slowing from the 11.8% increase it recorded in the same quarter last year. Adjusted earnings are expected to come in at $1.34 per share. RTX Total Revenue\n\nAnalysts covering the company have generally reconfirmed their estimates over the last 30 days, suggesting they anticipate the business to stay the course heading into earnings. RTX has missed Wall Street’s revenue estimates twice over the last two years.\n\nLooking at RTX’s peers in the aerospace and defense segment, only Byrna has reported results so far. It met analysts’ revenue estimates, delivering year-on-year sales growth of 194%. The stock was down 18.4% on the results.\n\nRead our full analysis of Byrna’s earnings results here.\n\nThere has been positive sentiment among investors in the aerospace and defense segment, with share prices up 3.3% on average over the last month. RTX is up 4.9% during the same time and is heading into earnings with an average analyst price target of $126.65 (compared to the current share price of $126.19).\n\nUnless you’ve been living under a rock, it should be obvious by now that generative AI is going to have a huge impact on how large corporations do business. While Nvidia and AMD are trading close to all-time highs, we prefer a lesser-known (but still profitable) semiconductor stock benefitting from the rise of AI. Click here to access our free report on our favorite semiconductor growth story.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-rtx-reports-q3-everything-070547786.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.986,
            "neg": 0.006,
            "neu": 0.881,
            "pos": 0.112
        }
    }
]