[
    {
        "date": "2024-08-11T13:06:33+00:00",
        "title": "Read This Before Considering RTX Corporation (NYSE:RTX) For Its Upcoming US$0.63 Dividend",
        "content": "Some investors rely on dividends for growing their wealth, and if you're one of those dividend sleuths, you might be intrigued to know that RTX Corporation (NYSE:RTX) is about to go ex-dividend in just four days. The ex-dividend date is one business day before a company's record date, which is the date on which the company determines which shareholders are entitled to receive a dividend. The ex-dividend date is important as the process of settlement involves two full business days. So if you miss that date, you would not show up on the company's books on the record date. Meaning, you will need to purchase RTX's shares before the 16th of August to receive the dividend, which will be paid on the 5th of September.\n\nThe company's upcoming dividend is US$0.63 a share, following on from the last 12 months, when the company distributed a total of US$2.52 per share to shareholders. Last year's total dividend payments show that RTX has a trailing yield of 2.2% on the current share price of US$116.15. Dividends are an important source of income to many shareholders, but the health of the business is crucial to maintaining those dividends. That's why we should always check whether the dividend payments appear sustainable, and if the company is growing.\n\nSee our latest analysis for RTX\n\nDividends are typically paid from company earnings. If a company pays more in dividends than it earned in profit, then the dividend could be unsustainable. RTX paid out 144% of profit in the past year, which we think is typically not sustainable unless there are mitigating characteristics such as unusually strong cash flow or a large cash balance. Yet cash flow is typically more important than profit for assessing dividend sustainability, so we should always check if the company generated enough cash to afford its dividend. It distributed 40% of its free cash flow as dividends, a comfortable payout level for most companies.\n\nIt's disappointing to see that the dividend was not covered by profits, but cash is more important from a dividend sustainability perspective, and RTX fortunately did generate enough cash to fund its dividend. If executives were to continue paying more in dividends than the company reported in profits, we'd view this as a warning sign. Extraordinarily few companies are capable of persistently paying a dividend that is greater than their profits.\n\nClick here to see the company's payout ratio, plus analyst estimates of its future dividends. historic-dividend\n\nHave Earnings And Dividends Been Growing?\n\nCompanies with consistently growing earnings per share generally make the best dividend stocks, as they usually find it easier to grow dividends per share. If business enters a downturn and the dividend is cut, the company could see its value fall precipitously. With that in mind, we're encouraged by the steady growth at RTX, with earnings per share up 2.3% on average over the last five years.\n\nMany investors will assess a company's dividend performance by evaluating how much the dividend payments have changed over time. In the last 10 years, RTX has lifted its dividend by approximately 0.7% a year on average.\n\nThe Bottom Line\n\nFrom a dividend perspective, should investors buy or avoid RTX? Earnings per share have grown modestly, and last year RTX paid out a low percentage of its cash flow. However, its dividend payments were not well covered by profits. To summarise, RTX looks okay on this analysis, although it doesn't appear a stand-out opportunity.\n\nSo if you want to do more digging on RTX, you'll find it worthwhile knowing the risks that this stock faces. For instance, we've identified 4 warning signs for RTX (1 makes us a bit uncomfortable) you should be aware of.\n\nIf you're in the market for strong dividend payers, we recommend checking our selection of top dividend stocks.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/read-considering-rtx-corporation-nyse-130633771.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.035,
            "neu": 0.818,
            "pos": 0.146
        }
    }
]