[
    {
        "date": "2024-06-12T14:00:00+00:00",
        "title": "RTX's Blue Canyon Technologies selected by NASA to provide multiple spacecraft buses for PolSIR mission",
        "content": "LAFAYETTE, Colo., June 12, 2024 /PRNewswire/ -- RTX's (NYSE: RTX) small satellite manufacturer and mission services provider, Blue Canyon Technologies, was selected to build two 12U CubeSat buses for NASA's PolSIR mission, which will study ice clouds that form at high altitudes throughout tropical and sub-tropical regions. In addition to designing and manufacturing the bus platforms, Blue Canyon will also provide mission operations services. Blue Canyon Technologies will design and manufacture the bus platforms and provide mission operations services for NASA’s PolSIR mission.\n\nThe PolSIR instrument –Polarized Submillimeter Ice-cloud Radiometer– will observe the full diurnal cycle of high-altitude ice clouds to improve climate forecasts and provide climate models with important insights on how Earth's atmosphere will change in the future.\n\n\"Supporting this critical mission builds on our heritage of weather monitoring missions including TEMPEST-D and TROPICS,\" said Chris Winslett, general manager of Blue Canyon Technologies.\n\nEach spacecraft will be equipped with radiometers that will observe the clouds' daily cycle of ice content through two separate wavelengths in two spectral bands and will fly in orbits separated by three to nine hours. Over time, these two instruments will observe the clouds' daily cycle of ice content.\n\nNASA Goddard will provide the project management team that builds the two instruments for the Principal Investigator led mission from Vanderbilt University, and science operations will be conducted by the Space Science and Engineering Center at the University of Wisconsin – Madison.  For more information on the PolSIR mission, visit vanderbilt.edu/polsir.\n\nAbout Blue Canyon Technologies  \r\nBlue Canyon Technologies (BCT), RTX's small satellite manufacturer and mission services provider, offers a diverse portfolio of innovative, reliable, and affordable spacecraft and components that enable a broad range of missions and technological advancements for the new space economy. The company currently supports numerous unique missions with more than 140 cumulative spacecraft orders.\n\nAbout RTX \r\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/rtxs-blue-canyon-technologies-selected-by-nasa-to-provide-multiple-spacecraft-buses-for-polsir-mission-302169923.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-blue-canyon-technologies-selected-140000910.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.964,
            "neg": 0.006,
            "neu": 0.927,
            "pos": 0.067
        }
    }
]