[
    {
        "date": "2024-10-03T18:26:47+00:00",
        "title": "Deutsche Bank Changes Tune On Raytheon Parent RTX, Sees Aerospace Edge Fuel Long-Term Growth Potential",
        "content": "Deutsche Bank Changes Tune On Raytheon Parent RTX, Sees Aerospace Edge Fuel Long-Term Growth Potential\n\nDeutsche Bank analyst Scott Deuschle upgrades RTX Corporation (NYSE:RTX) from Sell to Hold, raising the price forecast from $109 to $129.\n\nAccording to the analyst, RTX’s aerospace exposure is expected to enable it to outpace other defense companies, leveraging operational efficiencies to drive long-term growth and compound earnings.\n\nThe analyst sees potential for further stock upside with RTX currently valued similarly to pure defense companies for 2026 but boasting a more promising long-term growth outlook due to its aerospace exposure.\n\nDeuschle writes that the overall narrative for RTX is compelling, as long as operational improvements persist.\n\nThe analyst forecasts third-quarter earnings per share of $1.36, exceeding the Street’s expectation of $1.32 by $0.04.\n\nAlso Read: RTX’s Raytheon Secures DARPA Contract To Develop Ultra-Wide Bandgap Semiconductors: Details\n\nDeuschle projects sequential revenue growth at Pratt & Whitney and Collins, driven by increased aftermarket activity at Pratt & Whitney from higher V2500 and GTF shop visits, while Collins is likely to benefit from sequential original equipment growth on Airbus and business jet platforms, along with sustained aftermarket strength and potential upside from increased modification revenue.\n\nThe analyst projects Raytheon’s revenue will decline quarter-over-quarter but sees upside potential due to strong demand, favorable DoD spending trends, and gradually improving conditions in the defense supply chain.\n\nEPS estimates for 2024-2026 have been revised to $5.48, $6.06, and $6.88, respectively, from $5.48, $6.17, and $6.93.\n\nThis decrease is mainly due to lower original equipment rate assumptions for both Boeing and Airbus, partially offset by a better product mix and higher margins.\n\nMeanwhile, operational risk keeps them at a Hold rather than a Buy.\n\nPrice Action: RTX shares are trading lower by 0.52% to $123.40 on Thursday.\n\nRead Next:\n\nJobs Report Preview: Could September Labor Data Shift Fed’s Interest Rate Path?\n\nLatest Ratings for RTX\n\nDate Firm Action From To Mar 2022 Barclays Maintains Overweight Mar 2022 Morgan Stanley Maintains Overweight Jan 2022 Morgan Stanley Maintains Overweight\n\nView More Analyst Ratings for RTX\n\nView the Latest Analyst Ratings\n\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools. Click now to access unique insights that can set you ahead in today's competitive market.\n\nGet the latest stock analysis from Benzinga?\n\nRTX (RTX): Free Stock Analysis Report\n\nThis article Deutsche Bank Changes Tune On Raytheon Parent RTX, Sees Aerospace Edge Fuel Long-Term Growth Potential originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nView comments",
        "link": "https://finance.yahoo.com/news/deutsche-bank-changes-tune-raytheon-182647827.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.04,
            "neu": 0.769,
            "pos": 0.19
        }
    },
    {
        "date": "2024-10-03T15:00:00+00:00",
        "title": "RTX Secures $192M Contract to Upgrade Next Generation Jammer",
        "content": "RTX Corporation’s RTX business segment, Raytheon, recently won a $192 million modification contract to upgrade the Next Generation Jammer Mid-Band Expansion (NGJ-MB) system. The contract was provided by the U.S. Navy.\n\nDetails of the Deal Secured by RTX\n\nPer the terms of the deal, RTX will develop the NGJ-MBX system, which is an upgraded version of its existing Next NGJ-MB system. The latest modification will extend the frequency range of the NGJ-MB system to counter additional threats, as MBX provides additional capabilities, which should improve the operational effectiveness of the NGJ-MB.\r\n\r\nThe work related to this deal will be executed in Dallas, TX; Forest, MI; El Segundo, CA, and Fort Wayne, IN, through 2027.\n\nSignificance of RTX’s NGJ-MB System\n\nRaytheon's NGJ-MB is a jamming system that improves airborne electronic attack capabilities for EA-18G Growler fighter aircraft. The NGJ-MB is the U.S. Navy's sophisticated electronic attack system designed to destroy enemy technology, such as air defense systems and communication tools. The NGJ-MB employs digital, software-based and Active Electronically Scanned Array technology, allowing operators to non-kinetically attack more targets at longer distances.\n\nWhat’s Favoring RTX?\n\nRising geopolitical tensions globally have prompted countries to enhance their military capabilities, including electronic warfare (EW) systems, by increasing spending on the production and modernization of varied programs. During the past decade, the utilization of cutting-edge technology in EW systems has rapidly evolved, making them an essential component of any country's defensive architecture.\r\n\r\nTo this end, the Mordor Intelligence firm predicts the Electronic Warfare market to witness a CAGR of 5.1% during the 2024-2029 period. This should benefit EW system manufacturers like RTX in the form of steady order flows from the Pentagon and other U.S. allies for advanced EW systems like NGJ-MB. The latest contract win is a bright example of that.\n\nProspects for RTX’s Peers\n\nOther defense contractors that are expected to reap the benefits of the expanding EW market are listed below:\r\n\r\nL3Harris Technologies LHX: It manufactures electronic warfare systems like AN/ALQ-214 (IDECM) F/A-18 Countermeasure System, Viper Shield AN/ALQ-254(V)1 All-digital Electronic Warfare Suite, CREW Vehicle Receiver/Jammer and The Next Generation Jammer-Low Band.\r\n\r\nL3Harris has a long-term (three to five years) earnings growth rate of 8.9%. The Zacks Consensus Estimate for LHX’s 2024 sales suggests growth of 9.6% from the prior-year reported figure.\r\n\r\nLockheed Martin LMT: It provides global ground EW solutions to U.S. forces as well as partner nations through a unique next-generation open architecture product platform and open business model.  Its Advanced Off-Board Electronic Warfare program delivers persistent electronic surveillance and attack capability against naval threats like anti-ship missiles.\r\n\r\nLockheed boasts a solid long-term earnings growth rate of 4.7%. The consensus estimate for LMT’s 2024 sales indicates a 5.3% improvement from the prior year's reported figure.\r\n\r\nNorthrop Grumman NOC: The company has been providing Naval Airborne Electronic Warfare solutions for more than 55 years. Some of its EW systems include the ALQ-251 radio frequency countermeasures system and the AN/APR-39 Radar Warning Receiver/Electronic Warfare Management System.\r\n\r\nNOC boasts a solid long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for its 2024 sales indicates year-over-year growth of 5.4%.\n\nStory continues\n\nPrice Movement\n\nIn the past six months, shares of RTX have risen 24.9% compared with the industry’s growth of 9.3%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nRTX currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nL3Harris Technologies Inc (LHX) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-secures-192m-contract-upgrade-150000462.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.XETRA",
            "LHX.US",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.063,
            "neu": 0.78,
            "pos": 0.157
        }
    }
]