[
    {
        "date": "2024-07-04T11:08:00+00:00",
        "title": "3 Industrial Stocks to Sell in July Before They Crash &amp; Burn",
        "content": "Industrial stocks can present mouthwatering returns. However, their cyclical nature makes them susceptible to interim drawdowns.\n\nUnfortunately for industrial stocks, the U.S. consumer environment is on a knife’s edge. For example, the unemployment rate ticked up to 4% in May. Additionally, consumer sentiment is topsy-turvy, and business inventory levels are unstable.\n\nConsidering the above, I delved into the industrial stocks arena to seek three unfavorable stocks. Methodologically, my screening process focused on fundamental aspects, valuation multiples and technical analysis. Moreover, I considered recent events to gauge the prevailing market sentiment.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nAlthough my outlook on industrial stocks is merely one of many, I hold a firm view of the sub-asset class’ short-term trajectory. If you concur, then here are three industrial stocks to sell.\n\nThe Boeing Company (BA) BA stock: a blue and white Boeing 787 flying in the sky above the clouds\n\nSource: vaalaa / Shutterstock\n\nThe Boeing Company’s (NYSE:BA) stock has shed more than 25% of its market value in the past six months, mainly due to a series of controversies about whistleblowing. The firm has been the subject of concerns relating to its aircraft quality inspection, concurrently raising risks such as diminished public perception, litigation charges and waning end-market confidence.\n\nI’m not going to comment on whether Boeing’s practices are savvy or not, as it isn’t within my breadth of knowledge. However, I would say that I’d be uncomfortable being invested in a company facing the amount of controversy that Boeing is facing. Moreover, Boeing recently agreed to the acquisition of Spirit AeroSystems (NYSE:SPR). Although the deal might be accretive in the long haul, I think BA stock is at risk of losing value due to the merger arbitrage theory.\n\nLastly, BA stock’s forward price-to-earnings (P/E) multiple of 420.22x is questionable. In fact, I’d go as far as saying that it signals absolute and relative overvaluation. Sure, other valuation metrics should be considered. Nevertheless, a P/E multiple is salient to a mature company’s valuation outlook. As such, I cast doubt over BA stock’s price trajectory.\n\nSchneider National (SNDR) a truck traveling on a highway during night time\n\nSource: Shutterstock\n\nAlthough not a pure play, Schneider National (NYSE:SNDR) partakes in industrial activities by providing numerous logistical services. For example, the company offers truckload, intermodal and logistical services via an integrated business model. Moreover, it targets various end markets, including supply chain channels and port logistics.\n\nStory continues\n\nI’m wary about SNDR stock, primarily because of the systematic headwinds mentioned in the introduction. Additionally, I believe Schneider National faces idiosyncratic challenges. For instance, it recently delivered a disappointing first-quarter fiscal report that communicated a revenue miss of $50 million and an earnings-per-share miss of one cent.\n\nFurthermore, Schneider National’s salient profitability and valuation metrics are questionable. For instance, the company has a return on common equity ratio of merely 5.43% and a forward price-to-earnings multiple of 28.09x. On top of that, SNDR stock has a relative strength index figure of about 63.55, which worries me, given the firm’s lack of publicly disseminated fundamental catalysts.\n\nI’m not saying SNDR stock is doomed. Instead, I’m suggesting that a correction might be in sight!\n\nRTX (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nRTX (NYSE:RTX), formerly known as Raytheon, is a U.S.-based aerospace and defense company. The firm’s past fundamental performance is commendable. However, it seems like it is time for a pullback. Here’s why.\n\nAgain, I want to highlight the sectoral headwinds mentioned in the introduction. Although RTX caters to governments, government spending, like consumer spending, is cyclical. As such, I worry that the firm might enter a cyclical dip.\n\nFurthermore, Wells Fargo (NYSE:WFC) recently stated that RTX might end up less profitable than initially anticipated. Although Wells Fargo’s claim is an isolated opinion, it holds gravitas, given the investment bank’s acquaintance with the stock. In fact, RTX recently released its first-quarter results, which revealed lower adjusted quarterly sales among its subsidiaries, which included a 4.8% quarter-over-quarter drawdown from Collins Aerospace and a 3.4% decrease from Raytheon. The company’s latest adjusted sales results somewhat substantiate Wells Fargo’s claims — which worries me.\n\nLastly, I believe a cyclical swing of RTX’s stock has commenced, based on the fact that RTX stock has slid below its 50-, and 100-day moving averages. Moreover, RTX stock’s forward P/E ratio of 23.31x is above the sector median of 20.42x, suggesting RTX stock is relatively overvalued.\n\nI raise caution here!\n\nOn the date of publication, Steve Booyens did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nSteve Booyens co-founded Pearl Gray Equity and Research in 2020 and has been responsible for cross-asset research and PR ever since. Before founding the firm, Steve spent time working in various finance roles in London and South Africa. He holds an MSc in Investment Banking from Queen Mary – University of London. Furthermore, Steve obtained his CFA Charter on April 26, 2024, and is working toward his Ph.D. in Finance. His articles are published on various reputable web pages such as Seeking Alpha, TipRanks, Yahoo Finance, and Benzinga. Steve’s articles on InvestorPlace don’t constitute financial advice. However, they form an interesting juxtaposition between mainstream opinion and objective theory, allowing readers to benefit from unbiased commentary. Readers can expect coverage on frequently traded stocks, REITs, fixed-income funds, CEFs, and ETFs.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 3 Industrial Stocks to Sell in July Before They Crash & Burn appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-industrial-stocks-sell-july-110800860.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "BA.US",
            "RTX.US",
            "RYTT34.SA",
            "SNDR.US",
            "SNIA.F",
            "SPR.US",
            "WFC.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.388,
            "neg": 0.06,
            "neu": 0.875,
            "pos": 0.065
        }
    },
    {
        "date": "2024-07-04T00:00:00+00:00",
        "title": "3 Industrial Stocks to Sell in July Before They Crash &amp; Burn",
        "content": "Industrial stocks might enter a cyclical dip if salient economic indicators don't improve. Consider dumping these industrial stocks to sell.\n",
        "link": "https://investorplace.com/2024/07/3-industrial-stocks-to-sell-in-july-before-they-crash-burn/",
        "symbols": [
            "BA.US",
            "RTX.US",
            "SNDR.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.232,
            "neg": 0.074,
            "neu": 0.761,
            "pos": 0.165
        }
    }
]