[
    {
        "date": "2024-05-11T12:29:30+00:00",
        "title": "RTX Corporation (NYSE:RTX) Pays A US$0.63 Dividend In Just Four Days",
        "content": "Regular readers will know that we love our dividends at Simply Wall St, which is why it's exciting to see RTX Corporation (NYSE:RTX) is about to trade ex-dividend in the next 4 days. The ex-dividend date is one business day before the record date, which is the cut-off date for shareholders to be present on the company's books to be eligible for a dividend payment. It is important to be aware of the ex-dividend date because any trade on the stock needs to have been settled on or before the record date. This means that investors who purchase RTX's shares on or after the 16th of May will not receive the dividend, which will be paid on the 13th of June.\n\nThe company's next dividend payment will be US$0.63 per share. Last year, in total, the company distributed US$2.36 to shareholders. Based on the last year's worth of payments, RTX stock has a trailing yield of around 2.2% on the current share price of US$106.32. If you buy this business for its dividend, you should have an idea of whether RTX's dividend is reliable and sustainable. So we need to investigate whether RTX can afford its dividend, and if the dividend could grow.\n\nView our latest analysis for RTX\n\nDividends are typically paid from company earnings. If a company pays more in dividends than it earned in profit, then the dividend could be unsustainable. Last year RTX paid out 95% of its profits as dividends to shareholders, suggesting the dividend is not well covered by earnings. That said, even highly profitable companies sometimes might not generate enough cash to pay the dividend, which is why we should always check if the dividend is covered by cash flow. Over the last year it paid out 54% of its free cash flow as dividends, within the usual range for most companies.\n\nIt's good to see that while RTX's dividends were not well covered by profits, at least they are affordable from a cash perspective. Still, if the company continues paying out such a high percentage of its profits, the dividend could be at risk if business turns sour.\n\nClick here to see the company's payout ratio, plus analyst estimates of its future dividends. historic-dividend\n\nHave Earnings And Dividends Been Growing?\n\nCompanies with consistently growing earnings per share generally make the best dividend stocks, as they usually find it easier to grow dividends per share. If earnings decline and the company is forced to cut its dividend, investors could watch the value of their investment go up in smoke. For this reason, we're glad to see RTX's earnings per share have risen 12% per annum over the last five years.\n\nStory continues\n\nAnother key way to measure a company's dividend prospects is by measuring its historical rate of dividend growth. RTX has delivered 1.0% dividend growth per year on average over the past 10 years. Earnings per share have been growing much quicker than dividends, potentially because RTX is keeping back more of its profits to grow the business.\n\nTo Sum It Up\n\nShould investors buy RTX for the upcoming dividend? Growing earnings per share and a normal cashflow payout ratio is an ok combination, but we're concerned that the company is paying out such a high percentage of its income as dividends. In summary, while it has some positive characteristics, we're not inclined to race out and buy RTX today.\n\nSo if you want to do more digging on RTX, you'll find it worthwhile knowing the risks that this stock faces. For example, we've found 4 warning signs for RTX that we recommend you consider before investing in the business.\n\nGenerally, we wouldn't recommend just buying the first dividend stock you see. Here's a curated list of interesting stocks that are strong dividend payers.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-corporation-nyse-rtx-pays-122930259.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.025,
            "neu": 0.87,
            "pos": 0.104
        }
    },
    {
        "date": "2024-05-11T11:11:35+00:00",
        "title": "What happened to 3D printing stocks?",
        "content": "In this piece, we will take a look at the performance and developments surrounding 3D printing stocks.\n\nA big reasons Apple Inc. (NASDAQ:AAPL) is widely credited to be one of the most advanced personal computing companies in the world is the firm's ability to blend in a device's design with high end specifications. A key aspect of product design is manufacturing, which has slowly grown to become one of the most advanced industries in the world. Advances in manufacturing have also nearly completely re shaped the landscape of today's technologies, with one high end manufacturing category, i.e. 3D printing or additive manufacturing, reshaping the way designers, businesses, and consumers produce and order gadgets.\n\n3D printing's utility allows high end jet engine manufacturers, such as General Electric Company (NYSE:GE) and RTX Corporation (NYSE:RTX) subsidiary Pratt & Whitney to fabricate complex components with high degrees of precision. At the same time, it also enables firms like the Ireland based medical device manufacturer Medtronic plc (NYSE:MDT) to create life like models of human organs such as the heart for testing, training, and other uses. For a detailed look at how GE and others are using 3D printing, you should read 10 Best 3D Printing and Additive Manufacturing Stocks To Buy.\n\nWhile the allure of 3D printing to transform industries and generate revenue has always been strong, these stocks, like others that require significant capital investment, fluctuate in response to economic conditions. As proof, consider the performance of the Solactive 3D Printing Index (CHF). It is one of the earliest collections of 3D printing stocks which predates Ark Investment's well known The 3D Printing ETF (BATS:PRNT). Year to date, the Solactive index is down by 2.4%. However, the 3D printing stock index closed 3.9% higher on April 11th, which has proven as one of the most important stock market dates this year. The following day, markets and investor sentiment reworked their expectations for interest rate cuts later this year after evaluating fresh inflation data and earnings from big banks and saw them struggle with high costs which disappointed Wall Street estimates for net interest income. You can read more about this turmoil by clicking on 20 Most Profitable Banks in the US in 2024.\n\nShifting gears, while 3D printing stocks have responded negatively to investors shifting their rate cut expectations forward, individual stocks might be doing better. Some of the oldest 3D printing stocks you're likely to find are Stratasys Ltd. (NASDAQ:SSYS) and 3D Systems Corporation (NYSE:DDD). These two have been trading on the stock market since the 1990s, and among them, Startsys's shares have been the better performers. They are up by 466% in all time price gains, for a nice chunk of returns which peaked in 2014 when the shares touched $140. And just as is the case for the Solactive 3D Printing Index (CHF) these 3D printing stocks also jumped in 2021 after investors and media hyped up the potential offered by printers to create alternatives to traditional supply chain and manufacturing resources that were harmed by the post pandemic lockdowns.\n\nStory continues\n\nThese fluctuations are a classic representation of 3D printing stocks, which soar in popularity, see a growth in adoption, and then slowly fade away to bide their time. 2021's 3D printing stock peak also led to this industry joining the special purpose acquisition company (SPAC) fever amongst firms eager to try their hand at a public listing. Some 3D printing stocks that went public during this time are Markforged Holding Corporation (NYSE:MKFG), Velo3D, Inc. (NYSE:VLD), and Shapeways Holdings, Inc. (NASDAQ:SHPW). Neither of these are stellar performers, and we can't blame them given how high interest rates have gotten since their listing.\n\nOne 3D printing stock that has bucked the trend of being red in 2024 is the Boston based software firm PTC Inc. (NASDAQ:PTC). PTC is an example of the software arm of the 3D printing industry, which benefits from selling manufacturing software firms that rely on 3D printing. This enables it to directly benefit from any growth in the adoption of additive manufacturing technologies. Additionally, in case of a slowdown in 3D printing, PTC Inc. (NASDAQ:PTC) also benefits from product management and industrial software which allow it to generate recurring revenue. The shares have gained 6.7% year to date, outpacing the gains of all 3D printing stocks in this introduction and the Solactive 3D Printing Index (CHF).\n\nThe latest bit about this top performing 3D printing stock is for its first quarter earnings. The results saw PTC Inc. (NASDAQ:PTC) post $603 million in revenue and $0.95 in earnings per share. These beat analyst estimates of $576 million for revenue and $0.74 for the EPS. At its earnings call, management shared that PTC's Creo software, used primarily in 3D printing applications, had led to an 11% annual recurring revenue (ARR) growth for its CAD business division.\n\nSo, as 3D printing stocks continue to prove to be an interesting bunch, we decided to see which stocks are finding favor with analysts. Analysts spend countless hours pouring over financial statements and business models to decide whether a firm can enhance its cash flow and shareholder value in the future. For 3D printing stocks, their take can provide important insight due to the hurdles that the industry faces with wide scale adoption and the stable potential offered by the software side. Some top 3D printing stocks in this list are Materialise NV (NASDAQ:MTLS), Stratasys Ltd. (NASDAQ:SSYS), and FARO Technologies, Inc. (NASDAQ:FARO). What happened to 3D printing stocks?\n\nminkus-aCniNTiIFd8-unsplash\n\nOur Methodology\n\nTo make our list of the top 3D printing stocks according to analysts, we ranked the constituents of the Solactive 3D Printing Index (CHF) and those selected in our coverage of 13 Best 3D Printing Stocks To Invest In by the average analyst share price target upside and picked out the top stocks. Moreover, for each of these stocks, we looked at how many hedge funds from our database held shares according to the last round of 13F filings. Hedge funds’ top 10 consensus stock picks outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). That’s why we pay very close attention to this underlooked indicator.\n\nWhat happened to 3D printing stocks?\n\n10. AMETEK, Inc. (NYSE:AME)\n\nAverage Analyst Share Price Upside: 10%\n\nAverage Analyst Share Price Target: $187.46\n\nAMETEK, Inc. (NYSE:AME) is a 3D printing hardware firm that sells printers and items such as coolers. The firm has beaten analyst EPS estimates in all four of its latest quarters, and it was out with a welcoming announcement for investors in May 2024. This announcement saw AMETEK, Inc. (NYSE:AME) declare a 28 cent quarterly dividend for the current quarter.\n\nAccording to Insider Monkey's data covering 933 hedge fund filings for 2023's fourth quarter, 37 had held stakes in AMETEK, Inc. (NYSE:AME). Phill Gross And Robert Atchinson's Adage Capital Management owned the most valuable stake which was worth $174 million.\n\nAlong with Materialise NV (NASDAQ:MTLS), Stratasys Ltd. (NASDAQ:SSYS), and FARO Technologies, Inc. (NASDAQ:FARO), AMETEK, Inc. (NYSE:AME) is a highly rated 3D printing stock according to analysts.\n\n9. PTC Inc. (NASDAQ:PTC)\n\nAverage Analyst Share Price Upside: 13%\n\nAverage Analyst Share Price Target: $203\n\nPTC Inc. (NASDAQ:PTC) is quite strongly rated when it comes to analyst sentiment. Data from 17 analysts shows that the average score is Strong Buy. Analyst coverage for the stock has been regular too, with multiple reiterations taking place in April and May. This month's ratings have been varied so far. Baird, Mizuho, and Citigroup reiterated their Outperform, Buy, and Neutral ratings, respectively. Baird increased PTC Inc. (NASDAQ:PTC)'s share price target to $216 from $210, Mizuho cut it to $200 from $210, and Citi slashed it by $8 to $187.\n\nOut of the 933 hedge fund SEC filings for Q4 2023 compiled by Insider Monkey, 47 mentioned PTC Inc. (NASDAQ:PTC). Among these hedge funds, the one with the most valuable stake was Stephen Mandel's Lone Pine Capital. It owned $554 million worth of shares.\n\n8. Align Technology, Inc. (NASDAQ:ALGN)\n\nAverage Analyst Share Price Upside: 21%\n\nAverage Analyst Share Price Target: $338.96\n\nAlign Technology, Inc. (NASDAQ:ALGN) is a medical devices manufacturer that functions on the consumer end of the 3D printing and additive manufacturing industry. Its shares have struggled in 2024 after having given up most of their gains in April and May. However, the recent first quarter earnings report saw Align Technology, Inc. (NASDAQ:ALGN)'s shares jump after EPS and revenue of $2.14 and $994 million exceeded $1.97 and $974 million in analyst estimates.\n\nBy December 2023 end, out of the 933 hedge funds part of Insider Monkey's database, 50 had owned Align Technology, Inc. (NASDAQ:ALGN)'s shares. The one who reported the largest stake among these was Ken Fisher's Millennium Management. Its stake at Q4 2023 end was worth $212 million.\n\n7. Proto Labs, Inc. (NYSE:PRLB)\n\nAverage Analyst Share Price Upside: 29%\n\nAverage Analyst Share Price Target: $41.5\n\nProto Labs, Inc. (NYSE:PRLB) is a manufacturing firm that relies on using 3D printing to work with metal parts. Its shares have performed well in May 2024 after a strong quarterly showing with a ~40% annual revenue growth for a $3.21 million beat. Year to date the stock has struggled and is down 15%.\n\nOut of the 933 hedge funds tracked by Insider Monkey at the end of last year, 19 were Proto Labs, Inc. (NYSE:PRLB)'s stakeholders. D. E. Shaw's D E Shaw owned the most valuable stake which was worth $20.5 million.\n\n6. Autodesk, Inc. (NASDAQ:ADSK)\n\nAverage Analyst Share Price Upside: 31%\n\nAverage Analyst Share Price Target: $287.44\n\nDesign software firm Autodesk, Inc. (NASDAQ:ADSK) is one of the more widely covered 3D printing stocks in the world. This is because its software is often indispensable to engineers and designers when they work with additive manufacturing. The shares are rated Buy on average, and the average analyst share price target is $287.44. However, Berenberg's slicing note in May 2024 downgraded the shares to Hold from Buy and set a $294 price target. The downgrade reflected Autodesk, Inc. (NASDAQ:ADSK)'s inability to file its annual report with the SEC.\n\nBy the end of 2023's final quarter, out of the 933 hedge funds in Insider Monkey's database, 46 had held stakes in Autodesk, Inc. (NASDAQ:ADSK). William Von Mueffling's Cantillon Capital Management reported the largest stake among these as it held $414 million worth of shares.\n\nMaterialise NV (NASDAQ:MTLS), Autodesk, Inc. (NASDAQ:ADSK), Stratasys Ltd. (NASDAQ:SSYS), and FARO Technologies, Inc. (NASDAQ:FARO) are some top rated analyst 3D printing stocks.\n\nClick here to continue reading and see What happened to 3D printing stocks? Top 5 Stocks.\n\nSuggested Articles:\n\n20 Countries with Highest Income Tax Rates in Europe 13 Countries for Unskilled Workers to Immigrate to Cathie Wood’s Latest Stock Portfolio: Top 10 Stock Picks\n\nDisclosure: None. What happened to 3D printing stocks? is originally published on Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/happened-3d-printing-stocks-111135583.html",
        "symbols": [
            "0HF7.LSE",
            "0HJF.LSE",
            "A1LG34.SA",
            "A1UT34.SA",
            "AAPL.US",
            "ADSK.MX",
            "ADSK.US",
            "AFW.BE",
            "AFW.F",
            "AFW.STU",
            "AK1.BE",
            "AK1.F",
            "AK1.STU",
            "ALGN.US",
            "AME.US",
            "AUD.DU",
            "AUD.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.017,
            "neu": 0.863,
            "pos": 0.12
        }
    }
]