[
    {
        "date": "2024-07-30T21:04:12+00:00",
        "title": "7 Top Defense Stock Picks Geopolitics Continues to Take Center Stage",
        "content": "Although a controversial sector, the concept of top defense stocks will likely become an increasingly important one. Primarily, circumstances in the geopolitical realm will likely worsen. At the same time, a critical election cycle could mean significant changes. Therefore, emotionally agnostic investors may consider the potential viability of this ecosystem.\n\nSeveral worrying catalysts come to mind. First, tensions in the Middle East could boil over, threatening regional stability. In addition, global oil supply chains could be disrupted, leading to severe economic consequences. Second, the war in Ukraine has shown no sign of abating. Add the possibility of an isolationist shift in U.S. foreign policy, and the conflict there may worsen.\n\nAt the same time this is going on, China has ambitions of its own. In other words, the U.S. can’t afford to let off the gas pedal. Cynically, such a framework may only serve to bolster top defense stocks. Below are several ideas to consider.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) Space Systems sign in Sunnyvale, California.\n\nSource: Ken Wolter / Shutterstock.com\n\nSpecializing in some of the most advanced systems in the aerospace field, Lockheed Martin (NYSE:LMT) is widely known for its fighter jets, such as the F-35 Lightning II. It also offers missile defense systems along with space communications systems. Due to the importance of air and space superiority in any future conflict that Western powers may find themselves in, demand for LMT stock should rise.\n\nIt’s not just a random musing. Lockheed enjoyed a strong showing in its second quarter, producing earnings per share of $6.85. This handily beat the projection calling for $6.46. Overall, the earnings surprise came out to 6%. In the past four quarters, the average EPS stood at $6.93, eclipsing the collective consensus view of $6.54.\n\nWhat makes LMT stock attractive is that it still trades for a relatively reasonable valuation. For example, between Q2 2023 and Q2 2024, the average sales multiple sat at 1.69x. Right now, the multiple comes in at 1.8x — higher but still reasonable.\n\nFor fiscal 2024, analysts anticipate that sales may rise to $71.08 billion, up 5.2% from the prior year. However, the high-side estimate of $72.13 billion could be realistic. With that, LMT is one of the top defense stocks to consider.\n\nNorthrop Grumman (NOC) United States Air Force Northrop Grumman (NOC) RQ-4B Global Hawk unmanned surveillance aircraft.\n\nSource: viper-zero / Shutterstock.com\n\nAnother top-tier name in the aerospace and defense industry, Northrop Grumman (NYSE:NOC), specializes in several fields. These include unmanned systems, cybersecurity, missile defense and space-related systems. Increasingly, nefarious agents are taking to connected networks to render damage or essentially hold entities financially hostage. Northrop can potentially address this critical area.\n\nStory continues\n\nWhat makes Northrop one of the credible defense stocks is the underlying financial performance. In Q2, the company posted EPS of $6.36, beating out the consensus target of $5.93. This yielded an earnings surprise of 7.2%. In the past four quarters, Northrop generated an average EPS of $6.03, exceeding the average target of $5.68.\n\nInterestingly, NOC stock appears relatively undervalued. Right now, shares trade hands at 1.76x trailing-year sales. However, in the past year since Q2, the average multiple stood at 1.81x.\n\nCircumstances could get even more favorable. In fiscal 2024, sales may rise to $41.31 billion, up 5.1% from the prior year’s haul of $39.29 billion. In fiscal 2025, revenue could bump up again to $42.95 billion. It’s one of the top defense stocks to consider.\n\nRTX (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nFormerly known as Raytheon Technologies, RTX (NYSE:RTX) has long represented one of the top defense stocks. One of its main specialties is missile systems. In addition, the company offers solutions involving radar, avionics and integrated defense networks. With tensions in multiple global regions turning sadly kinetic, the idea of missile defense systems will likely rise. Therefore, RTX stock should be cynically relevant.\n\nAs with other top defense stocks, RTX has put on a solid showing in Q2, posting EPS of $1.41. In contrast, analysts were anticipating earnings of $1.30 per share. That led to an earnings surprise of 8.61%. In the past year, the company posted an average EPS of $1.29, beating out the consensus view of $1.22.\n\nIt must be said that this enhanced performance comes at a cost. RTX trades at 2.16x sales, which is a bit pricier than some of its rivals. However, it’s not a terrible premium when considering the prior year’s print of 1.89x.\n\nMoreover, experts see sales shooting up to $79.41 billion, up 6.9% from last year’s tally of $74.31 billion. It’s easily one of the players to keep on your radar.\n\nGeneral Dynamics (GD) image of General Dynamics (GD) website, representing dividend stocks\n\nSource: Casimiro PT / Shutterstock.com\n\nProviding a vast portfolio of defense products and services, General Dynamics (NYSE:GD) has been one of the most relevant names among top defense stocks. That’s because it specializes in combat vehicles and, especially, weapons systems and munitions. The latter two categories have seen extensive use recently, underscoring their practicality and effectiveness when conflicts become kinetic.\n\nNow, it must be stated that GD stock is a higher-risk, higher-reward entity among top defense stocks. Unlike some of its peers, it slightly missed expectations in Q2, posting EPS of $3.26 against a target calling for $3.31. To be sure, the company also slightly missed earnings expectations in the past three quarters. However, Q3 2024 was strong, lifting the overall average into positive EPS territory.\n\nCurrently, GD stock trades at 1.77x sales. That’s on par with many other defense enterprises. In the past year, the metric sat at 1.68x.\n\nThe distinguishing factor for General Dynamics could be its sales front. Analysts see fiscal 2024 revenue hitting $48.07 billion. That’s up 13.7% from the prior year.\n\nL3Harris Technologies (LHX) An office building with the logo for L3Harris Industries visible on the building.\n\nSource: JennLShoots / Shutterstock.com\n\nSpecializing in advanced defense and commercial technologies, L3Harris Technologies (NYSE:LHX) covers all domains: air, land, sea, space and cyber. This integration of multiple domains will likely be critical in future conflicts. We’ve already seen how unmanned drones have been supremely effective against numerically superior forces. Thus, L3Harris should see increased demand as Western powers seek a technological edge.\r\n\r\nA key element moving in LHX stock’s favor is the financials. While not blisteringly impressive, L3Harris is getting the job done. In Q2, the company posted EPS of $3.24, beating the consensus view of $3.18. Over the past four quarters, the defense specialist’s average EPS landed at $3.14. This eclipsed experts’ target calling for $3.05.\n\nRight now, LHX stock trades hands at 2.06x sales. That’s a bit high compared to some other top defense stocks. However, in the past year, the metric was 2.1x. So, the valuation is relatively reasonable.\n\nFor fiscal 2024, analysts anticipate that sales may rise to $21.23 billion, up 9.3% from the prior year. In the following year, the top line could expand to $22.09 billion, up 4%.\n\nTextron (TXT) Bell Boeing V-22 Osprey shown during a flight demo.\n\nSource: Angel DiBilio / Shutterstock.com\n\nA multi-industry company mainly covering the aerospace solutions segment, Textron (NYSE:TXT) is perhaps best known for partnering with other companies to develop the V-22 Osprey aircraft. The company also has its hands in developing advanced land vehicles. In future conflicts, rapid deployment of special military operators may be crucial. Therefore, TXT stock could see significant demand in the years ahead.\n\nFinancially, Textron is usually consistent, though sometimes it slightly misses expectations. In Q2, it was firing on all cylinders, posting an EPS of $1.54 against a consensus view of $1.47. This produced an earnings surprise of 4.7%. In the past year, Textron posted an average EPS of $1.44, beating the average forecast of $1.32.\n\nRelative to other top defense stocks, TXT appears to be a bargain, trading at 1.28x sales. Between Q1 2023 to Q1 2024, the average metric sat at 1.2x.\n\nLooking out to year’s end, sales may reach $14.5 billion, up 6% from last year’s tally of $13.7 billion. In the following year, the top line might rise to $15.35 billion, up another 6%.\n\nKratos Defense (KTOS) The front of a Kratos (KTOS) office in Silicon Valley.\n\nSource: Michael Vi / Shutterstock.com\n\nOne of the higher-risk, higher-reward ideas among top defense stocks, Kratos Defense (NASDAQ:KTOS) just might see some awareness burgeon over the next several years. The company focuses on unmanned systems, which as stated before, is becoming a critical component of defense. Should conflicts erupt in more parts of the world, it’s reasonable to assume that demand for KTOS stock will blossom.\n\nWhile it’s a smaller enterprise compared to its peers on this list, that’s what makes Kratos so compelling. Its Q2 report will be coming up shortly on Thursday. However, if it’s anything like Q1 — when Kratos posted EPS of 11 cents against a target of 5 cents — investors may see a significant pop higher. In the past year since Q1 2023, the average earnings surprise has clocked in at around 70%.\n\nNow, the performance comes at a cost: KTOS stock trades hands at 2.8x revenue. That’s also higher than the prior year’s average multiple of 2.15x.\n\nStill, analysts believe that by year’s end, sales may rise to $1.15 billion, up 11.1%. In the following year, the top line could jump to $1.28 billion, up 10.7%.\n\nOn the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nA former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post 7 Top Defense Stock Picks Geopolitics Continues to Take Center Stage appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/7-top-defense-stock-picks-210412889.html",
        "symbols": [
            "0IUC.LSE",
            "0JS0.LSE",
            "0K92.LSE",
            "0LF0.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "GD.MX",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.XETRA",
            "KTOS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.055,
            "neu": 0.828,
            "pos": 0.117
        }
    },
    {
        "date": "2024-07-30T19:32:17+00:00",
        "title": "Q3’s Rising Stars: 8 Dividend Stocks for Your Must-Watch List",
        "content": "Dividend stocks are a must-own component for any investor looking to establish serious wealth. We all know the statistic that the S&P 500 has returned 10.5% annually on average since its creation in 1957. It is one of the reasons the index is considered the benchmark against which we should compare our portfolios.\n\nWhat’s not as well known is that over the past 60 years, dividends have made up 85% of the index’s total return. Without dividend stocks and the reinvestment of those payouts, the S&P 500 would offer meager gains.\n\nAs a dividend growth investor, I’m looking to juice my returns even more. I want to see the dividend stocks I own grow their payouts over time, often by double-digit percentages. What follows is a list of top dividend stocks to watch. They are companies that have a strong history of rewarding shareholders by ever-increasing amounts. Not all will be increasing their payouts by 10% or more, but many do. All of them deserve a place on your watch list for the third quarter to buy and hold for the long term.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nAutomatic Data Processing (ADP) In this photo illustration the stock market information of Automatic Data Processing, Inc. displays on a smartphone with the logo of Automatic Data Processing, Inc. ADP stock.\n\nSource: IgorGolovniov / Shutterstock\n\nPayroll processor Automatic Data Processing (NYSE:ADP) is the first dividend stock to watch. Hardly a hidden gem, it is more a diamond in the rough since many investors ignore it because it is so ubiquitous.\n\nFounded in 1949 and going public 12 years later, ADP has a long history of paying its shareholders a dividend. It made its first quarterly payment in 1974 and has reliably raised the payout for 49 consecutive years. It is about to become a Dividend King, or a stock that has raised its dividend for 50 years or more. The payout yields 2% annually.\n\nMore remarkable is that the payroll leader has been increasing the payment at a compounded annual growth rate (CAGR) of over 11% annually for the past decade. Because its business throws off so much cash it can reward shareholders over time. ADP generated $3.6 billion in free cash flow (FCF) last year while paying out $1.9 billion in dividends. Its free cash flow payout ratio of 52% means the dividend is safe, well-supported and has plenty of room for future growth.\n\nADP stock is up only 8% so far in 2024. With Wall Street forecasting earnings growth of 10% annually for the next five years, it makes it a great time to buy the stock.\n\nWendy’s (WEN) a Wendy's (WEN stock) sign\n\nSource: Jonathan Weiss / Shutterstock.com\n\nFast-food chain Wendy’s (NASDAQ:WEN) is probably more of a surprise as a rising dividend star. The burger joint began paying dividends 20 years ago and has raised the payout at a whopping 17% CAGR for the last 10 years. It is even better in more recent periods with the quick-serve restaurant growing its dividend at 19% a year for the last five years.\n\nStory continues\n\nWendy’s payout is also well-supported as it generates substantial FCF. Cash profits have grown 10% annually over the last decade and at a rate exceeding 21% a year for the past five years. While its FCF payout ratio is on the high side at 80%, it does show there are sufficient profits to keep making payments. The dividend yield 6% annually.\n\nThe quick-serve restaurant has bolstered its business fundamentals, too. It improved its menu through innovation and the launch of breakfast options. Store remodels and positioning itself as a value meal destination have helped make it a favorite destination for customers. That’s evident in stable same-restaurant sales growth.\n\nOften overshadowed by rivals McDonald’s (NYSE:MCD) and Burger King, Wendy’s stock earns its place on your watch list.\n\nAflac (AFL) the Aflac (AFL) logo on an office building\n\nSource: Ken Wolter / Shutterstock.com\n\nLife insurance giant Aflac (NYSE:AFL) deserves a seat at the table. Hurt by the pandemic and the wave of claims that ensued, Aflac has worked diligently to build up its bottom line again. Notably, the global health crisis did not impact its dividend. The insurer continued making its payout through the turmoil, adding to its 41-year history of making and raising its dividend payment.\n\nAlthough increases slowed during that period, for the last five years it has hiked its dividend by 13% a year. It also sports a low FCF payout ratio of just 30%, meaning it has plenty of opportunity to raise the dividend by substantial amounts. The dividend yields 2.1% annually.\n\nLike death and taxes, life insurance will always be with us and will protect our financial security from at least one of those eventualities. This benefits Aflac with a reliable, steady stream of profitable revenue.\n\nWith claim costs falling, new products added and the past few years of strong net interest income due to the high interest rate environment, Aflac is on a firm financial foundation and a dividend stock to watch.\n\nCostco (COST) A Costco Wholesale (COST) warehouse in Auburn Hills, Michigan.\n\nSource: ilzesgimene / Shutterstock.com\n\nWarehouse club Costco (NASDAQ:COST) has been a tremendous dividend stock to own that has grown its payout at double-digit rates. The retailer’s dividend has expanded at a 13% CAGR over the last five- and 10-year periods, but it has a 20-year track record of raising the payout. The retailer’s dividend yields only 0.6% annually. Yet, if you only focus on that, you miss the bigger picture.\n\nCostco’s dividend has grown from $1.21 per share in 2013 to $4.64 per share today. More rewarding is the fact that Costco often rewards shareholders with a special dividend payment. Last December it announced a $15 per share dividend payment for investors and has made similar extra payments in 2012, 2015, 2017 and 2020 for varying amounts.\n\nThe warehouse club is able to grow and support its dividend because it is a profit-producing machine. Earnings over the last five years are up 88% and they’ve more than tripled over the past decade. The stock itself is up 48% over the last 12 months.\n\nAlthough shares pulled back 9% after it raised its membership fees for the first time in seven years, that represents an opportunity for shareholders. Those extra revenues will flow straight through to the bottom line.\n\nRTX (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nDefense contractor RTX (NYSE:RTX) will deliver some offense to your portfolio. Shares are up 37% this year as demand for weapons systems grows. It manufactures numerous defense systems but missile systems are one of its primary outputs.\n\nIn its just reported second-quarter earnings, its Raytheon division saw a 4% increase in adjusted sales to $6.5 billion. Patriot and Stinger missile systems, along with anti-drone systems, helped lift the total. Raytheon accounts for one-third of total revenue.\n\nHowever, Collins Aerospace could quickly become RTX’s crown jewel. The commercial aviation business saw sales rise 10% with operating profits surging 24% year-over-year. It could see sustained growth in the years ahead as the commercial aerospace manufacturing sector grows.\n\nRTX pays a dividend of $2.52 that yields 2.2% annually. It has paid a dividend every year since 1936 and has raised it for 30 consecutive years. So, this rising star should be on your watchlist.\n\nAmerican Tower (AMT) American Tower Corporation logo on a smartphone with the website in the background on a computer screen. AMT stock.\n\nSource: T. Schneider / Shutterstock\n\nSpecialty real estate investment trust (REIT) American Tower (NYSE:AMT) leases cellular towers to wireless service providers, and radio and television broadcast companies under long-term leases. More recently it expanded into data centers where it owns 28 facilities.\n\nAmerican Tower is the biggest owner-operator of towers with over 224,000 communications sites globally. In the U.S., Statista says there are 129 companies that own towers. Yet, 75% of them belong to just three companies, and AMT is the largest, owning one-third of them. Other analysts suggest American Tower has a 63% market share.\n\nThat’s important for American Tower’s future growth as mobile communications rapidly expand. More and better coverage will be insisted upon by wireless carrier customers.\n\nAMT has raised its dividend by more than 16% annually for the last 10 years while growing FCF at a 12% CAGR. Over the last five years, FCF has grown nearly 18% annually. It makes the specialty REIT a dividend stock to watch.\n\nDick’s Sporting Goods (DKS) An image of a Dick's Sporting Goods retail location\n\nSource: Jonathan Weiss / Shutterstock.com\n\nInvestors hit a home run with Dick’s Sporting Goods (NYSE:DKS). The sporting goods retailer stock is up 45% in 2024, has doubled over the past three years and is up nearly 460% over the last five. Equally impressive are its dividend stats.\n\nOver the past decade, DKS has increased its payout by a 24% CAGR, but in the last five years that has swelled to almost 32%. As FCF growth has kept pace, the sporting goods retailer has a low 32% FCF payout ratio.\n\nWhile consumers can buy their sporting goods equipment and apparel from any number of retailers, online or off, they have increasingly chosen Dick’s as the place to shop. As the largest pure-play sporting goods retailer, it benefits from having everything under one roof. With strong partners like Nike (NYSE:NKE) and Adidas (OTCMKTS:ADDYY), Dick’s can meet the current trends in sports and athleisure fashion.\n\nIt might not have much of a competitive moat, but Dick’s Sporting Goods has exploited its position to good effect. It is why the retailer is a top dividend stock to watch.\n\nJPMorgan Equity Premium Income ETF (JEPI) the word \"etf\" spelled out in many yellow cubes against a background of many black cubes\n\nSource: shutterstock.com/Imagentle\n\nFor investors who might want broad coverage and not go through the process of buying individual stocks, exchange-traded fund (ETF) JPMorgan Equity Premium Income ETF (NYSEARCA:JEPI) is one to consider. It pays its dividends monthly and offers a rich 6.5% yield.\n\nJEPI, as the ETF is known, seeks to deliver income by both investing in large cap stocks and trading options. It wants most of its returns to be associated with the S&P 500 index but with less volatility. Its top three holdings are Progressive (NYSE:PGR), TraneTechnologies (NYSE:TT) and Amazon (NASDAQ:AMZN). Yet if you look over its biggest positions, you notice they are not exactly high-yielding stocks. So how does JEPI generate such big yields?\n\nIt does so by investing up to 20% of its portfolio into equity-linked notes (ELN), essentially an advanced covered call option. JEPI collects premiums from buyers of those options. So, most of the dividends JEPI pays are from those premiums. The ETF tends to perform better during volatile market periods, especially down markets. It can often serve as a hedge for such times.\n\nYet the ETF is not for everyone. Because of the ELNs, a portion of its dividend payments are taxable, meaning JEPI is best held in a tax-deferred account. This ultra-high-yield stock may be best for those about to retire or who are retired and looking for immediate dividend income. But it is still a dividend stock to watch.\n\nOn the date of publication, Rich Duprey held a LONG position in RTX stock. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nRich Duprey has written about stocks and investing for the past 20 years. His articles have appeared on Nasdaq.com, The Motley Fool, and Yahoo! Finance, and he has been referenced by U.S. and international publications, including MarketWatch, Financial Times, Forbes, Fast Company, USA Today, Milwaukee Journal Sentinel, Cheddar News, The Boston Globe, L’Express, and numerous other news outlets.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post Q3’s Rising Stars: 8 Dividend Stocks for Your Must-Watch List appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/q3-rising-stars-8-dividend-193217801.html",
        "symbols": [
            "0H68.LSE",
            "0HEU.LSE",
            "5UR.F",
            "5UR.XETRA",
            "A0T.F",
            "A0T.STU",
            "ADP.US",
            "AFL.BE",
            "AFL.DU",
            "AFL.F",
            "AFL.MU",
            "AFL.US",
            "AFL.XETRA",
            "AMT.US",
            "AMZN.US",
            "COST.US",
            "DKS.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.023,
            "neu": 0.85,
            "pos": 0.127
        }
    },
    {
        "date": "2024-07-30T15:45:58+00:00",
        "title": "The Top 3 Manufacturing Stocks to Buy Now: Summer 2024",
        "content": "It’s been a rough month for manufacturing stocks. The reading on manufacturing activity is one of the most closely watched economic reports. In July, the S&P Global Flash U.S. Manufacturing Purchasing Managers Index came in at 49.5. The number was lower than estimated at 51.7, approximately equal to the 49 registered in July 2023. It also was the lowest reading recorded since November 2023.\n\nAny number under 50 indicates contraction, which is another example of an economy that continues to take one step forward and two steps back. At least that’s the perception. And since perception often reflects investor sentiment, it’s unsurprising that many manufacturing stocks are doing poorly.\n\nHowever, in many cases, that sentiment can be misdirected. It takes a little digging, but if you look at the sectors driving the economy, you can find some manufacturing stocks offering upside. And if money continues to rotate away from the tech sector, there may still be strong gains.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nHoneywell International (HON) Quantum Computing Stocks - Honeywell (HON)\n\nInvestors can argue that diversification is a good strategy, but it’s one of the arguments for Honeywell International (NYSE:HON). The company is exposed to both the technology and manufacturing sectors. Its business units include building technologies, performance materials and technologies, safety and productivity solutions, and aerospace. The latter includes investments in the emerging eVTOL (electric vertical take-off and landing) vehicle sector.\n\nHoneywell was one of the first companies to report quarterly earnings, delivering beats in revenue and earnings. The numbers were also higher year-over-year. Still, HON stock dropped approximately 5% after the earnings reports on concerns about weaker guidance. That turned a stock already underperforming the market into negative territory for the year.\n\nHowever, the company continues executing a disciplined growth strategy through mergers and acquisitions. That will take some time to play out. In the meantime, it’s maintaining its free cash flow at year-over-year levels.\n\nAnalysts are lowering their price targets after earnings but still give the stock a consensus “Buy” rating. The company has increased its dividend for 13 years and is on track to announce another dividend increase in its upcoming quarter.\n\nRTX (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nRTX (NYSE:RTX) is another manufacturer that delivered strong earnings. Diversification is a story here, as RTX is a leading aerospace and defense contractor. The company provides the Patriot and Javelin missiles that NATO and Israel have used. Its engines also power the engines of the F15 and F16 fighter jets. The company’s business also touches on the growing space economy.\n\nStory continues\n\nThis ability to impact many verticals was reflected in the earnings report. RTX, formerly known as Raytheon, beat on the top and bottom lines. Both numbers were also higher year-over-year. The company also raised its full-year guidance.\n\nAnalysts quickly boosted their price targets for RTX stock, which is already up 35% in 2024. Traders looking to buy the stock may want to wait for an opportunistic pullback. However, as a long-term investment, RTX has been a solid performer with a total return of over 63% in the last five years.\n\nHillenbrand (HI) Hillenbrand's (HI) corporate headquarters in Batesville, Indiana. Hillenbrand is a producer of machinery and equipment.\n\nSource: smoothsails / Shutterstock.com\n\nIf small-cap stocks are more your thing, Hillenbrand (NYSE:HI) may be a name to watch. There’s been a conscious rotation away from mega-cap technology stocks, and small-cap stocks like Hillebrand are benefiting. Hillenbrand delivers processing technologies in extrusion, material handling, and injection molding.\n\nHI stock is up over 10% in the last month. Having said that, the stock is still down 7.3% in 2024. That’s largely due to a revenue miss in the first quarter, which was due, in part, to slower-than-expected final customer decisions. The company also guided lower sales during the full year.\n\nThat said, positive customer decisions may be more forthcoming if the Federal Reserve lowers interest rates as expected in the back half of the year. That would seem to be the opinion of analysts with a “Strong Buy” rating on HI stock with a $56.80 price target of 28% above its closing price on July 26, 2024.\n\nAnd it’s important to note that Hillebrand pays a dividend growing for 17 consecutive years. The dividend yield of 2.01% is higher than the sector’s median of 1.43%.\n\nOn the date of publication, Chris Markoch did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly orindirectly) any positions in the securities mentioned in this article.\n\nChris Markoch is a freelance financial copywriter who has been covering the market for over five years. He has been writing for InvestorPlace since 2019.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post The Top 3 Manufacturing Stocks to Buy Now: Summer 2024 appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/top-3-manufacturing-stocks-buy-154558375.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "9HI.F",
            "ALD.BE",
            "ALD.DU",
            "ALD.F",
            "ALD.HA",
            "ALD.HM",
            "ALD.MU",
            "ALD.STU",
            "ALD.XETRA",
            "HI.US",
            "HON.MX",
            "HON.NEO",
            "HON.US",
            "HONB34.SA",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.034,
            "neu": 0.87,
            "pos": 0.096
        }
    },
    {
        "date": "2024-07-30T00:00:00+00:00",
        "title": "The Top 3 Manufacturing Stocks to Buy Now: Summer 2024",
        "content": "If money continues to rotate away from the tech sector there may be some strong gains in these manufacturing stocks.",
        "link": "https://investorplace.com/2024/07/the-top-3-manufacturing-stocks-to-buy-now-summer-2024/",
        "symbols": [
            "HI.US",
            "HON.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.691,
            "neg": 0,
            "neu": 0.759,
            "pos": 0.241
        }
    },
    {
        "date": "2024-07-30T00:00:00+00:00",
        "title": "Q3&#039;s Rising Stars: 8 Dividend Stocks for Your Must-Watch List",
        "content": "These seven dividend stocks to watch can enhance your portfolio's return by providing both growth and income.",
        "link": "https://investorplace.com/2024/07/q3s-rising-stars-8-dividend-stocks-for-your-must-watch-list/",
        "symbols": [
            "ADP.US",
            "AFL.US",
            "AMT.US",
            "COST.US",
            "DKS.US",
            "RTX.US",
            "WEN.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.382,
            "neg": 0,
            "neu": 0.86,
            "pos": 0.14
        }
    },
    {
        "date": "2024-07-30T00:00:00+00:00",
        "title": "7 Top Defense Stock Picks Geopolitics Continues to Take Center Stage",
        "content": "The idea of top defense stocks is controversial. However, with conflicts rising in many parts of the world, it’s also relevant.\n",
        "link": "https://investorplace.com/2024/07/7-top-defense-stock-picks-geopolitics-continues-to-take-center-stage/",
        "symbols": [
            "GD.US",
            "KTOS.US",
            "LHX.US",
            "LMT.US",
            "NOC.US",
            "RTX.US",
            "TXT.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.273,
            "neg": 0.178,
            "neu": 0.688,
            "pos": 0.134
        }
    }
]