[
    {
        "date": "2024-07-22T21:27:16+00:00",
        "title": "Summer travel boom not enough to fire up airline earnings",
        "content": "Record summer travel demand was tipped to translate into bumper earnings for airlines - but quarterly reports are looking less than stellar.",
        "link": "https://www.reuters.com/business/aerospace-defense/summer-travel-boom-not-enough-fire-up-airline-earnings-2024-07-22/",
        "symbols": [
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.064,
            "neg": 0.059,
            "neu": 0.941,
            "pos": 0
        }
    },
    {
        "date": "2024-07-22T17:26:01+00:00",
        "title": "Anti-drone laser fires from British Army vehicle for first time",
        "content": "The test fire took place at the Government's Porton Down science and defence technology campus in Wiltshire - Raytheon\n\nA high-powered laser weapon capable of shooting down aerial drones has been fired from a British military vehicle for the first time.\n\nRaytheon’s high-energy laser weapon system (HELWS) was mounted on a British Army Wolfhound armoured truck for the test-fire, which took place at the Government’s Porton Down science and defence technology campus in Wiltshire.\n\nIt is the first time the weapon has been trialled in the UK as part of an ongoing Ministry of Defence (MoD) programme to develop directed energy weapons.\n\nHELWS, which is already cleared for use by the US military, is designed to shoot down small drones and be compatible with existing air defence systems such as radar.\n\nADVERTISEMENT\n\nDeveloping anti-drone systems is increasingly important as low-cost weapons become more common on the battlefield. For example, Russia and Ukraine have relied heavily on drones to launch attacks on one another.\n\nBritish and American ships were recently forced to fire multimillion-pound missiles to shoot down inexpensive unmanned drones launched by Houthi rebels on the Red Sea.\n\nShooting down drones with lasers, which cost far less per shot than the drones themselves, offers a much cheaper solution.\n\nJames Gray, chief executive and managing director of Raytheon UK, said: “We have proven that the Raytheon high-energy laser weapon system can track and engage targets whilst mounted on a vehicle.\n\n“The speed at which this capability was delivered is only possible due to the hard work of our British partners, coupled with the operationally proven technology developed by Raytheon.”\n\nUK-based companies including Frazer Nash, NP Aerospace, LumOptica, Blighter Surveillance Systems and Cambridge Pixel contributed technology to the project.\n\nThe test comes after the MoD demonstrated Dragonfire, another laser weapon that the Navy hopes to mount on to warships by 2027.\n\nDragonfire was developed by a consortium including MBDA, Leonardo and QinetiQ.\n\nRaytheon’s HELWS is being developed in partnership with the Defence Science and Technology Laboratory (DSTL) and Defence Equipment and Support (DE&S), which are both part of the MoD.\n\nStory continues\n\nMatt Cork, of DSTL, said: “The joint working between DSTL, DE&S and industry has enabled rapid evolution of this laser demonstrator.\n\n“The successful testing of this high-powered laser weapon marks a pivotal moment in our ongoing efforts to enhance the future operational capabilities of the British Army.\n\nHe added: “This technology offers a precise, powerful and cost-effective means to defeat aerial threats, ensuring greater protection for our forces.”",
        "link": "https://uk.finance.yahoo.com/news/anti-drone-laser-fires-british-172601944.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.897,
            "neg": 0.111,
            "neu": 0.797,
            "pos": 0.092
        }
    },
    {
        "date": "2024-07-22T16:19:15+00:00",
        "title": "Britain tests Raytheon's anti-drone laser from military vehicle",
        "content": "The British Army has carried out its first test of Raytheon's anti-drone laser weapon from a military vehicle, the company said on Monday, in the latest sign that drone warfare is a growing priority for Western armed forces.",
        "link": "https://www.reuters.com/business/aerospace-defense/britain-tests-raytheons-anti-drone-laser-military-vehicle-2024-07-22/",
        "symbols": [
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.402,
            "neg": 0.113,
            "neu": 0.844,
            "pos": 0.043
        }
    },
    {
        "date": "2024-07-22T12:12:00+00:00",
        "title": "Cebu Pacific Celebrates Agreement for up to 152 A321neo Aircraft Order with Airbus, RTX's Pratt &amp; Whitney",
        "content": "Largest aircraft order in Philippine aviation history\n\nLONDON, July 22, 2024 /PRNewswire/ -- Farnborough Air Show – Cebu Pacific (CEB), Airbus, and Pratt & Whitney, held an official ceremony to commemorate a memorandum of understanding (MOU) signed for CEB's purchase of up to 152 A321neo aircraft for estimated USD $24 billion (PHP 1.4 trillion) based on list prices, the largest aircraft order in Philippine aviation history. Pratt & Whitney is an RTX (NYSE: RTX) business.\n\nThe binding MOU covers firm orders for up to 102 A321neo, plus 50 A320neo family purchase rights. CEB has selected Pratt & Whitney GTF™ engines to power the future aircraft.\n\n\"The order is designed to give Cebu Pacific the flexibility to choose between the A321neo and A320neo aircraft as needed, helping us adapt to market changes,\" said Michael Szucs, chief executive officer of CEB. \"This deal is a significant milestone in our ongoing mission to make air travel more accessible and affordable for everyone while supporting the Philippine growth story.\"\n\nAirbus said the MOU is a testament to the airline's confidence in its products and a positive signal for the aviation industry's recovery.\n\n\"We thank Cebu Pacific for its ongoing confidence in Airbus and its products. These latest generation aircraft will enable the carrier to reduce its operating costs and continue to offer low fares in a competitive market environment. We look forward to continuing to work with the airline as it builds on its position as one of the leading low-cost carriers in the Asia-Pacific region,\" said Benoît de Saint-Exupéry, executive vice president sales of Commercial Aircraft at Airbus.\n\nPratt & Whitney expressed gratitude for CEB's continued confidence in the GTF engine, which the airline initially selected in 2012.\n\n\"This latest order demonstrates the growing opportunities for aviation in the Philippines and the larger Asia Pacific region,\" said Rick Deurloo, president of Commercial Engines at Pratt & Whitney. \"Our GTF engine will power this growth while delivering industry-leading fuel efficiency and sustainability benefits for single-aisle aircraft. Cebu Pacific's order attests to the value it provides.\"\n\nThe purchase agreement to finalize this transaction is expected to be completed in the third quarter of the year.\n\nAbout Cebu Pacific Cebu Pacific (CEB), the Philippines' leading airline, entered the aviation industry on March 8, 1996 and pioneered the \"low fare, great value\" strategy. It has flown over 200 million passengers since inception. CEB offers the widest domestic network in the Philippines with 35 domestic destinations. It also currently operates flights to 25 international destinations, spanning across Asia, Australia, and the Middle East.\n\nStory continues\n\nAbout Airbus Airbus pioneers sustainable aerospace for a safe and united world. The Company constantly innovates to provide efficient and technologically -advanced solutions in aerospace, defence, and connected services. In commercial aircraft, Airbus designs and manufactures modern and fuel-efficient airliners and associated services. Airbus is also a European leader in space systems, defence and security. In helicopters, Airbus provides efficient civil and military rotorcraft solutions and services worldwide.\n\nAbout Pratt & Whitney Pratt & Whitney is a world leader in the design, manufacture and service of aircraft engines and auxiliary power units. To learn more, visit www.prattwhitney.com.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact:\n\nCebu Pacific cebcorpcommteam@cebupacificair.com\n\nAirbus media@airbus.com\n\nPratt & Whitney corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/cebu-pacific-celebrates-agreement-for-up-to-152-a321neo-aircraft-order-with-airbus-rtxs-pratt--whitney-302202659.html\n\nSOURCE RTX",
        "link": "https://finance.yahoo.com/news/cebu-pacific-celebrates-agreement-152-121200620.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.01,
            "neu": 0.849,
            "pos": 0.141
        }
    },
    {
        "date": "2024-07-22T11:53:00+00:00",
        "title": "Raytheon's High-Energy Laser Weapon System fired from UK military vehicle for first time",
        "content": "Major milestone speeds up UK's adoption of laser technology\n\nLONDON, July 22, 2024 /PRNewswire/ -- Raytheon UK, Defence Science and Technology Laboratory (Dstl) and Defence Equipment and Support (DE&S) have successfully tested Raytheon's High-Energy Laser Weapon System (HELWS) integrated onto a British Army combat vehicle, the first test of its kind in the UK. The UK’s first test of a High-Energy Laser Weapon System (HELWS) was successfully completed by Raytheon UK and the Defence Science and Technology Laboratory (Dstl)\n\nThis ground-breaking test, conducted at Dstl's range in Porton Down, saw the laser weapon fired at full power whilst integrated onto a British Army Wolfhound armoured vehicle. The lightweight, portable HELWS is the first laser weapon integrated on a land vehicle to be fired in the UK.\n\nThis milestone marks a major leap forward in the UK Ministry of Defence's Land Laser Directed Energy Weapon (LDEW) Demonstrator programme. The increasing prevalence, proliferation and evolution of drone warfare makes the rapid adoption of counter-UAS technologies ever more important.\n\nThis variant of the HELWS has been designed to defeat NATO class 1 drones whilst being easily compatible within existing air defence systems, including radar, command and control and other platforms.\n\n\"We have proven that the Raytheon high energy laser weapon system can track and engage targets whilst mounted on a vehicle,\" said James Gray, chief executive and managing director of Raytheon UK. \"The speed at which this capability was delivered is only possible due to the hard work of our British SME partners, coupled with the operationally proven technology developed by Raytheon.\"\n\nThe Wolfhound integration successfully fused the proven capability of Raytheon's High-Energy Laser Weapon System with cutting edge UK intellectual property from Frazer Nash, NP Aerospace, LumOptica, Blighter Surveillance Systems, and Cambridge Pixel.\n\n\"As Defence Secretary, I want to take the politics out of national security so where there is important work begun under the previous government, we will take it forward in the interest of national security,\" said Secretary of State for Defence, the Rt Hon John Healey MP. \"That is why we are renewing important partnerships with industry and continuing to push technological boundaries. This will drive prosperity and create skilled jobs across the country.\"\n\nTeam Hersa, which pairs Dstl's technical expertise with the best acquisition skills from DE&S, is managing delivery of the demonstrators and is responsible for preparing Defence for the introduction of innovative weapons systems, ensuring the UK Armed Forces can successfully exploit this potentially game changing capability at pace.\n\nStory continues\n\n\"The joint working between Dstl, DE&S and industry has enabled rapid evolution of this laser demonstrator. The successful testing of this high-powered laser weapon marks a pivotal moment in our ongoing efforts to enhance the future operational capabilities of the British Army,\" said Matt Cork, Dstl Programme Lead. \"This technology offers a precise, powerful and cost-effective means to defeat aerial threats, ensuring greater protection for our forces.\"\n\nRaytheon's HELWS is certified for use in combat with US forces, with multiple systems now in service. The system has logged more than 40,000 testing hours and downed more than 400 targets.\n\nThe next phase of testing for the UK will allow British Army soldiers to familiarise themselves with the system and refine requirements for future capability.\n\nAbout Raytheon UK\n\nWith over 2,000 employees in the UK, Raytheon UK is a major supplier and systems integrator to the UK Ministry of Defence that designs, develops and manufactures defence and space products. The company is also a leading provider of training transformations services and continues to invest in research and development, supporting innovation and technological advances across the country. Raytheon UK is part of RTX's Raytheon business.\n\nAbout RTX\n\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com. Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/raytheons-high-energy-laser-weapon-system-fired-from-uk-military-vehicle-for-first-time-302202642.html\n\nSOURCE RTX",
        "link": "https://finance.yahoo.com/news/raytheons-high-energy-laser-weapon-115300894.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.99,
            "neg": 0.065,
            "neu": 0.805,
            "pos": 0.13
        }
    },
    {
        "date": "2024-07-22T11:32:00+00:00",
        "title": "SMBC Aviation Capital confirms an additional 42 Airbus A320neo family aircraft powered by RTX's Pratt &amp; Whitney GTF™ engines",
        "content": "One of the largest GTF engine lessors now owns, manages, and has firm commitments for 142 GTF-powered aircraft\n\nLONDON, July 22, 2024 /PRNewswire/ -- Farnborough Air Show  — Pratt & Whitney, an RTX (NYSE: RTX) business, today announced SMBC Aviation Capital, one of the largest lessors for GTF- powered A320neo family aircraft, has exercised options for 22 firm orders. This is supplemental to a 2021 order for 20 additional firm aircraft, bringing the lessor's additional commitment to 42 firm A320neo family aircraft equipped with GTF engines.\n\nSMBC Aviation Capital announced its initial selection for 50 firm Pratt & Whitney A320neo family aircraft in 2019, and currently manages a portfolio of 142 GTF-powered A320neo family aircraft. Today's announcement affirms the relationship between two global leaders in the aviation space.\n\n\"We appreciate SMBC Aviation Capital's continued confidence in Pratt & Whitney as we work together to deliver economic and environmental benefits for airline customers,\" said Rick Deurloo, president of Commercial Engines at Pratt & Whitney. \"These additional orders are a testament to the advantages this engine delivers as the most fuel-efficient, sustainable engine for single-aisle aircraft.\"\n\n\"SMBC Aviation Capital is pleased to confirm these latest technology engines reflecting our underlying commitment to invest in the most fuel efficient and sustainable aircraft types, which our customers want to operate,\" said Barry Flannery, CCO of SMBC Aviation Capital.\n\nABOUT SMBC AVIATION CAPITAL: SMBC Aviation Capital is the second largest aircraft lessor in the world. Benefitting from the strong support of its shareholders Sumitomo Mitsui Financial Group and Sumitomo Corporation, SMBC Aviation Capital has a high-quality global airline customer base with a portfolio comprising 83% narrow-body aircraft and 66% new technology aircraft (by net book value). SMBC Aviation Capital has a strong capital position and holds an A- and BBB+ rating with S&P and Fitch respectively, reflecting the long-term strength of its business. For more information, please visit: https://www.smbc.aero/\n\nAbout Pratt & Whitney \r\nPratt & Whitney is a world leader in the design, manufacture and service of aircraft engines and auxiliary power units. To learn more visit www.prattwhitney.com.\n\nAbout RTX\r\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com. Cision\n\nView original content:https://www.prnewswire.com/news-releases/smbc-aviation-capital-confirms-an-additional-42-airbus-a320neo-family-aircraft-powered-by-rtxs-pratt--whitney-gtf-engines-302202630.html\n\nSOURCE RTX",
        "link": "https://finance.yahoo.com/news/smbc-aviation-capital-confirms-additional-113200003.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.006,
            "neu": 0.863,
            "pos": 0.131
        }
    },
    {
        "date": "2024-07-22T10:30:00+00:00",
        "title": "RTX completes preliminary design review of hybrid-electric Pratt &amp; Whitney GTF™ engine demonstrator for Clean Aviation SWITCH project",
        "content": "Hybrid-electric propulsion technology has potential to increase efficiency and reduce emissions for future aircraft applications\n\nLONDON, July 22, 2024 /PRNewswire/ -- Farnborough Air Show — RTX (NYSE: RTX) today announced the completion of the preliminary design review for the hybrid-electric propulsion demonstrator engine being developed as part of the SWITCH project, supported by the European Union's Clean Aviation Joint Undertaking (Clean Aviation). By combining two Collins Aerospace megawatt-class electric motor generators within a Pratt & Whitney GTF™ engine, the hybrid-electric propulsion system aims to enhance engine efficiency across all phases of flight, offering the potential to reduce fuel burn and emissions for future short- and medium-range aircraft.\n\n\"Completing the preliminary design review is a significant milestone toward demonstrating the potential of hybrid-electric technology to further enhance the performance and efficiency of next generation aircraft propulsion systems,\" said Juan de Bedout, chief technology officer, RTX. \"We are leveraging our growing expertise in the field of hybrid-electric propulsion, including close collaboration between Pratt & Whitney, Collins Aerospace and all members of the SWITCH consortium.\"\n\nThe SWITCH hybrid-electric propulsion system comprises two megawatt-class electric motor generators mounted on the low spool and high spool of the GTF engine, along with associated motor controllers, high voltage wiring and batteries. Testing of the electric powertrain is planned to take place at Collins' state-of-the-art electric power systems development facility, The Grid, in Rockford, IL, before assembly and test of the full-scale GTF demonstrator engine.\n\nThe SWITCH project (Sustainable Water Injecting Turbofan Comprising Hybrid-Electrics) is a collaborative consortium including MTU Aero Engines AG, Pratt & Whitney, Collins Aerospace, GKN Aerospace and Airbus, and aims to demonstrate the potential of hybrid-electric and water-enhanced turbofan technologies to enable improvements in aircraft fuel efficiency and reduced emissions.\n\nHybrid-electric propulsion is a key part of RTX's technology roadmap for enabling more sustainable aviation. In addition to SWITCH, RTX is advancing hybrid-electric technologies through multiple demonstrator programs applicable to a variety of future aircraft platforms, including STEP-Tech and the RTX Hybrid-Electric Flight Demonstrator, supported by the governments of Canada and Quebec.\n\nAbout Clean Aviation The Clean Aviation Joint Undertaking is the European Union's leading research and innovation programme for transforming aviation towards a sustainable and climate-neutral future. It is a European public-private partnership. The programme's disruptive clean aviation technologies will help reduce CO2 of short-medium range aircraft by no less than 30% and -50% for regional range aircraft.\n\nStory continues\n\nAbout RTX\r\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtx-completes-preliminary-design-review-of-hybrid-electric-pratt--whitney-gtf-engine-demonstrator-for-clean-aviation-switch-project-302202171.html\n\nSOURCE RTX",
        "link": "https://finance.yahoo.com/news/rtx-completes-preliminary-design-review-103000313.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.989,
            "neg": 0.018,
            "neu": 0.878,
            "pos": 0.104
        }
    },
    {
        "date": "2024-07-22T04:00:00+00:00",
        "title": "RTX STEP-Tech hybrid-electric demonstrator continues to progress in lab tests",
        "content": "LONDON, July 22, 2024 /PRNewswire/ -- Farnborough Air Show – RTX (NYSE: RTX) today announced it has completed a significant milestone in the development of its hybrid-electric STEP-Tech (Scalable Turboelectric Powertrain Technology) demonstrator. The company has successfully validated sustained operation of the thermal engine, electrical generator, battery system and propulsors to demonstrate energy transfer between these components through the high-voltage electrical network.\n\nAs a modular demonstrator program, STEP-Tech is intended for prototyping future distributed propulsion concepts in the 100-500kW class, with capability to scale to 1MW and beyond. These concepts could have application for a range of next-generation platforms, including advanced air mobility vehicles, high-speed electric Vertical Take-Off and Landing aircraft and blended wing body aircraft.\n\n\"When combined with RTX's other hybrid-electric demonstrator programs, STEP-Tech positions us to offer advanced propulsion technologies that enable greater fuel efficiency across all future aircraft segments, from advanced air mobility to large commercial,\" said Juan de Bedout, chief technology officer for RTX. \"These new hybrid-electric architectures are key to our strategy for supporting the aviation industry's goal of reduced carbon emissions and more sustainable flight.\"\n\nRTX has validated the capability of STEP-Tech's battery system to start the thermal engine and use electrical power produced by the turbogenerator to charge the batteries used to drive the propulsor motors. This follows previous tests of each of STEP-Tech's system components, including the first engine run at partial power and the electrical system integration test. All tests were conducted at the RTX Technology Research Center in East Hartford, Connecticut, which features a class-leading 800-volt electrical architecture designed for aerospace applications.\n\nIn addition to STEP-Tech, RTX's other hybrid-electric propulsion programs address a range of future aircraft applications up to single-aisle, including the RTX Hybrid-Electric Flight Demonstrator, supported by the governments of Canada and Quebec, and the SWITCH project, which is supported by the European Union's Clean Aviation Joint Undertaking.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtx-step-tech-hybrid-electric-demonstrator-continues-to-progress-in-lab-tests-302202170.html\n\nSOURCE RTX",
        "link": "https://finance.yahoo.com/news/rtx-step-tech-hybrid-electric-040000360.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.987,
            "neg": 0.006,
            "neu": 0.883,
            "pos": 0.11
        }
    },
    {
        "date": "2024-07-22T04:00:00+00:00",
        "title": "RTX to collaborate on hybrid-electric system for Airbus PioneerLab helicopter demonstrator",
        "content": "Project aims to demonstrate a fuel efficiency improvement of up to 30% compared to a conventional H145\n\nLONDON, July 22, 2024 /PRNewswire/ -- Farnborough Air Show – Pratt & Whitney Canada and Collins Aerospace, businesses of RTX (NYSE: RTX), have been selected by Airbus Helicopters to support the development of a hybrid-electric propulsion system for its PioneerLab technology demonstrator. Based on a twin-engine H145 helicopter, PioneerLab aims to demonstrate the potential of hybrid-electric propulsion as well as aerodynamic improvements to enable up to 30% improved fuel efficiency and reduced CO2 emissions compared to a conventionally powered aircraft.\n\nFor the PioneerLab demo, the helicopter's existing engines will be replaced by a hybrid-electric propulsion system comprised of a Pratt & Whitney Canada PW210 engine derivative linked with two Collins Aerospace 250 kW electric motors and controllers through a common gearbox. This hybrid-electric configuration is designed to enable optimized engine performance and improved efficiency, with the electric motors providing high torque capability during flight conditions such as take-off and landing. Test flights of the hybrid-electric propulsion system are targeted to begin in 2027 at Airbus Helicopters' site in Donauwörth, Germany.\n\n\"With world-class efficiency and reliability, Pratt & Whitney Canada's PW210 engine is very well-suited to perform as part of a hybrid-electric helicopter propulsion system,\" said Maria Della Posta, president, Pratt & Whitney Canada. \"To help achieve the goals of this innovative project, we'll draw on expertise from our growing list of hybrid-electric demonstrator programs, including the RTX Hybrid-Electric Flight Demonstrator, STEP-Tech and SWITCH.\"\n\n\"The combined 250 kW motor and controller we're designing for PioneerLab are part of our family of electric motors and controllers that can be scaled up or down to meet the future electrification needs of aircraft across multiple segments,\" said Henry Brooks, president, Power & Controls for Collins Aerospace. \"By serving as part of hybrid-electric propulsion architectures or helping to electrify onboard systems, these motors and controllers will support the aviation industry's commitment to reduce carbon emissions from future platforms.\"\n\nPioneerLab is supported by Germany's Federal Ministry for Economic Affairs and Climate Actions (BMWK) through its aerospace research program LuFo. Collins will develop the program's 250kW motor and controller at its Electronic Controls and Motor Systems center of excellence in Solihull, UK, with support provided by the UK's Aerospace Technology Institute.\n\nStory continues\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtx-to-collaborate-on-hybrid-electric-system-for-airbus-pioneerlab-helicopter-demonstrator-302202168.html\n\nSOURCE RTX",
        "link": "https://finance.yahoo.com/news/rtx-collaborate-hybrid-electric-system-040000827.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.995,
            "neg": 0.005,
            "neu": 0.864,
            "pos": 0.131
        }
    }
]