[
    {
        "date": "2024-08-20T12:00:11+00:00",
        "title": "Has RTX Corporation's (NYSE:RTX) Impressive Stock Performance Got Anything to Do With Its Fundamentals?",
        "content": "Most readers would already be aware that RTX's (NYSE:RTX) stock increased significantly by 15% over the past month. As most would know, fundamentals are what usually guide market price movements over the long-term, so we decided to look at the company's key financial indicators today to determine if they have any role to play in the recent price movement. Particularly, we will be paying attention to RTX's  ROE today.\n\nROE or return on equity is a useful tool to assess how effectively a company can generate returns on the investment it received from its shareholders. In simpler terms, it measures the profitability of a company in relation to shareholder's equity.\n\nView our latest analysis for RTX\n\nHow Is ROE Calculated?\n\nThe formula for return on equity is:\n\nReturn on Equity = Net Profit (from continuing operations) ÷ Shareholders' Equity\n\nSo, based on the above formula, the ROE for RTX is:\n\n4.1% = US$2.5b ÷ US$61b (Based on the trailing twelve months to June 2024).\n\nThe 'return' is the amount earned after tax over the last twelve months. One way to conceptualize this is that for each $1 of shareholders' capital it has, the company made $0.04 in profit.\n\nWhat Has ROE Got To Do With Earnings Growth?\n\nSo far, we've learned that ROE is a measure of a company's profitability. We now need to evaluate how much profit the company reinvests or \"retains\" for future growth which then gives us an idea about the growth potential of the company. Assuming everything else remains unchanged, the higher the ROE and profit retention, the higher the growth rate of a company compared to companies that don't necessarily bear these characteristics.\n\nRTX's Earnings Growth And 4.1% ROE\n\nIt is quite clear that RTX's ROE is rather low. Even when compared to the industry average of 14%, the ROE figure is pretty disappointing. Although, we can see that RTX saw a modest net income growth of 18% over the past five years. We reckon that there could be other factors at play here. For instance, the company has a low payout ratio or is being managed efficiently.\n\nWe then compared RTX's net income growth with the industry and we're pleased to see that the company's growth figure is higher when compared with the industry which has a growth rate of 6.5% in the same 5-year period. past-earnings-growth\n\nEarnings growth is a huge factor in stock valuation. It’s important for an investor to know whether the market has priced in the company's expected earnings growth (or decline). This then helps them determine if the stock is placed for a bright or bleak future. Is RTX fairly valued? This infographic on the company's intrinsic value  has everything you need to know.\n\nStory continues\n\nIs RTX Using Its Retained Earnings Effectively?\n\nThe high three-year median payout ratio of 77% (or a retention ratio of 23%) for RTX suggests that the company's growth wasn't really hampered despite it returning most of its income to its shareholders.\n\nMoreover, RTX is determined to keep sharing its profits with shareholders which we infer from its long history of paying a dividend for at least ten years. Our latest analyst data shows that the future payout ratio of the company is expected to drop to 42% over the next three years. As a result, the expected drop in RTX's payout ratio explains the anticipated rise in the company's future ROE to 14%, over the same period.\n\nSummary\n\nOn the whole, we do feel that RTX has some positive attributes. Namely, its high earnings growth. We do however feel that the earnings growth number could have been even higher, had the company been reinvesting more of its earnings and paid out less dividends. With that said, the latest industry analyst forecasts reveal that the company's earnings are expected to accelerate. To know more about the latest analysts predictions for the company, check out this visualization of analyst forecasts for the company.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-corporations-nyse-rtx-impressive-120011891.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.018,
            "neu": 0.848,
            "pos": 0.134
        }
    }
]