[
    {
        "date": "2024-07-17T20:10:00+00:00",
        "title": "RTX names Troy Brunk as President, Collins Aerospace",
        "content": "ARLINGTON, Va., July 17, 2024 /PRNewswire/ -- RTX (NYSE: RTX) today announced Troy Brunk has been appointed president of Collins Aerospace and will report to RTX president and chief executive officer Christopher Calio. Brunk, a 30-year aerospace and defense veteran, succeeds Stephen Timm who has decided to retire.\n\n\"Having led three of the six strategic business units at Collins Aerospace, Troy has a deep understanding of the portfolio and its customers,\" said Calio. \"Troy's decades of industry experience and leadership make him the right person to lead Collins into its next phase of growth.\"\n\nBrunk has served in a variety of Collins Aerospace leadership positions including president of the Avionics, Interiors and Mission Systems strategic business units. Brunk earned his Bachelor of Science degree in Industrial Engineering and Master of Business Administration degree from the University of Iowa.\n\nStephen Timm will remain with the company through March 2025 as special advisor, focused on business transformation at Collins Aerospace, continuing to report to Calio. Timm's career with Collins spans 28-years, serving as business president since 2020. He played a critical role in managing Collins through the global pandemic and commercial aerospace recovery.\n\n\"Steve's leadership has been the driving force for the full integration of the Collins business,\" said Calio. \"The blueprint he has developed sets Collins Aerospace on strong footing for future success.\"\n\nAs part of the planned leadership transition, Heather Robertson becomes president of Collins' Mission Systems strategic business unit.\n\nRobertson is a 24-year company veteran with leadership expertise spanning both defense and commercial segments. Most recently she's served as the chief operating officer for Mission Systems. Prior to that role, Robertson was vice president and general manager of the company's Commercial Air Transport Systems business and before that she spent more than a decade in leadership roles supporting the Mission Systems portfolio.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nContact:\r\nChris Johnson\r\n1-202-384-2474\r\nchris.johnson@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtx-names-troy-brunk-as-president-collins-aerospace-302199741.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-names-troy-brunk-president-201000163.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.971,
            "neg": 0.012,
            "neu": 0.908,
            "pos": 0.08
        }
    },
    {
        "date": "2024-07-17T07:30:00+00:00",
        "title": "RTX's Pratt &amp; Whitney Expands India Operations with Customer Service Center in Bengaluru",
        "content": "New center will employ 150 aerospace experts and drive customer service and operations support\n\nBENGALURU, India, July 17, 2024 /PRNewswire/ -- Pratt & Whitney, an RTX (NYSE: RTX) business, announced the establishment of its new Customer Service Center in Bengaluru. The new center will be part of Pratt & Whitney's India Capability Center and will drive customer service and operations support for Pratt & Whitney Canada's 68,000 engines in service.\n\nThe facility is expected to employ more than 150 aerospace experts and engineers who will support a global customer service ecosystem. The center will be co-located with Pratt & Whitney's supply chain operations, engineering, and digital transformation centers of excellence in India.\n\n\"With the new Customer Service Center, we are leveraging our existing investments in India and using regional talent to augment our world-class product and service dependability and customer experience service level,\" said Nivine Kallab, vice president, Customer Programs, Pratt & Whitney Canada.\n\nEmployees at the Customer Service Center will deliver a wide range of services such as maintenance, repair and operations (MRO) support, spare part management, engine leasing, engine reliability analysis and contract administration. The center's customers are expected to include Indian and global airlines, original equipment manufacturers, MROs, regulatory bodies and small operators.\n\nPratt & Whitney Canada's turboprop engine families power the majority of India's regional aviation fleet. Indian airlines like IndiGo, Alliance Air, Fly91 and SpiceJet operate over 90 ATR-72, ATR-42 and DHC-8-400 aircraft, powered by various Pratt & Whitney engines. The business also powers Indian Air Force's C-295 aircraft.\n\nWith an Indian workforce of more than 6,000 employees, across Pratt & Whitney and Collins Aerospace, RTX has one the largest presences amongst aerospace and defense firms in India.\n\nAbout Pratt & Whitney \r\nPratt & Whitney is a world leader in the design, manufacture and service of aircraft engines and auxiliary power units. To learn more, visit www.prattwhitney.com.\n\nAbout RTX\r\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-pratt--whitney-expands-india-operations-with-customer-service-center-in-bengaluru-302198909.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-pratt-whitney-expands-india-073000111.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.984,
            "neg": 0.006,
            "neu": 0.901,
            "pos": 0.093
        }
    },
    {
        "date": "2024-07-17T07:21:24+00:00",
        "title": "Defense Contractors Stocks Q1 Highlights: RTX (NYSE:RTX)",
        "content": "Defense Contractors Stocks Q1 Highlights: RTX (NYSE:RTX)\n\nWrapping up Q1 earnings, we look at the numbers and key takeaways for the defense contractors stocks, including RTX (NYSE:RTX) and its peers.\n\nDefense contractors typically require technical expertise and government clearance. Companies in this sector can also enjoy long-term contracts with government bodies, leading to more predictable revenues. Combined, these factors create high barriers to entry and can lead to limited competition. Lately, geopolitical tensions–whether it be Russia’s invasion of Ukraine or China’s aggression towards Taiwan–highlight the need for defense spending. On the other hand, demand for these products can ebb and flow with defense budgets and even who is president, as different administrations can have vastly different ideas of how to allocate federal funds.\n\nThe 13 defense contractors stocks we track reported a strong Q1; on average, revenues beat analyst consensus estimates by 3.5%. while next quarter's revenue guidance was 0.7% above consensus. Valuation multiples for many growth stocks have not yet reverted to their early 2021 highs, but the market was optimistic at the end of 2023 due to cooling inflation. The start of 2024 has been a different story as mixed signals have led to market volatility, and defense contractors stocks have held roughly steady amidst all this, with share prices up 3.7% on average since the previous earnings results.\n\nRTX (NYSE:RTX)\n\nOriginally focused on refrigeration technology, Raytheon (NSYE:RTX) provides a a variety of products and services to the aerospace and defense industries.\n\nRTX reported revenues of $19.31 billion, up 12.1% year on year, exceeding analysts' expectations by 4.9%. Overall, it was a stunning quarter for the company with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates.\n\n\"RTX saw strong momentum in the first quarter, delivering 12 percent organic sales* growth and winning over $25 billion in new orders across our businesses,\" said RTX President and Chief Operating Officer Chris Calio. RTX Total Revenue\n\nThe stock is flat since reporting and currently trades at $101.72.\n\nIs now the time to buy RTX? Access our full analysis of the earnings results here, it's free.\n\nBest Q1: Northrop Grumman (NYSE:NOC)\n\nResponsible for the development of the first stealth bomber, Northrop Grumman (NYSE:NOC) specializes in providing aerospace, defense, and security solutions for various industry applications.\n\nNorthrop Grumman reported revenues of $10.13 billion, up 8.9% year on year, outperforming analysts' expectations by 3.8%. It was a stunning quarter for the company with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates.\n\nStory continues Northrop Grumman Total Revenue\n\nAlthough it had a great quarter compared its peers, the market seems unhappy with the results as the stock is down 9% since reporting. It currently trades at $431.92.\n\nIs now the time to buy Northrop Grumman? Access our full analysis of the earnings results here, it's free.\n\nWeakest Q1: Mercury Systems (NASDAQ:MRCY)\n\nFounded in 1981, Mercury Systems (NASDAQ:MRCY) specializes in providing processing subsystems and components for primarily defense applications.\n\nMercury Systems reported revenues of $208.3 million, down 21% year on year, falling short of analysts' expectations by 2.9%. It was a weak quarter for the company with a miss of analysts' earnings and organic revenue estimates.\n\nMercury Systems posted the weakest performance against analyst estimates and slowest revenue growth in the group. Interestingly, the stock is up 11.4% since the results and currently trades at $32.41.\n\nRead our full analysis of Mercury Systems's results here.\n\nHuntington Ingalls (NYSE:HII)\n\nBuilding Nimitz-class aircraft carriers used in active service, Huntington Ingalls (NYSE:HII) develops marine vessels and their mission systems and maintenance services.\n\nHuntington Ingalls reported revenues of $2.81 billion, up 4.9% year on year, in line with analysts' expectations. Overall, it was a solid quarter for the company with a decent beat of analysts' earnings estimates.\n\nThe stock is down 7.6% since reporting and currently trades at $255.88.\n\nRead our full, actionable report on Huntington Ingalls here, it's free.\n\nICF (NASDAQ:ICFI)\n\nOriginally founded as Inner City Fund, ICF International (NASDAQ:ICFI) delivers consulting and technology services in health, environment, and infrastructure.\n\nICF reported revenues of $494.4 million, up 2.3% year on year, surpassing analysts' expectations by 1.3%. More broadly, it was a very strong quarter for the company with an impressive beat of analysts' earnings estimates.\n\nThe stock is down 3.8% since reporting and currently trades at $138.46.\n\nRead our full, actionable report on ICF here, it's free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/defense-contractors-stocks-q1-highlights-072124585.html",
        "symbols": [
            "0K92.LSE",
            "5UR.F",
            "5UR.XETRA",
            "HII.US",
            "ICFI.US",
            "MCY.F",
            "MCY.MU",
            "MCY.STU",
            "MRCY.US",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.03,
            "neu": 0.812,
            "pos": 0.158
        }
    },
    {
        "date": "2024-07-17T06:58:42+00:00",
        "title": "RTX Corporation (RTX): Is This Aerospace and Defense Stock a Good Buy Right Now?",
        "content": "We recently compiled a list of the 10 Best Aerospace and Defense Stocks to Buy Now. In this article, we are going to take a look at where RTX Corporation (NYSE:RTX) stands against the other aerospace and defense stocks.\n\nThe world has been rocked with conflict over the last few years. The war between Russia and Ukraine has gone beyond 860 days, with no immediate end in sight. Azerbaijan and Armenia continue to engage in a regular exchange of fire after the latter lost control of the Nagorno-Karabakh region to the Azeris in 2020. The Middle East is up in flames, with defense experts describing the ongoing Israel-Hamas conflict as the worst crisis in the region since the Arab-Israeli War in 1973.\n\nWhile the human impacts of war are undeniably tragic, it is also a time when defense companies make money and lure investors into loading up on their stocks. According to a report on CNN earlier this year, defense companies in the United States and Europe have thrived since Russia invaded Ukraine in February 2022. German automotive and arms manufacturer Rheinmetall’s share price had surged by a staggering 315% in two years following the start of the conflict, while BAE Systems posted a 105% gain. Northrop Grumman and Lockheed Martin also witnessed an increase in their share prices by 18% and 10%, respectively.\n\nWhen the war broke out, industry analysts expected the aerospace sector to be affected by western sanctions placed on Russia. According to KPMG, the country is the source of 30% of the titanium used by Boeing and other large engine producers that power fighter jets and commercial aviation. Titanium is a key material that goes into the development of jet fan blades and landing gears. However, the supply of titanium from Russia to these companies has largely remained unaffected despite sanctions.\n\nWhile sharing his insights on commercial aviation at the Morningstar Investment Conference in Chicago on June 26, Tony Bancroft from Gabelli Funds said that he had noticed a significant growth in aircraft orders lately, with both Airbus and Boeing having a 12-year backlog of orders. He believes there are three reasons driving it. The first catalyst, according to him, is China which accounts for 20% of the growth in orders to cater to the growing middle class in both China and India who want to travel more. Another critical factor he cited during his talk was that business travel has finally returned to the 2019 pre-pandemic level. Lastly, Tony highlighted the the rising middle class in the United States, and the world, which is increasing air travel and contributing to the economic growth in the industry.\n\nStory continues\n\nFurthermore, Bancroft identified Textron as his hot stock pick in the aerospace and defense industry. He believes the stock is undervalued at its current share price of $85, and anticipates its value to hover around the $125 range in the future. Last year in March, the US Department of Defense (DoD) awarded a $1.3 billion contract to the company to develop helicopters to replace the aging Blackhawk fleet.\n\nAnother top stock that hedge funds are talking about is Carpenter Technology Corporation, a leading supplier of specialty alloys that holds a market share of roughly 40% in the aerospace industry. It was among the top picks during the Sohn Investment Conference in New York back in April. Mohammed Anjarwala, the managing director of Advent Global Opportunities, shared the following remarks about the company during the conference:\n\nWe think Carpenter is one of the best ways to play the growing backlog of planes at Boeing and Airbus, as they ramp up their billing rates.\n\nAt the time of the conference, the stock was trading at around $70 per share. Anjarwala forecasted that the value could go up to around $200 per share or 20 times forward P/E. It is currently valued at $107 per share.\n\nMethodology\n\nInsider Monkey’s database of 920 hedge funds was assessed, as of the first quarter of 2024. We have chosen the 10 best aerospace and defense stocks to buy now based on the hedge fund sentiment towards each stock. The stocks are ranked in ascending order of hedge fund holders in each company.\n\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\n\nAn aerial view of a commercial jetliner in flight, its airframe glinting in the sun.\n\nRTX Corporation (NYSE:RTX)\n\nNumber of Hedge Fund Holders: 62\n\nFormerly known as Raytheon, RTX Corporation (NYSE:RTX) is a giant in the global aerospace and defense industry. The company’s products generally complement Lockheed Martin’s offerings, such as preparing missiles for Lockheed’s fighters to ensure they remain a lethal threat. Since the beginning of the Ukraine war in February 2022, the stock's share price has grown by over 15% due to a high demand for its weapons.\n\nThe ongoing conflicts in Europe and the Middle East have led to a robust first quarter of the year for RTX Corporation (NYSE:RTX), with sales increasing 12% compared to last year, to a total of $19.3 billion, and EPS posted at $1.34 per share, which is 10% higher YoY. The company has reaffirmed its forecasts for the full financial year, where it expects total revenue between $78-79 billion, and an EPS in the range of $5.25 - $5.40. According to Insider Monkey, 62 hedge funds are bullish on the company, making it one of the best aerospace and defense stocks to buy now.\n\nSome investors, however, hold a bearish view of RTX Corporation (NYSE:RTX) after its aerospace subsidiary Pratt & Whitney discovered last year that several parts of its engine turbine discs were made using contaminated powder that makes metal parts susceptible to cracks and erosions. The management estimated a $3 billion pre-tax hit to cash flows between 2023 and 2025, but there was essentially no charge incurred in 2023, and the amount is now set to hit its numbers in 2024, 2025, and 2026.\n\nHaving said that, while headwinds undoubtedly exist, 2025 or 2026 is not the end of the road for RTX Corporation (NYSE:RTX). A major reason that speaks to the bull case for the company is its impressive backlog of $196 billion, of which $78 billion comprises defense-related orders, including a $2.8 billion guided-missile order by NATO. Most industry analysts have mixed views on the stock's ratings, which range between hold to buy, with an average share price target of $102 at an upside of 0.4%.\n\nOverall RTX ranks 2nd on our list of the best aerospace and defense stocks to buy. You can visit 10 Best Aerospace and Defense Stocks to Buy Nowto see the other aerospace and defense stocks that are on hedge funds’ radar. While we acknowledge the potential of RTX as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than RTX but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nREAD NEXT:Analyst Sees a New $25 Billion “Opportunity” for NVIDIA and Jim Cramer is Recommending These 10 Stocks in June.\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-corporation-rtx-aerospace-defense-065842188.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.04,
            "neu": 0.869,
            "pos": 0.091
        }
    }
]