[
    {
        "date": "2024-09-11T18:29:19+00:00",
        "title": "RTX CEO does not see 'transformative' deals, open to pruning business",
        "content": "(Reuters) - RTX is open to pruning and pairing its existing businesses rather than pursuing \"transformative\" mergers and acquisitions, the aerospace giant's CEO said on Wednesday.\n\nSpeaking at a conference organized by Morgan Stanley, CEO Christopher Calio pointed to the second-quarter divestment of its Goodrich Hoist and Winch business as an example of the deals the company might do.\n\nRTX emerged from a $121 billion combination of United Technologies Corp and Raytheon Co in 2020 and now houses businesses such as civil aircraft engine maker Pratt & Whitney and aerospace supplier Collins Aerospace.\n\nThe company counts planemakers Boeing and Airbus as customers.\n\nCalio on Wednesday said RTX was working with Boeing on calbirating its production rates for 2025 and beyond as the U.S. planemaker is currently producing its best-selling 737 MAX aircraft at a lower rate due to an ongoing crisis.\n\n\"Obviously we've got a lot of capacity above and beyond what those rates are today. So making sure that we're calibrated to where that's going and that we've got the right level of inventory to support that,\" he said.\n\nDefense demand continues to be strong, with RTX's weapons business Raytheon garnering $8 billion in bookings so far in the third quarter, Calio added.\n\nRTX is also working on a hybrid-electric technology demonstrator that combines a thermal engine with electric motor, with a goal to improve fuel efficiency by 30%.\n\nCalio said RTX was focused on the durability of the engine, having learned lessons from recent quality issues surrounding its GTF engines. He sees the next generation propulsion penetrating the small aircraft market first.\n\n(Reporting by Pratyush Thakur, Abhijith Ganapavaram in Bengaluru; Editing by Vijay Kishore)",
        "link": "https://uk.finance.yahoo.com/news/rtx-prioritize-streamlining-over-major-182919491.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.847,
            "neg": 0.037,
            "neu": 0.89,
            "pos": 0.073
        }
    },
    {
        "date": "2024-09-11T11:00:18+00:00",
        "title": "RTX Corporation (NYSE:RTX) Shares Could Be 24% Below Their Intrinsic Value Estimate",
        "content": "Key Insights\n\nUsing the 2 Stage Free Cash Flow to Equity, RTX fair value estimate is US$157 Current share price of US$120 suggests RTX is potentially 24% undervalued Analyst price target for RTX is US$122 which is 22% below our fair value estimate\n\nDoes the September share price for RTX Corporation (NYSE:RTX) reflect what it's really worth? Today, we will estimate the stock's intrinsic value by taking the expected future cash flows and discounting them to today's value. Our analysis will employ the Discounted Cash Flow (DCF) model. Believe it or not, it's not too difficult to follow, as you'll see from our example!\n\nCompanies can be valued in a lot of ways, so we would point out that a DCF is not perfect for every situation. If you want to learn more about discounted cash flow, the rationale behind this calculation can be read in detail in the Simply Wall St analysis model.\n\nCheck out our latest analysis for RTX\n\nCrunching The Numbers\n\nWe use what is known as a 2-stage model, which simply means we have two different periods of growth rates for the company's cash flows. Generally the first stage is higher growth, and the second stage is a lower growth phase. To begin with, we have to get estimates of the next ten years of cash flows. Where possible we use analyst estimates, but when these aren't available we extrapolate the previous free cash flow (FCF) from the last estimate or reported value. We assume companies with shrinking free cash flow will slow their rate of shrinkage, and that companies with growing free cash flow will see their growth rate slow, over this period. We do this to reflect that growth tends to slow more in the early years than it does in later years.\n\nGenerally we assume that a dollar today is more valuable than a dollar in the future, and so the sum of these future cash flows is then discounted to today's value:\n\n10-year free cash flow (FCF) estimate\n\n2025 2026 2027 2028 2029 2030 2031 2032 2033 2034 Levered FCF ($, Millions)  US$7.03b US$8.37b US$10.00b US$9.51b US$9.28b US$9.19b US$9.20b US$9.27b US$9.39b US$9.55b Growth Rate Estimate Source Analyst x11 Analyst x8 Analyst x2 Analyst x1 Est @ -2.45% Est @ -0.97% Est @ 0.07% Est @ 0.80% Est @ 1.31% Est @ 1.67% Present Value ($, Millions) Discounted @ 6.2%  US$6.6k US$7.4k US$8.3k US$7.5k US$6.9k US$6.4k US$6.0k US$5.7k US$5.5k US$5.2k\n\n(\"Est\" = FCF growth rate estimated by Simply Wall St)\r\nPresent Value of 10-year Cash Flow (PVCF) = US$66b\n\nAfter calculating the present value of future cash flows in the initial 10-year period, we need to calculate the Terminal Value, which accounts for all future cash flows beyond the first stage. The Gordon Growth formula is used to calculate Terminal Value at a future annual growth rate equal to the 5-year average of the 10-year government bond yield of 2.5%. We discount the terminal cash flows to today's value at a cost of equity of 6.2%.\n\nStory continues\n\nTerminal Value (TV)= FCF2034 × (1 + g) ÷ (r – g) = US$9.5b× (1 + 2.5%) ÷ (6.2%– 2.5%) = US$263b\n\nPresent Value of Terminal Value (PVTV)= TV / (1 + r)10= US$263b÷ ( 1 + 6.2%)10= US$144b\n\nThe total value is the sum of cash flows for the next ten years plus the discounted terminal value, which results in the Total Equity Value, which in this case is US$209b. To get the intrinsic value per share, we divide this by the total number of shares outstanding. Compared to the current share price of US$120, the company appears a touch undervalued at a 24% discount to where the stock price trades currently. Remember though, that this is just an approximate valuation, and like any complex formula - garbage in, garbage out. dcf\n\nThe Assumptions\n\nWe would point out that the most important inputs to a discounted cash flow are the discount rate and of course the actual cash flows. If you don't agree with these result, have a go at the calculation yourself and play with the assumptions. The DCF also does not consider the possible cyclicality of an industry, or a company's future capital requirements, so it does not give a full picture of a company's potential performance. Given that we are looking at RTX as potential shareholders, the cost of equity is used as the discount rate, rather than the cost of capital (or weighted average cost of capital, WACC) which accounts for debt. In this calculation we've used 6.2%, which is based on a levered beta of 0.905. Beta is a measure of a stock's volatility, compared to the market as a whole. We get our beta from the industry average beta of globally comparable companies, with an imposed limit between 0.8 and 2.0, which is a reasonable range for a stable business.\n\nSWOT Analysis for RTX\n\nStrength\n\nDebt is well covered by cash flow.\n\nWeakness\n\nEarnings declined over the past year.\n\nInterest payments on debt are not well covered.\n\nDividend is low compared to the top 25% of dividend payers in the Aerospace & Defense market.\n\nOpportunity\n\nAnnual earnings are forecast to grow faster than the American market.\n\nTrading below our estimate of fair value by more than 20%.\n\nThreat\n\nDividends are not covered by earnings.\n\nAnnual revenue is forecast to grow slower than the American market.\n\nNext Steps:\n\nWhilst important, the DCF calculation ideally won't be the sole piece of analysis you scrutinize for a company. It's not possible to obtain a foolproof valuation with a DCF model. Rather it should be seen as a guide to \"what assumptions need to be true for this stock to be under/overvalued?\" If a company grows at a different rate, or if its cost of equity or risk free rate changes sharply, the output can look very different. Can we work out why the company is trading at a discount to intrinsic value? For RTX, we've compiled three additional aspects you should assess:\n\nRisks: Case in point, we've spotted  4 warning signs for RTX you should be aware of, and 1 of them is a bit concerning. Future Earnings: How does RTX's growth rate compare to its peers and the wider market? Dig deeper into the analyst consensus number for the upcoming years by interacting with our free analyst growth expectation chart. Other Solid Businesses: Low debt, high returns on equity and good past performance are fundamental to a strong business. Why not explore our interactive list of stocks with solid business fundamentals to see if there are other companies you may not have considered!\n\nPS. Simply Wall St updates its DCF calculation for every American stock every day, so if you want to find the intrinsic value of any other stock just search here.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-corporation-nyse-rtx-shares-110018702.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.034,
            "neu": 0.797,
            "pos": 0.169
        }
    },
    {
        "date": "2024-09-11T07:38:31+00:00",
        "title": "Q2 Rundown: ICF (NASDAQ:ICFI) Vs Other Defense Contractors Stocks",
        "content": "Q2 Rundown: ICF (NASDAQ:ICFI) Vs Other Defense Contractors Stocks\n\nThe end of an earnings season can be a great time to discover new stocks and assess how companies are handling the current business environment. Let’s take a look at how ICF (NASDAQ:ICFI) and the rest of the defense contractors stocks fared in Q2.\n\nDefense contractors typically require technical expertise and government clearance. Companies in this sector can also enjoy long-term contracts with government bodies, leading to more predictable revenues. Combined, these factors create high barriers to entry and can lead to limited competition. Lately, geopolitical tensions–whether it be Russia’s invasion of Ukraine or China’s aggression towards Taiwan–highlight the need for defense spending. On the other hand, demand for these products can ebb and flow with defense budgets and even who is president, as different administrations can have vastly different ideas of how to allocate federal funds.\n\nThe 15 defense contractors stocks we track reported a strong Q2. As a group, revenues beat analysts’ consensus estimates by 4.7% while next quarter’s revenue guidance was 6.7% below.\n\nValuation multiples for many growth stocks have not yet reverted to their early 2021 highs, but the market was optimistic at the end of 2023 due to cooling inflation. This year has been a different story as mixed inflation signals have led to market volatility. Thankfully, defense contractors stocks have been resilient with share prices up 5.3% on average since the latest earnings results.\n\nICF (NASDAQ:ICFI)\n\nOriginally founded as Inner City Fund, ICF International (NASDAQ:ICFI) delivers consulting and technology services in health, environment, and infrastructure.\n\nICF reported revenues of $512 million, up 2.4% year on year. This print exceeded analysts’ expectations by 1.3%. Overall, it was a very strong quarter for the company with a solid beat of analysts’ earnings estimates. ICF Total Revenue\n\nInterestingly, the stock is up 11.8% since reporting and currently trades at $162.68.\n\nIs now the time to buy ICF? Access our full analysis of the earnings results here, it’s free.\n\nBest Q2: Mercury Systems (NASDAQ:MRCY)\n\nFounded in 1981, Mercury Systems (NASDAQ:MRCY) specializes in providing processing subsystems and components for primarily defense applications.\n\nMercury Systems reported revenues of $248.6 million, down 1.8% year on year, outperforming analysts’ expectations by 7.8%. The business had an incredible quarter with an impressive beat of analysts’ organic revenue and earnings estimates. Mercury Systems Total Revenue\n\nThe market seems happy with the results as the stock is up 5.8% since reporting. It currently trades at $35.97.\n\nStory continues\n\nIs now the time to buy Mercury Systems? Access our full analysis of the earnings results here, it’s free.\n\nWeakest Q2: General Dynamics (NYSE:GD)\n\nCreator of the famous M1 Abrahms tank, General Dynamics (NYSE:GD) develops aerospace, marine systems, combat systems, and information technology products.\n\nGeneral Dynamics reported revenues of $11.98 billion, up 18% year on year, exceeding analysts’ expectations by 4.1%. Still, it was a slower quarter as it posted a miss of analysts’ backlog sales estimates.\n\nInterestingly, the stock is up 2.6% since the results and currently trades at $302.01.\n\nRead our full analysis of General Dynamics’s results here.\n\nRTX (NYSE:RTX)\n\nOriginally focused on refrigeration technology, Raytheon (NSYE:RTX) provides a a variety of products and services to the aerospace and defense industries.\n\nRTX reported revenues of $19.72 billion, up 7.7% year on year. This print topped analysts’ expectations by 2.3%. It was a very strong quarter as it also logged an impressive beat of analysts’ organic revenue estimates.\n\nThe stock is up 14.7% since reporting and currently trades at $120.26.\n\nRead our full, actionable report on RTX here, it’s free.\n\nCACI (NYSE:CACI)\n\nFounded to commercialize SIMSCRIPT, CACI International (NYSE:CACI) offers defense, intelligence, and IT solutions to support national security and government transformation efforts.\n\nCACI reported revenues of $2.04 billion, up 19.7% year on year. This number topped analysts’ expectations by 5.5%. It was an exceptional quarter as it also recorded an impressive beat of analysts’ backlog sales estimates.\n\nThe stock is up 5.4% since reporting and currently trades at $470.31.\n\nRead our full, actionable report on CACI here, it’s free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/q2-rundown-icf-nasdaq-icfi-073831405.html",
        "symbols": [
            "CACI.US",
            "G6V.BE",
            "G6V.F",
            "G6V.STU",
            "GD.US",
            "ICFI.US",
            "MCY.F",
            "MCY.MU",
            "MCY.STU",
            "MRCY.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.017,
            "neu": 0.801,
            "pos": 0.182
        }
    }
]