[
    {
        "date": "2024-07-24T16:02:29+00:00",
        "title": "Lower G700 business jet deliveries hit General Dynamics results, shares fall",
        "content": "General Dynamics reported second-quarter revenue above Wall street estimates on Wednesday, but profit slightly missed and fewer high end jets were delivered than expected, and its shares fell 5%.",
        "link": "https://www.reuters.com/business/aerospace-defense/general-dynamics-quartely-revenue-rises-higher-defense-demand-2024-07-24/",
        "symbols": [
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.7,
            "neg": 0.068,
            "neu": 0.702,
            "pos": 0.23
        }
    },
    {
        "date": "2024-07-24T13:00:00+00:00",
        "title": "RTX's Pratt &amp; Whitney GTF™ Engines Surpass 950 Orders and Commitments in 2024",
        "content": "More than 11,000 GTF orders and commitments program to date\n\nLONDON, July 24, 2024 /PRNewswire/ -- Farnborough Air Show – Pratt & Whitney, an RTX (NYSE: RTX) business, announced more than 950 GTF engine orders and commitments since the beginning of 2024. Airlines and lessors that have announced orders include Avolon, Breeze Airways, Cebu Pacific, Icelandair, JetSMART, Mexicana, SKY Airline, SMBC, and Vietjet. In total, more than 11,000 GTF engine orders and commitments have been placed by more than 90 customers worldwide.\n\n\"These orders demonstrate continued customer confidence in Pratt & Whitney and the value the GTF engine offers with its world-class economic and environmental benefits,\" said Rick Deurloo, president of Commercial Engines at Pratt & Whitney. \"The GTF Advantage engine will extend this lead while providing more thrust and higher durability. We remain focused on executing all elements of the GTF fleet management plan including industrial output and material flow, GTF maintenance, repair and overhaul network expansion and ongoing customer support.\"\n\nThe GTF delivers up to 20% better fuel efficiency than previous generation engines, saving airlines more than 1.7 billion gallons of fuel and the planet over 17 million metric tons of carbon emissions. GTF engines will continue to drive reductions in operating costs, new routes and revenue, and progress towards meeting the industry's sustainability goals. The engine's revolutionary geared fan architecture is the foundation for even more efficient propulsion technologies in the decades ahead.\n\nAbout Pratt & Whitney\r\nPratt & Whitney is a world leader in the design, manufacture and service of aircraft engines and auxiliary power units. To learn more visit www.prattwhitney.com.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com. Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-pratt--whitney-gtf-engines-surpass-950-orders-and-commitments-in-2024-302204877.html\n\nSOURCE RTX\n\nView comments()",
        "link": "https://finance.yahoo.com/news/rtxs-pratt-whitney-gtf-engines-130000323.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.986,
            "neg": 0.007,
            "neu": 0.874,
            "pos": 0.119
        }
    },
    {
        "date": "2024-07-24T12:00:30+00:00",
        "title": "Those who invested in RTX (NYSE:RTX) five years ago are up 49%",
        "content": "Ideally, your overall portfolio should beat the market average. But in any portfolio, there will be mixed results between individual stocks. So we wouldn't blame long term RTX Corporation (NYSE:RTX) shareholders for doubting their decision to hold, with the stock down 22% over a half decade.\n\nSince shareholders are down over the longer term, lets look at the underlying fundamentals over the that time and see if they've been consistent with returns.\n\nSee our latest analysis for RTX\n\nTo quote Buffett, 'Ships will sail around the world but the Flat Earth Society will flourish. There will continue to be wide discrepancies between price and value in the marketplace...' By comparing earnings per share (EPS) and share price changes over time, we can get a feel for how investor attitudes to a company have morphed over time.\n\nRTX became profitable within the last five years. Most would consider that to be a good thing, so it's counter-intuitive to see the share price declining. Other metrics may better explain the share price move.\n\nIn contrast to the share price, revenue has actually increased by 7.0% a year in the five year period. So it seems one might have to take closer look at the fundamentals to understand why the share price languishes. After all, there may be an opportunity.\n\nYou can see below how earnings and revenue have changed over time (discover the exact values by clicking on the image). earnings-and-revenue-growth\n\nRTX is well known by investors, and plenty of clever analysts have tried to predict the future profit levels. You can see what analysts are predicting for RTX in this interactivegraph of future profit estimates.\n\nWhat About Dividends?\n\nAs well as measuring the share price return, investors should also consider the total shareholder return (TSR). The TSR incorporates the value of any spin-offs or discounted capital raisings, along with any dividends, based on the assumption that the dividends are reinvested. It's fair to say that the TSR gives a more complete picture for stocks that pay a dividend. We note that for RTX the TSR over the last 5 years was 49%, which is better than the share price return mentioned above. And there's no prize for guessing that the dividend payments largely explain the divergence!\n\nA Different Perspective\n\nRTX provided a TSR of 24% over the year (including dividends). That's fairly close to the broader market return. That gain looks pretty satisfying, and it is even better than the five-year TSR of 8% per year. Even if the share price growth slows down from here, there's a good chance that this is business worth watching in the long term. While it is well worth considering the different impacts that market conditions can have on the share price, there are other factors that are even more important. For instance, we've identified  4 warning signs for RTX that you should be aware of.\n\nStory continues\n\nIf you would prefer to check out another company -- one with potentially superior financials -- then do not miss this freelist of companies that have proven they can grow earnings.\n\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nView comments()",
        "link": "https://finance.yahoo.com/news/those-invested-rtx-nyse-rtx-120030746.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.017,
            "neu": 0.801,
            "pos": 0.182
        }
    },
    {
        "date": "2024-07-24T12:00:00+00:00",
        "title": "RTX's Pratt &amp; Whitney GTF™ engines to power 11 Airbus A220 aircraft for Air Niugini",
        "content": "National airline of Papua New Guinea is a first-time GTF customer\n\nLONDON, July 24, 2024 /PRNewswire/ -- Farnborough Air Show -- Pratt & Whitney, an RTX (NYSE: RTX) business, and Air Niugini have finalized engine and aftermarket agreements for the GTF engines that will power the airline's fleet of 11 Airbus A220 aircraft. Pratt & Whitney will provide a full suite of support services with a 12-year EngineWise® Comprehensive agreement. With this order, Air Niugini becomes a first-time GTF customer.\n\n\"GTF engines offer unmatched payload and range, enabling Air Niugini to open new routes internationally, while benefitting from industry-leading fuel efficiency, and we look forward to supporting the airline's fleet in the years ahead,\" said Rick Deurloo, president of Commercial Engines at Pratt & Whitney.\n\n\"This is an exciting time for Air Niugini as we modernize our fleet,\" said Gary Seddon, chief executive officer of Air Niugini. \"By upgrading next-generation aircraft with the most efficient engines, this will revolutionize travel for our passengers, ensuring significant reduction in fuel consumption and emissions, while expanding our route offerings and enhancing passenger experience.\"\n\nAir Niugini is the national carrier of Papua New Guinea based in the capital Port Moresby. It operates an extensive domestic network as well as internationally to Australia, Asia and the Pacific. The airline's new fleet will deliver more capacity and greater reliability throughout its network.\n\nAbout Pratt & Whitney Pratt & Whitney is a world leader in the design, manufacture and service of aircraft engines and auxiliary power units. To learn more visit www.prattwhitney.com.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-pratt--whitney-gtf-engines-to-power-11-airbus-a220-aircraft-for-air-niugini-302204811.html\n\nSOURCE RTX\n\nView comments()",
        "link": "https://finance.yahoo.com/news/rtxs-pratt-whitney-gtf-engines-120000680.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.989,
            "neg": 0.011,
            "neu": 0.858,
            "pos": 0.131
        }
    },
    {
        "date": "2024-07-24T07:02:16+00:00",
        "title": "RTX (RTX) Reports Q2: Everything You Need To Know Ahead Of Earnings",
        "content": "RTX (RTX) Reports Q2: Everything You Need To Know Ahead Of Earnings\n\nAerospace and defense company Raytheon (NYSE:RTX) will be announcing earnings results tomorrow morning. Here's what to expect.\n\nRTX beat analysts' revenue expectations by 4.9% last quarter, reporting revenues of $19.31 billion, up 12.1% year on year. It was a stunning quarter for the company, with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates.\n\nIs RTX a buy or sell going into earnings? Read our full analysis here, it's free.\n\nThis quarter, analysts are expecting RTX's revenue to grow 5.2% year on year to $19.28 billion, slowing from the 12.3% increase it recorded in the same quarter last year. Adjusted earnings are expected to come in at $1.30 per share. RTX Total Revenue\n\nAnalysts covering the company have generally reconfirmed their estimates over the last 30 days, suggesting they anticipate the business to stay the course heading into earnings. RTX has missed Wall Street's revenue estimates three times over the last two years.\n\nLooking at RTX's peers in the aerospace and defense segment, some have already reported their Q2 results, giving us a hint as to what we can expect. Lockheed Martin delivered year-on-year revenue growth of 8.6%, beating analysts' expectations by 6.5%, and Hexcel reported revenues up 10.1%, topping estimates by 3%. Hexcel traded down 7.5% following the results.\n\nRead our full analysis of Lockheed Martin's results here and Hexcel's results here.\n\nThere has been positive sentiment among investors in the aerospace and defense segment, with share prices up 8.3% on average over the last month. RTX is up 3.2% during the same time and is heading into earnings with an average analyst price target of $107.7 (compared to the current share price of $104.77).\n\nUnless you’ve been living under a rock, it should be obvious by now that generative AI is going to have a huge impact on how large corporations do business. While Nvidia and AMD are trading close to all-time highs, we prefer a lesser-known (but still profitable) semiconductor stock benefitting from the rise of AI. Click here to access our free report on our favorite semiconductor growth story.\n\nView comments()",
        "link": "https://finance.yahoo.com/news/rtx-rtx-reports-q2-everything-070216379.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.987,
            "neg": 0.013,
            "neu": 0.87,
            "pos": 0.117
        }
    },
    {
        "date": "2024-07-24T04:00:00+00:00",
        "title": "Collins Aerospace relocating Singapore plant to new $250M manufacturing facility in Seletar Aerospace Park, Singapore",
        "content": "LONDON, July 24, 2024 /PRNewswire/ -- Farnborough Air Show  — Collins Aerospace, an RTX (NYSE: RTX) business, today announced the relocation of its Singapore manufacturing facility to a new, state-of-the-art site in Seletar Aerospace Park, Singapore. This move represents a significant investment of $250 million and will bolster the company's capabilities and commitment to innovation and excellence in the aerospace industry.\n\nScheduled to begin construction in the fourth quarter of 2025, the new facility is expected to be completed by 2027. This strategic relocation will enable Collins to transfer its operations from the current Bedok site to the new Seletar Aerospace Park location, approximately 15 miles (24 kilometers) away. Production is anticipated to commence in 2028, with dual production capability maintained at the Bedok facility over a multi-year transition plan.\n\n\"This new facility will be a hub of innovation, leveraging cutting-edge technology to support aerospace components' design, development and production,\" said Henry Brooks, president, Power & Controls for Collins Aerospace. \"Our investment in Seletar Aerospace Park underscores our long-term commitment to Singapore and to providing our customers with the highest quality products and services.\"\n\nSeletar Aerospace Park is home to the world's leading aerospace companies. Employees currently based at Bedok will play an integral role in the transition and future operations at the new facility, ensuring continuity and leveraging their extensive expertise.\n\nCollins has a rich history in Singapore as one of the first aerospace companies to establish a presence in the country in 1975. Over the past 50 years, the Bedok site has built strong relationships as a supplier to key airframers, including Airbus, Boeing, Bombardier, Embraer and Gulfstream.\n\n\"We welcome Collins' decision to transform its Singapore operations into a new state-of-the-art manufacturing facility,\" said Cindy Koh, executive vice president of the Singapore Economic Development Board (EDB). \"This significant investment is testament to Singapore's strengths as a location for advanced manufacturing and is a good example of how we are partnering with leading aerospace companies on their long-term growth. We look forward to the new manufacturing capabilities and technologies that will be introduced in this facility.\"\n\nTo maintain the security of supply and manufacturing continuity, the transfer of products from Bedok to Seletar will adhere to Collins' AS9100-compliant work transfer process. This process includes comprehensive risk mitigation strategies and ensures conformity to our customer contractual obligations.\n\nStory continues\n\n\"We are committed to making this transition as seamless as possible for our customers,\" said Aaron Tan, senior director for Global Ops, Singapore Operations at Collins. \"Our focus remains on delivering on our commitments and maintaining the high standards of quality and service that our customers expect.\"\n\nAbout Collins Aerospace Collins Aerospace, an RTX business, is a leader in integrated and intelligent solutions for the global aerospace and defense industry. Our 80,000 employees are dedicated to delivering future-focused technologies to advance sustainable and connected aviation, passenger safety and comfort, mission success, space exploration, and more.\n\nAbout RTX\r\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com. Cision\n\nView original content:https://www.prnewswire.com/news-releases/collins-aerospace-relocating-singapore-plant-to-new-250m-manufacturing-facility-in-seletar-aerospace-park-singapore-302204487.html\n\nSOURCE RTX\n\nView comments()",
        "link": "https://finance.yahoo.com/news/collins-aerospace-relocating-singapore-plant-040000057.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.008,
            "neu": 0.85,
            "pos": 0.143
        }
    },
    {
        "date": "2024-07-24T04:00:00+00:00",
        "title": "RTX's Ascentia® awarded first predictive maintenance customer in Turkey with Freebird Airlines",
        "content": "Freebird Airlines gains a connected ecosystem through real-time data insights\n\nLONDON, July 24, 2024 /PRNewswire/ -- Farnborough Air Show – Freebird Airlines has selected Collins Aerospace, an RTX business (NYSE: RTX) to add a comprehensive suite of digital solutions enabling the airline to make proactive decisions to improve operations across its A320 fleet of aircraft.\n\nFreebird Airlines will implement Ascentia®, a cloud-based data management and analytics platform designed to provide a holistic view of aircraft maintenance. Freebird Airlines will use the solution to analyze maintenance data that will enable the air service to predict and reduce aircraft on the ground events, lowering maintenance costs and improving the passenger experience.\n\nThis new agreement adds to a suite of solutions currently used by Freebird Airlines, including OpsCore™ for aircraft flight tracking, ARINC Hermes™ for smart ACARS message management, and GLOBALinkSM for communication services.\n\n\"This collaboration with Collins Aerospace marks a significant step forward in our maintenance operations,\" said Kerem Güngörmez, maintenance manager at Freebird Airlines. \"By leveraging the advanced capabilities of Ascentia and Collins' integrated software solutions, we can enhance our maintenance, repair, and overhaul efficiency, reduce engineering costs, and improve our ability to predict and prevent on-the-ground events. This will ultimately result in a more reliable and cost-effective service for our passengers.\"\n\n\"Our software solutions allow Freebird to digitally transform their operations, using data-driven insights to inform proactive maintenance decisions that provide a high level of operational availability of their fleet,\" said Nicole White, vice president of Business Development for Connected Aviation Solutions at Collins Aerospace.\n\nAbout Freebird Airlines Freebird Airlines is a company of Gözen Holding, which has been serving in the aviation industry for more than 40 years in the fields of representation, fuel supply, supervision, brokerage, safety and training. Founded in 2000 on a strong infrastructure and holding two different registrations in Malta and Turkey, Freebird operates as an international airline with a fleet of 14 Airbus A320s. Freebird aims to create value for its customers, employees and shareholders with the technology and employment infrastructures it has developed for sustainable aviation. In 2002, Freebird was the first airline in Turkey to be awarded the ISO 9001:2000 Certification by TUV Rheinland and in July 2006, it became the first charter airline to receive the IOSA (IATA Operational Safety Audit) registration issued by IATA (International Air Transport Association).\n\nStory continues\n\nAbout Collins Aerospace\r\nCollins Aerospace, an RTX business, is a leader in integrated and intelligent solutions for the global aerospace and defense industry. Our 80,000 employees are dedicated to delivering future-focused technologies to advance sustainable and connected aviation, passenger safety and comfort, mission success, space exploration, and more.\n\nAbout RTX\r\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-ascentia-awarded-first-predictive-maintenance-customer-in-turkey-with-freebird-airlines-302204531.html\n\nSOURCE RTX\n\nView comments()",
        "link": "https://finance.yahoo.com/news/rtxs-ascentia-awarded-first-predictive-040000722.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.008,
            "neu": 0.824,
            "pos": 0.168
        }
    }
]