[
    {
        "date": "2024-05-07T11:45:00+00:00",
        "title": "3 Defense Stocks to Sell in May Before They Crash &amp; Burn",
        "content": "Although geopolitical tensions are high and defense spending is generally on the rise globally, not all defense stocks companies will benefit. Some defense contractors may face challenges. Those include supply chain disruptions, labor shortages or reputational risks that could impact performance and prices.\n\nMoreover, the defense industry is heavily dependent on government contracts and budget allocations. And those can be highly unpredictable and subject to political shifts. Companies that rely heavily on a few key contracts or have a narrow product portfolio may be more vulnerable to changes in government priorities or spending cuts.\n\nMore specifically, some defense stocks have a mix of weakening fundamentals and overvalued natures. Let’s explore some of those that investors should sell this month.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nRTX Corporation (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nRTX Corporation (NYSE:RTX) is known for its aerospace and defense products. Quite recently, it faced a significant setback with a defect discovered in 1,200 of its jet engines. This issue requires grounding and inspection of the engines, which could impact the company’s financial performance and reputation.\n\nImportantly, RTX did very well in its Q1 results. Also, the Raytheon defense division showed strong profit margin growth. However, the Collins Aerospace and Pratt & Whitney divisions experienced margin declines. This could be a concern, as these two divisions account for a significant portion of RTX’s revenue.\n\nSome analysts’ commentary leans into RTX being currently overvalued. It trades at high multiples compared to both its historical averages as well as the median for its peer universe. So although a solid stock, a pullback may be needed, and it could be primed for a retracement.\n\nThe Boeing Company (BA) image of a Boeing (BA) 737 max aircraft. stocks to buy and sell related to Boeing\n\nSource: Marco Menezes / Shutterstock.com\n\nThe Boeing Company (NYSE:BA) has also experienced challenges. The company’s stock performance has been underwhelming compared to market expectations. Furthermore, BA has faced production issues and other operational difficulties.\n\nBad news has been abound for the stock, which is perhaps one of the most impactful media disasters of the last decade for a company. Also, last month, the Chief Executive Officer (CEO) indicated that there could be more bad news forthcoming.\n\nDuring the earnings call, CEO Calhoun mentioned that 737 production will be “slow and lumpy” in Q2 as the company works through challenges over the next 60 days. Chief Financial Officer (CFO) Brian West also indicated that Boeing is slowing near-term production of the 787 Dreamliner. The company is planning to return to five per month later in the year. So, these production issues could impact the company’s performance.\n\nStory continues\n\nAlso, Northcoast Research cut its rating for BA stock to sell from neutral. It cites channel checks that point to a lower build rate for the 787 Dreamliner than Boeing’s claim of five per month. This discrepancy could indicate an underlying problem not yet shared with investors.\n\nLockheed Martin (LMT) Close top view of a Lockheed Martin (LMT) F-35C Lightning II with afterburner on\n\nSource: ranchorunner / Shutterstock.com\n\nWhile traditionally a strong performer, Lockheed Martin (NYSE:LMT) has recently been subject to concerns over its valuation and the sustainability of its growth.\n\nLMT stock has underperformed the S&P 500 in 2021 and 2023, despite outperforming in 2022. This inconsistent performance, especially during a period when many other stocks have provided better returns with less risk, may make LMT less attractive to some investors.\r\n\r\nAdditionally, despite strong revenue growth, Lockheed Martin’s consolidated operating margin declined by 170 basis points year-over-year (YOY) to 11.8% in Q1. Lower operating margins led to a decrease in earnings per share compared to the prior-year quarter.\n\nLike RTX, I think that LMT is a great stock but its valuation is too rich due to its own success. Its high valuation makes it more vulnerable to market and systemic risks than others. Therefore, it should be worth waiting on the sidelines before considering adding LMT to one’s portfolio. And similar to RTX, it also trades at high valuation multiples to its historical performance. This prompts caution.\n\nOn the date of publication, Matthew Farley did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nMatthew started writing coverage of the financial markets during the crypto boom of 2017 and was also a team member of several fintech startups. He then started writing about Australian and U.S. equities for various publications. His work has appeared in MarketBeat, FXStreet, Cryptoslate, Seeking Alpha, and the New Scientist magazine, among others.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 3 Defense Stocks to Sell in May Before They Crash & Burn  appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-defense-stocks-sell-may-114500256.html",
        "symbols": [
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "BA.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.916,
            "neg": 0.05,
            "neu": 0.878,
            "pos": 0.071
        }
    },
    {
        "date": "2024-05-07T00:00:00+00:00",
        "title": "3 Defense Stocks to Sell in May Before They Crash &amp; Burn ",
        "content": "With overvaluations and risks persisting, discover three defense stocks that investors should drop this month before potential crashes. ",
        "link": "https://investorplace.com/2024/05/3-defense-stocks-to-sell-in-may-before-they-crash-burn/",
        "symbols": [
            "BA.US",
            "LMT.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.402,
            "neg": 0.203,
            "neu": 0.725,
            "pos": 0.072
        }
    }
]