[
    {
        "date": "2024-05-13T14:27:52+00:00",
        "title": "10 Weakest Militaries in Asia",
        "content": "In this article, we look at the 10 weakest militaries in Asia. You can skip our detailed analysis of the current defense spending trends in the continent, and head over directly to the 5 Weakest Militaries in Asia.\n\nAccording to the latest figures released by the Stockholm International Peace Research Institute (SIPRI), global military spending registered its steepest rise since 2009, increasing 6.8% from 2022 to total $2.44 trillion in 2023. This was the ninth successive year in which the world’s military spending had risen, with all major regions, including the Americas, Europe, and Asia witnessing an increase.\n\nIn 2023, $560 billion was spent on defense across Asia, increasing 3.6% year over year. Of this, $411 billion was incurred in East Asia, which represented 73% of the continent’s total defense spending. On the other hand, defense spending in South Asia was recorded at $98.2 billion, whereas $47.8 billion was expensed in Southeast Asia. The least expenditure in the continent was noticed in Central Asia, where only $1.8 billion was spent during the year.\n\nDefense expenditure in Asia has risen by more than 40% since 2014, with a sharp rise being observed in East Asia and South Asia – the two major flashpoints of military and diplomatic escalation in the continent. Countries in the region have gotten embroiled in an arms race, and the resultant surge in demand for weapons has created a boom in the global armaments industry.\n\nAccording to defense experts, the threat of China invading and annexing Taiwan is greater today than it ever was, with Beijing steadily stockpiling its arsenal for the last few decades. In response, the United States, in order to protect its own and Taipei’s interests, has ramped up its military presence in the Indo-Pacific region. Washington has also recently approved sales of weapons worth billions of dollars to Taiwan. In March last year, in a move that soured the relationship further between the United States and China, the American government approved selling new weapons worth $619 million to Taiwan, which included 200 Advanced Medium Range Air-to-Air Missiles (AMRAAM) and 100 AGM-88B HARM missiles, among others. Lockheed Martin Corporation (NYSE:LMT) and RTX Corporation (NYSE:RTX) are the primary contractors of the deal.\n\nThe arms race between South Korea and North Korea also does not seem to have an end in sight any soon. Kim Jong-un’s regime has been a thorn in Seoul’s side, and has launched over a hundred ballistic missiles over the last two years, signaling Pyongyang's intentions of not relinquishing its weapons of mass destruction. South Korea in response increased its defense spending by 3.6% last year compared to 2022, incurring $47.9 billion in 2023, which included an order placed in September for 25 F-35 fighter jets from Lockheed Martin Corporation (NYSE:LMT) valued at $5.06 billion. According to Yonhap News Agency, Seoul had already acquired another 40 F-35s from Lockheed Martin Corporation (NYSE:LMT) between 2019 and 2022.\n\nStory continues\n\nThe South China Sea continues to remain a point of contention between regional and global powers, with Beijing laying a claim over nearly all of its strategic waterways, while Taiwan, Malaysia, Vietnam, and the Philippines have overlapping claims as well. South Asia also remains hot, as Pakistan and India continue to pile up their arsenals in what is termed as the most weaponized region in the world. The arch-rivals regularly launch newer, improved missiles, and showcase their latest military equipment in parade ceremonies and drills to flaunt their war capabilities to the other.\n\nCountries in the Middle East have also been heavily upgrading their military capabilities to enhance national security, especially after the jolts faced by the Arab Spring in the early 2010s. Saudi Arabia has remained the fifth largest defense spender in the world for two successive years now – 2022 and 2023 – with over $75 billion incurred in military spending in each of these years, including a $3 billion agreement with the United States to purchase 300 MIM-104E Patriot missiles from RTX Corporation (NYSE:RTX). There are also reports about RTX Corporation (NYSE:RTX) moving the production of parts involved in manufacturing the Patriot missiles to Saudi Arabia.\n\nAll said and done, while defense spending continues to expand significantly in Asia, the increase has not been even within the continent, as was evident from the breakdown of military spending in Asia shared earlier in the discussion. There are regions and countries in the continent where defense expenditure, sizes and inventories of militaries remain small, because of which, these are some of the weakest militaries in Asia.\n\nWe now take a look at these countries. If interested, you can also read our article on the 15 Most Powerful Militaries in Asia. 10 Weakest Militaries in Asia\n\niurii/Shutterstock.com\n\nMethodology\n\nWe have considered three broad weighted categories to rank the weakest militaries in Asia. These include the strength of ground troops in terms of manpower, tanks, and armored fighting vehicles (30%), size of the economy and defense spending (30%), and aerial and naval capabilities (40%). Weighted scores for each metric were aggregated to get a final overall score. The 10 weakest militaries in Asia are ranked in descending order of these scores.\n\nData related to military equipment and defense spending has been sourced from the Global Firepower Index 2024, Stockholm International Peace Research Institute (SIPRI), and other independent news agencies of various countries. The International Monetary Fund (IMF) was consulted for figures related to countries’ GDP.\n\nBy the way, Insider Monkey is an investing website that uses a consensus approach to identify the best stock picks of more than 900 hedge funds investing in US stocks. The website tracks the movement of corporate insiders and hedge funds. Our top 10 consensus stock picks of hedge funds outperformed the S&P 500 stock index by more than 140 percentage points over the last 10 years (see the details here). So, if you are looking for the best stock picks to buy, you can benefit from the wisdom of hedge funds and corporate insiders.\n\nLet’s now head over to the list of the weakest militaries in Asia.\n\n10 Weakest Armed Forces in Asia:\n\n10. Lebanon\n\nGDP (2023): $21.78 billion\n\nDefense Spending (2023): $241.3 million\n\nActive Manpower: 60,000\n\nTanks: 204\n\nArmored Fighting Vehicles: 4,522\n\nMilitary Aircraft: 81\n\nNaval Assets: 69\n\nOverall Score: 9.0\n\nWe begin with Lebanon, which has the weakest military in the Middle East, and one that faces an asymmetric threat from non-state actors, including militant groups. A major challenge impeding the potential of the Lebanese military is its shortage of logistical equipment and a lack of financial resources. The country’s air force also remains weak, with only nine combat aircraft; the rest of the fleet comprising attack helicopters and transport aircraft.\n\n9. Armenia\n\nGDP (2023): $24.54 billion\n\nDefense Spending (2023): $1.33 billion\n\nActive Manpower: 57,500\n\nTanks: 221\n\nArmored Fighting Vehicles: 736\n\nMilitary Aircraft: 64\n\nNaval Assets: 0\n\nOverall Score: 7.6\n\nNext on our list is Armenia. The country has significantly increased its manpower and defense spending in wake of the armed conflict with Azerbaijan in the Nagorno-Karabakh region in 2020. Despite that Armenia’s military capabilities remain limited, and the results in the conflict in which it ended up losing territory reflects its weaknesses. The country has a small fleet of battle tanks and military aircraft, and has no naval assets. It has a force of 57,500 personnel when it comes to active military manpower.\n\n8. Laos\n\nGDP (2023): $14.24 billion\n\nDefense Spending (2023): $40 million\n\nActive Manpower: 100,000\n\nTanks: 130\n\nArmored Fighting Vehicles: 1,880\n\nMilitary Aircraft: 34\n\nNaval Assets: 45\n\nOverall Score: 6.4\n\nLaos is the only landlocked country in Southeast Asia, with a population of 7.5 million people. It has the weakest military in Southeast Asia and one of the weakest in Asia, with only 130 battle tanks, 34 military aircraft, and 45 naval assets. It has a sizable number of active military personnel and a large fleet of armored fighting vehicles; however, these are not sufficient to help the country to shrug off its reputation of being a weak link when it comes to military strength in the continent.\n\n7. Nepal\n\nGDP (2023): $41.34 billion\n\nDefense Spending (2023): $418.9 million\n\nActive Manpower: 95,000\n\nTanks: 0\n\nArmored Fighting Vehicles: 2,216\n\nMilitary Aircraft: 15\n\nNaval Assets: 0\n\nOverall Score: 6.2\n\nNepal is one of the weakest militaries in Asia with no battle tanks and naval assets. Its fleet of armored fighting vehicles is the country's only recognizable area of military strength. The military aircraft fleet of Nepal includes no combat aircraft, with all 15 of these aircraft either being transport jets or combat helicopters. Nepal relies heavily on India for most of its military equipment. Due to the country’s weak military, there has been growing concern in India over Nepal becoming a hub for cross-border spying against Delhi’s security interests.\n\n6. Afghanistan\n\nGDP (2023): $14.94 billion\n\nDefense Spending (2023): $278.3 million\n\nActive Manpower: 80,000\n\nTanks: 20\n\nArmored Fighting Vehicles: 6,555\n\nMilitary Aircraft: 17\n\nNaval Assets: 0\n\nOverall Score: 5.8\n\nAfghanistan is sixth on our list of the weakest militaries in Asia. After the collapse of Ashraf Ghani’s government in 2021, the Afghan National Security Forces (ANSF) were replaced by the Taliban’s Islamic Emirate Armed Forces as the national military of the country. Most of the military equipment in Afghanistan’s inventory, especially the armored fighting vehicles, is what was left behind by the American-led coalition. Afghanistan has no naval assets, only 17 military aircraft, and 20 battle tanks, according to the Global Firepower Index. There has been a scarcity of information that comes out Kabul after the Taliban takeover, but rough estimates suggest the group has about 80,000 fighters that now form part of the national military.\n\nClick to continue reading and see the 5 Weakest Militaries in Asia.\n\nSuggested Articles:\n\n15 Weakest Militaries in the World 10 Weakest Militaries in Europe 10 Weakest Militaries in Africa\n\nDisclosure: None. 10 Weakest Militaries in Asia is originally published on Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/10-weakest-militaries-asia-142752027.html",
        "symbols": [
            "0R3E.LSE",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.959,
            "neg": 0.071,
            "neu": 0.853,
            "pos": 0.076
        }
    },
    {
        "date": "2024-05-13T14:00:00+00:00",
        "title": "RTX's Pratt &amp; Whitney receives Transport Canada type certification for PW545D engine",
        "content": "Engine selected to power Textron Aviation's business jet delivers improved specific fuel consumption, greater thrust and extended time between overhauls\n\nLONGUEUIL, Quebec, May 13, 2024 /PRNewswire/ -- Pratt & Whitney Canada's PW545D engine is one step closer to entry into service with type certification granted May 9 by Transport Canada Civil Aviation. In May 2023, Textron Aviation announced its new Cessna Citation Ascend business jet would be powered by twin PW545D engines. Pratt & Whitney is an RTX (NYSE: RTX) business.  Pratt & Whitney Canada receives Transport Canada certification for the PW545D engine selected to power the Cessna Citation Ascend business jet from Textron Aviation.\n\n\"As the latest derivative in the PW500 engine family, we look forward to the Ascend's entry into service,\" said Cedric Gauthier, vice president, Sales and Marketing, General Aviation, Pratt & Whitney Canada. \"Certification was granted following 630 hours of engine testing, in addition to 230 hours of flight testing on the Ascend prototype test aircraft.\"\n\nThe new engine incorporates an advanced mixer and efficiency improvements in the compressor and turbine sections, thereby lowering fuel burn and reducing operating temperatures. The new engine is also equipped with Full Authority Digital Engine Control (FADEC) technology which is included with many PW500 models. This enables the Citation Ascend to integrate new auto-throttle technology that simplifies engine operation, maximizes efficiency and reduces pilot workload.\n\nThere are approximately 4,600 PW500 engines in service today, with more than 5,000 manufactured. The fleet has flown approximately 24.5 million hours. PW500 engines also power other aircraft in the Textron Aviation portfolio such as the Cessna Citation Bravo, Excel, XLS, XLS+, Ultra Encore and Encore+. In addition to a family of business jets, Textron Aviation also manufactures twin- and single-engine turboprops, many of which are powered by Pratt & Whitney Canada engines.\n\nRead more about Pratt & Whitney's history of innovation here.\n\nAbout Pratt & Whitney Pratt & Whitney is a world leader in the design, manufacture and service of aircraft engines and auxiliary power units.\n\nAbout RTX\r\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/rtxs-pratt--whitney-receives-transport-canada-type-certification-for-pw545d-engine-302143494.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-pratt-whitney-receives-transport-140000417.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.978,
            "neg": 0.01,
            "neu": 0.903,
            "pos": 0.086
        }
    }
]