[
    {
        "date": "2024-07-23T16:00:00+00:00",
        "title": "RTX's Raytheon partners with AVIO to build a more resilient U.S. Defense Industrial Base for solid rocket motor production",
        "content": "Raytheon signs contract with AVIO to continue the development of solid rocket motor solutions to meet USG and Allied Demand.\n\nLONDON, July 23, 2024 /PRNewswire/ -- Farnborough Air Show -- Raytheon, an RTX (NYSE: RTX) business, signed a contract with Avio (AVIO.MI), leaders in propulsion technology, for the development of critical solid rocket motors for defense applications. The contract further progresses systems engineering work required to mature these solid rocket motors into a production-ready state.\n\n\"This partnership with Avio marks a commitment between our companies to work together to develop resilient and responsive production of solid rocket motors,\" said Bob Butz, vice president, operations and supply chain, Raytheon. \"We will continue to develop and mature potenial rocket motor solutions with Avio to ensure we can meet the increased long-term demand of our domestic and international customers.\"\n\nIn April 2024, Avio completed its preliminary design development to support the pressing need for additional sources for two critical solid rocket motor systems. Avio's planned investments in capability and capacity enable them to help support immediate customer demand. Avio is leveraging its Italian manufacturing and engineering teams' existing capabilities to support the maturation of Avio USA, and to facilitate their domestic solid rocket motor manufacturing strategy.\n\n\"We are leveraging our past experience and track record in solid rocket motors to help expand production capacity and develop new product lines to meet the growing demand,\" said Giulio Ranzo, CEO of Avio. \"Avio and Avio USA are eager to partner with Raytheon to build a more resilient U.S. industrial base for rocket motors.\"\n\nAbout Raytheon Raytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nAbout Avio is a leading international group operating in the development and production of space launchers and solid propulsion systems for defense applications. With over 1,300 employees, Avio runs its business in Italy and in French Guyana at the European spaceport, where its satellite launcher Vega is operated. The experience and know-how in defense and space solid propulsion dates back over 60 years during which the company has developed advanced technologies and manufacturing solutions. The company is headquartered in Rome, Italy and has its subsidiary Avio USA headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-raytheon-partners-with-avio-to-build-a-more-resilient-us-defense-industrial-base-for-solid-rocket-motor-production-302203699.html\n\nSOURCE RTX",
        "link": "https://finance.yahoo.com/news/rtxs-raytheon-partners-avio-build-160000673.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.996,
            "neg": 0.026,
            "neu": 0.804,
            "pos": 0.17
        }
    },
    {
        "date": "2024-07-23T12:00:00+00:00",
        "title": "SKY Airline selects RTX's Pratt &amp; Whitney GTF™ engine to power up to 39 Airbus A320neo family aircraft",
        "content": "SKY becomes first-time Pratt & Whitney customer\n\nLONDON, July 23, 2024 /PRNewswire/ -- Farnborough Air Show – Pratt & Whitney, an RTX (NYSE: RTX) business, announced today that Chilean-based SKY Airline has entered into a memorandum of understanding to select the GTF engine to power 10 firm Airbus A321XLR aircraft, with options for 29 Airbus A320neo and A321neo aircraft. With this selection, SKY Airline becomes a first-time Pratt & Whitney customer.\n\n\"This selection is a testament to SKY Airline's confidence in the GTF engine over the long term,\" said Rick Deurloo, president of Commercial Engines at Pratt & Whitney. \"These engines and aircraft will enable SKY to continue its route expansion while delivering industry-leading fuel efficiency and low CO2 emissions.\"\n\nPratt & Whitney plans to provide long-term maintenance services via an EngineWise™ Comprehensive service agreement.\n\nFounded in Chile in 2001, SKY is a low-cost airline that operates a modern fleet of Airbus A320/A321neo aircraft, becoming the first full neo-operator worldwide, and flying to more than 40 domestic and international routes in the Americas through its subsidiaries in Chile and Peru. In June 2024, SKY was awarded as \"The best low-cost airline in South America\" by SKYTRAX, for the fourth time.\n\n\"SKY has doubled revenues compared to pre-COVID and plans to continue this successful growth path for the next six years, including expanding our valuable low-cost model to the long range markets, becoming the first airline to introduce the XLR aircraft in Latin America,\" said Juan Pablo Latorre, chief financial officer, SKY Airline. \"As we continue to grow, SKY remains focused on making travel accessible, affordable and sustainable. The A320neo family aircraft powered by GTF engines will provide both environmental and economic advantages.\"\n\nAbout Pratt & Whitney\r\nPratt & Whitney is a world leader in the design, manufacture and service of aircraft engines and auxiliary power units. To learn more visit www.prattwhitney.com.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com. Cision\n\nView original content:https://www.prnewswire.com/news-releases/sky-airline-selects-rtxs-pratt--whitney-gtf-engine-to-power-up-to-39-airbus-a320neo-family-aircraft-302203543.html\n\nSOURCE RTX",
        "link": "https://finance.yahoo.com/news/sky-airline-selects-rtxs-pratt-120000051.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.983,
            "neg": 0.011,
            "neu": 0.897,
            "pos": 0.092
        }
    },
    {
        "date": "2024-07-23T10:45:00+00:00",
        "title": "RTX's Pratt &amp; Whitney delivers F100 engine in support of Poland's F-16 Fighting Falcon fleet",
        "content": "F100s rolling off production line bolster ally's military readiness\n\nLONDON, July 23, 2024 /PRNewswire/ -- Farnborough Air Show -- Pratt & Whitney, an RTX (NYSE: RTX) business, has announced the delivery of an F100 engine to Poland. This delivery supports Poland's ongoing efforts to strengthen the readiness of its F-16 fleet, which is powered exclusively by Pratt & Whitney engines.\n\n\"This is the first of several engines we'll deliver to our Polish ally this year to ensure they have the propulsion power they need to address current and future threats,\" said Josh Goodman, senior director of the F100 Program at Pratt & Whitney. \"The Pratt & Whitney F100 is the mainstay powerplant for 23 global air forces, and we are seeing increased demand for our latest generation F100 engine.\"\n\nCurrently produced in Middletown, Connecticut, the original F100 engines powering the Polish F-16 fleet were manufactured at Pratt & Whitney's Rzeszów facility. Today, nearly 20 years later, that facility produces F100 static structures and critical rotating parts in support of new F100 engines and worldwide sustainment.\n\nThe F100 boasts operationally proven technologies, such as advanced materials and thermal coatings, improved turbine cooling capabilities and prognostic health management. Across global F-16 and F-15 fleets, the F100 has flown more than 30 million engine flight hours, which is nearly three times as many hours as other fourth-generation fighter engines.\n\nAbout Pratt & Whitney \r\nPratt & Whitney is a world leader in the design, manufacture and service of aircraft engines and auxiliary power units. To learn more visit www.prattwhitney.com.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com.  Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-pratt--whitney-delivers-f100-engine-in-support-of-polands-f-16-fighting-falcon-fleet-302203528.html\n\nSOURCE RTX",
        "link": "https://finance.yahoo.com/news/rtxs-pratt-whitney-delivers-f100-104500675.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.979,
            "neg": 0.018,
            "neu": 0.872,
            "pos": 0.11
        }
    },
    {
        "date": "2024-07-23T10:30:00+00:00",
        "title": "Avolon selects RTX's Pratt &amp; Whitney GTF™ engines to power up to 160 Airbus A320neo family aircraft",
        "content": "Agreement is aircraft lessor's first direct GTF engine order\n\nLONDON, July 23, 2024 /PRNewswire/ -- Farnborough Air Show - Pratt & Whitney, an RTX (NYSE: RTX) business, announced today that Avolon has selected GTF engines to power 80 Airbus A320neo family aircraft. The order means Avolon will have 158 GTF-powered aircraft in its delivered and committed fleet, with options for engines to power 80 additional aircraft.\n\nThis order represents one of Pratt & Whitney's largest transactions with a lessor for its GTF engines.\n\n\"We are building on our collaboration with Avolon, who remains at the forefront of the lessor community,\" said Rick Deurloo, president of Commercial Engines at Pratt & Whitney. \"GTF engines will provide Avolon's customers with unmatched fuel efficiency and the lowest carbon emissions available for single aisle aircraft.\"\n\n\"These engines will power our large orderbook of A320neo family aircraft and put us in an excellent position to service our customers' narrowbody requirements out to 2030 and beyond,\" said Andy Cronin, chief executive officer at Avolon. \"Engine innovation has been one of the key tools to lower emissions and support the industry's decarbonization journey. We value Pratt & Whitney's strong customer focus and are excited about leveraging their GTF engines to support the transition of our fleet to more fuel-efficient technology.\"\n\nAvolon currently has a portfolio of 81 V2500-powered A320ceo family aircraft and 39 GTF-powered A320neo family aircraft in its delivered fleet.\n\nAbout Pratt & Whitney\r\nPratt & Whitney is a world leader in the design, manufacture and service of aircraft engines and auxiliary power units. To learn more visit www.prattwhitney.com.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nAbout Avolon Avolon is a leading global aviation finance company connecting capital with customers to drive the transformation of aviation and the economic and social benefits of global travel. We pride ourselves on our deep customer relationships, our collaborative team approach, and our fast execution. We invest with a long-term perspective, diversifying risk and managing capital efficiently to maintain our strong balance sheet. Working with 142 airlines in 63 countries, Avolon has an owned, managed, and committed fleet of 1,029 aircraft, as of 30 June 2024. www.avolon.aero\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com. Cision\n\nView original content:https://www.prnewswire.com/news-releases/avolon-selects-rtxs-pratt--whitney-gtf-engines-to-power-up-to-160-airbus-a320neo-family-aircraft-302203361.html\n\nSOURCE RTX",
        "link": "https://finance.yahoo.com/news/avolon-selects-rtxs-pratt-whitney-103000695.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.99,
            "neg": 0.023,
            "neu": 0.859,
            "pos": 0.118
        }
    },
    {
        "date": "2024-07-23T10:00:00+00:00",
        "title": "RTX's StormBreaker goes 14 for 14 from the F-35C in U.S. Navy flight tests",
        "content": "RTX tests StormBreaker across four separate platforms, with three services, for 28 total flight tests in 2023\n\nLONDON, July 23, 2024 /PRNewswire/ -- Farnborough Air Show — Raytheon, an RTX (NYSE: RTX) business announced 28 tests of its StormBreaker® smart weapon in 2023, including a 100 percent success rate on 14 of 14 planned jettisons from the F-35C. The additional 14 tests throughout the year included employment from the F/A-18E/F, F-15E, and F-35B across the U.S. Navy, Marines, and Air Force.\n\n\"Service-members need trusted weapons that are highly survivable, network enabled and keep them as far from harm's way as possible,\" said Paul Ferraro, president of Air & Space Defense Systems at Raytheon. \"StormBreaker's unique capabilities position it as the right choice for multiple generations of weapons systems.\"\n\nStormBreaker is an air-launched, precision-strike standoff weapon that enables the service-members to defeat moving and fixed targets. It can operate in adverse weather conditions through its tri-mode seeker that employs infrared and millimeter wave radar to see through fog, smoke and rain. The weapon has the capability to receive updated target coordinates mid-flight via two-way datalink communications. Using these network options, StormBreaker allows airborne or ground controllers the ability to send in-flight target updates.\n\nAbout Raytheon Raytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nAbout RTX\n\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com. Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-stormbreaker-goes-14-for-14-from-the-f-35c-in-us-navy-flight-tests-302203522.html\n\nSOURCE RTX",
        "link": "https://finance.yahoo.com/news/rtxs-stormbreaker-goes-14-14-100000793.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.945,
            "neg": 0.059,
            "neu": 0.825,
            "pos": 0.117
        }
    }
]