[
    {
        "date": "2024-09-23T12:00:00+00:00",
        "title": "airBaltic and RTX's Pratt &amp; Whitney Unveil Long-Term Engine Maintenance Deal",
        "content": "GTF maintenance agreement supports airline's growth plans\n\nEAST HARTFORD, Conn., Sept. 23, 2024 /PRNewswire/ -- Latvian national airline airBaltic and Pratt & Whitney have announced a long-term EngineWise™ Comprehensive maintenance services agreement for the airline's GTF engine fleet. This agreement links airBaltic's maintenance costs to the utilization of the airline's engines. Pratt & Whitney is an RTX (NYSE: RTX) business.\n\n\"Pratt & Whitney has been a long-term, trusted collaborator of airBaltic since we became the global launch operator of the Airbus A220-300 aircraft type back in 2016,\" said Martin Gauss, president and CEO of airBaltic. \"The aircraft's PW1500G GTF engines have delivered a 25% reduction in fuel burn per seat compared to previous generations, resulting in significant cost savings. This agreement will support the growth plans of airBaltic towards a 100 Airbus A220-300 fleet by the year 2030. We are looking forward to many more years of successful cooperation with Pratt & Whitney.\"\n\nThe 17-year per-engine agreement provides airBaltic with greater transparency and predictability in maintenance planning and associated costs.\n\n\"We will provide long-term support to airBaltic to optimize fleet performance as they expand their route network,\" said Rick Deurloo, president of Commercial Engines at Pratt & Whitney. \"We appreciate the airline's continued confidence in the GTF engine and the value it provides with industry-leading fuel efficiency, lower carbon emissions and smaller noise footprint. Together, we share a strong commitment to make air travel more accessible while reducing the environmental impact.\"\n\nAbout airBaltic airBaltic (Air Baltic Corporation AS) is the leading airline in the Baltics and one of Europe's fastest-growing carriers. As a hybrid airline, it leverages the upsides of both traditional network and low-cost carriers. Through a network of more than 130 routes from Riga, Tallinn, Vilnius, Tampere and, seasonally, Gran Canaria, airBaltic connects the Baltics with over 80 destinations across Europe, the Middle East, North Africa, and the Caucasus. Founded in 1995, today airBaltic operates one of Europe's youngest fleets, consisting of 48 Airbus A220-300 aircraft, and employs over 2 600 professionals. The company is majority-owned by the Latvian state, which holds a 97.97% stake, with the remaining 2.03% owned by private shareholders.\n\nairBaltic's commitment to excellence is recognized by numerous prestigious awards including the Best Airline in its region by Skytrax for three consecutive years. In 2022, the International Air Transport Association (IATA) recognized airBaltic with the Diversity and Inclusion Team Award, and in 2023, the company received the APEX Passenger Choice Award for Best Cabin Service in Europe. In 2024, the airline was awarded the PROS AI Innovator Award for leveraging AI to drive transformative outcomes and optimize operations.\n\nStory continues\n\nAbout Pratt & Whitney \r\nPratt & Whitney is a world leader in the design, manufacture and service of aircraft engines and auxiliary power units. To learn more visit www.prattwhitney.com.\n\nAbout RTX \r\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor further information, please contact: CorporatePR@rtx.com or pr@airbaltic.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/airbaltic-and-rtxs-pratt--whitney-unveil-long-term-engine-maintenance-deal-302254938.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/airbaltic-rtxs-pratt-whitney-unveil-120000830.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.008,
            "neu": 0.802,
            "pos": 0.19
        }
    }
]