[
    {
        "date": "2024-05-29T08:00:00+00:00",
        "title": "RTX's Collins Aerospace wins prestigious Crystal Cabin Award for STARLight™ structural technology",
        "content": "Collins has now won 14 Crystal Cabin Awards in the program's 18-year history\n\nHAMBURG, Germany, May 29, 2024 /PRNewswire/ -- Collins Aerospace, an RTX (NYSE: RTX) business has been named a winner of a 2024 Crystal Cabin Award for its STARLight™ structural technology. The Crystal Cabin Award is the only international award for excellence in aircraft interior innovation. Lightweight and flexible, STARLight™ structural technology can seamlessly integrate into many aircraft interior components.\n\nPlacing first in the Material and Components category, Collins' STARLight structures are ultra-lightweight, strong and sustainable composite structures that can easily integrate into many cabin interior spaces – including seats, galleys, monuments, lavatories, interior linings and more.\n\nAdvanced composite designs tools, automated manufacturing techniques and the use of renewable materials result in architectures that are thinner and lighter weight than traditional honeycomb panels. The monolithic structures are reinforced with stiffeners that match the shape and curvature of the final structure, providing enhanced strength, reliability and integrity to the end product.\n\n\"Innovation and the relentless pursuit of technology development and integration is not just core to all we do but is foundational to Collins' service of our global customer base,\" said Rebecca Stoner, vice president of engineering at Collins Aerospace. \"The recognition of STARLight structures as a Crystal Cabin Award winner is an incredible testament to the Collins team and how something as simple as material development and optimization can provide an outsized impact on manufacturing, cabin integration and aircraft operations.\"\n\nThe advanced machining techniques utilized by STARLight technologies eliminate the need for pre-preg fabric, adhesives and bonding in the material assembly process – not only eliminating structural weight but also leading to a significant reduction in material waste and energy-intensive processes in manufacturing.\n\nCollins was named a finalist for two other 2024 Crystal Cabin Awards, including its ARISE™ intelligent comfort system and ADAPT™ digital flight experience control.\n\nAbout Collins Aerospace\r\nCollins Aerospace, an RTX business, is a leader in integrated and intelligent solutions for the global aerospace and defense industry. Our 80,000 employees are dedicated to delivering future-focused technologies to advance sustainable and connected aviation, passenger safety and comfort, mission success, space exploration, and more.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/rtxs-collins-aerospace-wins-prestigious-crystal-cabin-award-for-starlight-structural-technology-302157336.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-collins-aerospace-wins-prestigious-080000269.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.013,
            "neu": 0.786,
            "pos": 0.2
        }
    },
    {
        "date": "2024-05-29T07:00:00+00:00",
        "title": "RTX's Collins Aerospace introduces its Helix™ next-generation main cabin seat",
        "content": "The lightweight seat makes short and medium haul travel more comfortable, reliable and spacious\n\nHAMBURG, Germany, May 29, 2024 /PRNewswire/ -- Collins Aerospace, an RTX (NYSE: RTX) business introduced its Helix™ main cabin seat for narrow body aircraft at the 2024 Aircraft Interiors Expo. Helix is intelligently engineered to reduce weight in comparison to previous generations of economy class seats while maintaining ergonomic comfort and improving living space without impacting cabin density. The advanced structural design, engineering and material usage of the Helix™ main cabin seat enhances passenger comfort, increases in-seat stowage and improves product reliability, all while weighing less than similar main cabin seats.\n\n\"Helix seating was developed with three key pillars in mind – comfort, reliability and sustainability,\" said Christophe Blanc, vice president and general manager of Aircraft Seating at Collins Aerospace. \"The contemporary design increases passenger living space and under seat stowage, while the seat back is optimized to accommodate a greater number of integrated inflight entertainment (IFE) solutions, literature pockets and full-sized meal trays.\n\nHigh strength-to-weight composite materials and advanced design enable a definitive weight savings over similar economy class seats, reducing the overall carry weight of aircraft, associated fuel burn and carbon emissions.\n\nA reimagined frame design not only optimizes passenger seat back angles for longer lasting comfort, but also improves cushion integration – enhancing ergonomics, product longevity and consistency across cabins and fleets.\n\nCollins is currently engaged with a number of airline customers to introduce the Helix main cabin seat into their narrowbody fleets.\n\nAbout Collins Aerospace\r\nCollins Aerospace, an RTX business, is a leader in integrated and intelligent solutions for the global aerospace and defense industry. Our 80,000 employees are dedicated to delivering future-focused technologies to advance sustainable and connected aviation, passenger safety and comfort, mission success, space exploration, and more.\n\nAbout RTX\r\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com The advanced structural design, engineering and material usage of the Helix™ main cabin seat enhances passenger comfort, increases in-seat stowage and improves product reliability, all while weighing less than similar main cabin seats. The advanced structural design, engineering and material usage of the Helix™ main cabin seat enhances passenger comfort, increases in-seat stowage and improves product reliability, all while weighing less than similar main cabin seats. Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/rtxs-collins-aerospace-introduces-its-helix-next-generation-main-cabin-seat-302157435.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-collins-aerospace-introduces-helix-070000675.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.009,
            "neu": 0.803,
            "pos": 0.188
        }
    }
]