[
    {
        "date": "2024-06-28T16:00:08+00:00",
        "title": "RTX (RTX) Upgraded to Buy: What Does It Mean for the Stock?",
        "content": "Investors might want to bet on RTX (RTX), as it has been recently upgraded to a Zacks Rank #2 (Buy). This rating change essentially reflects an upward trend in earnings estimates -- one of the most powerful forces impacting stock prices.\n\nThe sole determinant of the Zacks rating is a company's changing earnings picture. The Zacks Consensus Estimate -- the consensus of EPS estimates from the sell-side analysts covering the stock -- for the current and following years is tracked by the system.\n\nSince a changing earnings picture is a powerful factor influencing near-term stock price movements, the Zacks rating system is very useful for individual investors. They may find it difficult to make decisions based on rating upgrades by Wall Street analysts, as these are mostly driven by subjective factors that are hard to see and measure in real time.\n\nAs such, the Zacks rating upgrade for RTX is essentially a positive comment on its earnings outlook that could have a favorable impact on its stock price.\n\nMost Powerful Force Impacting Stock Prices\n\nThe change in a company's future earnings potential, as reflected in earnings estimate revisions, and the near-term price movement of its stock are proven to be strongly correlated. The influence of institutional investors has a partial contribution to this relationship, as these big professionals use earnings and earnings estimates to calculate the fair value of a company's shares. An increase or decrease in earnings estimates in their valuation models simply results in higher or lower fair value for a stock, and institutional investors typically buy or sell it. Their bulk investment action then leads to price movement for the stock.\n\nFor RTX, rising earnings estimates and the consequent rating upgrade fundamentally mean an improvement in the company's underlying business. And investors' appreciation of this improving business trend should push the stock higher.\n\nHarnessing the Power of Earnings Estimate Revisions\n\nAs empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock movements, tracking such revisions for making an investment decision could be truly rewarding. Here is where the tried-and-tested Zacks Rank stock-rating system plays an important role, as it effectively harnesses the power of earnings estimate revisions.\n\nThe Zacks Rank stock-rating system, which uses four factors related to earnings estimates to classify stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), has an impressive externally-audited track record, with Zacks Rank #1 stocks generating an average annual return of +25% since 1988. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here >>>>.\n\nStory continues\n\nEarnings Estimate Revisions for RTX\n\nFor the fiscal year ending December 2024, this an aerospace and defense company is expected to earn $5.39 per share, which is a change of 6.5% from the year-ago reported number.\n\nAnalysts have been steadily raising their estimates for RTX. Over the past three months, the Zacks Consensus Estimate for the company has increased 0.1%.\n\nBottom Line\n\nUnlike the overly optimistic Wall Street analysts whose rating systems tend to be weighted toward favorable recommendations, the Zacks rating system maintains an equal proportion of 'buy' and 'sell' ratings for its entire universe of more than 4000 stocks at any point in time. Irrespective of market conditions, only the top 5% of the Zacks-covered stocks get a 'Strong Buy' rating and the next 15% get a 'Buy' rating. So, the placement of a stock in the top 20% of the Zacks-covered stocks indicates its superior earnings estimate revision feature, making it a solid candidate for producing market-beating returns in the near term.\n\nYou can learn more about the Zacks Rank here >>>\n\nThe upgrade of RTX to a Zacks Rank #2 positions it in the top 20% of the Zacks-covered stocks in terms of estimate revisions, implying that the stock might move higher in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-rtx-upgraded-buy-does-160008692.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.008,
            "neu": 0.858,
            "pos": 0.134
        }
    },
    {
        "date": "2024-06-28T10:00:00+00:00",
        "title": "7 Defense Stocks to Buy Amid Peace Summit Tensions",
        "content": "Although labeled as the peace summit, an international call for an end to Russia’s invasion of Ukraine effectively did little more than harden ideological lines. While a great many support a roadmap to peace that encompasses Ukraine’s territorial integrity, key players – namely Russia and China, along with a few others – believe differently. What can be said is that defense stocks to buy present a cynically positive framework.\n\nUnless the Russians agree to pull back their troops – something that Moscow has demonstrated zero intention of doing without receiving what Ukraine considers unacceptable concessions – and return to internationally recognized borders, the conflict will likely continue. At this point, then, the U.S. and its allies have little to do except to bolster their military capabilities.\n\nFrankly, the conflict may come down to who is going to blink first. For the U.S. to keep its superpower reputation intact, it just can’t blink at all.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nWhat makes defense stocks to buy even more compelling is that no matter who’s president next, foreign policy will likely play a huge role in any administration. Being the long superpower affords the U.S. with great economic advantages that can be lost if that power is shared with other nations. While it’s a controversial topic, it’s time to consider these defense plays.\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) Space Systems sign in Sunnyvale, California.\n\nSource: Ken Wolter / Shutterstock.com\n\nLockheed Martin (NYSE:LMT) is one of the biggest names in defense stocks to buy. Fundamentally, the company is important for its ability to project power. Thanks to its massive aerospace division, U.S. forces and allies maintain air superiority across vast regions of the world. Of course, Lockheed is vital in myriad other areas. However, the ability to respond to saber rattling has never been more important.\n\nFinancially, LMT stock doesn’t offer the most exciting profile, I’m just keeping it real. However, it benefits from consistency. Between the second quarter of last year to Q1 2024, the company’s average earnings per share hit nearly $6.91. This print translated to an average earnings surprise of 5.5%.\n\nDuring the trailing 12 months (TTM), Lockheed posted net income of $6.78 billion or earnings of $27.34 per share. Revenue in the period reached $69.64 billion. The latest quarterly sales rate (year-over-year) landed at 13.7%.\n\nFor fiscal 2024, covering experts anticipate a slight dip in EPS to $26.27. However, revenue could rise by 3.2% to $69.76 billion. Further, it offers a forward yield of 2.69%. Again, LMT isn’t exciting but it’s one of the top defense stocks to buy.\n\nStory continues\n\nNorthrop Grumman (NOC) Northrop Grumman (NOC) logo on a corporate building\n\nSource: Kristi Blokhin / Shutterstock.com\n\nAnother revered (and feared) name among defense stocks to buy, Northrop Grumman (NYSE:NOC) makes a strong case for inclusion in your portfolio. Frankly, tensions in Europe are only going to rise unless the Russians encounter a catastrophic battlefield defeat. In the meantime, China consistently presents an adversarial presence. Essentially, Northrop’s myriad weapons systems keeps honest people honest.\n\nFinancially, Northrop occupies similar ground to Lockheed Martin. Neither company is particularly riveting from an investment standpoint. However, Northrop – like its rival – is consistent. During the past four quarters, it posted EPS of $6.03. This print translated to an earnings surprise of just under 6%.\n\nDuring the TTM period, Northrop posted net income of $2.16 billion or $14.35 per share. In the cycle, revenue reached $40.12 billion. Further, the company’s most recent quarterly sales growth rate hit 8.9%. For fiscal 2024, experts believe EPS may rise 6.35% to land at $24.77. On the top line, sales could rise 4.6% to reach $41.11 billion.\n\nLastly, Northrop offers a forward dividend yield of 1.92%. It’s a solid idea if you’re looking for a stable candidate among defense stocks to buy.\n\nRTX (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nFormerly known as Raytheon Technologies, RTX (NYSE:RTX) is a key player within the aerospace and defense sector. Per its public profile, RTX provides systems and services for commercial, military and government customers. It’s easily one of the top defense stocks to buy thanks to its weapons systems, especially its interceptor missiles.\n\nRaytheon of course plays a major role in responding to saber rattling. However, it’s also important to back up the tough talk: Raytheon does a lot of backing up, let’s put it that way. Even better, RTX stock isn’t all doom, gloom and boom. In the past four quarters, the underlying company’s EPS landed at roughly $1.27. This print translated to an earnings surprise of 6.45%.\n\nIn the TTM period, RTX posted net income of $3.48 billion or $2.54 per share. Moreover, revenue in the cycle hit $71.01 billion. The latest quarterly sales growth rate stands at 12.1%. For fiscal 2024, analysts see EPS rising by 6.3% to hit $5.38. On the top line, revenue may clock in at $79.07 billion, up 6.4% from last year.\n\nRTX offers a decent forward yield of 2.48% for those on the fence.\n\nHuntington Ingalls Industries (HII) Person holding smartphone with logo of US company Huntington Ingalls Industries Inc (HII) on screen in front of website Focus on phone display\n\nSource: Wirestock Creators / Shutterstock.com\n\nOne of the distinct plays among defense stocks to buy, Huntington Ingalls Industries (NYSE:HII) designs and builds military ships. It’s also responsible for their overhauling and repairs. This business will be increasingly significant, not only from a capacity perspective but also as a projection of power. Unlike the Russians, the U.S. commands a dominant naval force.\n\nFurther, with tensions rising with China, both the current and future administrations can’t afford to show weakness. The U.S. Navy will be called upon to demonstrate the nation’s broader military supremacy. Therefore, I see a huge demand influx for HII stock. So far, the financials bear this out. During the past four quarters, the average earnings surprise came out to a robust 21.03%.\n\nIn the TTM period, Huntington posted net income of $705 million, translating to $17.71 per share. Revenue in this cycle reached $11.59 billion. The most recent quarterly sales growth rate comes in at 4.9%. For fiscal 2024, experts see a slight dip in EPS to $16.56. However, the top line may rise modestly to $11.72 billion from last year’s $11.45 billion.\n\nHuntington also offers a forward yield of 2.07%. While you might not get rich with HII, it’s one of the most relevant defense stocks to buy.\n\nAeroVironment (AVAV) The logo for AeroVironment (AVAV) is seen through a magnifying glass on the company's website.\n\nSource: Pavel Kapysh / Shutterstock.com\n\nA higher-risk, higher-reward idea within the aerospace and defense sector, AeroVironment (NASDAQ:AVAV) flew to fame with its self-destruct zones. Essentially, military operators can hide behind cover while directly an unmanned drone. Should a target be cited, an operator can deliberately crash into it, with the aim of destruction or disablement.\n\nDrone warfare represented one of the key takeaways in the conflict in Ukraine. I’d imagine that future conflicts will involve the same, meaning that AeroVironment may cynically benefit from increased demand. It hasn’t always been the most consistent financial performer, with the company missing in its fiscal Q1 2023 report. However, during the past four quarters, its average earnings surprise clocked in at 107.5%.\n\nDuring the TTM period, AeroVironment posted a net loss of $106.85 million or $4.44 per share in the red. However, sales hit $705.78 million. Further, the most recent sales growth rate soared to 38.8%.\n\nFor fiscal 2024, analysts anticipate a big jump in EPS to $2.81. Also, revenue may reach $708.15 million, a 31% increase from last year. It’s one of the enticing defense stocks to buy.\n\nBoeing (BA) Royal Air Force Boeing (BA) Chinook HC2A (352) [ZH895] lifting off from runway\n\nSource: InsectWorld / Shutterstock.com\n\nAerospace giant Boeing (NYSE:BA) presents a controversial narrative, not just for the underlying relevance to defense stocks to buy but also because of troubles in its civilian unit. Without going into all the details, Boeing for the last few years has struggled due to safety concerns associated with its jetliners. That’s the kind of stuff that happens when doors blow off airplanes.\n\nIt appears that the controversies have weighed on the firm’s financials. In the past four quarters, Boeing incurred an average loss per share of $1.33. In fairness, the red ink came in at a lesser degree than experts anticipated. Therefore, the average quarterly surprise came out to 18.08%. Still, BA stock is down heavily on a year-to-date basis.\n\nIn the TTM period, Boeing suffered a net loss of $2.15 billion or $3.54 per share. Sales in the period landed at $76.44 billion. For fiscal 2024, analysts expect a major improvement to a loss of $1.36. Last year, the company posted a loss of $5.81 per share.\n\nOn the top line, sales may dip 5.4% to $73.58 billion. Still, a recovery could materialize in fiscal 2025, with sales projected to rise to $88.36 billion.\n\nBlacksky Technology (BKSY) futuristic image of earth from space to represent aerospace stocks\n\nIf you want to roll the dice with your defense stocks to buy, Blacksky Technology (NYSE:BKSY) might be an enticing prospect. For all intents and purposes, when you consider the lowly share price and the nothing-burger market capitalization, Blacksky is a penny stock. However, it’s part of the burgeoning geospatial intelligence ecosystem. Therefore, it could play a huge role in critical data collection.\n\nUnderstanding where enemy positions are located along with potential areas of movement will offer military operators a potentially pivotal advantage. Therefore, BKSY stock could reasonably see a demand influx if more people recognize the opportunity. For now, it’s a hit-or-miss affair financially. Still, it must be said that in terms of mitigating expected losses per share, Blacksky posted a quarterly surprise of 11.45% between Q2 2023 and Q1 2024.\n\nDuring the TTM period, the company incurred a net loss of $52.35 million or 37 cents per share. Revenue in the period hit $100.33 million. For fiscal 2024, experts believe Blacksky will post a loss per share of 34 cents, an improvement from last year’s 39 cents in the red.\n\nRevenue may land at $108.94 million, up 15.3%. Further, fiscal 2025 sales could soar to $138.54 million, up 27.2%.\n\nOn the date of publication, Josh Enomoto did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nA former senior business analyst for Sony Electronics, Josh Enomoto has helped broker major contracts with Fortune Global 500 companies. Over the past several years, he has delivered unique, critical insights for the investment markets, as well as various other industries including legal, construction management, and healthcare. Tweet him at @EnomotoMedia.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. Legendary Investor Predicts: “Forget A.I. THIS Technology Is the Future”\n\nThe post 7 Defense Stocks to Buy Amid Peace Summit Tensions appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/7-defense-stocks-buy-amid-100000269.html",
        "symbols": [
            "0J76.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "AVAV.US",
            "BA.US",
            "BKSY.US",
            "HI4.F",
            "HI4.STU",
            "HII.US",
            "JPX.BE",
            "JPX.F",
            "JPX.STU",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.07,
            "neu": 0.797,
            "pos": 0.133
        }
    },
    {
        "date": "2024-06-28T08:43:11+00:00",
        "title": "Reflecting On Defense Contractors Stocks’ Q1 Earnings: AeroVironment (NASDAQ:AVAV)",
        "content": "Reflecting On Defense Contractors Stocks’ Q1 Earnings: AeroVironment (NASDAQ:AVAV)\n\nEarnings results often indicate what direction a company will take in the months ahead. With Q1 now behind us, let’s have a look at AeroVironment (NASDAQ:AVAV) and its peers.\n\nDefense contractors typically require technical expertise and government clearance. Companies in this sector can also enjoy long-term contracts with government bodies, leading to more predictable revenues. Combined, these factors create high barriers to entry and can lead to limited competition. Lately, geopolitical tensions–whether it be Russia’s invasion of Ukraine or China’s aggression towards Taiwan–highlight the need for defense spending. On the other hand, demand for these products can ebb and flow with defense budgets and even who is president, as different administrations can have vastly different ideas of how to allocate federal funds.\n\nThe 14 defense contractors stocks we track reported a strong Q1; on average, revenues beat analyst consensus estimates by 3.2%. while next quarter's revenue guidance was 0.7% above consensus. Inflation progressed towards the Fed's 2% goal at the end of 2023, leading to strong stock market performance. The start of 2024 has been a bumpier ride, as the market switches between optimism and pessimism around rate cuts due to mixed inflation data, and while some of the defense contractors stocks have fared somewhat better than others, they collectively declined, with share prices falling 0.5% on average since the previous earnings results.\n\nAeroVironment (NASDAQ:AVAV)\n\nFocused on the future of autonomous military combat, AeroVironment (NASDAQGS:AVAV) specializes in advanced unmanned aircraft systems and electric vehicle charging solutions.\n\nAeroVironment reported revenues of $197 million, up 5.9% year on year, topping analysts' expectations by 4.2%. It was a strong quarter for the company, with an impressive beat of analysts' revenue and earnings estimates. AeroVironment Total Revenue\n\nThe stock is down 6.7% since the results and currently trades at $180.\n\nIs now the time to buy AeroVironment? Access our full analysis of the earnings results here, it's free.\n\nBest Q1: Northrop Grumman (NYSE:NOC)\n\nResponsible for the development of the first stealth bomber, Northrop Grumman (NYSE:NOC) specializes in providing aerospace, defense, and security solutions for various industry applications.\n\nNorthrop Grumman reported revenues of $10.13 billion, up 8.9% year on year, outperforming analysts' expectations by 3.8%. It was a stunning quarter for the company, with an impressive beat of analysts' organic revenue and EPS estimates.\n\nStory continues Northrop Grumman Total Revenue\n\nThe stock is down 8.3% since the results and currently trades at $434.99.\n\nIs now the time to buy Northrop Grumman? Access our full analysis of the earnings results here, it's free.\n\nWeakest Q1: Mercury Systems (NASDAQ:MRCY)\n\nListed on the NASDAQ in 1998, Mercury Systems (NASDAQGS:MRCY) specializes in providing processing subsystems and components for defense applications.\n\nMercury Systems reported revenues of $208.3 million, down 21% year on year, falling short of analysts' expectations by 2.9%. It was a weak quarter for the company, with a miss of analysts' revenue and earnings estimates.\n\nMercury Systems had the weakest performance against analyst estimates and slowest revenue growth in the group. The stock is down 8% since the results and currently trades at $26.76.\n\nRead our full analysis of Mercury Systems's results here.\n\nRTX (NYSE:RTX)\n\nOriginally focused on refrigeration technology, Raytheon (NSYE:RTX) provides a a variety of products and services to the aerospace and defense industries.\n\nRTX reported revenues of $19.31 billion, up 12.1% year on year, surpassing analysts' expectations by 4.9%. It was a very strong quarter for the company, with an impressive beat of analysts' organic revenue estimates and a decent beat of analysts' earnings estimates.\n\nThe stock is down 1.3% since the results and currently trades at $100.3.\n\nRead our full, actionable report on RTX here, it's free.\n\nLockheed Martin (NYSE:LMT)\n\nResponsible for renowned military systems like the F-35 fighter jet, Lockheed Martin Lockheed Martin (NYSE:LMT) specializes in defense, space, intelligence, homeland security, and information technology solutions.\n\nLockheed Martin reported revenues of $17.2 billion, up 13.7% year on year, surpassing analysts' expectations by 7.5%. It was a stunning quarter for the company, with an impressive beat of analysts' organic revenue estimates.\n\nThe stock is up 1.3% since the results and currently trades at $467.57.\n\nRead our full, actionable report on Lockheed Martin here, it's free.\n\nJoin Paid Stock Investor Research\n\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\n\nView comments",
        "link": "https://finance.yahoo.com/news/reflecting-defense-contractors-stocks-q1-084311160.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "AVAV.US",
            "JPX.BE",
            "JPX.F",
            "JPX.STU",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "MCY.F",
            "MCY.MU",
            "MCY.STU",
            "MRCY.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.035,
            "neu": 0.805,
            "pos": 0.16
        }
    },
    {
        "date": "2024-06-28T00:00:00+00:00",
        "title": "7 Defense Stocks to Buy Amid Peace Summit Tensions",
        "content": "With the latest peace summit lacking substance, the simmering tensions will likely bolster these defense stocks to buy.",
        "link": "https://investorplace.com/2024/06/7-defense-stocks-to-buy-amid-peace-summit-tensions/",
        "symbols": [
            "AVAV.US",
            "BA.US",
            "HII.US",
            "LMT.US",
            "NOC.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.318,
            "neg": 0.119,
            "neu": 0.661,
            "pos": 0.22
        }
    }
]