[
    {
        "date": "2024-08-01T20:17:17+00:00",
        "title": "The Top 3 Space Stocks to Buy Now: Summer 2024",
        "content": "Due to milestones like NASA’s Artemis 2 Moon orbit in late 2024, space stocks remain popular. Astronauts are already preparing for this voyage toward a permanent Moon presence.\n\nThe National Space Council’s new plan stresses Moon and Mars missions and ambitious human space exploration and development. Moreover, the U.S. government’s 2024 budget for NASA is $25.2 billion, reflecting substantial space exploration expenditures.\n\nAll of these projects are driving the market possibility for space stocks connected to several spheres of the industry. For instance, the space tourism business is estimated to pull in $3 billion yearly by the early 2030s. A lucrative venture is also space mining. Comprising primarily iron and nickel, the asteroid 16 Psyche alone has a value of around $10,000 quadrillion; no wonder experts estimate the market to grow 19% between 2024 and 2037.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nHowever, the space industry is still nascent, so avoid pure bets when choosing space stocks. Also, check whether the firm was successful for the majority of the previous 10 years and if the FCF margin is greater than the industry. Space exploration requires a lot of resources, so you want a company that can handle it. Here are three space stocks that make the cut.\n\nRaytheon Technologies (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nRaytheon Technologies (NYSE:RTX) is responsible for designing and constructing NASA’s Landsat Next Instrument Suite under a $506 million contract.\n\nThe U.S. Space Force’s Overhead Persistent Infrared Battlespace Awareness Center hosts Raytheon’s advanced ground system for space-based missile warning. FORGE MDPAF uses satellite data to offer timely missile warnings, highlighting Raytheon’s role in space-based military capabilities.\n\nTwo next-generation imaging devices developed by Raytheon fit Maxar’s WorldView Legion satellites, providing the highest commercial resolution for national security and commercial mapping.\n\nAmid this, RTX is shifting its military satellite market strategy to merchant supplier from prime contractor. The SDA’s Tracking Layer ordered seven ballistic and hypersonic missile-detecting satellites from the company for $250 million.\n\nRaytheon also successfully demonstrated the Standard Missile-6 with the U.S. Army’s Lower Tier Air and Missile Defense Sensor and IBCS during Valiant Shield 24.\n\nBecause of a strong earnings report and a raised outlook, RTX shares are selling close to their 52-week high. RTX has a $206 billion backlog and is seeing unprecedented demand across its portfolio.\n\nStory continues\n\nWith nine years of profitability over the last decade, RTX ranks higher than 75% of the aerospace and defense industry, and its FCF margin of 11% puts it ahead of 81%.\n\nNorthrop Grumman (NOC) Szczecin,Poland-January 2022:Northrop Grumman RQ-4 Global Hawk taking off from an airfield equipped with drone control equipment.3D Illustration.\n\nSource: Mike Mareen / Shutterstock.com\n\nNorthrop Grumman‘s (NYSE:NOC) Cygnus cargo ship, “SS Patty Hilliard Robertson,” departed the International Space Station on July 12, delivering 8,200 pounds of supplies and research equipment.\n\nNOC also provided two satellites for Space Norway’s Arctic Satellite Broadband Mission launch. These satellites will link the northern polar region to commercial internet and secure military satellite communications using Northrop Grumman’s GEOStar-3 technology.\n\nNOC and Boeing (NYSE:BA) are the sole contenders for the Space Force’s Protected Tactical Satellite-Resilient program. This project generates anti-jamming satellites for safe communications in crowded areas. The 2025 launch of Northrop Grumman’s ESPAStar-HP bus-based satellite will power this project.\n\nRegarding financials, NOC reported 7% sales growth, 13% operating income growth, over $1 billion in free cash flow in Q2 and healthy progress on the Sentinel and B-21 programs. Northrop also increased its full-year sales and earnings projection and boosted its dividend payment by 10%; Northrop expects a long-term cash flow increase of over 15% through 2026.\n\nNo surprise analysts are also bullish on NOC’s future, projecting a potential upside of 10%, complimenting a 10-year profitability record, and an FCF margin of 6.4% better than 70% of its peers.\n\nL3Harris Technologies (LHX) An image of the Harris company logo at corporate headquarters.\n\nSource: Thomas Kelley / Shutterstock.com\n\nWith a 10-year profitability record and a 7% FCF margin — better than 72% of rivals — L3 Harris Technologies (NYSE:LHX) closes off our conversation on space stocks.\n\nThe Space Development Agency has awarded L3 Harris $919 million to develop and build eighteen Tranche 2 Tracking Layer infrared space vehicles. Near-global missile warning and monitoring satellites will let the U.S. military react to hypersonic missile threats.\n\nAerojet Rocketdyne — an L3 Harris subsidiary — modernized four RS-25 engines for NASA’s Artemis IV mission. This flight will introduce the upgraded Block 1B orbit Launch System rocket.\n\nExtensive testing of L3 Harris’s newest Viper Shield EW system took place at the Integrated Defense Avionics Laboratory of the U.S. Air Force. Technology in the F-16 fighter jet monitors classifies and arranges dense background radio frequencies for situational awareness and threat protection. The Viper Shield system might use APG-83 AESA radar from former F-16s.\n\nUnder Tracking Layer Tranche 1, the SDA has also selected L3 Harris and Northrop Grumman to build 14 missile-tracking satellites. Low-Earth-orbit satellites will detect and classify ballistic and hypersonic missiles. The first satellites should fly by 2025.\n\nFinancially, LHX’s Q2 sales climbed 13% yearly to $5.3 billion, non-GAAP EPS surged 9% to $3.24 from $2.97, and it upgraded its 2024 revenue projection. The upside for LHX stock is potentially around 17%.\n\nOn the date of publication, Faizan Farooque did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nFaizan Farooque is a contributing author for InvestorPlace.com and numerous other financial sites. Faizan has several years of experience in analyzing the stock market and was a former data journalist at S&P Global Market Intelligence. His passion is to help the average investor make more informed decisions regarding their portfolio.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post The Top 3 Space Stocks to Buy Now: Summer 2024 appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/top-3-space-stocks-buy-201717833.html",
        "symbols": [
            "0K92.LSE",
            "5UR.F",
            "5UR.XETRA",
            "BA.US",
            "HRS.BE",
            "HRS.DU",
            "HRS.F",
            "HRS.XETRA",
            "LHX.US",
            "NOC.US",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.029,
            "neu": 0.864,
            "pos": 0.107
        }
    },
    {
        "date": "2024-08-01T08:28:11+00:00",
        "title": "Wizz Air cuts annual forecast after first-quarter profit slumps 44%",
        "content": "Wizz Air lowered its annual profit forecast on Thursday after reporting a 44% drop in its first-quarter operating profit, partly owing to costs related to Pratt & Whitney engine troubles and one-off wet leases to bolster capacity.",
        "link": "https://www.reuters.com/business/aerospace-defense/wizz-air-cuts-annual-forecast-after-first-quarter-profit-slumps-44-2024-08-01/",
        "symbols": [
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.052,
            "neg": 0.156,
            "neu": 0.708,
            "pos": 0.137
        }
    },
    {
        "date": "2024-08-01T00:00:00+00:00",
        "title": "The Top 3 Space Stocks to Buy Now: Summer 2024",
        "content": "Space stocks are surging with major contracts and advanced missile detection technology, leading the way in space innovation.",
        "link": "https://investorplace.com/2024/08/the-top-3-space-stocks-to-buy-now-summer-2024/",
        "symbols": [
            "LHX.US",
            "NOC.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.557,
            "neg": 0,
            "neu": 0.777,
            "pos": 0.223
        }
    }
]