[
    {
        "date": "2024-09-18T21:43:40+00:00",
        "title": "Why Is RTX Corporation (RTX) The Best Defense Stock to Buy Now?",
        "content": "We recently published a list of 10 Best Defense Stocks To Buy Now. In this article, we are going to take a look at where RTX Corporation (NYSE:RTX) stands against other defense stocks to buy now.\n\nAs we move into 2025 and beyond, the defense industry stands at a critical juncture, where technological advancements, evolving geopolitical threats, and increased spending from both public and private sectors are converging to shape the future of aerospace and defense (A&D). The years ahead promise significant growth opportunities for companies within the sector, especially those positioned at the forefront of innovation and strategic alignment. This article aims to provide a detailed overview of the best investment opportunities in the defense sector, which will be heavily influenced by emerging technologies, hypersonic developments, and the ongoing digital transformation of the industry.\n\nAccording to Deloitte, one of the most exciting developments shaping the defense landscape in years ahead is the emergence of supersonic and hypersonic technologies. NASA’s X-59 QueSST program has been pushing the boundaries of quiet supersonic travel, aiming to reduce sonic boom intensity and revolutionize high-speed aviation. While this technology is still in its nascent stages, manufacturers are optimistic about its potential, having already secured significant investments and collaborations with major airlines. This optimism reflects the increasing recognition that supersonic travel may not just be a technological marvel but an economically viable solution for future air travel.\n\nIn addition to supersonic travel, the defense sector is witnessing an unparalleled surge in demand for hypersonic technology, both for offensive and defensive purposes. The U.S. Department of Defense (DOD) has allocated a substantial budget in fiscal year 2024 to develop and test hypersonic capabilities, including glide vehicles and cruise missiles. As this technology inches closer to operationalization, defense companies are expected to accelerate their efforts to bring hypersonic weapons systems to market, which will likely drive growth in the sector for years to come.\n\nLooking ahead, the A&D industry’s growth will be driven by a combination of defense and commercial spending. With escalating geopolitical tensions, the demand for next-generation defense capabilities is at an all-time high. The global defense budget surpassed $2.24 trillion in 2022, and the U.S. DOD has requested $842 billion for fiscal year 2024, a 3.2% increase from the previous year. This funding surge is set to propel innovation in areas such as artificial intelligence (AI), advanced technologies, and the modernization of air, ground, and naval vehicles, all of which will play a crucial role in shaping the defense sector over the next decade.\n\nStory continues\n\nInvestors should pay close attention to companies involved in the defense supply chain, particularly those engaged in research and development (R&D) of cutting-edge defense equipment. The DOD’s emphasis on AI, microelectronics, quantum computing, and advanced propulsion systems is expected to fuel rapid technological advancements. By focusing on these areas, defense firms can maintain their competitive edge, providing ample opportunities for investors looking to capitalize on the sector’s growth potential.\n\nIn addition to traditional defense technologies, the space sector is becoming an increasingly important part of the A&D industry’s future. U.S. spending on space-related defense initiatives has risen sharply, with the U.S. Space Force (USSF) requesting $30.1 billion for fiscal year 2024. This represents a 15% increase from the previous year, and the trend is expected to continue into 2025 and beyond as the U.S. works to maintain its strategic advantage in space. Investments in cybersecurity, space exploration, and resilient space forces will remain a key focus, positioning companies in the space and defense sectors for long-term growth.\n\nWhile the defense industry is set to thrive in the coming years, it is not without its challenges. Inflation, which has been a persistent issue in recent years, is expected to remain a concern as the industry grapples with the rising costs of materials and production. In real terms, the U.S. defense budget increase of 3.2% for fiscal year 2024 may be overshadowed by inflation rates, currently hovering around 6%. This could limit the DOD’s flexibility in launching new missions or advancing certain technologies, as resources are reallocated to cover essential operational costs. Despite these headwinds, companies that can innovate and streamline their supply chains will likely find ways to mitigate these risks.\n\nCommercial aerospace is another area that will see significant investment in the years to come. The recovery of international and domestic passenger traffic to pre-pandemic levels is projected to drive new aircraft orders, with increased spending on digitalization, new product development, and next-generation technologies like Advanced Air Mobility (AAM) and space exploration. Companies that can tap into these emerging markets will find themselves well-positioned to benefit from the broader recovery of the aerospace sector.\n\nMoving forward, the AAM sector, in particular, is expected to transition from R&D to full-scale manufacturing and commercialization. Aircraft manufacturers are targeting type certification for their AAM vehicles, with the first wave of commercialization anticipated in 2025. To support these efforts, substantial investments in infrastructure—such as vertiports, charging stations, and pilot training facilities—are expected to drive long-term growth in this emerging market. Companies that position themselves as leaders in AAM technology will be at the forefront of this transformation, offering attractive investment opportunities for those with a forward-looking perspective.\n\nThe future of the defense industry also hinges on the successful integration of digital tools throughout the supply chain. The concept of the “digital thread,” which connects engineering, manufacturing, and aftermarket activities, is becoming increasingly important as companies look to streamline their operations and reduce time-to-market for new products. By embracing digital transformation, A&D companies can accelerate the certification and commercialization of new technologies, providing a significant competitive advantage in a rapidly evolving industry.\n\nFurthermore, the importance of cybersecurity in the defense sector cannot be overstated. As the industry becomes more digitally interconnected, the risk of cyberattacks increases. In response, defense companies are expected to invest heavily in cyber-resiliency measures to protect sensitive data and critical infrastructure. This focus on cybersecurity will be particularly relevant in 2025 and beyond, as companies work to safeguard their operations against increasingly sophisticated cyber threats.\n\nIn addition to technology and innovation, geopolitical factors will continue to shape the defense industry in years ahead. The ongoing conflict between Russia and Ukraine, tensions in the South China Sea, and the broader competition for global dominance between the U.S. and China are expected to drive further increases in defense spending. The U.S. DOD is investing heavily in next-generation technologies to maintain its strategic advantage in these areas, with a focus on AI, quantum computing, and space capabilities.\n\nMoreover, the private sector’s role in defense innovation is expected to grow as the DOD continues to engage with small businesses, startups, and academia to accelerate the integration of emerging technologies. Initiatives like the Defense Innovation Unit (DIU) and AFWERX are helping to bridge the gap between the government and the private sector, fostering innovation and driving growth in the defense industry.\n\nFor investors, companies that can successfully navigate these partnerships and bring new technologies to market will offer compelling investment opportunities. As the defense industry looks toward the future, the companies that can embrace technological advancements, adapt to changing geopolitical dynamics, and manage inflationary pressures will be best positioned for long-term success. For investors, identifying the best defense stocks to buy now will require a keen understanding of these trends and an eye for companies that are leading the charge in innovation, digital transformation, and operational excellence.\n\nOur Methodology\n\nFor this article we first screened for companies operating in the defense sector and picked the 30 largest companies operating in the space. We then sourced the hedge fund sentiment for these companies from Insider Monkey’s proprietary database of 912 elite money managers. We narrowed down our selection to stocks that were the most widely-held by hedge funds and then ranked them in ascending order of the number of hedge fund holders, as of Q2 2024.\n\nAt Insider Monkey we are obsessed with the stocks that hedge funds pile into. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\n\nAn aerial view of a commercial jetliner in flight, its airframe glinting in the sun.\n\nRTX Corporation (NYSE:RTX)\n\nNumber of Hedge Fund Holders: 54\n\nRTX Corporation (NYSE:RTX) stands out as a leading defense stock due to its diverse and robust portfolio in aerospace and defense systems, which serves a broad range of commercial, military, and government clients. The company operates through four main segments: Collins Aerospace Systems, Pratt & Whitney, Raytheon Intelligence and Space (RIS), and Raytheon Missiles and Defense (RMD). Each segment brings critical capabilities to the defense sector, from avionics and aircraft engines to advanced radar systems and missile defense solutions. This makes Raytheon a compelling choice for investors seeking exposure to the defense industry.\n\nIn the second quarter of 2024, RTX Corporation (NYSE:RTX) reported impressive financial results that underscore its strong market position and operational efficiency. The company achieved adjusted sales of $19.8 billion, reflecting a 10% organic growth. This growth was driven by significant contributions from all three major business segments and is indicative of robust demand across its product lines. The adjusted EPS of $1.41 surpassed analysts’ expectations of $1.30, marking a 9% increase year-over-year, driven by profit growth and improved margins.\n\nRTX Corporation (NYSE:RTX) financial metrics highlight its operational strength. The company generated $2.2 billion in free cash flow, reinforcing its solid financial health and ability to return value to shareholders. The backlog continued to grow, reaching $206 billion with a book-to-bill ratio of 1.25, signaling strong future revenue visibility. Noteworthy contract wins include a multibillion-dollar award for the U.S. Air Force’s next-generation airborne operations center and a significant contract for SPY-6 radar production for the U.S. Navy, further emphasizing Raytheon’s pivotal role in defense technology.\n\nThe company has also demonstrated strategic foresight with substantial investments in innovation and capacity expansion. Raytheon is advancing in areas such as hybrid electric propulsion, next-generation sensing, and hypersonics, with a commitment of over $7.5 billion to research and development this year. This focus on future technologies not only supports ongoing growth but also positions Raytheon to capitalize on evolving defense needs. Overall, RTX Corporation (NYSE:RTX) offers a compelling investment case within the defense sector. Its strong financial performance, substantial backlog, and strategic investments in cutting-edge technologies reflect a well-positioned company poised for continued growth and value creation in the defense industry.\n\nOverall, RTX ranks 3rd on our list of best defense stocks to buy now. While we acknowledge the potential of RTX as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than RTX but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nREAD NEXT: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/why-rtx-corporation-rtx-best-214340413.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.026,
            "neu": 0.758,
            "pos": 0.216
        }
    },
    {
        "date": "2024-09-18T14:00:00+00:00",
        "title": "RTX's Collins Aerospace receives first-ever FAA approval to increase cockpit processing power",
        "content": "Collins' Display with Mosarc increases cockpit processing power by 75% and decreases certification risk\n\nCEDAR RAPIDS, Iowa, Sept. 18, 2024 /PRNewswire/ -- Collins Aerospace, an RTX (NYSE: RTX) business, received the first-ever FAA Technical Standard Order (TSO) approval for a fully enabled multi-core processor. The CollinsMultifunction Display, powered by Mosarc™, will increase the speed, capacity and flexibility of an aircraft's flight deck, providing 75% more capability than traditional single core processors.\n\nWith this authorization, the Multifunction Display is now the world's first multi-core processor that's certified for civil and military aircraft and facilitates simultaneous use of all processing cores across all Design Assurance Level (DAL) standards. This certification paves the way to utilize the processor for future hardware to enable multi-core processing.\n\n\"On a military mission, every second counts and access to information is critical,\" said Dave Schreck, vice president and general manager of Military Avionics and Helicopters at Collins Aerospace. \"Collins' display is the only multi-core processor on the market that is certified by the FAA and is being used by the U.S. Army. This translates to being much more efficient in integrating new capabilities while also being able to safely run more applications in parallel than ever before.\"\n\nThis enhanced performance comes from the system's ability to process data 12 times faster than a single core processor, consuming 40% less power. It integrates multiple operating systems, which enables rapid third-party integration and reduces vendor lock. Ultimately, this provides platforms the flexibility to integrate evolving mission-systems capabilities in weeks rather than recertifying flight critical applications every time, which can take months or longer.\n\nCollins has been a leading provider of civil-certified, high integrity, safety-critical processors for military aircraft for more than two decades. To date, the display has completed more than 6,000 hours of flight tests and is optimized for use in rotary-wing, fighter, bomber and trainer environments.\n\nAbout Collins Aerospace Collins Aerospace, an RTX business, is a leader in integrated and intelligent solutions for the global aerospace and defense industry. Our 80,000 employees are dedicated to delivering future-focused technologies to advance sustainable and connected aviation, passenger safety and comfort, mission success, space exploration, and more.\n\nAbout RTX\r\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com  Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-collins-aerospace-receives-first-ever-faa-approval-to-increase-cockpit-processing-power-302251549.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-collins-aerospace-receives-first-140000328.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.993,
            "neg": 0.014,
            "neu": 0.856,
            "pos": 0.13
        }
    }
]