[
    {
        "date": "2024-08-05T15:25:38+00:00",
        "title": "Hungary's competition watchdog fines Wizz Air for misleading communication",
        "content": "Hungary's competition watchdog has imposed a fine of 770,000 euros ($839,916) on Wizz Air for misleading communication, the authority said on its website on Saturday.",
        "link": "https://www.reuters.com/sustainability/hungarys-competition-watchdog-fines-wizz-air-misleading-communication-2024-08-03/",
        "symbols": [
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.226,
            "neg": 0.148,
            "neu": 0.738,
            "pos": 0.114
        }
    },
    {
        "date": "2024-08-05T13:42:10+00:00",
        "title": "3 Defense Stocks to Sell Before You Regret It",
        "content": "Selling defense stocks at a time when the wider market is showing strong growth may seem counterintuitive to investors. However, with more uncertainty set to reign in the months ahead, it now is a good time to trim.\n\nIn recent years, defense stocks have rallied throughout Wall Street. VanEck’s Defense ETF has grown 36.54% in the past 12 months, far outpacing the S&P 500.\n\nPlus, with the prospect of a United States presidential election in November, the new incumbent could oversee dramatic changes. For instance, changes over the political landscape surrounding the conflicts in Europe and the Middle East.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nDespite their outperformance, defense stocks don’t necessarily rally during periods of conflict. Evidence from Russia’s invasion of Ukraine in 2022 shows that affected stocks experienced significant outperformance before the conflict began. Relative returns fell largely flat for the following nine months in line with a wider bear market.\n\nUncertainty could arise from the U.S. presidential election, with both candidates discussing at length their proposals for peace talks. We could see the defense market struggle to maintain its momentum in the future. These three stocks are at risk:\n\nBoeing (BA) boeing stock\n\nSource: VDB Photos / Shutterstock.com\n\nIt has been a challenging year for aviation and defense firm Boeing (NYSE:BA).\n\nThe stock ended the first half of 2024 27.7% down. Its struggles have pushed Boeing more than 50% adrift from its all-time high value recorded in Q1 2019.\n\nWith the appointment of Robert Ortberg as CEO, Boeing hopes to address its heavy losses. Losses weighed in at $1.4 billion in Q2 2024, representing a drop more than triple its deficit one year ago.\n\nOne of the leading causes of Boeing’s struggles has been the long-standing fallout from its 737 MAX 9 aircraft crashes in 2018. This saw the company face lawsuits over its safety management.\n\nBecause of Boeing’s vulnerable position as a struggling defense stock at a time when the wider market is booming, the prospect of the industry slowing down could be disastrous for the stock. Thus, investors should seek to offload even if they believe in the long-term growth of the defense sector.\n\nNorthrop Grumman (NOC) A photograph of the underside of a Northrop Grumman stealth bomber.\n\nSource: Philip Pilosian / Shutterstock.com\n\nAnother aviation and defense stock that’s facing an uncertain future is Northrop Grumman (NYSE:NOC). The stock ended the first half of 2024 2.72% down and has experienced more erratic price movements amid its struggles throughout the year.\n\nDespite this, Northrop Grumman appears to remain buoyant about its long-term prospects. The firm recently raised its full-year revenue forecast and profit expectations following higher demand for weapons and the anticipation of higher defense spending.\n\nStory continues\n\nWith expectations for annual sales rising to $41.4 billion from the initial forecast of $40.8 billion, Northrop could end the year strongly. Still, with the firm’s corporate vice president and president, Thomas H. Jones, selling over $1.3 million in stock recently, the optimistic outlook may not be shared within the company.\n\nWith Northrop Grumman adjusting its sales expectations in an election year that’s set to see plenty of global political change in the United States and Europe, the stock may fall short of its targets should these bolstered new defense budgets fail to materialize.\n\nRTX (RTX) Raytheon (RTX) defense company logo hanging from glass building\n\nSource: JHVEPhoto / Shutterstock.com\n\nCould it be time for investors to cash in their profits for RTX (NYSE:RTX) following a period of solid growth and a fresh all-time high value?\n\nThe firm is a conglomerate of leading defense companies, Raytheon Technologies, Collins Aerospace, and Pratt & Whitney. Following better-than-expected Q2 earnings, in which an 8% year-over-year sales increase to $19.72 billion was recorded, the stock climbed to new heights.\n\nHowever, questions have been raised about RTX’s sustainability in the event of a Trump presidency. With the Republican nominee repeatedly suggesting that his reinstatement could help bring peace to afflicted regions, the strong performance of leading firms like RTX could quickly run out of steam.\n\nWith a $1.7 billion program to deliver Patriot missiles to NATO and Israel that could be scrapped in the event of a Trump victory, there could be a period of volatility ahead for RTX looking further afield.\n\nOn the date of publication, Dmytro Spilka did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOn the date of publication, the responsible editor did not have (either directly or indirectly) any positions in the securities mentioned in this article.\n\nDmytro is a finance and investing writer based in London. He is also the founder of Solvid, Pridicto and Coinprompter. His work has been published in Nasdaq, Kiplinger, FXStreet, Entrepreneur, VentureBeat and InvestmentWeek.\n\nMore From InvestorPlace\n\nLegendary Investor Predicts: “Forget AI... THIS Technology Is the Future”\n\nThe post 3 Defense Stocks to Sell Before You Regret It appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/3-defense-stocks-sell-regret-134210150.html",
        "symbols": [
            "0K92.LSE",
            "5UR.F",
            "5UR.XETRA",
            "BA.US",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F",
            "NTH.MU",
            "NTH.STU",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.978,
            "neg": 0.072,
            "neu": 0.816,
            "pos": 0.112
        }
    },
    {
        "date": "2024-08-05T00:00:00+00:00",
        "title": "3 Defense Stocks to Sell Before You Regret It",
        "content": "Given the uncertainty that could arise from the U.S. presidential election, we could see the defense stocks struggle to maintain its momentum.",
        "link": "https://investorplace.com/2024/08/3-defense-stocks-to-sell-before-you-regret-it/",
        "symbols": [
            "BA.US",
            "NOC.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.494,
            "neg": 0.187,
            "neu": 0.754,
            "pos": 0.06
        }
    }
]