[
    {
        "date": "2024-08-28T21:00:20+00:00",
        "title": "Jim Cramer Says RTX Is His Favorite Defense Stock, Likes This Semiconductor Stock That 'Has Come Down A Great Deal'",
        "content": "Jim Cramer Says RTX Is His Favorite Defense Stock, Likes This Semiconductor Stock That 'Has Come Down A Great Deal'\n\nBenzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\n\nOn CNBC’s \"Mad Money Lightning Round,\" Jim Cramer said he likes Arm Holdings plc (NASDAQ:ARM) \"The stock has come down a great deal, and yet, at the same time, I think its business is actually accelerating,\" he noted. On Aug. 8, Bernstein upgraded the stock from Underperform to Market Perform and raised its price target from $92 to $100.\n\nTrending Now:\n\nA billion-dollar investment strategy with minimums as low as $10 — you can become part of the next big real estate boom today. This is a paid advertisement. Carefully consider the investment objectives, risks, charges and expenses of the Fundrise Flagship Fund before investing. This and other information can be found in the Fund's prospectus. Read them carefully before investing. This billion-dollar fund has invested in the next big real estate boom, here's how you can join for $10. This is a paid advertisement. Carefully consider the investment objectives, risks, charges and expenses of the Fundrise Flagship Fund before investing. This and other information can be found in the Fund's prospectus. Read them carefully before investing.\n\nWhen asked about Energy Transfer LP (NYSE:ET), he said, \"I believe its dividend is indeed safe. I’ve been back and forth and back and forth on this, and I believe that they have the coverage, and it’s an inexpensive stock, and I like the pipeline companies very, very much here.\"\n\nOn Aug. 9, Energy Transfer announced a secondary public offering of 38,755,996 of its common units.\n\nThe \"Mad Money\" host recommended buying Paychex, Inc. (NASDAQ:PAYX) with a 3% yield. \"I would buy some here, and then wait for some analysts to knock it down, buy even more. The company’s an excellent company,\" he added.\n\nRead More:\n\nCheck it out: Rory McIlroy’s mansion in Florida is worth $22 million today, doubling from 2017 — here’s how to get started investing in real estate with just $100. Purchase shares in great masterpieces from artists like Pablo Picasso, Claude Monet, Andy Warhol, and more. Here’s how you can be part of the art market. Get ‘em while you can — investing in this asset class may be reaching a high-water mark but you can still make returns right now.\n\nOn Aug. 20, JPMorgan analyst Tien-Tsin Huang maintained Paychex with an Underweight rating and raised the price target from $120 to $128.\n\nCramer said he likes defense stocks, and RTX Corporation (NYSE:RTX) is his favorite.\n\nOn July 25, RTX reported second-quarter results and raised its 2024 outlook. RTX's adjusted net sales increase 8% year-over-year to $19.791 billion, beating the consensus of $19.28 billion. Adjusted EPS grew 9% to $1.41, above the consensus of $1.30.\n\nThis article Jim Cramer Says RTX Is His Favorite Defense Stock, Likes This Semiconductor Stock That 'Has Come Down A Great Deal' originally appeared on Benzinga.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/jim-cramer-says-rtx-favorite-210020159.html",
        "symbols": [
            "ARM.US",
            "ET.US",
            "PAYX.US",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.991,
            "neg": 0.03,
            "neu": 0.839,
            "pos": 0.131
        }
    },
    {
        "date": "2024-08-28T12:00:00+00:00",
        "title": "RTX's SeaVue Multi-role Radar provides critical targeting data at RIMPAC",
        "content": "Radar proves its long-range target detection ability\n\nHONOLULU, Aug. 28, 2024 /PRNewswire/ -- Raytheon, an RTX (NYSE: RTX) business, successfully demonstrated the SeaVue Multi-role Radar's superior long-range target detection at the U.S. Navy's Exercise Rim of the Pacific (RIMPAC) – the world's largest international maritime exercise.\n\nPerforming a Sink Exercise, or SINKEX, an MQ-9B SeaGuardian® Unmanned Aircraft System from General Atomics Aeronautical Systems, Inc. used SeaVue Multi-role Radar (SVMR) surveillance and imaging to survey multiple targets and send track data to F/A-18 E/F Super Hornet aircraft. The aircraft were able to use the data provided by the radar to successfully fire a Long-Range Anti-Ship Missile (LRASM) at a decommissioned amphibious assault ship, the USS Tarawa (LHA-1), showcasing SVMR's net-enabled, long-range weapons employment capabilities.\n\n\"SVMR proved its ability to capture high fidelity targeting data needed for successful weapons engagement in a maritime environment,\" said Bryan Rosselli, president of Advanced Products & Solutions at Raytheon. \"The live-fire exercise enabled us to test and validate SVMR to ensure it can provide the situational awareness required in an operational environment –  allowing faster decision making and more efficient kill chains.\"\n\nSVMR is a modern, software-defined radar that provides all-weather surveillance and superior multi-mission performance for crewed and uncrewed aircraft, including fixed, rotary-wing and aerostat platforms.\n\nLeveraging over 60 years of surveillance radar innovation, SVMR provides extended range and small target detection from operational altitudes, enabling a more capable and efficient method for monitoring and protecting. It features a modular and scalable architecture that supports affordable upgrades and sustainment and has been developed and extensively flight tested for low and high-altitude surveillance modes.\n\nAbout Raytheon\n\nRaytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nAbout RTX\n\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-seavue-multi-role-radar-provides-critical-targeting-data-at-rimpac-302232315.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-seavue-multi-role-radar-120000608.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.05,
            "neu": 0.776,
            "pos": 0.173
        }
    },
    {
        "date": "2024-08-28T12:00:00+00:00",
        "title": "RTX President and CEO to present at the Morgan Stanley 12th Annual Laguna Conference",
        "content": "ARLINGTON, Va., Aug. 28, 2024 /PRNewswire/ -- RTX (NYSE: RTX) President and CEO Chris Calio will speak at the Morgan Stanley 12th Annual Laguna Conference on Wednesday, Sept. 11 at 11:45 a.m. Eastern Time. The presentation will be broadcast live at www.rtx.com and will be archived on the website afterward.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nMedia Contact C: 202.384.2474\n\nInvestor Contact C: 781.522.5123 Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtx-president-and-ceo-to-present-at-the-morgan-stanley-12th-annual-laguna-conference-302232170.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-president-ceo-present-morgan-120000659.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.779,
            "neg": 0.017,
            "neu": 0.898,
            "pos": 0.084
        }
    }
]