[
    {
        "date": "2024-08-31T12:01:09+00:00",
        "title": "Possible Bearish Signals With RTX Insiders Disposing Stock",
        "content": "Over the past year, many RTX Corporation (NYSE:RTX) insiders sold a significant stake in the company which may have piqued investors' interest. When evaluating insider transactions, knowing whether insiders are buying is usually more beneficial than knowing whether they are selling, as the latter can be open to many interpretations. However, when multiple insiders sell stock over a specific duration, shareholders should take notice as that could possibly be a red flag.\n\nWhile insider transactions are not the most important thing when it comes to long-term investing, logic dictates you should pay some attention to whether insiders are buying or selling shares.\n\nView our latest analysis for RTX\n\nThe Last 12 Months Of Insider Transactions At RTX\n\nThe President of Pratt & Whitney, Shane Eddy, made the biggest insider sale in the last 12 months. That single transaction was for US$3.2m worth of shares at a price of US$91.19 each. So it's clear an insider wanted to take some cash off the table, even below the current price of US$123. When an insider sells below the current price, it suggests that they considered that lower price to be fair. That makes us wonder what they think of the (higher) recent valuation. Please do note, however, that sellers may have a variety of reasons for selling, so we don't know for sure what they think of the stock price. It is worth noting that this sale was 84% of Shane Eddy's holding.\n\nIn the last year RTX insiders didn't buy any company stock. You can see the insider transactions (by companies and individuals) over the last year depicted in the chart below. If you want to know exactly who sold, for how much, and when, simply click on the graph below! insider-trading-volume\n\nI will like RTX better if I see some big insider buys. While we wait, check out this freelist of undervalued and small cap stocks with considerable, recent, insider buying.\n\nInsiders At RTX Have Sold Stock Recently\n\nOver the last three months, we've seen significant insider selling at RTX. In total, insiders dumped US$3.1m worth of shares in that time, and we didn't record any purchases whatsoever. This may suggest that some insiders think that the shares are not cheap.\n\nInsider Ownership\n\nMany investors like to check how much of a company is owned by insiders. We usually like to see fairly high levels of insider ownership. RTX insiders own 0.09% of the company, currently worth about US$151m based on the recent share price. This kind of significant ownership by insiders does generally increase the chance that the company is run in the interest of all shareholders.\n\nStory continues\n\nWhat Might The Insider Transactions At RTX Tell Us?\n\nInsiders sold RTX shares recently, but they didn't buy any. Looking to the last twelve months, our data doesn't show any insider buying. While insiders do own a lot of shares in the company (which is good), our analysis of their transactions doesn't make us feel confident about the company. While it's good to be aware of what's going on with the insider's ownership and transactions, we make sure to also consider what risks are facing a stock before making any investment decision. To that end, you should learn about the 4 warning signs we've spotted with RTX (including 1 which shouldn't be ignored).\n\nOf course RTX may not be the best stock to buy. So you may wish to see this freecollection of high quality companies.\n\nFor the purposes of this article, insiders are those individuals who report their transactions to the relevant regulatory body. We currently account for open market transactions and private dispositions of direct interests only, but not derivative transactions or indirect interests.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/possible-bearish-signals-rtx-insiders-120109768.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.989,
            "neg": 0.027,
            "neu": 0.883,
            "pos": 0.09
        }
    }
]