[
    {
        "date": "2024-10-01T20:55:53+00:00",
        "title": "Defense Stocks Jump After Iran Attacks Israel",
        "content": "Major defense stocks advanced Tuesday after Iran launched missiles at Israel, raising the odds of a wider conflict. Lockheed Martin was among the S&P 500's best performers, while RTX shares hit an all-time high.\n\nContinue reading\n\nView comments",
        "link": "https://finance.yahoo.com/m/8dc4a078-48ce-37c3-9706-fbb7a053d495/defense-stocks-jump-after.html",
        "symbols": [
            "0R2N.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.796,
            "neg": 0.051,
            "neu": 0.694,
            "pos": 0.255
        }
    },
    {
        "date": "2024-10-01T18:30:00+00:00",
        "title": "RTX's Pratt &amp; Whitney opens its largest Military Engines facility in Oklahoma City",
        "content": "$255 million investment will support global sustainment for F135, F117, TF33, F100 and F119 engines\n\nOKLAHOMA CITY, Oct. 1, 2024 /PRNewswire/ -- Pratt & Whitney, an RTX business (NYSE: RTX), celebrated the opening of its new 845,000-square-foot facility in Oklahoma City, Oklahoma, solidifying its position as the business's largest military engines field location. The $255 million investment will enable Pratt & Whitney to meet the growing demands of both U.S. and global defense customers for the F135, F117, TF33, F100 and F119 engines.\n\n\"Oklahoma City is the heart of our global sustainment network for Pratt & Whitney's Military Engines business and plays a critical role on every single one of our programs,\" said Jill Albertelli, president of Military Engines at Pratt & Whitney. \"This new facility will serve as a hub for all of our military engine programs and allow us to better support our customers and their missions.\"\n\nPratt & Whitney's Oklahoma City site is home to over 500 full-time employees, with an additional 500 contract and partner employees. This investment will create an additional 100 full-time jobs over the next five years.\n\n\"Our investment in this state-of-the-art facility underscores our commitment to meeting both today's sustainment needs and preparing for the future,\" said Greg Treacy, vice president of Pratt & Whitney in Oklahoma City.  \"This expansion more than doubles our footprint in Oklahoma City, ensuring we have the capacity and agility to support increased workloads as military programs ramp up and new ones come online.\"\n\nThe site features automation and advanced technologies that will streamline processes, improving accuracy, speed and cost-effectiveness. It also incorporates LEED-certified energy-efficient systems and waste reduction processes, reflecting RTX's commitment to sustainability and operational efficiency.\n\nLocated alongside Tinker Air Force Base, the largest maintenance, repair, and overhaul facility for the U.S. Department of Defense, the new site will enhance the business' global sustainment network and support the public-private partnership between Pratt & Whitney and the U.S. Air Force. This Oklahoma City facility is strategically positioned to meet current and future sustainment demands, supporting engines for the F-35, F-22, C-17, B-52, E-3, F-15, F-16 and more.\n\nAbout Pratt & Whitney Pratt & Whitney is a world leader in the design, manufacture and service of aircraft engines and auxiliary power units. To learn more, visit www.prattwhitney.com.\n\nStory continues\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com. Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-pratt--whitney-opens-its-largest-military-engines-facility-in-oklahoma-city-302264580.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-pratt-whitney-opens-largest-183000410.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.015,
            "neu": 0.852,
            "pos": 0.133
        }
    },
    {
        "date": "2024-10-01T14:11:55+00:00",
        "title": "RTX's Raytheon Delivers Missile-Warning Sensor",
        "content": "Raytheon, an RTX business, delivered its first sensor payload to prime contractor Lockheed Martin, keeping the U.S. Space Force Space Systems Command's first Next-Generation Overhead Persistent Infrared, or Next-Gen OPIR, Geosynchronous Earth Orbit (GEO) Block 0 missile warning satellite on track for a 2025 initial launch capability.\n\nMost Read on Design & Development Today:\n\nBoeing Completes First Flight of E-7 Wedgetail GM Recalling More Than 449,000 SUVs, Pickups Due to Issue with Low Brake Fluid Warning Light Electra Conducts Multiple Flight Demonstrations of Ultra Short Aircraft for U.S. Military A Capsule has Been Propelled Through a Hyperloop Test Tube in a Step Forward for the Transit System\n\nDesigned to improve missile warning resilience and performance, two Next-Gen OPIR GEO satellites will eventually provide continuous coverage over mid-latitudes to the existing constellation. Raytheon is designing and building sensor payloads for both satellites.\n\nPrior to delivery of the first payload, Raytheon completed a series of assessments including thermal vacuum testing. Thermal vacuum testing exposes the payload to a space-like environment and validates digital models to ensure the sensor meets design requirements. The second sensor payload is more than 60 percent completed and is scheduled to start thermal vacuum testing in early 2025.\n\nClick here to subscribeto our daily newsletter.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-raytheon-delivers-missile-warning-141155371.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.586,
            "neg": 0.064,
            "neu": 0.899,
            "pos": 0.037
        }
    },
    {
        "date": "2024-10-01T13:30:00+00:00",
        "title": "RTX's Raytheon awarded U.S. Navy contract for Next Generation Jammer Mid-Band Expansion",
        "content": "Capability upgrade will counter new adversary threats\n\nMCKINNEY, Texas, Oct. 1, 2024 /PRNewswire/ -- Raytheon, an RTX (NYSE: RTX) business, has been awarded a $192 million contract from the U.S. Navy to develop the Next Generation Jammer Mid-Band Expansion (NGJ-MBX), an upgrade to the current Next Generation Jammer Mid-Band (NGJ-MB) system.\n\nThis modification will extend the frequency range of the NGJ-MB system to counter additional threats. MBX provides additional capabilities to improve operational effectiveness.\n\n\"Offensive Electronic Attack provides a tremendous combat capability supporting strike packages and kinetic weapons across a broad range of missions,\" said Barbara Borgonovi, president of Naval Power at Raytheon. \"With this upgrade, we'll ensure our naval aviators in all theaters are better prepared to counter new adversary threats and provide greater combat power throughout their missions.\"\n\nNGJ-MB, to include MBX, is a cooperative development and production program with the Royal Australian Air Force. It is an airborne electronic attack system consisting of two pods containing active electronically scanned arrays that radiate in the mid-band frequency range.\n\nThe U.S. Navy employs NGJ-MB on the EA-18G GROWLER® to target advanced electronic warfare threats.\n\nWork under this contract will take place in Dallas; Forest, Michigan; El Segundo, California; and Fort Wayne, Indiana through 2027.\n\nAbout Raytheon\r\nRaytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nAbout RTX\r\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com  Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-raytheon-awarded-us-navy-contract-for-next-generation-jammer-mid-band-expansion-302263874.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-raytheon-awarded-u-navy-133000866.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.882,
            "neg": 0.098,
            "neu": 0.763,
            "pos": 0.139
        }
    },
    {
        "date": "2024-10-01T12:00:00+00:00",
        "title": "RTX to release third quarter results on October 22, 2024",
        "content": "ARLINGTON, Va., Oct. 1, 2024 /PRNewswire/ -- RTX (NYSE: RTX) will issue its third quarter 2024 earnings Tuesday, October 22, prior to the stock market opening. A conference call will take place at 8:30 a.m. ET.\n\nThe conference call will be webcast live on the company's website at www.rtx.com and will be available for replay following the call. A presentation corresponding with the conference call will be available for downloading prior to the call.\n\nAbout RTX With more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nMedia Contact C: 202.384.2474\n\nInvestor Contact C: 781.522.5123 Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtx-to-release-third-quarter-results-on-october-22-2024-302262955.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-release-third-quarter-results-120000583.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.779,
            "neg": 0.015,
            "neu": 0.912,
            "pos": 0.073
        }
    },
    {
        "date": "2024-10-01T09:37:43+00:00",
        "title": "RTX Wins $1.3B Contract For F135 Engine Upgrade: Details",
        "content": "RTX Wins $1.3B Contract For F135 Engine Upgrade: Details\n\nOn Monday, RTX Corporation‘s (NYSE:RTX) business, Pratt & Whitney, won a contract worth up to $1.3 billion to advance the F135 Engine Core Upgrade (ECU).\n\nThe contract is expected to boost engine durability and enhance power and cooling for Block 4 and future F-35 capabilities.\n\nJill Albertelli, president of Pratt & Whitney’s Military Engines business, said, “It allows us to continue work in the risk reduction phase with a fully staffed team focused on design maturation, aircraft integration, and mobilizing the supply base to prepare for production.”\n\nJeff Shockey, senior vice president of RTX Global Government Relations, stated, “Their steadfast commitment to the F135 ensures it will deliver critical capabilities for decades to come.”\n\nTo date, Pratt & Whitney has delivered over 1,200 F135 engines, accumulating more than 900,000 flight hours.\n\nThe F135 ECU will be integrated into new F-35s during production or retrofitted at global F135 depot sustainment facilities, making it accessible to all F-35 operators.\n\nApart from this, RTX’s Raytheon delivered its first sensor payload to Lockheed Martin Corporation (NYSE:LMT), ensuring the U.S. Space Force’s Next-Generation Overhead Persistent Infrared (Next-Gen OPIR) Geosynchronous Earth Orbit (GEO) Block 0 missile warning satellite remains on schedule for its initial launch in 2025.\n\nInvestors can gain exposure to the stock via iShares U.S. Aerospace & Defense ETF (BATS:ITA) and First Trust Exchange-Traded Fund First Trust Indxx Aerospace & Defense ETF (NYSE:MISL).\n\nPrice Action: RTX shares are up 0.12% at $121.16 premarket at the last check Tuesday.\n\nRead Next:\n\nRussia To Expand Army For Third Time Since War With Ukraine Began: Defense Stocks RTX, Northrop Grumman Gain\n\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools. Click now to access unique insights that can set you ahead in today's competitive market.\n\nGet the latest stock analysis from Benzinga?\n\nRTX (RTX): Free Stock Analysis Report\n\nThis article RTX Wins $1.3B Contract For F135 Engine Upgrade: Details originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-wins-1-3b-contract-093743978.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "LMT.US",
            "MISL.US",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.985,
            "neg": 0.044,
            "neu": 0.817,
            "pos": 0.139
        }
    }
]