[
    {
        "date": "2024-09-26T14:45:00+00:00",
        "title": "RTX Secures a Contract to Support Stinger Weapon Systems",
        "content": "RTX Corporation’s RTX business unit, Raytheon Missiles Defense, recently won a $46.8 million contract to provide engineering and technical services for supporting the Stinger Weapon System. The award has been offered by the Army Contracting Command, Redstone Arsenal, AL.\n\nMore About RTX’s Stinger Missile\n\nThe Stinger missile is a lightweight, self-contained air defense system that can be quickly deployed by ground forces. The weapon is currently deployed in 19 countries, which reflects the solid demand it enjoys in the missile market.\r\n\r\nIts Stinger-Reprogrammable Microprocessor version missile boasts a dependability and training test success rate of more than 90%. The weapon's supersonic speed, agility, and extremely precise guidance and control system offer it an operational advantage against cruise missiles and all types of aircraft.\n\nWhat’s Favoring RTX Stock?\n\nRapidly increasing geopolitical tensions worldwide, along with heightened regional conflicts in different parts of the globe, like the Middle East and the Russian invasion of Ukraine, have prompted nations to bolster their defense capabilities significantly in recent times.  Since missiles constitute a large share of a nation’s defense arsenals, countries are investing heftily these days in advanced missile systems for deterrence and defense. This has been boosting the demand for technologically advanced missile systems.\r\n\r\nTo this end, the Mordor Intelligence firm predicts the global market for missiles and missile defense systems to witness a CAGR of 5% between 2024 and 2029. This should benefit RTX, which has a handful of combat-proven missiles in its product portfolio, like the TOW missile, Guidance Enhanced Missile, the National Advanced Surface-to-Air Missile System, Tomahawk, Standard Missile 2 and a few more, in addition to the Stinger missile.\n\nProspects of RTX’s Peers\n\nAs global threats rise, military contractors that are projected to gain from the growth prospects presented by the missiles and missile defense system market are as follows:\r\n\r\nThe Boeing Company BA: For almost 25 years, the company has been providing air and missile defense systems to the United States, its allies and international partners. Its offerings include the Avenger Air Defense System, Aegis Ballistic Missile Defense and Ground-Based Midcourse Defense.\r\n\r\nBoeing boasts a long-term (three to five years) earnings growth rate of 21.3%. The Zacks Consensus Estimate for BA’s 2025 sales implies growth of 20.5% from the 2024 estimated figure.\r\n\r\nLockheed Martin LMT: The company’s Missiles and Fire Control business unit develops, manufactures and supports advanced missiles and rockets. Some of its renowned products are the PAC-3 family of missiles, M270, RRPR, THHAD and a few more.\r\n\r\nLockheed has a long-term earnings growth rate of 4.7%. The Zacks Consensus Estimate for LMT’s 2024 sales calls for growth of 5.3% from the prior-year reported figure.\r\n\r\nNorthrop Grumman NOC: The company provides high-speed, long-range strike weapons like the AARGM-ER, which is a supersonic, air-launched tactical missile system. It also develops and manufactures warheads, fuses, advanced high-speed propulsion systems and other missile components.\r\n\r\nNorthrop has a long-term earnings growth rate of 8.7%. The Zacks Consensus Estimate for NOC’s 2024 sales suggests growth of 5.4% from the prior-year reported figure.\n\nStory continues\n\nRTX Stock Price Movement\n\nIn the past six months, RTX shares have risen 24.1% against the industry’s decline of 0.4%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nRTX Zacks Rank\n\nRTX currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-secures-contract-support-stinger-144500453.html",
        "symbols": [
            "0BOE.LSE",
            "0K92.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "BA.MX",
            "BA.NEO",
            "BA.US",
            "BCO.BE",
            "BCO.DU",
            "BCO.F",
            "BCO.HA",
            "BCO.HM",
            "BCO.MU",
            "BCO.STU",
            "BCO.XETRA",
            "BOEI34.SA",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.032,
            "neu": 0.794,
            "pos": 0.174
        }
    },
    {
        "date": "2024-09-26T03:20:27+00:00",
        "title": "Is RTX Corporation (RTX) the Best Low Beta Stock to Buy Now?",
        "content": "We recently compiled a list of the 10 Best Low Beta Stocks To Buy.In this article, we are going to take a look at where RTX Corporation (NYSE:RTX) stands against the other low beta stocks.\n\nAfter a rough few years, the market is coming together and is on a healthy trajectory. The recent Fed rate cuts triggered a lot of bullish sentiment toward the broader market. For example, on September 20, Business Insider reported that Brian Belski from BMO raised his S&P 500 price target for 2024 to 6,100 from 5,600, followed by the Fed's recent rate cut and strong seasonal market data.\n\nMoreover, Belski talked about broadening stock market gains and the increased likelihood of a soft landing for the U.S. economy. He finds current elevated valuations justified as he compared the situation to the mid-1990s when the market sustained high multiples.\n\nIn addition, Tom Lee of Fundstrat is bullish on the market for several upcoming years and expects the broader market to nearly triple to 15,000 by 2030. His bullish sentiment is driven by demographic shifts, millennial spending, and technology advancements. He mentioned the prime earning years of millennials and Gen Z, which mirror previous periods of high stock market returns. Furthermore, he also highlighted the role of technology in addressing global labor shortages and projects significant spending on AI and tech solutions.\n\nBroadening Market Participation and the Outlook for Recession Risks\n\nOn September 24, Prashant Bhayani of BNP Paribas Wealth Management joined CNBC to discuss the current market conditions. He discussed the improving liquidity and noted the tight credit spreads, near-record equities, and steady lending. While U.S. hiring is slowing, he explained that rising unemployment is partly due to labor force growth, not just layoffs, which makes it different from past cycles. Bhayani stressed that employment data, like jobless claims, will be important in determining market outlooks.\n\nOn market valuations, Bhayani acknowledged some sectors are overvalued but sees broader market participation beyond AI-related stocks. He suggested that stocks could outperform bonds if a soft landing or no recession occurs.\n\nAddressing concerns about potential triggers for volatility, Bhayani said that a credit event, similar to those seen in 2000 or 2007, could lead to significant market declines. However, current credit spreads and a healthy banking system support the soft landing view.\n\nOur Methodology\n\nFor this article, we used the Yahoo Finance stock screener to identify over 30 mid to mega-cap stocks with a 5-year beta (monthly) between 0.2 to 0.8. Next, we narrowed the list to 10 stocks most widely held by institutional investors. The 10 best low-beta stocks to buy are listed in ascending order of their hedge fund sentiment and we used the beta as a tie-breaker as well.\n\nStory continues\n\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\n\nAn aerial view of a commercial jetliner in flight, its airframe glinting in the sun.\n\nRTX Corporation (NYSE:RTX)\n\n5-year Beta (monthly): 0.54\n\nNumber of Hedge Fund Holders: 54\n\nOne of the best low beta stocks, RTX Corporation (NYSE:RTX), previously known as Raytheon Technologies Corporation, is a known force in the aerospace and defense sectors. The company was formed in April 2020 from the merger of Raytheon Company and United Technologies Corporation. It rebranded to RTX in July 2023. Its extensive portfolio serves a diverse range of clients, including commercial, military, and government customers both domestically and internationally.\n\nThe company operates through four segments, Collins Aerospace, Pratt & Whitney, Raytheon Intelligence & Space, and Raytheon Missiles & Defense. The diversified approach allows it to offer an impressive range of products and services, from aircraft engines and avionics systems to missile defense solutions and advanced cybersecurity technologies.\n\nIn the second quarter, 54 hedge funds held positions in RTX (NYSE:RTX) worth $2.817 billion. As of Q2, Fisher Asset Management is the most dominant shareholder in the company and has a position worth $1.769 billion.\n\nIn 2024, the company has secured several significant contracts that signify its leadership in the industry. A standout achievement came in July when the Missile Defense Agency awarded the company a substantial $1.94 billion contract to produce Standard Missile-3 Block IIA interceptors for the U.S. government and Japan’s defense ministry. The project, based in Tucson, Arizona, and Huntsville, Alabama, is set to continue until February 2031, which affirms its role in enhancing global defense capabilities.\n\nAdditionally, in April, Raytheon, a subsidiary of RTX, was granted a $344 million contract aimed at modernizing the electronics for two missile variants, the SM-2 Block IIICU and SM-6 Block IU. The initiative is crucial for improving missile guidance systems, which ensures the effectiveness of these systems for the U.S. Navy and allied forces.\n\nAnother key development occurred in August when RTX’s (NYSE:RTX) Raytheon received a $478 million contract from the NATO Support and Procurement Agency to supply additional GEM-T missiles to Germany. The contract plays an important role in replenishing Patriot missiles that Germany donated to Ukraine.\n\nFurther solidifying its position, on September 11, Raytheon was awarded a landmark $1.19 billion contract for the production of Advanced Medium Range Air-to-Air Missiles (AMRAAM), including additional support hardware. The contract involves Foreign Military Sales to multiple countries such as Bahrain, Canada, Germany, Japan, and Ukraine, which shows its essential role in global defense partnerships.\n\nOverall RTX ranks 2nd on our list of the best low beta stocks to buy. While we acknowledge the potential of RTX as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for an AI stock that is promising and trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nRead Next: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’.\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-corporation-rtx-best-low-032027332.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.04,
            "neu": 0.815,
            "pos": 0.145
        }
    }
]