[
    {
        "date": "2024-08-02T13:00:27+00:00",
        "title": "A Look At The Intrinsic Value Of RTX Corporation (NYSE:RTX)",
        "content": "Key Insights\n\nThe projected fair value for RTX is US$111 based on 2 Stage Free Cash Flow to Equity Current share price of US$117 suggests RTX is potentially trading close to its fair value The US$119 analyst price target for RTX is 6.7% more than our estimate of fair value\n\nHow far off is RTX Corporation (NYSE:RTX) from its intrinsic value? Using the most recent financial data, we'll take a look at whether the stock is fairly priced by taking the expected future cash flows and discounting them to their present value. We will use the Discounted Cash Flow (DCF) model on this occasion. It may sound complicated, but actually it is quite simple!\n\nWe would caution that there are many ways of valuing a company and, like the DCF, each technique has advantages and disadvantages in certain scenarios. Anyone interested in learning a bit more about intrinsic value should have a read of the Simply Wall St analysis model.\n\nView our latest analysis for RTX\n\nThe Calculation\n\nWe are going to use a two-stage DCF model, which, as the name states, takes into account two stages of growth. The first stage is generally a higher growth period which levels off heading towards the terminal value, captured in the second 'steady growth' period. In the first stage we need to estimate the cash flows to the business over the next ten years. Where possible we use analyst estimates, but when these aren't available we extrapolate the previous free cash flow (FCF) from the last estimate or reported value. We assume companies with shrinking free cash flow will slow their rate of shrinkage, and that companies with growing free cash flow will see their growth rate slow, over this period. We do this to reflect that growth tends to slow more in the early years than it does in later years.\n\nGenerally we assume that a dollar today is more valuable than a dollar in the future, so we need to discount the sum of these future cash flows to arrive at a present value estimate:\n\n10-year free cash flow (FCF) estimate\n\n2025 2026 2027 2028 2029 2030 2031 2032 2033 2034 Levered FCF ($, Millions)  US$7.04b US$8.29b US$9.22b US$7.87b US$7.13b US$6.72b US$6.50b US$6.39b US$6.37b US$6.40b Growth Rate Estimate Source Analyst x11 Analyst x8 Analyst x2 Analyst x1 Est @ -9.37% Est @ -5.81% Est @ -3.32% Est @ -1.57% Est @ -0.35% Est @ 0.50% Present Value ($, Millions) Discounted @ 6.3%  US$6.6k US$7.3k US$7.7k US$6.2k US$5.3k US$4.7k US$4.2k US$3.9k US$3.7k US$3.5k\n\n(\"Est\" = FCF growth rate estimated by Simply Wall St)\r\nPresent Value of 10-year Cash Flow (PVCF) = US$53b\n\nWe now need to calculate the Terminal Value, which accounts for all the future cash flows after this ten year period. For a number of reasons a very conservative growth rate is used that cannot exceed that of a country's GDP growth. In this case we have used the 5-year average of the 10-year government bond yield (2.5%) to estimate future growth. In the same way as with the 10-year 'growth' period, we discount future cash flows to today's value, using a cost of equity of 6.3%.\n\nTerminal Value (TV)= FCF2034 × (1 + g) ÷ (r – g) = US$6.4b× (1 + 2.5%) ÷ (6.3%– 2.5%) = US$174b\n\nPresent Value of Terminal Value (PVTV)= TV / (1 + r)10= US$174b÷ ( 1 + 6.3%)10= US$94b\n\nThe total value, or equity value, is then the sum of the present value of the future cash flows, which in this case is US$147b. The last step is to then divide the equity value by the number of shares outstanding. Compared to the current share price of US$117, the company appears around fair value at the time of writing. The assumptions in any calculation have a big impact on the valuation, so it is better to view this as a rough estimate, not precise down to the last cent. dcf\n\nImportant Assumptions\n\nThe calculation above is very dependent on two assumptions. The first is the discount rate and the other is the cash flows. You don't have to agree with these inputs, I recommend redoing the calculations yourself and playing with them. The DCF also does not consider the possible cyclicality of an industry, or a company's future capital requirements, so it does not give a full picture of a company's potential performance. Given that we are looking at RTX as potential shareholders, the cost of equity is used as the discount rate, rather than the cost of capital (or weighted average cost of capital, WACC) which accounts for debt. In this calculation we've used 6.3%, which is based on a levered beta of 0.918. Beta is a measure of a stock's volatility, compared to the market as a whole. We get our beta from the industry average beta of globally comparable companies, with an imposed limit between 0.8 and 2.0, which is a reasonable range for a stable business.\n\nSWOT Analysis for RTX\n\nStrength\n\nDebt is well covered by cash flow.\n\nWeakness\n\nEarnings declined over the past year.\n\nInterest payments on debt are not well covered.\n\nDividend is low compared to the top 25% of dividend payers in the Aerospace & Defense market.\n\nExpensive based on P/E ratio and estimated fair value.\n\nOpportunity\n\nAnnual earnings are forecast to grow faster than the American market.\n\nThreat\n\nDividends are not covered by earnings.\n\nAnnual revenue is forecast to grow slower than the American market.\n\nLooking Ahead:\n\nAlthough the valuation of a company is important, it is only one of many factors that you need to assess for a company. It's not possible to obtain a foolproof valuation with a DCF model. Instead the best use for a DCF model is to test certain assumptions and theories to see if they would lead to the company being undervalued or overvalued. For example, changes in the company's cost of equity or the risk free rate can significantly impact the valuation. For RTX, we've compiled three essential items you should further research:\n\nRisks: To that end, you should learn about the  5 warning signs  we've spotted with RTX (including 1 which shouldn't be ignored) . Management:Have insiders been ramping up their shares to take advantage of the market's sentiment for RTX's future outlook? Check out our management and board analysis with insights on CEO compensation and governance factors. Other High Quality Alternatives: Do you like a good all-rounder? Explore our interactive list of high quality stocks to get an idea of what else is out there you may be missing!\n\nPS. The Simply Wall St app conducts a discounted cash flow valuation for every stock on the NYSE every day. If you want to find the calculation for other stocks just search here.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nView comments",
        "link": "https://finance.yahoo.com/news/look-intrinsic-value-rtx-corporation-130027569.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 1,
            "neg": 0.032,
            "neu": 0.797,
            "pos": 0.172
        }
    }
]