[
    {
        "date": "2024-05-15T14:00:00+00:00",
        "title": "Sky-High Stakes: 3 Aerospace &amp; Defense Stocks Soaring Above the Fray",
        "content": "Escalating geopolitical tensions have put the aerospace and defense (A&D) industry at a pivotal juncture. With global security concerns at the forefront of national agendas, governments have increased spending on advanced weaponry, sophisticated surveillance systems and cutting-edge military technologies. As a result, Wall Street has been paying close attention to aerospace and defense stocks to buy.\n\nA recent study by Deloitte highlights a robust outlook for the sector.  Fueled by global developments, the U.S. defense budget has climbed 3.2% year-over-year (YOY) to a staggering $842 billion for 2024. Another study projects a compound annual growth rate (CAGR) of 8.2% for the A&D sector worldwide from 2023 to 2030. Thus, this article introduces three aerospace & defense stocks to buy to capitalize on this dynamic industry.\n\nLockheed Martin (LMT) A Lockheed Martin (LMT) Space Systems sign in Sunnyvale, California.\n\nSource: Ken Wolter / Shutterstock.com\n\nThe global A&D behemoth Lockheed Martin (NYSE:LMT) operates through four main segments: Aeronautics, Missiles and Fire Control, Rotary and Mission Systems and Space. Its products include fighter jets, combat vehicles, missile defense systems, satellites and next-generation hypersonic weapons.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nIn late April, the defense technology company reported mixed financial results for the first quarter. Net sales reached $17.2 billion, reflecting a 13.9% YOY increase. But net earnings declined 11.8% compared to the previous year and came in at $1.5 billion. Diluted earnings per share (EPS) stood at $6.33, a 1.6% drop compared to the previous year quarter. Investors noted management has allocated $700 million into research and development (R&D) with the aim focusing on innovation and technology leadership.\n\nMeanwhile, Lockheed Martin won the competitive bid for the Missile Defense Agency’s (MDA) Next Generation Interceptor (NGI) program. This development positions Lockheed Martin as the prime contractor responsible for delivering the nation’s most advanced homeland missile defense capability to date. Many analysts point out Lockheed Martin’s ability to secure new contracts, particularly in high-growth areas like space and advanced missile systems.\n\nLMT stock has gained 2.8% year-to-date (YTD) and currently trades near 1-year highs. Yet, its valuation remains compelling at 18.2 times forward earnings and 1.67 times sales. In addition, shares currently have a robust 2.69% dividend yield. Analysts have a 12-month price target of $491.47 for LMT, suggesting potential upside of 5% from current levels. Interested investors can wait for a pull back towards $460 to initiate positions.\n\nStory continues\n\nGeneral Dynamics (GD) US tank General Dynamics (GD) Abrams M1A1 in military polygon in the exercise Platinum Lynx 16 on Galati, Romania, 11 December 2015\n\nSource: PhotoStock10 / Shutterstock.com\n\nAnother top stock pick among aerospace & defense stocks to buy is General Dynamics (NYSE:GD), whose operations span across four major segments: Aerospace, Marine Systems, Combat Systems and Technologies. Meanwhile, its products include combat vehicles, nuclear-powered submarines, business jets, communication systems and munitions.\n\nWall Street was pleased with the recent earnings results as revenue climbed to $10.7 billion, marking an 8.6% increase from the previous year. Net earnings reached $799 million, a 9.5% surge compared to the prior-year quarter. This strong performance translated to diluted EPS of $2.88, representing a 9.1% YOY growth. General Dynamics’ profitability metrics are equally impressive. A gross profit margin of over 15% and an operating margin of over 9% indicate efficient management and strong pricing power.\n\nIn late March, Gulfstream Aerospace, a wholly owned subsidiary of General Dynamics, announced a significant milestone for its business aviation segment. The all-new Gulfstream G700 has successfully achieved Federal Aviation Administration (FAA) type certification. Management has already announced the first customer deliveries of the Gulfstream G700. Additionally, the increased demand for Combat Systems products, particularly from European and U.S. markets, and the expansion in the Marine Systems segment driven by U.S. Navy’s needs, are pivotal growth areas.\n\nSo far in 2024, GD stock has appreciated a robust 15% and is currently trading at all-time highs and offering a 1.92% dividend yield. Shares are changing hands at 20.4 times forward earnings and 1.9 times sales. And Wall Street remains optimistic for the prospects of GD stock with a 12-month median price forecast of $316. Such an up move could potentially mean an almost 7.5% increase in GD price.\n\niShares US Aerospace & Defense ETF (ITA) A photograph of two jet fighters flying above clouds. defense stocks. Defense Stocks to Sell\n\nSource: Shutterstock\n\nRounding out our discussion on A&D investments is the iShares US Aerospace & Defense ETF (NYSEARCA:ITA) an industry-focused fund. Since its inception in May 2006, net assets have grown close to $6.4 billion.\n\nAmong ITA’s 34 holdings, the top 10 names comprise about three-quarters of the fund. This concentration of heavyweights allows investors to tap into the performance of industry leaders like RTX (NYSE:RTX), Boeing (NYSE:BA), Lockheed Martin, Howmet Aerospace (NYSE:HWM), and TransDigm Group(NYSE:TDG). These companies are the backbone of the sector, driving innovation and shaping the future of A&D.\n\nSince the beginning of the year, ITA has gained 7.1%, and it offers a dividend yield of 0.82%. Meanwhile, the fund’s trailing price-to-earnings (P/E) ratio stands at 31.2x. Given the geopolitical environment and growing importance of aerospace and defense, we’re bullish on the ITA, but would consider buying after a pullback towards the $125 level. Finally, interested investors should also note the annual expense ratio of 0.95%.\n\nOn the date of publication, Tezcan Gecgil did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nTezcan Gecgil, PhD, began contributing to InvestorPlace in 2018. She brings over 20 years of experience in the U.S. and U.K. and has also completed all 3 levels of the Chartered Market Technician (CMT) examination. Publicly, she has contributed to investing.com and the U.K. website of The Motley Fool.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post Sky-High Stakes: 3 Aerospace & Defense Stocks Soaring Above the Fray appeared first on InvestorPlace.\n\nView comments",
        "link": "https://finance.yahoo.com/news/sky-high-stakes-3-aerospace-140000826.html",
        "symbols": [
            "0IUC.LSE",
            "0R3E.LSE",
            "BA.US",
            "GD.US",
            "GDBR34.SA",
            "GDX.BE",
            "GDX.F",
            "GDX.HM",
            "HWM.US",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.994,
            "neg": 0.022,
            "neu": 0.862,
            "pos": 0.115
        }
    }
]