[
    {
        "date": "2024-05-17T14:02:00+00:00",
        "title": "Curtiss-Wright (CW) Rewards Investors With Buyback, Ups Dividend",
        "content": "Curtiss-Wright Corporation CW announced that its board of directors approved a hike in its quarterly dividend to 21 cents per share, reflecting an increase of 5% from the prior payout. With the current hike, Curtiss-Wright will now pay out an annual dividend of 84 cents per share.\r\n\r\nThis signifies Curtiss-Wright’s strength in the business to generate enough cash flow to reward shareholders with improved dividend payouts.\n\nCurtiss-Wright Enhances Shareholders Value\n\nCurtiss-Wright’s emphasis on returning cash to shareholders is backed by a disciplined and balanced capital allocation strategy and is buoyed by its ability to deploy capital effectively. Curtiss-Wright has been returning cash to shareholders through share repurchases and dividend hikes, thus highlighting consistency in sharing profits with its shareholders.\r\n\r\nAlong with dividend payments, Curtiss-Wright’s management continues to increase shareholders’ value by repurchasing shares. In the first three months of 2024, the company repurchased shares worth $12.2 million. The board of directors authorized an additional $300 million for share repurchases, increasing the total available authorization to $400 million under the repurchase program.\r\n\r\nSuch a stable return strategy is backed by its ability to generate strong revenues and free cash flows. Curtiss-Wright expects a surge of 5-7% in total sales and projects 8% to 11% growth in earnings in 2024. The company anticipates the free cash flow to increase in the range of 0-5% in 2024.\r\n\r\nAll three business segments of Curtiss-Wright are showing strong growth, which is boosting its earnings. Apart from organic growth, the acquisition of WSC Inc will further expand Curtiss-Wright’s commercial nuclear business. It will create more opportunities for Curtiss-Wright to support its long-term financial goal and generate more revenues.\r\n\r\nThe company is committed to expanding its business through organic methods and strategic acquisitions. The improving end market conditions and rising demand for the high-quality products offered by Curtiss-Wright will continue to generate profits, which can be utilized to increase shareholders' value in future periods.\n\nPeer Moves\n\nOther defense companies are also rewarding their investors through dividend payments and hikes at regular intervals. These defense majors are benefiting from a strong U.S. defense budget and a stable flow of contracts from the Pentagon.\r\n\r\nIn October 2023, Lockheed Martin LMT approved a hike in its quarterly dividend of 15 cents per share from the prior payout.\r\n\r\nLMT boasts a long-term earnings growth rate of 4.2%. Lockheed’s shares have inched up 1.6% in the past year.\r\n\r\nOn May 10, 2024, Northrop Grumman Corp.  NOC announced that the board of directors declared a 10% increase in the quarterly dividend to $2.06 per share.\r\n\r\nNOC has a long-term earnings growth rate of 9.9%. NOC’s shares have risen 4.9% in the past year.\r\n\r\nOn May 2, 2024, RTX Technologies RTX announced an increase of 6.8% over the prior quarter's dividend amount.\r\n\r\nRTX has a long-term earnings growth rate of 10.3%. Raytheon’s shares have increased 8.9% in the past year.\n\nStory continues\n\nPrice Movement\n\nIn the past three months, shares of Curtiss-Wright have risen 18.3% compared with its industry‘s average decline of 0.6%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nCurtiss-Wright currently carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nCurtiss-Wright Corporation (CW) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/curtiss-wright-cw-rewards-investors-140200639.html",
        "symbols": [
            "0K92.LSE",
            "0R3E.LSE",
            "5UR.F",
            "5UR.XETRA",
            "CW.US",
            "CWT.F",
            "CWT.STU",
            "LMT.MX",
            "LMT.US",
            "LMTB34.SA",
            "LOM.DU",
            "LOM.F",
            "LOM.MU",
            "LOM.STU",
            "LOM.XETRA",
            "NOC.US",
            "NOCG34.SA",
            "NTH.BE",
            "NTH.DU",
            "NTH.F"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.999,
            "neg": 0.004,
            "neu": 0.755,
            "pos": 0.241
        }
    }
]