[
    {
        "date": "2024-10-08T14:23:31+00:00",
        "title": "RTX's Raytheon Completes Hydrodynamic Testing for the Barracuda Mine Neutralization System",
        "content": "Raytheon, an RTX business, recently conducted a series of controlled environmental tests for the Barracuda Mine Neutralization System at the Naval Surface Warfare Center Carderock Division.\n\nUsing a production representative test unit, Barracuda operated and collected data in environments of various sea states and water currents, demonstrating the ability to hydrodynamically control itself in conditions simulating the ocean.\n\nMost Read on Design & Development Today:\n\nBoeing Completes First Flight of E-7 Wedgetail GM Recalling More Than 449,000 SUVs, Pickups Due to Issue with Low Brake Fluid Warning Light Electra Conducts Multiple Flight Demonstrations of Ultra Short Aircraft for U.S. Military A Capsule has Been Propelled Through a Hyperloop Test Tube in a Step Forward for the Transit System\n\nThe test demonstrated the ability of the vehicle to detect, track and hold position on a target on its own. It was the first time Raytheon has executed this type of testing with the Barracuda mine neutralizer underwater vehicle and moves the program one step closer towards meeting operational requirements.\n\nBarracuda is the U.S. Navy's program of record for next-generation mine neutralization. It is a semi-autonomous system that uses sonar and camera systems to locate and neutralize undersea mine threats.\n\nRaytheon was first awarded a contract for Barracuda in 2018. The program completed its critical design review in March 2023, and has now entered its qualification testing phase. In July 2023, Raytheon was awarded a contract to deliver engineering development model units to the U.S. Navy. The program will go into Low-Rate Initial Production in 2027.\n\nClick here to subscribe to our daily newsletter.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-raytheon-completes-hydrodynamic-testing-142331038.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": -0.202,
            "neg": 0.044,
            "neu": 0.918,
            "pos": 0.037
        }
    },
    {
        "date": "2024-10-08T14:00:30+00:00",
        "title": "RTX Insiders Sell US$7.3m Of Stock, Possibly Signalling Caution",
        "content": "Many RTX Corporation (NYSE:RTX) insiders ditched their stock over the past year, which may be of interest to the company's shareholders. When evaluating insider transactions, knowing whether insiders are buying is usually more beneficial than knowing whether they are selling, as the latter can be open to many interpretations. However, shareholders should take a deeper look if several insiders are selling stock over a specific time period.\n\nAlthough we don't think shareholders should simply follow insider transactions, we do think it is perfectly logical to keep tabs on what insiders are doing.\n\nSee our latest analysis for RTX\n\nRTX Insider Transactions Over The Last Year\n\nThe President of Pratt & Whitney, Shane Eddy, made the biggest insider sale in the last 12 months. That single transaction was for US$3.2m worth of shares at a price of US$91.19 each. That means that even when the share price was below the current price of US$125, an insider wanted to cash in some shares. When an insider sells below the current price, it suggests that they considered that lower price to be fair. That makes us wonder what they think of the (higher) recent valuation. However, while insider selling is sometimes discouraging, it's only a weak signal. It is worth noting that this sale was 84% of Shane Eddy's holding.\n\nRTX insiders didn't buy any shares over the last year. The chart below shows insider transactions (by companies and individuals) over the last year. If you want to know exactly who sold, for how much, and when, simply click on the graph below! insider-trading-volume\n\nI will like RTX better if I see some big insider buys. While we wait, check out this freelist of undervalued and small cap stocks with considerable, recent, insider buying.\n\nInsiders At RTX Have Sold Stock Recently\n\nThe last three months saw significant insider selling at RTX. In total, insiders sold US$3.1m worth of shares in that time, and we didn't record any purchases whatsoever. Overall this makes us a bit cautious, but it's not the be all and end all.\n\nInsider Ownership Of RTX\n\nFor a common shareholder, it is worth checking how many shares are held by company insiders. A high insider ownership often makes company leadership more mindful of shareholder interests. RTX insiders own 0.09% of the company, currently worth about US$154m based on the recent share price. This kind of significant ownership by insiders does generally increase the chance that the company is run in the interest of all shareholders.\n\nSo What Do The RTX Insider Transactions Indicate?\n\nInsiders haven't bought RTX stock in the last three months, but there was some selling. Looking to the last twelve months, our data doesn't show any insider buying. It is good to see high insider ownership, but the insider selling leaves us cautious. So these insider transactions can help us build a thesis about the stock, but it's also worthwhile knowing the risks facing this company. Case in point: We've spotted 4 warning signs for RTX you should be aware of, and 1 of them is a bit concerning.\n\nStory continues\n\nIf you would prefer to check out another company -- one with potentially superior financials -- then do not miss this freelist of interesting companies, that have HIGH return on equity and low debt.\n\nFor the purposes of this article, insiders are those individuals who report their transactions to the relevant regulatory body. We currently account for open market transactions and private dispositions of direct interests only, but not derivative transactions or indirect interests.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-insiders-sell-us-7-140030030.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.992,
            "neg": 0.036,
            "neu": 0.861,
            "pos": 0.103
        }
    }
]