[
    {
        "date": "2024-10-17T15:43:26+00:00",
        "title": "RTX Corporation (RTX): Capitalizing on Defense Contracts and Backlog Growth",
        "content": "We recently published a list of 10 Stocks That Could 10X Over the Next 5 Years. In this article, we are going to take a look at where RTX Corporation (NYSE:RTX) stands against other stocks that could 10x over the next 5 years.\n\nDespite ongoing concerns related to the durability of growth and interest rate policy, Deloitte believes that the broader US economy is fundamentally strong. While real GDP growth witnessed some slowness in Q1 2024, growth rebounded to 3.0% in Q2 2024. All the available evidence demonstrates that policymakers have managed to bring inflation under control without a recession.\n\nMarket experts opine that the boom in factory construction is expected to boost the economy’s potential over the upcoming years. Deloitte expects that, in the short term, a faster pace of interest rate cuts by the US Fed is expected to allow households to take on more debt and support continued consumer spending growth. This, together with the elevated government consumption, will help the US economy to grow by 2.7% this year.\n\nPathway for Rate Cuts\n\nS&P Global expects that the global policy rate easing cycle remains in full swing after the 50-bps cut by the US Fed in mid-September.  The US has been outperforming as growth remains above potential, amidst relatively higher policy and market rates. This above-trend growth stems from services and private investment, new business formation, and productivity.\n\nThe firm believes that the US Fed is on a path to a steady series of interest-rate cuts, and the company is expecting policy rates to reach the terminal rate of 3.00%-3.25% by 2025 end, with risks in both directions. It has kept its probability of a recession starting in the upcoming 12 months unchanged at 25%. With healthy consumption, the company expects that fears of a recession in the near term are overblown.\n\nAmidst Noise, What Are Investment Implications?\n\nEY believes that the US economy is expected to slow into 2025, with restrictive monetary policy and elevated costs curbing the private sector activity. On the positive side, it expects that the recession risks are contained. Households are expected to spend more cautiously, with labor market conditions and income growth softening further. Also, still-elevated financing costs will continue to prompt the businesses to hire and deploy capital with discretion. Investors should know that lower inflation and interest rates, together with a balanced labor market, should result in cooler but more sustainable economic growth in 2025. EY expects real GDP growth to average ~2.7% in 2024.\n\nRegarding consumer spending, Vanguard believes that healthy balance sheets, together with a steady labor market, should support consumer spending over the coming quarters, though at a more modest pace as compared to recent quarters.\n\nAs per Merrill (A Bank of America Company), for long-term investors, events such as worker strikes do not often warrant action. Concerning military conflict events, the company has continued to be constructive on Defense stocks for years considering the trend in geopolitical risk. It was highlighted that the pure-play S&P 500 Defense stocks were able to outperform S&P 500 Energy stocks on October 1. This was because of elevated tensions in Israel/Iran and spike in oil prices. Also, defense stocks outperformed when equity volatility increased in July.\n\nTherefore, Merrill believes that defense stocks provide some non-cyclical diversification benefits that cannot be offered by energy. For interest rates, the risks of supply-side inflation warrant the Fed’s attention considering the potential for disinflation to slow or stop. Also, the geopolitical conflict can mean longer-term rates and borrowing rates for the private sector remaining higher for longer.\n\nTo put things in perspective, Wall Street analysts opine that, amidst uncertainties, long-term investors should be inclined towards diversification and fundamentally strong companies that offer strong potential for the next 3-5 years.\n\nOur Methodology\n\nTo list the 10 Stocks That Could 10X Over the Next 5 Years, we conducted extensive research and sifted through several online rankings. After extracting the list of 20-25 stocks, we narrowed the list to the following 10 stocks, and ranked them in the ascending order of their hedge fund sentiments, as of Q2 2024.\n\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here). RTX Corporation (RTX): Capitalizing on Defense Contracts and Backlog Growth\n\nAn aerial view of a commercial jetliner in flight, its airframe glinting in the sun.\n\nRTX Corporation (NYSE:RTX)\n\nNumber of Hedge Fund Holders: 54\n\nRTX Corporation (NYSE:RTX) offers systems and services for commercial, military, and government customers in the US and internationally.\n\nRTX Corporation (NYSE:RTX) remains optimistic about aligning its business model with airframers to better serve customers and address profit driver misalignment in the upcoming programs. Despite the challenges in product costs and supply chain, it continues to make strides in its GTF engine program and align its initiatives with customer needs and market demands. Collectively, these measures are expected to support the company’s stock price over the next 3-5 years.\n\nIn the recent earnings, RTX Corporation (NYSE:RTX)’s management highlighted its substantial backlog, which totalled $206 billion. It also commented that there remains robust demand for its offerings. RTX Corporation (NYSE:RTX) continues to concentrate on fulfilling customer commitments, fueled by its CORE operating system, which enables efficient execution and management of operations. Raytheon, an RTX Corporation (NYSE:RTX) business, was awarded a $736 million contract from the US Navy to produce AIM-9X® SIDEWINDER® missiles.\n\nRTX Corporation (NYSE:RTX) raised its FY 2024 outlook, with adjusted sales expected to come in the range of $78.75 billion – $79.5 billion, up from $78.0 billion – $79.0 billion. It expects adjusted EPS of between $5.35 – $5.45, up from $5.25 – $5.40.\n\nAnalysts at Susquehanna upped their target price on the shares of RTX Corporation (NYSE:RTX) from $119.00 to $140.00, giving a “Positive” rating on 26th July.\n\nOverall, RTX ranks 2nd on our list of stocks that could 10x over the next 5 years. While we acknowledge the potential of RTX as an investment, our conviction lies in the belief that some deeply undervalued AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for a deeply undervalued AI stock that is more promising than RTX but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\n\nREAD NEXT: $30 Trillion Opportunity: 15 Best Humanoid Robot Stocks to Buy According to Morgan Stanley and Jim Cramer Says NVIDIA ‘Has Become A Wasteland’\n\nDisclosure: None. This article is originally published at Insider Monkey.\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-corporation-rtx-capitalizing-defense-154326104.html",
        "symbols": [
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.998,
            "neg": 0.045,
            "neu": 0.832,
            "pos": 0.124
        }
    }
]