[
    {
        "date": "2024-10-07T19:22:45+00:00",
        "title": "US State Dept okays defense sales to India, Italy, Romania for $965 million",
        "content": "The U.S. State Department approved possible military sales to Italy, India and Romania for a combined total of $965 million, the Pentagon said on Monday.",
        "link": "https://www.reuters.com/world/us-state-dept-okays-defense-sales-india-italy-romania-965-million-2024-10-07/",
        "symbols": [
            "RTX.US"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.422,
            "neg": 0,
            "neu": 0.891,
            "pos": 0.109
        }
    },
    {
        "date": "2024-10-07T16:23:33+00:00",
        "title": "Occidental and Humana Are on the Casualty List",
        "content": "October 7, 2024 (Maple Hill Syndicate) - I can only buy on train wrecks, famed money manager John Neffonce said.\n\nNeff's lament was that his fund (the Windsor Fund) had grown so large that he normally couldn't buy a stockwithout pushing the price up. Accordingly, he felt that he could only buy on bad news.\n\nMost of us don't have the problem that afflicted Neff. But buying good stocks on bad news is a wise investmenttechnique for almost anyone.\n\nWarning! GuruFocus has detected 2 Warning Sign with OXY.\n\nThat's the goal of my quarterly Casualty List. It comprises stocks that have been roughed up in the latestquarterly, and that I think can bounce back strongly.\n\nIn the third quarter, the stock market was up but many stocks still took it on the chin. Here are four that Ifeel have excellent recovery potential.\n\nOccidental\n\nOccidental Petroleum Corp. (NYSE:OXY), based in Houston, Texas, is on investors' radar because Berkshire Hathaway, run by Warren Buffett (Trades, Portfolio), owns about 28% of its stock. Betting with Buffett, oftenconsidered the premiere investor in the U.S., is often a good idea.\n\nBut investors went the other way in the third quarter, knocking down a slew of oil stocks as the price of oil fellfrom $83 a barrel to $69. OXY fell 18% in the quarter.\n\nI believe that oil and gas will be energy mainstays for the U.S. well into the 2030s. In addition, the war betweenIsrael and its neighbors poses a risk to world oil supplies a risk that I don't believe is fully reflected in the price of oil as of early October.\n\nHumana\n\nHumana Inc. (NYSE:HUM), with headquarters in Louisville, Kentucky, is one of the country's largest healthinsurers. Its strength and its weakness, too is that it specializes in insurance for people covered by Medicare, Medicaid, and the U.S. military program called Tricare.\n\nReliant on the government, Humana was grievously hurt when the Centers for Medicare and Medicaid Services gave many of its health plans low grades in a review in early October. This could cripple future enrollment in Humana's plans. The shares dropped 12% on October 1 after falling 15% in the third quarter.\n\nThis is terrible news, but Humana has been profitable for 24 years in a row. Over the past decade, it has grownits revenue by close to 12% per year. I think that management, led by new CEO Jim Rechtin, can probably right the ship.\n\nAmkor\n\nAmkor Technology Inc. (NASDAQ:AMKR) does semiconductor testing and packaging. Its largest customers are Apple Inc. (NASDAQ:AAPL) and Qualcomm Inc. (NASDAQ:QCOM). Apple alone is nearly 28% of sales.\n\nStory continues\n\nThe word Amkor stems from America and Korea. The company was founded in Korea in 1968 and now has itsheadquarters in Tempe, Arizona.\n\nIn the past year Amkor's sales fell about 8%, and profits (always more volatile than sales) dropped about 34%.\n\nAs a result, Amkor shares fell 23% in the third quarter. Of the 10 analysts who cover it, six rate it a buy.\n\nVisteon\n\nVisteon Corp. (NASDAQ:VC), out of Buren Township, Michigan, is an auto-parts maker that Ford Motor Co. spun off in2000. Today Visteon sells parts to Ford, BMW, Honda, Mazda, Nissan, Renault, and Ford's longtime arch rival General Motors. Instrument clusters and electronics are its specialties.\n\nThe stock fell 11% in the third quarter after sales dipped slightly. More than 80% of new cars are financed,and interest rates in the past year have fairly high. Now the Federal Reserve is moving to reduce rates, which I figure will help car sales.\n\nThe Record\n\nThis column is the 86thone in my quarterly Casualty List series. One-year returns can be calculated for 82 columns. The average 12-month return on my recommendations has been 14.9%, compared to 11.3% for the Standard & Poor's 500 Total Return Index.\n\nThat's good news. The bad news is that only 39 of the 82 columns have beaten the S&P 500. So far, fifty-twohave shown a profit, and 30 a loss.\n\nBear in mind that my column results are hypothetical and shouldn't be confused with results I obtain for clients.Also, past performance doesn't predict the future.\n\nMy picks from a year ago racked up a 33.6% return. That makes me happy, but it failed to beat the surging S&P, which came in at 35.1%.\n\nMy best pick from a year ago was RTX Corp. (NYSE:RTX), up 78% as geopolitical tensions and wars sparked a rise indefense stocks. My worst pick was United Parks and Resorts Inc. (PRKS, formerly SeaWorld Entertainment Inc.), up 7%.\n\nDisclosure: I own Apple shares personally and for most of my clients. I own Amkor Technology personally andfor some clients. My wife, a portfolio manager, owns Qualcomm personally and for some of her clients.\n\nJohn Dorfman is chairman of Dorfman Value Investments LLC in Boston, Massachusetts. He or his clients may own or trade securities discussed in this column. He can be reached at jdorfman@dorfmanvalue.com.\n\nThis article first appeared on GuruFocus.\n\nView comments",
        "link": "https://finance.yahoo.com/news/occidental-humana-casualty-list-162333242.html",
        "symbols": [
            "0J6Z.LSE",
            "0KAK.LSE",
            "AAPL.US",
            "AMK.DU",
            "AMK.F",
            "AMK.MU",
            "AMK.STU",
            "AMKR.US",
            "GSPC.INDX",
            "HUM.DU",
            "HUM.F",
            "HUM.MU",
            "HUM.STU",
            "HUM.US",
            "OPC.BE",
            "OPC.DU",
            "OPC.F",
            "OPC.STU"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.468,
            "neg": 0.09,
            "neu": 0.816,
            "pos": 0.094
        }
    },
    {
        "date": "2024-10-07T16:10:15+00:00",
        "title": "Will RTX (RTX) Beat Estimates Again in Its Next Earnings Report?",
        "content": "Have you been searching for a stock that might be well-positioned to maintain its earnings-beat streak in its upcoming report? It is worth considering RTX (RTX), which belongs to the Zacks Aerospace - Defense industry.\n\nThis an aerospace and defense company has an established record of topping earnings estimates, especially when looking at the previous two reports. The company boasts an average surprise for the past two quarters of 9.12%.\n\nFor the most recent quarter, RTX was expected to post earnings of $1.29 per share, but it reported $1.41 per share instead, representing a surprise of 9.30%. For the previous quarter, the consensus estimate was $1.23 per share, while it actually produced $1.34 per share, a surprise of 8.94%.\n\nFor RTX, estimates have been trending higher, thanks in part to this earnings surprise history. And when you look at the stock's positive Zacks Earnings ESP (Expected Surprise Prediction), it's a great indicator of a future earnings beat, especially when combined with its solid Zacks Rank.\n\nOur research shows that stocks with the combination of a positive Earnings ESP and a Zacks Rank #3 (Hold) or better produce a positive surprise nearly 70% of the time. In other words, if you have 10 stocks with this combination, the number of stocks that beat the consensus estimate could be as high as seven.\n\nThe Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a version of the Zacks Consensus whose definition is related to change. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.\n\nRTX has an Earnings ESP of +2.58% at the moment, suggesting that analysts have grown bullish on its near-term earnings potential. When you combine this positive Earnings ESP with the stock's Zacks Rank #2 (Buy), it shows that another beat is possibly around the corner. The company's next earnings report is expected to be released on October 22, 2024.\n\nWhen the Earnings ESP comes up negative, investors should note that this will reduce the predictive power of the metric. But, a negative value is not indicative of a stock's earnings miss.\n\nMany companies end up beating the consensus EPS estimate, but that may not be the sole basis for their stocks moving higher. On the other hand, some stocks may hold their ground even if they end up missing the consensus estimate.\n\nStory continues\n\nBecause of this, it's really important to check a company's Earnings ESP ahead of its quarterly release to increase the odds of success. Make sure to utilize our Earnings ESP Filter to uncover the best stocks to buy or sell before they've reported.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtx-rtx-beat-estimates-again-161015329.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.997,
            "neg": 0.032,
            "neu": 0.802,
            "pos": 0.166
        }
    },
    {
        "date": "2024-10-07T12:00:00+00:00",
        "title": "RTX's Raytheon completes hydrodynamic testing for the Barracuda Mine Neutralization System",
        "content": "Milestone moves program one step closer to operational testing\n\nPORTSMOUTH, R.I., Oct. 7, 2024 /PRNewswire/ -- Raytheon, an RTX (NYSE: RTX) business, recently conducted a series of controlled environmental tests for the Barracuda Mine Neutralization System at the Naval Surface Warfare Center Carderock Division.\n\nUsing a production representative test unit, Barracuda operated and collected data in environments of various sea states and water currents, demonstrating the ability to hydrodynamically control itself in conditions simulating the ocean.\n\nThe test demonstrated the ability of the vehicle to detect, track and hold position on a target on its own. It was the first time Raytheon has executed this type of testing with the Barracuda mine neutralizer underwater vehicle and moves the program one step closer towards meeting operational requirements.\n\n\"This event marks a significant milestone in the advancement of underwater security and naval defense,\" said Barbara Borgonovi, president of Naval Power at Raytheon.  \"Barracuda's performance reaffirms its position as a game-changing solution for identifying and neutralizing naval mines, a critical challenge in modern naval operations.\"\n\nBarracuda is the U.S. Navy's program of record for next-generation mine neutralization. It is a semi-autonomous system that uses sonar and camera systems to locate and neutralize undersea mine threats.\n\nRaytheon was first awarded a contract for Barracuda in 2018. The program completed its critical design review in March 2023, and has now entered its qualification testing phase. In July 2023, Raytheon was awarded a contract to deliver engineering development model units to the U.S. Navy. The program will go into Low-Rate Initial Production in 2027.\n\nAbout Raytheon\n\nRaytheon, an RTX business, is a leading provider of defense solutions to help the U.S. government, our allies and partners defend their national sovereignty and ensure their security. For more than 100 years, Raytheon has developed new technologies and enhanced existing capabilities in integrated air and missile defense, smart weapons, missiles, advanced sensors and radars, interceptors, space-based systems, hypersonics and missile defense across land, air, sea and space.\n\nAbout RTX\n\nWith more than 185,000 global employees, RTX pushes the limits of technology and science to redefine how we connect and protect our world. Through industry-leading businesses – Collins Aerospace, Pratt & Whitney, and Raytheon – we are advancing aviation, engineering integrated defense systems, and developing next-generation technology solutions and manufacturing to help global customers address their most critical challenges. The company, with 2023 sales of $69 billion, is headquartered in Arlington, Virginia.\n\nStory continues\n\nFor questions or to schedule an interview, please contact corporatepr@rtx.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/rtxs-raytheon-completes-hydrodynamic-testing-for-the-barracuda-mine-neutralization-system-302266701.html\n\nSOURCE RTX\n\nView comments",
        "link": "https://finance.yahoo.com/news/rtxs-raytheon-completes-hydrodynamic-testing-120000384.html",
        "symbols": [
            "0R2N.LSE",
            "5UR.F",
            "5UR.XETRA",
            "RTX.US",
            "RYTT34.SA",
            "UTC1.HM"
        ],
        "tags": [],
        "sentiment": {
            "polarity": 0.978,
            "neg": 0.034,
            "neu": 0.852,
            "pos": 0.114
        }
    }
]